httpsinfo.automation.desc = Https Info Automation
httpsinfo.automation.name = Https Info Automation Framework Integration
httpsinfo.beast.desc=Beast (Browser Exploit Against SSL / TLS) - \u044d\u0442\u043e \u044d\u043a\u0441\u043f\u043b\u043e\u0439\u0442, \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0435\u043d\u043d\u044b\u0439 \u0432 2011 \u0433\u043e\u0434\u0443, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442 \u0441\u043b\u0430\u0431\u044b\u0435 \u043c\u0435\u0441\u0442\u0430 \u0432 \u0446\u0435\u043f\u043e\u0447\u043a\u0435 \u0431\u043b\u043e\u043a\u043e\u0432 \u0448\u0438\u0444\u0440\u043e\u0432 (CBC) \u0434\u043b\u044f \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u044f \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0430 SSL. \u0423\u044f\u0437\u0432\u0438\u043c\u043e\u0441\u0442\u044c \u043c\u043e\u0436\u0435\u0442 \u0441\u0434\u0435\u043b\u0430\u0442\u044c \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u044b\u043c\u0438 \u0430\u0442\u0430\u043a\u0438 \u0442\u0438\u043f\u0430 \u00ab\u0447\u0435\u043b\u043e\u0432\u0435\u043a \u043f\u043e\u0441\u0435\u0440\u0435\u0434\u0438\u043d\u0435\u00bb (MiTM) \u043d\u0430 \u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0439 HTTP-\u0442\u0440\u0430\u0444\u0438\u043a \u0441 \u0446\u0435\u043b\u044c\u044e \u0440\u0430\u0441\u0448\u0438\u0444\u0440\u043e\u0432\u043a\u0438 \u0442\u0440\u0430\u0444\u0438\u043a\u0430 \u0438 \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u044f \u043a\u043e\u043d\u0444\u0438\u0434\u0435\u043d\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0439 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438. \u0417\u0430\u0442\u0440\u043e\u043d\u0443\u0442\u044b SSL3 \u0438 TLSv1. 
httpsinfo.beast.name=\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f HTTPS\: Beast \u0443\u044f\u0437\u0432\u0438\u043c\u043e\u0441\u0442\u044c 
httpsinfo.beast.refs=https\://cve.mitre.org/cgi-bin/cvename.cgi?name\=cve-2011-3389\nhttp\://www.bolet.org/TestSSLServer/
httpsinfo.beast.soln=\u041e\u0442\u043a\u043b\u044e\u0447\u0438\u0442\u0435 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435 SSLv3 \u0438 TLSv1 \u0432 \u043f\u043e\u043b\u044c\u0437\u0443 TLSv1.1 \u0438 TLSv1.2 (\u0438\u043b\u0438 \u0431\u043e\u043b\u0435\u0435 \u043f\u043e\u0437\u0434\u043d\u0438\u0445 \u0432\u0435\u0440\u0441\u0438\u0439). 
httpsinfo.ciphersuites.exception = \u0418\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u043f\u0440\u0438 \u043e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0438  CipherSuites Panel. {0}
httpsinfo.crime.desc=CRIME (Compression Ratio Info-Leite Made Easy) - \u044d\u0442\u043e \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043e \u0437\u0430\u0449\u0438\u0442\u044b \u043e\u0442 \u0432\u0435\u0431-\u0444\u0430\u0439\u043b\u043e\u0432 cookie \u0447\u0435\u0440\u0435\u0437 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0449\u0438\u0435 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u044b HTTPS \u0438 SPDY, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0442\u0430\u043a\u0436\u0435 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442 \u0441\u0436\u0430\u0442\u0438\u0435 \u0434\u0430\u043d\u043d\u044b\u0445. \u041f\u0440\u0438 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0438 \u0434\u043b\u044f \u0432\u043e\u0441\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u044f \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u043e\u0432 cookie \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0438 \u043f\u043e\u0434\u043b\u0438\u043d\u043d\u043e\u0441\u0442\u0438 \u0438\u043b\u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0441\u0435\u0430\u043d\u0441\u043e\u043c \u0437\u043b\u043e\u0443\u043c\u044b\u0448\u043b\u0435\u043d\u043d\u0438\u043a \u043c\u043e\u0436\u0435\u0442 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0438\u0442\u044c \u0437\u0430\u0445\u0432\u0430\u0442 \u0441\u0435\u0430\u043d\u0441\u0430 \u0432 \u0432\u0435\u0431-\u0441\u0435\u0430\u043d\u0441\u0435, \u043f\u0440\u043e\u0448\u0435\u0434\u0448\u0435\u043c \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 \u043f\u043e\u0434\u043b\u0438\u043d\u043d\u043e\u0441\u0442\u0438 (\u043e\u043b\u0438\u0446\u0435\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0435 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f). CRIME \u0431\u044b\u043b \u043f\u0440\u0438\u0441\u0432\u043e\u0435\u043d CVE-2012-4929. 
httpsinfo.crime.name=\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f HTTPS\: \u0443\u044f\u0437\u0432\u0438\u043c\u043e\u0441\u0442\u044c \u0441 \u0442\u043e\u0447\u043a\u0438 \u0437\u0440\u0435\u043d\u0438\u044f \u043f\u0440\u0435\u0441\u0442\u0443\u043f\u043d\u043e\u0441\u0442\u0438 
httpsinfo.crime.refs=https\://en.wikipedia.org/wiki/CRIME
httpsinfo.crime.soln=\u0411\u043e\u043b\u044c\u0448\u0438\u043d\u0441\u0442\u0432\u043e \u0441\u043e\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445 \u043a\u043b\u0438\u0435\u043d\u0442\u043e\u0432 (\u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u0432) \u0440\u0435\u0430\u043b\u0438\u0437\u043e\u0432\u0430\u043b\u0438 \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430 \u0437\u0430\u0449\u0438\u0442\u044b \u043e\u0442 \u044d\u0442\u043e\u0439 \u0430\u0442\u0430\u043a\u0438. \u0421\u0435\u0440\u0432\u0435\u0440\u043d\u044b\u0435 \u043c\u0435\u0440\u044b \u043f\u043e \u0441\u043d\u0438\u0436\u0435\u043d\u0438\u044e \u0440\u0438\u0441\u043a\u043e\u0432 \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442 \u043e\u0442\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 SPDY, HTTP-\u0441\u0436\u0430\u0442\u0438\u044f \u0438\u043b\u0438 TLS-\u0441\u0436\u0430\u0442\u0438\u044f (\u0445\u043e\u0442\u044f \u0442\u0430\u043a\u0438\u0435 \u0440\u0435\u0448\u0435\u043d\u0438\u044f, \u043e\u0447\u0435\u0432\u0438\u0434\u043d\u043e, \u043d\u0435\u0441\u0443\u0442 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0435 \u043f\u043e\u0442\u0435\u043d\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0432\u043b\u0438\u044f\u043d\u0438\u0435 \u043d\u0430 \u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u044c). 
httpsinfo.general.cert.heading=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 (\u044b) \u0441\u0435\u0440\u0432\u0435\u0440\u0430\: 
httpsinfo.general.cert.notfound=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u044b \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u043d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d\u044b\! 
httpsinfo.general.exception = \u0418\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u043f\u0440\u0438 \u043e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0438 General \u043f\u0430\u043d\u0435\u043b\u0438. {0} 
httpsinfo.init.warning =\u0418\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u043f\u0440\u0435\u043f\u044f\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044e \u043a\: {0}. \u0412\u044b\u0437\u0432\u0430\u043d\u043e\: {1} 
httpsinfo.init.warning.missing =\u041d\u0435\u0432\u0435\u0440\u043d\u0430\u044f \u0446\u0435\u043b\u044c
httpsinfo.name=\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e HTTPS 
httpsinfo.panel.mnemonic = t
httpsinfo.panel.title = HTTPS Info
httpsinfo.scanner = Scanner
httpsinfo.table.header.certificateFingerPrint = \u041e\u0442\u043f\u0435\u0447\u0430\u0442\u043e\u043a \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430\: 
httpsinfo.table.header.certificateSerialNumber = \u0421\u0435\u0440\u0438\u0439\u043d\u044b\u0439 \u043d\u043e\u043c\u0435\u0440 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430\: 
httpsinfo.table.header.certificateVersion = \u0412\u0435\u0440\u0441\u0438\u044f \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430\: 
httpsinfo.table.header.cipherSuites = Cipher Suites Supported
httpsinfo.table.header.issuerDN = \u042d\u043c\u0438\u0442\u0435\u043d\u0442 DN\: 
httpsinfo.table.header.notValidAfter = \u041d\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0443\u0435\u0442 \u043f\u043e\u0441\u043b\u0435\: 
httpsinfo.table.header.notValidBefore = \u041d\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0443\u0435\u0442 \u0434\u043e\: 
httpsinfo.table.header.selfSignedCertificate = \u0421\u0430\u043c\u043e\u043f\u043e\u0434\u043f\u0438\u0441\u0430\u043d\u043d\u044b\u0439 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\: 
httpsinfo.table.header.signingAlgorithm	 = \u0410\u043b\u0433\u043e\u0440\u0438\u0442\u043c \u043f\u043e\u0434\u043f\u0438\u0441\u0438\: 
httpsinfo.table.header.subjectDN = DN \u0441\u0443\u0431\u044a\u0435\u043a\u0442\u0430\: 
httpsinfo.table.header.trusted = Trusted
httpsinfo.table.header.valid = Valid
httpsinfo.toolbar.site.label = Site:
httpsinfo.toolbar.site.select = -- Select Site --
httpsinfo.toolbar.toggle.state.disabled.tooltip=Click to Enable HttpsInfo
httpsinfo.toolbar.toggle.state.disabled=Disabled
httpsinfo.toolbar.toggle.state.enabled.tooltip=Click to Disable HttpsInfo
httpsinfo.toolbar.toggle.state.enabled=Enabled
httpsinfo.warn.outgoing.proxy.enabled=ZAP \u0432 \u043d\u0430\u0441\u0442\u043e\u044f\u0449\u0435\u0435 \u0432\u0440\u0435\u043c\u044f \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d \u043d\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435 \u0438\u0441\u0445\u043e\u0434\u044f\u0449\u0435\u0433\u043e \u043f\u0440\u043e\u043a\u0441\u0438. {0} \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u044b \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043d\u0435\u0442\u043e\u0447\u043d\u044b\u043c\u0438. \u0422\u043e \u0435\u0441\u0442\u044c \u043e\u043d\u0438 \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u044b \u043d\u0430 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0438 \u043a \u043f\u0440\u043e\u043a\u0441\u0438, \u0430 \u043d\u0435 \u043d\u0430 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0438 \u043a \u0446\u0435\u043b\u0438. 