httpsinfo.automation.desc = Https Info Automation
httpsinfo.automation.name = Https Info Automation Framework Integration
httpsinfo.beast.desc=BEAST (Browser Exploit Against SSL/TLS) est un exploit r\u00e9v\u00e9l\u00e9 en 2011, qui tire profit des faiblesses du cha\u00eenage de blocs de cryptage (cipher block chaining - CBC) pour exploiter le protocole SSL. La vuln\u00e9rabilit\u00e9 permet des attaques d'homme du milieu (man-in-the-middle - MiTM) contre le trafic HTTP chiffr\u00e9, afin de d\u00e9crypter ce trafic et d\u2019obtenir des informations sensibles. SSL3 et TLSv1 sont touch\u00e9s.
httpsinfo.beast.name=HTTPSInfo\u00a0\: Vuln\u00e9rabilit\u00e9 BEAST
httpsinfo.beast.refs=https\://cve.mitre.org/cgi-bin/cvename.cgi?name\=cve-2011-3389\nhttp\://www.bolet.org/TestSSLServer/
httpsinfo.beast.soln=D\u00e9sactivez l\u2019utilisation de SSLv3 et TLSv1 en faveur de TLSv1.1 et TLSv1.2 (ou ult\u00e9rieure).
httpsinfo.ciphersuites.exception = An exception occurred while updating the CipherSuites Panel. {0}
httpsinfo.crime.desc=CRIME (Compression Ratio Info-leak Made Easy) est une exploitation dirig\u00e9e contre les cookies web sur des connexions HTTPS et SPDY compressant \u00e9galement les donn\u00e9es. Lorsque du contenu d\u2019authentification ou des cookies de session sont r\u00e9cup\u00e9r\u00e9s, elle permet \u00e0 un attaquant de proc\u00e9der au d\u00e9tournement d'une session web authentifi\u00e9e (emprunt d\u2019identit\u00e9 de l\u2019utilisateur). CRIME a re\u00e7u l'identifiant CVE-2012-4929.
httpsinfo.crime.name=HTTPSInfo\u00a0\: Vuln\u00e9rabilit\u00e9 Crime
httpsinfo.crime.refs=https\://en.wikipedia.org/wiki/CRIME
httpsinfo.crime.soln=Les clients les plus modernes (navigateurs web) ont mis en place des mesures d\u2019att\u00e9nuation contre cette attaque. Les contre-mesures c\u00f4t\u00e9 serveur incluent la d\u00e9sactivation de SPDY, de la compression HTTP ou de la Compression TLS (bien que ces solutions aient leurs propres impacts potentiels sur la performance). 
httpsinfo.general.cert.heading=Certificat(s) de serveur\u00a0\:\n
httpsinfo.general.cert.notfound=Aucun certificat de serveur trouv\u00e9\u00a0\!\n
httpsinfo.general.exception = An exception occurred while updating the General panel. {0}
httpsinfo.init.warning =An exception has prevented connection to\: {0}. Caused by\: {1}
httpsinfo.init.warning.missing =Invalid Target 
httpsinfo.name=Info HTTPS
httpsinfo.panel.mnemonic = t
httpsinfo.panel.title = HTTPS Info
httpsinfo.scanner = Scanner
httpsinfo.table.header.certificateFingerPrint	= Certificate Fingerprint
httpsinfo.table.header.certificateSerialNumber		= Certificate Serial Number
httpsinfo.table.header.certificateVersion		= Certificate Version
httpsinfo.table.header.cipherSuites = Cipher Suites Supported
httpsinfo.table.header.issuerDN	= Issuer DN
httpsinfo.table.header.notValidAfter		= Not Valid After
httpsinfo.table.header.notValidBefore = Not Valid Before
httpsinfo.table.header.selfSignedCertificate		= Self Signed Certificate
httpsinfo.table.header.signingAlgorithm		= Signing Algorithm
httpsinfo.table.header.subjectDN		= Subject DN
httpsinfo.table.header.trusted = Trusted
httpsinfo.table.header.valid = Valid
httpsinfo.toolbar.site.label = Site:
httpsinfo.toolbar.site.select = -- Select Site --
httpsinfo.toolbar.toggle.state.disabled.tooltip=Click to Enable HttpsInfo
httpsinfo.toolbar.toggle.state.disabled=Disabled
httpsinfo.toolbar.toggle.state.enabled.tooltip=Click to Disable HttpsInfo
httpsinfo.toolbar.toggle.state.enabled=Enabled
httpsinfo.warn.outgoing.proxy.enabled=ZAP est actuellement configur\u00e9 pour utiliser un proxy sortant. {0} r\u00e9sultats peuvent \u00eatre inexacts. Autrement dit, ils peuvent reposer sur la connexion au proxy au lieu de la connexion \u00e0 la cible.