httpsinfo.ciphersuites.supported.label=Suites de cifrado compatibles\:
httpsinfo.ciphersuites.exception = Se ha producido una excepci\u00f3n al actualizar el Panel de CipherSuites. {0}
httpsinfo.desc=Este complemento agrupa y muestra la informaci\u00f3n de SSL/TLS para un servidor
httpsinfo.ext.name=Extensi\u00f3n de la informaci\u00f3n HTTPS
httpsinfo.general.server.leadin=Servidor\: {0}\n
httpsinfo.general.cert.notfound=\u00a1No se ha podido conseguir los certificados de servidor\!\n
httpsinfo.general.cert.heading=Certificado(s) del servidor\:\n
httpsinfo.general.subject.dn = DN del sujeto\:
httpsinfo.general.signing.algo = Algoritmo de firma\:
httpsinfo.general.cert.fingerprint = Huella digital del certificado\:
httpsinfo.general.issuer.dn = DN del emisor\:
httpsinfo.general.not.valid.before = No v\u00e1lido antes\:
httpsinfo.general.not.valid.after = No v\u00e1lido despu\u00e9s\:
httpsinfo.general.cert.serial.number = N\u00famero de serie del certificado\: 
httpsinfo.general.cert.version = Versi\u00f3n del certificado\:
httpsinfo.general.cert.self.signed = Certificado firmado de forma autom\u00e1tica\:
httpsinfo.general.exception = Se ha producido una excepci\u00f3n al actualizar el panel General. {0}
httpsinfo.init.warning =An exception has prevented connection to\: {0}. Caused by\: {1}
httpsinfo.init.warning.missing =Invalid Target 
httpsinfo.name=Informaci\u00f3n de HTTPS
httpsinfo.panel.usage=To start an HTTPS assessment choose 'Scan HTTPS Configuration' from the context menu (right click) on the Sites tree or History tab.
httpsinfo.rightclick.menuitem=Escanear la configuraci\u00f3n de HTTPS

#Left for potential future re-use
httpsinfo.beast.name=Informaci\u00f3n\: HTTPS\: Vulnerabilidades de la bestia
httpsinfo.beast.desc=Bestia (Explotar navegador contra SSL/TLS) es un explotador mostrado en el 2011, que se aprovecha de las debilidades en el encadenamiento de bloques de cifrado (CBC) para explotar el protocolo SSL. La vulnerabilidad puede permitir los ataques man-in-the-middle (MiTM) contra el tr\u00e1fico HTTP cifrado para lograr descifrar el tr\u00e1fico y poder conseguir informaci\u00f3n confidencial. SSL3 y TLSv1 se ven afectados por esto.
httpsinfo.beast.refs=https\://cve.mitre.org/cgi-bin/cvename.cgi?name\=cve-2011-3389\nhttp\://www.bolet.org/TestSSLServer/
httpsinfo.beast.soln=Desactive el uso de SSLv3 y de TLSv1 a favor de TLSv1.1 y TLS1.2 (o posterior).
httpsinfo.crime.name=Informaci\u00f3n HTTPS\: Vulnerabilidad de delincuencia
httpsinfo.crime.desc=CRIME (frecuencia de informaci\u00f3n de relaci\u00f3n de comprensi\u00f3n f\u00e1cil) es un ataque de seguridad contra las cookies de la web por medio de las conexiones utilizando los protocolos de HTTPS y SPDY que tambi\u00e9n utilizan la comprensi\u00f3n de datos. Cuando se utiliza para recuperar la informaci\u00f3n de las cookies de autenticaci\u00f3n o gesti\u00f3n de la sesi\u00f3n, permite a un atacante que realice el secuestro de sesi\u00f3n en una sesi\u00f3n web autenticada (suplantanci\u00f3n del usuario). CRIME se le asign\u00f3 CVE-2012-4929.
httpsinfo.crime.refs=https\://en.wikipedia.org/wiki/CRIME
httpsinfo.crime.soln=La mayoria de los clientes modernos (los navegadores web) han establecido mitigaciones contra este ataque. Las mitigaciones que se basan en el servidor incluyen desactivar SPDY, Comprensi\u00f3n de HTTP o Comprensi\u00f3n TLS (aunque esas soluciones obviamente tienen sus propios impactos de forma potencial en el rendimiento). 
httpsinfo.warn.outgoing.proxy.enabled=ZAP actualmente se encuentra configurado para utilizar un proxy de salida. Los resultados de {0} pueden ser que sean poco exactos. Es decir, pueden ser que se basen en la conexi\u00f3n al proxy en lugar de la conexi\u00f3n al objetivo.