pscanalpha.base64disclosure.desc = \u0414\u0430\u043d\u0456, \u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0456 \u0432 Base64, \u0431\u0443\u043b\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0456 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u043e\u043c \u0430\u0431\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c. \u041f\u0440\u0438\u043c\u0456\u0442\u043a\u0430\: \u0432 \u0456\u043d\u0442\u0435\u0440\u0435\u0441\u0430\u0445 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u043e\u0441\u0442\u0456 \u043d\u0435 \u0432\u0441\u0456 base64-\u0440\u044f\u0434\u043a\u0438 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u0438 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0456 \u043e\u043a\u0440\u0435\u043c\u043e, \u0432\u0441\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043f\u043e\u0432\u0438\u043d\u043d\u0430 \u0431\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0430 \u0430\u043d\u0430\u043b\u0456\u0442\u0438\u043a\u043e\u043c, \u043a\u043e\u043c\u0430\u043d\u0434\u043e\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0430\u0431\u043e \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0430\u043c\u0438.
pscanalpha.base64disclosure.extrainfo = {1}
pscanalpha.base64disclosure.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f Base64
pscanalpha.base64disclosure.refs = http\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e \u0434\u0430\u043d\u0456 Base64 \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u044e\u0442\u044c \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0430\u0433\u0440\u0435\u0433\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0456\u043d\u0448\u0438\u0445 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0435\u0439.
pscanalpha.base64disclosure.viewstate.desc = \u0414\u043e\u0434\u0430\u0442\u043e\u043a \u0430\u0431\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0440\u043e\u0437\u043a\u0440\u0438\u0432 ASP.NET ViewState.
pscanalpha.base64disclosure.viewstate.extrainfo = {0}
pscanalpha.base64disclosure.viewstate.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f ASP.NET ViewState
pscanalpha.base64disclosure.viewstate.refs = http\://msdn.microsoft.com/en-us/library/bb386448.aspx\nhttp\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.viewstate.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e ASP.NET ViewState \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0430\u0433\u0440\u0435\u0433\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0433\u043e \u0443\u0440\u0430\u0436\u0435\u043d\u043d\u044f.
pscanalpha.base64disclosure.viewstatewithoutmac.desc = \u0417\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u043a\u043e\u0434 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c (MAC) \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 ASP.NET ViewState, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0456\u0434\u0440\u043e\u0431\u043b\u0435\u043d\u0438\u0439 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043a\u043b\u0456\u0454\u043d\u0442\u043e\u043c
pscanalpha.base64disclosure.viewstatewithoutmac.extrainfo = {0}
pscanalpha.base64disclosure.viewstatewithoutmac.name = \u0426\u0456\u043b\u0456\u0441\u043d\u0456\u0441\u0442\u044c ASP.NET ViewState Integrity
pscanalpha.base64disclosure.viewstatewithoutmac.refs = http\://msdn.microsoft.com/en-us/library/bb386448.aspx\nhttps\://www.jardinesoftware.net/2012/02/06/asp-net-tampering-with-event-validation-part-1/
pscanalpha.base64disclosure.viewstatewithoutmac.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0441\u0456 ASP.NET ViewStates \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0432\u0456\u0434 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e MAC-\u0430\u0434\u0440\u0435\u0441\u0438, \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043e\u0457 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0443 \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0456 \u0441\u0435\u043a\u0440\u0435\u0442\u043d\u043e\u0433\u043e \u043a\u043b\u044e\u0447\u0430 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u0426\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c \u0443 \u0441\u0443\u0447\u0430\u0441\u043d\u0456\u0439 \u0456\u043d\u0441\u0442\u0430\u043b\u044f\u0446\u0456\u0457 ASP.NET, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u043c\u0456\u043d\u0435\u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e \u0430\u0431\u043e \u0447\u0435\u0440\u0435\u0437 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e ASP.NET.

pscanalpha.desc = \u041f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u043b\u044c\u0444\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanalpha.examplefile.desc = \u0414\u043e\u0434\u0430\u0442\u0438 \u0431\u0456\u043b\u044c\u0448\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c
pscanalpha.examplefile.name = \u041f\u0440\u0438\u043a\u043b\u0430\u0434 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0434\u0430\u043d\u0456 \u0437 \u0444\u0430\u0439\u043b\u0443
pscanalpha.examplefile.other = \u041b\u0438\u0448\u0435 \u0434\u043b\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u044f\u043a\u0430 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0436\u043e\u0434\u043d\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0440\u043e\u0437\u0434\u0456\u043b\u0430\u043c
pscanalpha.examplefile.refs = https\://www.zaproxy.org/blog/2014-04-03-hacking-zap-3-passive-scan-rules/
pscanalpha.examplefile.soln = \u0417\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0439 \u043e\u043f\u0438\u0441 \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u0438\u0440\u0456\u0448\u0438\u0442\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443.

pscanalpha.metadata-request-headers.name = Fetch Metadata Request Headers
pscanalpha.metadata-request-headers.sfd.invalid-values.desc = Specifies how and where the data would be used. For instance, if the value is audio, then the requested resource must be audio data and not any other type of resource.

pscanalpha.metadata-request-headers.sfd.invalid-values.name = Sec-Fetch-Dest Header Has an Invalid Value
pscanalpha.metadata-request-headers.sfd.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Dest
pscanalpha.metadata-request-headers.sfd.invalid-values.soln = Sec-Fetch-Dest header must have one of the following values\: audio, audioworklet, document, embed, empty, font, frame, iframe, image, manifest, object, paintworklet, report, script, serviceworker, sharedworker, style, track, video, worker, xslt.
pscanalpha.metadata-request-headers.sfd.missing.desc = Specifies how and where the data would be used. For instance, if the value is audio, then the requested resource must be audio data and not any other type of resource.

pscanalpha.metadata-request-headers.sfd.missing.name = Sec-Fetch-Dest Header is Missing
pscanalpha.metadata-request-headers.sfd.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Dest
pscanalpha.metadata-request-headers.sfd.missing.soln = Ensure that Sec-Fetch-Dest header is included in request headers.
pscanalpha.metadata-request-headers.sfm.invalid-values.desc = Allows to differentiate between requests for navigating between HTML pages and requests for loading resources like images, audio etc.

pscanalpha.metadata-request-headers.sfm.invalid-values.name = Sec-Fetch-Mode Header Has an Invalid Value
pscanalpha.metadata-request-headers.sfm.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Mode
pscanalpha.metadata-request-headers.sfm.invalid-values.soln = Sec-Fetch-Mode header must have one of the following values\: cors, no-cors, navigate, same-origin, or websocket.
pscanalpha.metadata-request-headers.sfm.missing.desc = Allows to differentiate between requests for navigating between HTML pages and requests for loading resources like images, audio etc.

pscanalpha.metadata-request-headers.sfm.missing.name = Sec-Fetch-Mode Header is Missing
pscanalpha.metadata-request-headers.sfm.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Mode
pscanalpha.metadata-request-headers.sfm.missing.soln = Ensure that Sec-Fetch-Mode header is included in request headers.
pscanalpha.metadata-request-headers.sfs.invalid-values.desc = Specifies the relationship between request initiator's origin and target's origin.

pscanalpha.metadata-request-headers.sfs.invalid-values.name = Sec-Fetch-Site Header Has an Invalid Value
pscanalpha.metadata-request-headers.sfs.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Site
pscanalpha.metadata-request-headers.sfs.invalid-values.soln = Sec-Fetch-Site header must have one of the following values\: same-origin, same-site, cross-origin, or none.
pscanalpha.metadata-request-headers.sfs.missing.desc = Specifies the relationship between request initiator's origin and target's origin.

pscanalpha.metadata-request-headers.sfs.missing.name = Sec-Fetch-Site Header is Missing
pscanalpha.metadata-request-headers.sfs.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Site
pscanalpha.metadata-request-headers.sfs.missing.soln = Ensure that Sec-Fetch-Site header is included in request headers.
pscanalpha.metadata-request-headers.sfu.invalid-values.desc = Specifies if a navigation request was initiated by a user.

pscanalpha.metadata-request-headers.sfu.invalid-values.name = Sec-Fetch-User Header Has an Invalid Value
pscanalpha.metadata-request-headers.sfu.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-User
pscanalpha.metadata-request-headers.sfu.invalid-values.soln = Sec-Fetch-User header must have the value set to ?1.
pscanalpha.metadata-request-headers.sfu.missing.desc = Specifies if a navigation request was initiated by a user.

pscanalpha.metadata-request-headers.sfu.missing.name = Sec-Fetch-User Header is Missing
pscanalpha.metadata-request-headers.sfu.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-User
pscanalpha.metadata-request-headers.sfu.missing.soln = Ensure that Sec-Fetch-User header is included in user initiated requests.

pscanalpha.name = \u041f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u2014 \u0430\u043b\u044c\u0444\u0430

