pscanalpha.base64disclosure.desc = \u0414\u0430\u043d\u0456, \u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0456 \u0432 Base64, \u0431\u0443\u043b\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0456 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u043e\u043c \u0430\u0431\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c. \u041f\u0440\u0438\u043c\u0456\u0442\u043a\u0430\: \u0432 \u0456\u043d\u0442\u0435\u0440\u0435\u0441\u0430\u0445 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u043e\u0441\u0442\u0456 \u043d\u0435 \u0432\u0441\u0456 base64-\u0440\u044f\u0434\u043a\u0438 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u0438 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0456 \u043e\u043a\u0440\u0435\u043c\u043e, \u0432\u0441\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043f\u043e\u0432\u0438\u043d\u043d\u0430 \u0431\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0430 \u0430\u043d\u0430\u043b\u0456\u0442\u0438\u043a\u043e\u043c, \u043a\u043e\u043c\u0430\u043d\u0434\u043e\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0430\u0431\u043e \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0430\u043c\u0438.
pscanalpha.base64disclosure.extrainfo = {1}
pscanalpha.base64disclosure.name = Base64 Disclosure
pscanalpha.base64disclosure.refs = http\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.soln = Manually confirm that the Base64 data does not leak sensitive information, and that the data cannot be aggregated/used to exploit other vulnerabilities.
pscanalpha.base64disclosure.viewstate.desc = An ASP.NET ViewState was disclosed by the application/web server
pscanalpha.base64disclosure.viewstate.extrainfo = {0}
pscanalpha.base64disclosure.viewstate.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f ASP.NET ViewState
pscanalpha.base64disclosure.viewstate.refs = http\://msdn.microsoft.com/en-us/library/bb386448.aspx\nhttp\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.viewstate.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e ASP.NET ViewState \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0430\u0433\u0440\u0435\u0433\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0433\u043e \u0443\u0440\u0430\u0436\u0435\u043d\u043d\u044f.
pscanalpha.base64disclosure.viewstatewithoutmac.desc = \u0417\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u043a\u043e\u0434 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c (MAC) \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 ASP.NET ViewState, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0456\u0434\u0440\u043e\u0431\u043b\u0435\u043d\u0438\u0439 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043a\u043b\u0456\u0454\u043d\u0442\u043e\u043c
pscanalpha.base64disclosure.viewstatewithoutmac.extrainfo = {0}
pscanalpha.base64disclosure.viewstatewithoutmac.name = \u0426\u0456\u043b\u0456\u0441\u043d\u0456\u0441\u0442\u044c ASP.NET ViewState Integrity
pscanalpha.base64disclosure.viewstatewithoutmac.refs = http\://msdn.microsoft.com/en-us/library/bb386448.aspx\nhttps\://www.jardinesoftware.net/2012/02/06/asp-net-tampering-with-event-validation-part-1/
pscanalpha.base64disclosure.viewstatewithoutmac.soln = Ensure that all ASP.NET ViewStates are protected from tampering, by using a MAC, generated using a secure algorithm, and a secret key on the server side. This is the default configuration on modern ASP.NET installation, by may be over-ridden programmatically, or via the ASP.NET configuration.

pscanalpha.desc = \u041f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u043b\u044c\u0444\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanalpha.examplefile.desc = \u0414\u043e\u0434\u0430\u0442\u0438 \u0431\u0456\u043b\u044c\u0448\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c
pscanalpha.examplefile.name = \u041f\u0440\u0438\u043a\u043b\u0430\u0434 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0434\u0430\u043d\u0456 \u0437 \u0444\u0430\u0439\u043b\u0443
pscanalpha.examplefile.other = \u041b\u0438\u0448\u0435 \u0434\u043b\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u044f\u043a\u0430 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0436\u043e\u0434\u043d\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0440\u043e\u0437\u0434\u0456\u043b\u0430\u043c
pscanalpha.examplefile.refs = https\://www.zaproxy.org/blog/2014-04-03-hacking-zap-3-passive-scan-rules/
pscanalpha.examplefile.soln = \u0417\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0439 \u043e\u043f\u0438\u0441 \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u0438\u0440\u0456\u0448\u0438\u0442\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443.

pscanalpha.name = Passive Scan Rules - alpha

pscanalpha.site-isolation.coep.desc = Cross-Origin-Embedder-Policy header is a response header that prevents a document from loading any cross-origin resources that don't explicitly grant the document permission (using CORP or CORS).
pscanalpha.site-isolation.coep.name = Cross-Origin-Embedder-Policy Header Missing or Invalid
pscanalpha.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy
pscanalpha.site-isolation.coep.soln = Ensure that the application/web server sets the Cross-Origin-Embedder-Policy header appropriately, and that it sets the Cross-Origin-Embedder-Policy header to 'require-corp' for documents.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Embedder-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy).
pscanalpha.site-isolation.coop.desc = Cross-Origin-Opener-Policy header is a response header that allows a site to control if others included documents share the same browsing context. Sharing the same browsing context with untrusted documents might lead to data leak.
pscanalpha.site-isolation.coop.name = Cross-Origin-Opener-Policy Header Missing or Invalid
pscanalpha.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy
pscanalpha.site-isolation.coop.soln = Ensure that the application/web server sets the Cross-Origin-Opener-Policy header appropriately, and that it sets the Cross-Origin-Opener-Policy header to 'same-origin' for documents.\n'same-origin-allow-popups' is considered as less secured and should be avoided.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Opener-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy).
pscanalpha.site-isolation.corp.desc = Cross-Origin-Resource-Policy header is an opt-in header designed to counter side-channels attacks like Spectre. Resource should be specifically set as shareable amongst different origins.
pscanalpha.site-isolation.corp.name = Cross-Origin-Resource-Policy Header Missing or Invalid
pscanalpha.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Cross-Origin_Resource_Policy_(CORP)
pscanalpha.site-isolation.corp.soln = Ensure that the application/web server sets the Cross-Origin-Resource-Policy header appropriately, and that it sets the Cross-Origin-Resource-Policy header to 'same-origin' for all web pages.\n'same-site' is considered as less secured and should be avoided.\nIf resources must be shared, set the header to 'cross-origin'.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Resource-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy).
pscanalpha.site-isolation.name = Insufficient Site Isolation Against Spectre Vulnerability

pscanalpha.sourcecodedisclosure.desc = Application Source Code was disclosed by the web server
pscanalpha.sourcecodedisclosure.extrainfo = {0}
pscanalpha.sourcecodedisclosure.name = Source Code Disclosure
pscanalpha.sourcecodedisclosure.refs = http\://blogs.wsj.com/cio/2013/10/08/adobe-source-code-leak-is-bad-news-for-u-s-government/
pscanalpha.sourcecodedisclosure.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438 \u043d\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0437 \u0430\u043b\u044c\u0442\u0435\u0440\u043d\u0430\u0442\u0438\u0432\u043d\u0438\u043c\u0438 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f\u043c\u0438, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u043d\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u043d\u0456\u0439 \u0432 \u0456\u043d\u0448\u0438\u0445 \u0444\u0430\u0439\u043b\u0430\u0445 \u0430\u0431\u043e \u0434\u0430\u043d\u0438\u0445, \u0440\u043e\u0437\u0433\u043e\u0440\u043d\u0443\u0442\u0438\u0445 \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0430\u0431\u043e \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u0438\u0445 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.
