pscanalpha.base64disclosure.desc = \u0414\u0430\u043d\u0456, \u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0456 \u0432 Base64, \u0431\u0443\u043b\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0456 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u043e\u043c \u0430\u0431\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c. \u041f\u0440\u0438\u043c\u0456\u0442\u043a\u0430\: \u0432 \u0456\u043d\u0442\u0435\u0440\u0435\u0441\u0430\u0445 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u043e\u0441\u0442\u0456 \u043d\u0435 \u0432\u0441\u0456 base64-\u0440\u044f\u0434\u043a\u0438 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u0438 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0456 \u043e\u043a\u0440\u0435\u043c\u043e, \u0432\u0441\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043f\u043e\u0432\u0438\u043d\u043d\u0430 \u0431\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0430 \u0430\u043d\u0430\u043b\u0456\u0442\u0438\u043a\u043e\u043c, \u043a\u043e\u043c\u0430\u043d\u0434\u043e\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0430\u0431\u043e \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0430\u043c\u0438.
pscanalpha.base64disclosure.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f Base64
pscanalpha.base64disclosure.refs = https\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e \u0434\u0430\u043d\u0456 Base64 \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u044e\u0442\u044c \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0430\u0433\u0440\u0435\u0433\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0456\u043d\u0448\u0438\u0445 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0435\u0439.
pscanalpha.base64disclosure.viewstate.desc = \u0414\u043e\u0434\u0430\u0442\u043e\u043a \u0430\u0431\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0440\u043e\u0437\u043a\u0440\u0438\u0432 ASP.NET ViewState.
pscanalpha.base64disclosure.viewstate.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f ASP.NET ViewState
pscanalpha.base64disclosure.viewstate.refs = https\://learn.microsoft.com/en-us/previous-versions/bb386448(v\=vs.140)\nhttps\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanalpha.base64disclosure.viewstate.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e ASP.NET ViewState \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0430\u0433\u0440\u0435\u0433\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0433\u043e \u0443\u0440\u0430\u0436\u0435\u043d\u043d\u044f.
pscanalpha.base64disclosure.viewstatewithoutmac.desc = \u0417\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u043a\u043e\u0434 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c (MAC) \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 ASP.NET ViewState, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0456\u0434\u0440\u043e\u0431\u043b\u0435\u043d\u0438\u0439 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043a\u043b\u0456\u0454\u043d\u0442\u043e\u043c
pscanalpha.base64disclosure.viewstatewithoutmac.name = \u0426\u0456\u043b\u0456\u0441\u043d\u0456\u0441\u0442\u044c ASP.NET ViewState Integrity
pscanalpha.base64disclosure.viewstatewithoutmac.refs = https\://learn.microsoft.com/en-us/previous-versions/bb386448(v\=vs.140)\nhttps\://www.jardinesoftware.net/2012/02/06/asp-net-tampering-with-event-validation-part-1/
pscanalpha.base64disclosure.viewstatewithoutmac.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0441\u0456 ASP.NET ViewStates \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0432\u0456\u0434 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e MAC-\u0430\u0434\u0440\u0435\u0441\u0438, \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043e\u0457 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0443 \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0456 \u0441\u0435\u043a\u0440\u0435\u0442\u043d\u043e\u0433\u043e \u043a\u043b\u044e\u0447\u0430 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u0426\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c \u0443 \u0441\u0443\u0447\u0430\u0441\u043d\u0456\u0439 \u0456\u043d\u0441\u0442\u0430\u043b\u044f\u0446\u0456\u0457 ASP.NET, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u043c\u0456\u043d\u0435\u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e \u0430\u0431\u043e \u0447\u0435\u0440\u0435\u0437 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e ASP.NET.

pscanalpha.desc = \u041f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u043b\u044c\u0444\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanalpha.examplefile.desc = \u0414\u043e\u0434\u0430\u0442\u0438 \u0431\u0456\u043b\u044c\u0448\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c
pscanalpha.examplefile.name = \u041f\u0440\u0438\u043a\u043b\u0430\u0434 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0434\u0430\u043d\u0456 \u0437 \u0444\u0430\u0439\u043b\u0443
pscanalpha.examplefile.other = \u041b\u0438\u0448\u0435 \u0434\u043b\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u044f\u043a\u0430 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0436\u043e\u0434\u043d\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0440\u043e\u0437\u0434\u0456\u043b\u0430\u043c
pscanalpha.examplefile.refs = https\://www.zaproxy.org/blog/2014-04-03-hacking-zap-3-passive-scan-rules/
pscanalpha.examplefile.soln = \u0417\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0439 \u043e\u043f\u0438\u0441 \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u0438\u0440\u0456\u0448\u0438\u0442\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443.

pscanalpha.fullpathdisclosurealert.desc = The full path of files which might be sensitive has been exposed to the client.
pscanalpha.fullpathdisclosurealert.name = Full Path Disclosure
pscanalpha.fullpathdisclosurealert.refs = https\://owasp.org/www-community/attacks/Full_Path_Disclosure
pscanalpha.fullpathdisclosurealert.soln = Disable directory browsing in your web server. Refer to the web server documentation.

pscanalpha.metadata-request-headers.name = \u041e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0438\u0445
pscanalpha.metadata-request-headers.sfd.invalid-values.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454, \u044f\u043a \u0456 \u0434\u0435 \u0431\u0443\u0434\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0434\u0430\u043d\u0456. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u044f\u043a\u0449\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u0454 \u0430\u0443\u0434\u0456\u043e, \u0442\u043e \u0437\u0430\u043f\u0438\u0442\u0443\u0432\u0430\u043d\u0438\u0439 \u0440\u0435\u0441\u0443\u0440\u0441 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u0441\u0430\u043c\u0435 \u0430\u0443\u0434\u0456\u043e\u0434\u0430\u043d\u0438\u043c\u0438, \u0430 \u043d\u0435 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0442\u0438\u043f\u043e\u043c \u0440\u0435\u0441\u0443\u0440\u0441\u0443.

pscanalpha.metadata-request-headers.sfd.invalid-values.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Dest \u043c\u0430\u0454 \u043d\u0435\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f
pscanalpha.metadata-request-headers.sfd.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Dest
pscanalpha.metadata-request-headers.sfd.invalid-values.soln = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Dest \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u043e\u0434\u043d\u0435 \u0437 \u0442\u0430\u043a\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c\: audio, audioworklet, document, embed, empty, font, frame, iframe, image, manifest, object, paintworklet, report, script, serviceworker, sharedworker, style, track, video, worker, xslt.
pscanalpha.metadata-request-headers.sfd.missing.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454, \u044f\u043a \u0456 \u0434\u0435 \u0431\u0443\u0434\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0434\u0430\u043d\u0456. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u044f\u043a\u0449\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u0454 \u0430\u0443\u0434\u0456\u043e, \u0442\u043e \u0437\u0430\u043f\u0438\u0442\u0443\u0432\u0430\u043d\u0438\u0439 \u0440\u0435\u0441\u0443\u0440\u0441 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u0441\u0430\u043c\u0435 \u0430\u0443\u0434\u0456\u043e\u0434\u0430\u043d\u0438\u043c\u0438, \u0430 \u043d\u0435 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0442\u0438\u043f\u043e\u043c \u0440\u0435\u0441\u0443\u0440\u0441\u0443.

pscanalpha.metadata-request-headers.sfd.missing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Dest
pscanalpha.metadata-request-headers.sfd.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Dest
pscanalpha.metadata-request-headers.sfd.missing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Dest \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e \u0434\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u0437\u0430\u043f\u0438\u0442\u0456\u0432.
pscanalpha.metadata-request-headers.sfm.invalid-values.desc = \u0414\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0440\u043e\u0437\u0440\u0456\u0437\u043d\u044f\u0442\u0438 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043b\u044f \u043d\u0430\u0432\u0456\u0433\u0430\u0446\u0456\u0457 \u043c\u0456\u0436 HTML-\u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u0442\u0430 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043b\u044f \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f, \u0430\u0443\u0434\u0456\u043e \u0442\u043e\u0449\u043e.

pscanalpha.metadata-request-headers.sfm.invalid-values.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Mode \u043c\u0430\u0454 \u043d\u0435\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f
pscanalpha.metadata-request-headers.sfm.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Mode
pscanalpha.metadata-request-headers.sfm.invalid-values.soln = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Mode \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u043e\u0434\u043d\u0435 \u0437 \u0442\u0430\u043a\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c\: cors, no-cors, navigate, same-origin \u0430\u0431\u043e websocket.
pscanalpha.metadata-request-headers.sfm.missing.desc = \u0414\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0440\u043e\u0437\u0440\u0456\u0437\u043d\u044f\u0442\u0438 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043b\u044f \u043d\u0430\u0432\u0456\u0433\u0430\u0446\u0456\u0457 \u043c\u0456\u0436 HTML-\u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u0442\u0430 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043b\u044f \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f, \u0430\u0443\u0434\u0456\u043e \u0442\u043e\u0449\u043e.

pscanalpha.metadata-request-headers.sfm.missing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Mode
pscanalpha.metadata-request-headers.sfm.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Mode
pscanalpha.metadata-request-headers.sfm.missing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Mode \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e \u0434\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u0437\u0430\u043f\u0438\u0442\u0456\u0432.
pscanalpha.metadata-request-headers.sfs.invalid-values.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454 \u0437\u0432'\u044f\u0437\u043e\u043a \u043c\u0456\u0436 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u0456\u043d\u0456\u0446\u0456\u0430\u0442\u043e\u0440\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0456 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u043e\u0434\u0435\u0440\u0436\u0443\u0432\u0430\u0447\u0430.

pscanalpha.metadata-request-headers.sfs.invalid-values.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Site \u043c\u0430\u0454 \u043d\u0435\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f
pscanalpha.metadata-request-headers.sfs.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Site
pscanalpha.metadata-request-headers.sfs.invalid-values.soln = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Site \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u043e\u0434\u043d\u0435 \u0437 \u0442\u0430\u043a\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c\: same-origin, same-site, cross-origin \u0430\u0431\u043e \u0436\u043e\u0434\u043d\u043e\u0433\u043e \u0456\u0437 \u043d\u0438\u0445.
pscanalpha.metadata-request-headers.sfs.missing.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454 \u0437\u0432'\u044f\u0437\u043e\u043a \u043c\u0456\u0436 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u0456\u043d\u0456\u0446\u0456\u0430\u0442\u043e\u0440\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0456 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u043e\u0434\u0435\u0440\u0436\u0443\u0432\u0430\u0447\u0430.

pscanalpha.metadata-request-headers.sfs.missing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Site
pscanalpha.metadata-request-headers.sfs.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Site
pscanalpha.metadata-request-headers.sfs.missing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-Site \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0456\u0432.
pscanalpha.metadata-request-headers.sfu.invalid-values.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454, \u0447\u0438 \u0437\u0430\u043f\u0438\u0442 \u043d\u0430 \u043d\u0430\u0432\u0456\u0433\u0430\u0446\u0456\u044e \u0456\u043d\u0456\u0446\u0456\u044e\u0432\u0430\u0432 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447.

pscanalpha.metadata-request-headers.sfu.invalid-values.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-User \u043c\u0430\u0454 \u043d\u0435\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f
pscanalpha.metadata-request-headers.sfu.invalid-values.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-User
pscanalpha.metadata-request-headers.sfu.invalid-values.soln = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-User \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f ?1.
pscanalpha.metadata-request-headers.sfu.missing.desc = \u0412\u0438\u0437\u043d\u0430\u0447\u0430\u0454, \u0447\u0438 \u0437\u0430\u043f\u0438\u0442 \u043d\u0430 \u043d\u0430\u0432\u0456\u0433\u0430\u0446\u0456\u044e \u0456\u043d\u0456\u0446\u0456\u044e\u0432\u0430\u0432 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447.

pscanalpha.metadata-request-headers.sfu.missing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-User
pscanalpha.metadata-request-headers.sfu.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-User
pscanalpha.metadata-request-headers.sfu.missing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Sec-Fetch-User \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e \u0434\u043e \u0437\u0430\u043f\u0438\u0442\u0456\u0432, \u0456\u043d\u0456\u0446\u0456\u0439\u043e\u0432\u0430\u043d\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c.

pscanalpha.name = \u041f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u2014 \u0430\u043b\u044c\u0444\u0430

