codedx.topmenu.upload.title = Code Dx\: Relat\u00f3rio de Upload
codedx.topmenu.report.title = Code Dx\: Gerar Relat\u00f3rio XML
codedx.desc                 = Gera relat\u00f3rio XML que inclui dados de solicita\u00e7\u00e3o e resposta para cada alerta

codedx.error                = Erro
codedx.warning              = Aten\u00e7\u00e3o

codedx.message.success      = O relat\u00f3rio foi carregado com sucesso para o Code Dx.
codedx.error.unexpected     = Ocorreu um erro inesperado e n\u00e3o foi poss\u00edvel enviar o relat\u00f3rio.
codedx.error.unsent         = O relat\u00f3rio n\u00e3o p\u00f4de ser enviado.
codedx.error.empty          = O relat\u00f3rio gerado est\u00e1 vazio.
codedx.error.failed         = A gera\u00e7\u00e3o do relat\u00f3rio falhou.
codedx.error.http.400       = O servidor retornou o Erro 400\: Solicita\u00e7\u00e3o Inv\u00e1lida.
codedx.error.http.403       = O servidor retornou o erro 403\: Proibido.\nA chave API pode estar incorreta ou ter permiss\u00f5es insuficientes para este projeto.
codedx.error.http.404       = O servidor retornou o erro 404\: N\u00e3o Encontrado.\nA URL do servidor pode estar errada ou o projeto pode n\u00e3o existir mais.
codedx.error.http.415       = O servidor retornou o Erro 415\: Tipo de M\u00eddia N\u00e3o Suportado.
codedx.error.http.other     = O c\u00f3digo de resposta \u00e9\:
codedx.error.client.failed  = Ocorreu um erro desconhecido ao criar o cliente HTTP.\nCertifique-se de que a URL do servidor e a chave API estejam corretas e que o servidor esteja online.
codedx.error.client.invalid = A URL do servidor n\u00e3o \u00e9 uma URL v\u00e1lida. Verifique se est\u00e1 correta.
codedx.error.httpMessage    = Nenhuma mensagem HTTP encontrada para o alerta id \= {0}
codedx.error.timeout        = O valor inserido para o tempo limite \u00e9 inv\u00e1lido. O tempo limite foi padronizado para 120 segundos.

codedx.settings.title       = Insira as configura\u00e7\u00f5es do servidor Code Dx
codedx.settings.serverurl   = URL do Servidor\:
codedx.settings.apikey      = Chave API\:
codedx.setting.timeout      = Tempo limite (segundos)\:
codedx.settings.upload      = Envio
codedx.settings.cancel      = Cancelar

codedx.refresh.noproject    = Nenhum projeto foi encontrado. Verifique se a URL do servidor e a chave API est\u00e3o\ncorretas e se a chave API tem permiss\u00e3o apropriada.
codedx.refresh.failed       = Ocorreu um erro ao tentar atualizar a lista de projetos.\nVerifique se a URL do servidor e a chave API est\u00e3o corretas e se\nA chave API est\u00e1 ativa. Verifique tamb\u00e9m se voc\u00ea est\u00e1 se conectando\ncom a porta correta.
codedx.refresh.non200       = Ocorreu um erro ao tentar atualizar a lista de projetos.\nO servidor retornou o c\u00f3digo de resposta\:
codedx.refresh.403          = Verifique se a chave API est\u00e1 correta e ativa.
codedx.refresh.404          = Verifique se a URL do servidor est\u00e1 correta.
codedx.refresh.400          = Verifique se a URL do servidor est\u00e1 correta e se voc\u00ea est\u00e1 se conectando\ncom a porta correta.

codedx.ssl.title            = Certificado Digital N\u00e3o Confi\u00e1vel
codedx.ssl.reject           = Rejeitar
codedx.ssl.accepttemp       = Aceitar Temporariamente
codedx.ssl.acceptperm       = Aceitar Permanentemente
codedx.ssl.description      = N\u00e3o foi poss\u00edvel estabelecer uma conex\u00e3o segura porque o certificado n\u00e3o \u00e9 confi\u00e1vel
codedx.ssl.issuer           = Emitente\:
codedx.ssl.fingerprint      = Impress\u00e3o Digital\:
codedx.ssl.mismatch         = Host Incompat\u00edvel\:
codedx.ssl.mismatchmsg      = Esperado '%s', mas o certificado \u00e9 para '%s'.