#X-Generator: crowdin.com
# Strings used by the add-on
tips.desc=Trucs et astuces
tips.button.nextTip=Astuce suivante
tips.checkbox.showOnStart=Afficher les Trucs et astuces au d\u00e9marrage
tips.dialog.title=Trucs et astuces
tips.topmenu.help.tips=Trucs et astuces

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001=Enregistrez votre session ZAP au d\u00e9but d'un test plut\u00f4t qu'\u00e0 la fin - la session est stock\u00e9e en base de donn\u00e9es, puis actualis\u00e9e en continu, de sorte que vous ne devez pas l'enregistrer r\u00e9guli\u00e8rement.
tips.tip.gen.002=Essayez diff\u00e9rentes mises en page de l'interface utilisateur via les boutons de la barre d'outils principale.
tips.tip.gen.003=Faites un clic droit partout dans ZAP. \n\nSurlignez un texte et faites un clic droit.\n\nDe nombreuses fonctionnalit\u00e9s de ZAP sont accessibles par menu contextuel, qui offre l'acc\u00e8s le plus facile.
tips.tip.gen.004=Utilisez les raccourcis clavier pour acc\u00e9l\u00e9rer vos tests - vous pouvez d\u00e9finir vos propres combinaisons via 'Options / clavier', qui permet aussi d'imprimer des pense-b\u00eates des raccourcis.
tips.tip.gen.005=Si vous obtenez trop de faux positifs, essayezt en fixant \u00e0 Haut le seuil de cette r\u00e8gle d'analyse.\n\nMais signalez-nous aussi le probl\u00e8me via le groupe d'utilisateurs de ZAP ou via le site des probl\u00e8mes, afin que nous puissions l'analyser - les deux sites figurent en liens dans le menu 'En ligne'
tips.tip.gen.006=Toujours \u00e0 utiliser des filtres? Ceux-ci sont progressivement retir\u00e9s et seront supprim\u00e9s dans l'avenir.\n\nUtilisez des scripts en lieu et place - ils sont beaucoup plus puissants.
tips.tip.gen.007=Ajoutez votre application cible dans un contexte en utilisant le menu contextuel par 'clic droit'\: 'Inclure dans le contexte'.\n\nCela vous permet d'en dire plus \u00e0 ZAP sur la cible, comme l'authentification, les utilisateurs et la technologie utilis\u00e9e.
tips.tip.gen.008=ZAP peut afficher, interceptern et m\u00eame robotiser les messages c\u00f4t\u00e9 client incorporant postMessages - faites un 'clic droit' sur une sous-arborescence dans l'arborescence des sites et s\u00e9lectionnez un sous-menu appropri\u00e9 sous 'Surveiller les clients'.\n\nForcez une actualisation du navigateur et vos pages ouvertes seront affich\u00e9es dans l'onglet 'Clients', ainsi que tous les messages g\u00e9n\u00e9r\u00e9s c\u00f4t\u00e9 client.
tips.tip.gen.009=Les scripts Zest sont un excellent moyen pour automatiser des t\u00e2ches.\n\nZest est le langage de macro graphique de ZAP, mais il fournit des fonctionnalit\u00e9s de programmation comme les instructions conditionnelles et les boucles.\n\nUtilisez le bouton 'Enregistrer un nouveau script Zest...' de la barre d'outils principale pour enregistrer rapidement un nouveau script est.\n\nVous pouvez \u00e9galement faire un 'clic droit'\u00bb sur les requ\u00eates pour les ajouter \u00e0 des scripts Zest.
tips.tip.gen.010=ZAP can automatically check for updates - turn it on via the 'Options / Check for Updates' screen.\n\nIf you dont want it to happen automatically then make sure you manually check for updates frequently via the 'Manage Add-ons' main toolbar button as we continually add new features and fix issues.
tips.tip.gen.011=Click on the 'gear' icon on the right hand side of many tabs to quickly access the setting for that feature. 
tips.tip.gen.012=There are lots of resources linked off the 'Online' menu, including the ZAP Homepage, User and Developer groups
tips.tip.gen.013=Want to chat to someone about ZAP?\n\nMany of the ZAP core developers hang out on irc\://irc.mozilla.org \#websectools
tips.tip.gen.014=ZAP has comprehensive help pages accessible via the 'Help / OWASP ZAP User Guide' menu.\n\nThe F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.0154=New to ZAP?\n\nDownload the 'Getting Started with ZAP' guide from the ZAP Marketplace. 

# Obscure features
tips.tip.obs.001=POST requests have a 'right click' menu for generating an anti CSRF test form
tips.tip.obs.002=The 'Show / enable' fields 'lightbulb' button on the main toolbar will make hidden fields visible and allow you to edit disabled fields.
tips.tip.obs.003=Does your application use anti CSRF tokens?\n\nMake sure you have configured ZAP to handle them via the 'Options / Active Scan' screen.
tips.tip.obs.004=You can compare 2 requests or responses by selecting them both, 'right clicking' and selecting one of the 'Compare 2..' menu items.
tips.tip.obs.005=You can tell ZAP to access an app using a specified user.\n\nTo do that you need to add your app to a Context and then define the authentication and user details.
tips.tip.obs.006=The Search tab allows you to find string in Fuzz results - it supports regex expressions and inverse matching.
tips.tip.obs.007=You can search for text in any text area, including the Request and Response tabs, using the 'right click' 'Find...' menu.  
tips.tip.obs.008=You can change the syntax highlighting used for the Request, Response and Script Console tabs via the 'right click' 'Syntax' menus.  

# Optional add-ons
tips.tip.add.001=Install the beta active and passive scan rules to find more potential issues.\n\nThere are also alpha active and passive scan rules but obviously they may be less stable.
tips.tip.add.002=Want to script ZAP in a scripting language other than Java Script and Zest?\n\nCheck the ZAP Marketplace for other languages like python and ruby.\n\nIf your preferred scripting language isnt yet available then get in touch - its fairly easy to add support for other languages.
tips.tip.add.003=Install the SAML Extension form the ZAP Marketplace to detect, show, edit and fuzz SAML requests.
tips.tip.add.004=There are a large number of fuzzing files available in the ZAP Marketplace in the 'Directory List *', 'Fuzzdb files' and 'SVN Digger files' add-ons.

# 2.4 specific tips (to be un-commented prior to 2.4 being released
#tips.tip.gen.xxx = The majority of ZAP's tabs are now hidden by default so that the UI is less cluttered.\n\
#You can show and hide all of the tabs via buttons on the main toolbar.\n\
#You can also 'pin' any tab you like so that it stays visible even after a restart.


