ascanbeta.HTTPParamPoll.desc = \u0410\u0442\u0430\u043a\u0438, \u0441\u043f\u0440\u044f\u043c\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0437\u0430\u0431\u0440\u0443\u0434\u043d\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443 HTTP (HPP-\u0430\u0442\u0430\u043a\u0438), \u043f\u043e\u043b\u044f\u0433\u0430\u044e\u0442\u044c \u0443 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0438\u0445 \u0440\u043e\u0437\u0434\u0456\u043b\u044c\u043d\u0438\u043a\u0456\u0432 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0432 \u0456\u043d\u0448\u0456 \u043d\u0430\u044f\u0432\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438. \u042f\u043a\u0449\u043e \u0432\u0435\u0431\u0434\u043e\u0434\u0430\u0442\u043e\u043a \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0454 \u043d\u0430\u043b\u0435\u0436\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0434\u0430\u043d\u0438\u0445, \u0449\u043e \u0432\u0432\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u0443\u0432\u0430\u0442\u0438 \u043b\u043e\u0433\u0456\u043a\u0443 \u0440\u043e\u0431\u043e\u0442\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0443 \u0456 \u0437\u0434\u0456\u0439\u0441\u043d\u0438\u0442\u0438 \u0430\u0442\u0430\u043a\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0430\u0431\u043e \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u041e\u0434\u0438\u043d \u0437 \u043d\u0430\u0441\u043b\u0456\u0434\u043a\u0456\u0432 HPP-\u0430\u0442\u0430\u043a\u0438 \u2014 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430 \u0456\u0433\u043d\u043e\u0440\u0443\u0432\u0430\u0442\u0438 \u043d\u0430\u044f\u0432\u043d\u0456, \u0436\u043e\u0440\u0441\u0442\u043a\u043e-\u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438  HTTP, \u0449\u043e\u0431 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440 \u0440\u043e\u0431\u043e\u0442\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0443, \u043e\u0431\u0456\u0439\u0442\u0438 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u0456 \u0442\u043e\u0447\u043a\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0432\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0456, \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0437\u043c\u0456\u043d\u043d\u0438\u0445, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u043d\u0435 \u0432 \u043c\u0435\u0436\u0430\u0445 \u0432\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443.
ascanbeta.HTTPParamPoll.extrainfo = https\://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/07-Input_Validation_Testing/04-Testing_for_HTTP_Parameter_Pollution
ascanbeta.HTTPParamPoll.name = \u0417\u0430\u0431\u0440\u0443\u0434\u043d\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443 HTTP
ascanbeta.HTTPParamPoll.sol = Properly sanitize the user input for parameter delimiters.

ascanbeta.backupfiledisclosure.desc = A backup of the file was disclosed by the web server.
ascanbeta.backupfiledisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0440\u0435\u0437\u0435\u0440\u0432\u043d\u043e\u0457 \u043a\u043e\u043f\u0456\u0457 \u0444\u0430\u0439\u043b\u0443
ascanbeta.backupfiledisclosure.otherinfo = \u0420\u0435\u0437\u0435\u0440\u0432\u043d\u0430 \u043a\u043e\u043f\u0456\u044f \u0444\u0430\u0439\u043b\u0443 [{0}] \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430 \u0432 [{1}]
ascanbeta.backupfiledisclosure.refs = https\://cwe.mitre.org/data/definitions/530.html\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/04-Review_Old_Backup_and_Unreferenced_Files_for_Sensitive_Information.html
ascanbeta.backupfiledisclosure.soln = \u041d\u0435 \u0440\u0435\u0434\u0430\u0433\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b\u0438 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0442\u0430 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043d\u0435\u0432\u0430\u0436\u043b\u0438\u0432\u0456 \u0444\u0430\u0439\u043b\u0438 (\u0443 \u0442\u043e\u043c\u0443 \u0447\u0438\u0441\u043b\u0456 \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0456) \u0432\u0438\u0434\u0430\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430. 

ascanbeta.cookieslack.affect.response.no = These cookies did NOT affect the response\: 
ascanbeta.cookieslack.affect.response.yes = These cookies affected the response\: 
ascanbeta.cookieslack.desc = \u041f\u043e\u0432\u0442\u043e\u0440\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 GET\: \u0449\u043e\u0440\u0430\u0437\u0443 \u0441\u043a\u0438\u0434\u0430\u0439\u0442\u0435 \u0440\u0456\u0437\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 cookie, \u043f\u0456\u0441\u043b\u044f \u0447\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0443\u0439\u0442\u0435 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437 \u0443\u0441\u0456\u043c\u0430 \u0444\u0430\u0439\u043b\u0430\u043c\u0438 cookie, \u0449\u043e\u0431 \u0441\u0442\u0430\u0431\u0456\u043b\u0456\u0437\u0443\u0432\u0430\u0442\u0438 \u0441\u0435\u0441\u0456\u044e, \u0456 \u043f\u043e\u0440\u0456\u0432\u043d\u044e\u0439\u0442\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437 \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0438\u043c GET. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u0442\u0438 \u0434\u0456\u043b\u044f\u043d\u043a\u0438, \u0434\u0435 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044f \u0447\u0438 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0438, \u044f\u043a\u0456 \u0431\u0430\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0430 \u0444\u0430\u0439\u043b\u0430\u0445 cookie, \u043d\u0430\u0441\u043f\u0440\u0430\u0432\u0434\u0456 \u043d\u0435 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f.
ascanbeta.cookieslack.endline = \n
ascanbeta.cookieslack.name = \u0414\u0435\u0442\u0435\u043a\u0442\u043e\u0440 \u0441\u043b\u0430\u0431\u0438\u0445 \u0444\u0430\u0439\u043b\u0456\u0432 cookie
ascanbeta.cookieslack.otherinfo.intro = \u0424\u0430\u0439\u043b\u0438 cookie, \u044f\u043a\u0456 \u043d\u0435 \u043c\u0430\u044e\u0442\u044c \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u0435\u0444\u0435\u043a\u0442\u0443, \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u043d\u0435\u0434\u043e\u043b\u0456\u043a\u0438 \u0432 \u043b\u043e\u0433\u0456\u0446\u0456 \u0440\u043e\u0431\u043e\u0442\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438. \u0423 \u043d\u0430\u0439\u0433\u0456\u0440\u0448\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0432\u0438\u044f\u0432\u0438\u0442\u0438, \u0434\u0435 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044f \u0447\u0435\u0440\u0435\u0437 \u043c\u0430\u0440\u043a\u0435\u0440\u0438 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0454\u0442\u044c\u0441\u044f.
ascanbeta.cookieslack.separator = ,
ascanbeta.cookieslack.session.destroyed = Dropping this cookie appears to have invalidated the session\: [{0}] A follow-on request with all original cookies still had a different response than the original request.\n
ascanbeta.cookieslack.session.warning = NOTE\: Because of its name this cookie may be important, but dropping it appears to have no effect\: [{0}]\n

ascanbeta.cors.info.desc = \u0421\u043f\u0456\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432 \u0437 \u0440\u0456\u0437\u043d\u0438\u0445 \u0434\u0436\u0435\u0440\u0435\u043b (CORS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0438\u0439 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0441\u0435\u0440\u0432\u0435\u0440\u0443 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0435 \u0456\u043d\u0448\u0435 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f (\u0434\u043e\u043c\u0435\u043d, \u0441\u0445\u0435\u043c\u0443 \u0447\u0438 \u043f\u043e\u0440\u0442), \u0430 \u043d\u0435 \u0432\u043b\u0430\u0441\u043d\u0435, \u0437 \u044f\u043a\u043e\u0433\u043e \u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432. \u0426\u0435 \u043f\u043e\u0441\u043b\u0430\u0431\u043b\u044e\u0454 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0443 \u0442\u043e\u0433\u043e \u0436 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f (SOP).
ascanbeta.cors.info.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a CORS
ascanbeta.cors.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/CORS\nhttps\://portswigger.net/web-security/cors
ascanbeta.cors.soln = \u042f\u043a\u0449\u043e \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0430 \u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u043d\u0430\u043b\u0435\u0436\u043d\u043e \u043e\u043f\u0438\u0441\u0430\u043d\u0430 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 "Access-Control-Allow-Origin". \u0423 \u0446\u044c\u043e\u043c\u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0441\u043b\u0456\u0434 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u043b\u0438\u0448\u0435 \u043d\u0430\u0434\u0456\u0439\u043d\u0456 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0438, \u044f\u043a\u0438\u043c \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0446\u0435\u0439 \u0440\u0435\u0441\u0443\u0440\u0441, \u0437 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u043e\u044e \u043d\u0430\u0439\u0431\u0456\u043b\u044c\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0443.
ascanbeta.cors.vuln.desc = \u0422\u0430\u043a\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f CORS \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 AJAX-\u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443 \u0437\u0456 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043e\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u043c \u0430\u0433\u0435\u043d\u0442\u043e\u043c \u0436\u0435\u0440\u0442\u0432\u0438.   \u0414\u043b\u044f \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0445 AJAX-\u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0431\u0443\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a "Access-Control-Allow-Credentials\: true", \u0430 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a "Access-Control-Allow-Origin" \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f null \u0430\u0431\u043e \u0434\u043e\u043c\u0435\u043d \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438. \u041d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0446\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u043d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0456 AJAX-\u0437\u0430\u043f\u0438\u0442\u0438, \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442 \u0432\u0441\u0435 \u043e\u0434\u043d\u043e \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0438 \u0456\u043d\u0442\u0440\u0430\u043c\u0435\u0440\u0435\u0436\u0456). \u0428\u043a\u0456\u0434\u043b\u0438\u0432\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043c\u043e\u0436\u0435 \u043d\u0430\u043b\u0435\u0436\u0430\u0442\u0438 \u044f\u043a \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443, \u0442\u0430\u043a \u0456 \u0434\u043e\u0432\u0456\u0440\u0435\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443 \u0437 \u043d\u0435\u0434\u043e\u043b\u0456\u043a\u0430\u043c\u0438 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, XSS, \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0430 HTTP \u0431\u0435\u0437 TLS, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0443\u0432\u0430\u0442\u0438 \u043a\u043e\u0434 \u0447\u0435\u0440\u0435\u0437 MITM \u0442\u043e\u0449\u043e).
ascanbeta.cors.vuln.name = \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f CORS

ascanbeta.crossdomain.adobe.desc = Flash/Silverlight based cross-site request forgery may be possible, due to a misconfiguration on the web server.
ascanbeta.crossdomain.adobe.read.extrainfo = The web server permits malicious cross-domain data read requests originating from Flash/Silverlight components served from any third party domain, to this domain. If the victim user is logged into this service, the malicious read requests are processed using the privileges of the victim, and can result in data from this service being compromised by an unauthorised third party web site, via the victim's web browser. This is particularly likely to be an issue if a Cookie based session implementation is in use.
ascanbeta.crossdomain.adobe.read.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Adobe - Read
ascanbeta.crossdomain.adobe.read.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b crossdomain.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <allow-access-from domain\="example.com">. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f "*" (\u0432\u0441\u0456\u043c \u0434\u043e\u043c\u0435\u043d\u0430\u043c), \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0436\u043e\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u043c \u0434\u043e\u0441\u0442\u0443\u043f\u043e\u043c, \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445.
ascanbeta.crossdomain.adobe.send.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u0442\u0438 (\u0430\u043b\u0435 \u043d\u0435 \u043e\u0431\u043e\u0432'\u044f\u0437\u043a\u043e\u0432\u043e \u0447\u0438\u0442\u0430\u0442\u0438) \u043d\u0430 \u0446\u0435\u0439 \u0434\u043e\u043c\u0435\u043d \u0437\u0430\u043f\u0438\u0442\u0438, \u0449\u043e \u043f\u043e\u0445\u043e\u0434\u044f\u0442\u044c \u0432\u0456\u0434 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 Flash/Silverlight, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u042f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447-\u0436\u0435\u0440\u0442\u0432\u0430 \u0437\u0430\u0440\u0435\u0454\u0441\u0442\u0440\u043e\u0432\u0430\u043d\u0438\u0439 \u0432 \u0446\u044c\u043e\u043c\u0443 \u0441\u0435\u0440\u0432\u0456\u0441\u0456, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0432\u0456\u0434\u043f\u0440\u0430\u0432\u043a\u0443 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0436\u0435\u0440\u0442\u0432\u0438 \u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0430\u0442\u0430\u043a\u0438 \u0442\u0438\u043f\u0443 Cross Site Request Forgery (CSRF) \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0436\u0435\u0440\u0442\u0432\u0438. \u0426\u0435 \u043e\u0441\u043e\u0431\u043b\u0438\u0432\u043e \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u044f\u043a\u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.
ascanbeta.crossdomain.adobe.send.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Adobe - Send
ascanbeta.crossdomain.adobe.send.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b crossdomain.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u043d\u043d\u044f (\u043d\u0435 \u043e\u0431\u043e\u0432'\u044f\u0437\u043a\u043e\u0432\u043e \u0447\u0438\u0442\u0430\u043d\u043d\u044f) \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh">. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0442\u0456\u043b\u044c\u043a\u0438 "*" (\u0432\u0441\u0456\u043c \u0434\u043e\u043c\u0435\u043d\u0430\u043c), \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0430 \u0434\u043e \u0430\u0442\u0430\u043a Cross Site Request Forgery (CSRF).
ascanbeta.crossdomain.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f
ascanbeta.crossdomain.refs = https\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc197955(v\=vs.95)\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc838250(v\=vs.95)
ascanbeta.crossdomain.silverlight.desc = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0430 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 Silverlight \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456.
ascanbeta.crossdomain.silverlight.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0438\u043c \u0437\u0430\u043f\u0438\u0442\u0430\u043c, \u0449\u043e \u043f\u043e\u0445\u043e\u0434\u044f\u0442\u044c \u0432\u0456\u0434 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 Silverlight, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443, \u043f\u043e\u0442\u0440\u0430\u043f\u043b\u044f\u0442\u0438 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u042f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447-\u0436\u0435\u0440\u0442\u0432\u0430 \u0443\u0432\u0456\u0439\u0448\u043e\u0432 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443, \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0436\u0435\u0440\u0442\u0432\u0438, \u0449\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u0434\u0430\u043d\u0456 \u0437 \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443 \u0431\u0443\u0434\u0443\u0442\u044c \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u0438\u043c \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u043e\u043c \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0436\u0435\u0440\u0442\u0432\u0438. \u0426\u0435 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438 \u0430\u0442\u0430\u043a\u0438 \u0442\u0438\u043f\u0443 Cross Site Request Forgery (CSRF). \u0426\u0435 \u043e\u0441\u043e\u0431\u043b\u0438\u0432\u043e \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u044f\u043a\u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.
ascanbeta.crossdomain.silverlight.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Silverlight
ascanbeta.crossdomain.silverlight.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b clientaccesspolicy.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <domain uri\="https\://example.com" />. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e "*" (\u0432\u0441\u0456\u0445 \u0434\u043e\u043c\u0435\u043d\u0456\u0432), \u0442\u0456\u043b\u044c\u043a\u0438 \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0436\u043e\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u043c \u0434\u043e\u0441\u0442\u0443\u043f\u043e\u043c, \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445.

ascanbeta.csrftoken.extrainfo.annotation = \u0426\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439\u043d\u0435 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u0436\u0435\u043d\u043d\u044f, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0444\u043e\u0440\u043c\u0430 \u043c\u0430\u0454 \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0430 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0442\u0435, \u0449\u043e \u0457\u0439 \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0430\u043d\u0442\u0438-CSRF \u043c\u0430\u0440\u043a\u0435\u0440. \u0426\u0435 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044f \u0454 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u044e.
ascanbeta.csrftoken.name = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0430\u043d\u0442\u0438-CSRF \u0442\u043e\u043a\u0435\u043d\u0456\u0432

ascanbeta.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

ascanbeta.elinjection.desc = \u041f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u043f\u043e\u0432\u043d\u0456\u0441\u0442\u044e \u0430\u0431\u043e \u0447\u0430\u0441\u0442\u043a\u043e\u0432\u043e \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 Expression Language (EL) \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043d\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 Java (JSP), \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0432\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u0437 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u044c\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430, \u0430\u043b\u0435 \u043d\u0435 \u0437\u043d\u0435\u0448\u043a\u043e\u0434\u0436\u0443\u0454 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0437\u043d\u0435\u0448\u043a\u043e\u0434\u0436\u0443\u0454 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0456 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0438, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u043f\u0435\u0440\u0435\u0434\u0431\u0430\u0447\u0443\u0432\u0430\u043d\u0438\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 EL \u0434\u043e \u0439\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f. \u0423 \u043f\u0435\u0432\u043d\u0438\u0445 \u0432\u0435\u0440\u0441\u0456\u044f\u0445 Spring 3.0.5 \u0442\u0430 \u0441\u0442\u0430\u0440\u0456\u0448\u0438\u0445 \u0431\u0443\u043b\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0435 \u043c\u0456\u0441\u0446\u0435 (CVE-2011-2730), \u0443 \u044f\u043a\u043e\u043c\u0443 \u0442\u0435\u0433\u0438 Expression Language \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u043b\u0438\u0441\u044f \u0431 \u0434\u0432\u0456\u0447\u0456, \u0449\u043e \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e \u0440\u043e\u0431\u0438\u043b\u043e \u0431\u0443\u0434\u044c-\u044f\u043a\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u044e \u0434\u043e EL-\u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f. \u041e\u0434\u043d\u0430\u043a, \u043d\u0430\u0432\u0456\u0442\u044c \u0443 \u043d\u043e\u0432\u0456\u0448\u0438\u0445 \u0432\u0435\u0440\u0441\u0456\u044f\u0445 \u0446\u044f \u0441\u043b\u0430\u0431\u043a\u0456\u0441\u0442\u044c \u0449\u0435 \u0439 \u0434\u043e\u0441\u0456 \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0432 \u0437\u0430\u043b\u0435\u0436\u043d\u043e\u0441\u0442\u0456 \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457.
ascanbeta.elinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f Expression Language
ascanbeta.elinjection.refs = https\://owasp.org/www-community/vulnerabilities/Expression_Language_Injection\nhttps\://cwe.mitre.org/data/definitions/917.html
ascanbeta.elinjection.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043d\u0430\u0439\u043a\u0440\u0430\u0449\u0456 \u043f\u0440\u0430\u043a\u0442\u0438\u043a\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0434\u0430\u043d\u0438\u0445 \u043f\u0440\u043e\u0442\u0438 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0445 \u0432\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0456 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0435 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u043a\u043e\u043b\u0438 \u0434\u0430\u043d\u0456 \u043d\u0430\u0434\u0445\u043e\u0434\u044f\u0442\u044c \u043d\u0430 \u0440\u0456\u0432\u0435\u043d\u044c EL, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0430\u0442\u043e\u0440 \u043d\u0435 \u0437\u043d\u0430\u0439\u0448\u043e\u0432 \u0436\u043e\u0434\u043d\u043e\u0433\u043e \u043c\u0435\u0442\u0430\u0441\u0438\u043c\u0432\u043e\u043b\u0443 \u0432 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u043e\u043c\u0443 \u0432\u043c\u0456\u0441\u0442\u0456 \u043f\u0435\u0440\u0435\u0434 \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u043d\u043d\u044f\u043c. \u041d\u0430\u0439\u0431\u0456\u043b\u044c\u0448 \u043e\u0447\u0435\u0432\u0438\u0434\u043d\u0456 \u043c\u043e\u0434\u0435\u043b\u0456, \u044f\u043a\u0456 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u044f\u0432\u0438\u0442\u0438, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c ${ \u0456 \#{, \u0430\u043b\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u043e \u0437\u0430\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0443\u0432\u0430\u0442\u0438 \u0446\u0456 \u0434\u0430\u043d\u0456.

ascanbeta.entityExpansion.desc = \u0415\u043a\u0441\u043f\u043e\u043d\u0435\u043d\u0446\u0456\u0430\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u043e\u0431'\u0454\u043a\u0442\u0456\u0432, \u0430\u0431\u043e \u0430\u0442\u0430\u043a\u0430 \u043a\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0438\u0431\u0443\u0445\u0443 \u2014 \u0446\u0435 \u0442\u0438\u043f \u0430\u0442\u0430\u043a\u0438 \u043d\u0430 \u0432\u0456\u0434\u043c\u043e\u0432\u0443 \u0432 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u0456 (DoS). \u0412\u043e\u043d\u0430 \u0441\u043f\u0440\u044f\u043c\u043e\u0432\u0430\u043d\u0430 \u043d\u0430 \u043f\u0430\u0440\u0441\u0435\u0440\u0438 \u043c\u0430\u0440\u043a\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u0445 \u043c\u043e\u0432, \u044f\u043a XML \u0447\u0438 YAML, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u043c\u0430\u043a\u0440\u043e\u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f.
ascanbeta.entityExpansion.name = \u0415\u043a\u0441\u043f\u043e\u043d\u0435\u043d\u0446\u0456\u0430\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u043e\u0431'\u0454\u043a\u0442\u0456\u0432 (\u0430\u0442\u0430\u043a\u0430 \u043a\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0438\u0431\u0443\u0445\u0443)
ascanbeta.entityExpansion.other = \u041a\u0456\u043b\u044c\u043a\u0456\u0441\u0442\u044c \u0441\u0435\u043a\u0443\u043d\u0434, \u0447\u0435\u0440\u0435\u0437 \u044f\u043a\u0456 \u0430\u0442\u0430\u043a\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u0439 HTTP-\u0437\u0430\u043f\u0438\u0442 \u043e\u0442\u0440\u0438\u043c\u0430\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c\: {0}
ascanbeta.entityExpansion.refs = https\://en.wikipedia.org/wiki/Billion_laughs_attack\nhttps\://owasp.org/www-community/vulnerabilities/XML_External_Entity_(XXE)_Processing\nhttps\://cwe.mitre.org/data/definitions/776.html
ascanbeta.entityExpansion.soln = \u0417\u0430\u0445\u0438\u0441\u0442 \u043f\u0440\u043e\u0442\u0438 \u0442\u0430\u043a\u043e\u0433\u043e \u0442\u0438\u043f\u0443 \u0430\u0442\u0430\u043a \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u043d\u044f \u043f\u0430\u043c'\u044f\u0442\u0456, \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043e\u0457 \u0434\u043b\u044f \u043e\u043a\u0440\u0435\u043c\u043e\u0433\u043e \u043f\u0430\u0440\u0441\u0435\u0440\u0430, \u044f\u043a\u0449\u043e \u0432\u0442\u0440\u0430\u0442\u0430 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430 \u0454 \u043f\u0440\u0438\u0439\u043d\u044f\u0442\u043d\u043e\u044e, \u0430\u0431\u043e \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0447\u043d\u0435 \u043f\u043e\u0432\u043e\u0434\u0436\u0435\u043d\u043d\u044f \u0437 \u043e\u0431'\u0454\u043a\u0442\u0430\u043c\u0438 \u0442\u0430 \u0457\u0445 \u043f\u043e\u0432\u0456\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0442\u0456\u043b\u044c\u043a\u0438 \u0442\u043e\u0434\u0456, \u043a\u043e\u043b\u0438 (\u0456 \u0442\u043e\u044e \u043c\u0456\u0440\u043e\u044e, \u0432 \u044f\u043a\u0456\u0439) \u0457\u0445 \u0432\u043c\u0456\u0441\u0442 \u0431\u0443\u0434\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e.

ascanbeta.forbiddenBypass.desc = \u041e\u0431\u0445\u0456\u0434 \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0445 \u0442\u043e\u0447\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043a\u0438 403 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u043c, \u044f\u043a\u0449\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043b\u043e \u0432\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0432 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u043a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 200).
ascanbeta.forbiddenBypass.name = \u041e\u0431\u0445\u0456\u0434 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 403
ascanbeta.forbiddenBypass.refs = https\://www.acunetix.com/blog/articles/a-fresh-look-on-reverse-proxy-related-attacks/\nhttps\://i.blackhat.com/us-18/Wed-August-8/us-18-Orange-Tsai-Breaking-Parser-Logic-Take-Your-Path-Normalization-Off-And-Pop-0days-Out-2.pdf\nhttps\://www.contextis.com/en/blog/server-technologies-reverse-proxy-bypass

ascanbeta.httponlysite.desc = \u0421\u0430\u0439\u0442 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437\u0430 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u043e\u043c HTTP, \u0430 \u043d\u0435 HTTPS.
ascanbeta.httponlysite.name = \u0421\u0430\u0439\u0442 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437\u0430 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u043e\u043c HTTP
ascanbeta.httponlysite.otherinfo = {0}\n\u0421\u043f\u0440\u043e\u0431\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f ZAP \u0447\u0435\u0440\u0435\u0437\: {1}
ascanbeta.httponlysite.otherinfo.connectionfail = \u041f\u043e\u043c\u0438\u043b\u043a\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f.
ascanbeta.httponlysite.otherinfo.differenthosts = \u0420\u0456\u0437\u043d\u0456 \u0445\u043e\u0441\u0442\u0438
ascanbeta.httponlysite.otherinfo.noredirection = \u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u043d\u0435 \u0431\u0443\u043b\u043e.
ascanbeta.httponlysite.otherinfo.nossl = \u0421\u0430\u0439\u0442 \u043d\u0435 \u043c\u0430\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0438 SSL/TLS
ascanbeta.httponlysite.otherinfo.redirectionlimit = \u041b\u0456\u043c\u0456\u0442 \u043f\u0435\u0440\u0435\u0441\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u044f\u0433\u043d\u0443\u0442\u043e.
ascanbeta.httponlysite.otherinfo.redirecttohttp = \u041f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043e \u0434\u043e HTTP.
ascanbeta.httponlysite.otherinfo.urinotencoded = \u041d\u0435 \u0432\u0434\u0430\u043b\u043e\u0441\u044f \u0437\u0430\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 URI \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.
ascanbeta.httponlysite.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\nhttps\://letsencrypt.org/
ascanbeta.httponlysite.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432 \u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f SSL (https).

ascanbeta.httpoxy.desc = The server initiated a proxied request via the proxy specified in the HTTP Proxy header of the request.Httpoxy typically affects code running in CGI or CGI like environments.\nThis may allow attackers to\:\n* Proxy the outgoing HTTP requests made by the web application\n* Direct the server to open outgoing connections to an address and port of their choosing or\n* Tie up server resources by forcing the vulnerable software to use a malicious proxy.
ascanbeta.httpoxy.name = Httpoxy - \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanbeta.httpoxy.otherinfo = \u0412\u0438\u0445\u0456\u0434\u043d\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u0434\u043e {0} \u0431\u0443\u043b\u043e \u0441\u043a\u0435\u0440\u043e\u0432\u0430\u043d\u0435 \u0447\u0435\u0440\u0435\u0437 \u0445\u043e\u0441\u0442 \u0442\u0430 \u043f\u043e\u0440\u0442, \u044f\u043a\u0456 ZAP \u0432\u0441\u0442\u0430\u0432\u0438\u0432 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u043f\u0440\u043e\u043a\u0441\u0456.
ascanbeta.httpoxy.refs = https\://httpoxy.org/
ascanbeta.httpoxy.skipped = \u043c\u0435\u0440\u0435\u0436\u0435\u0432\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0432\u0438\u043c\u043a\u043d\u0435\u043d\u043e
ascanbeta.httpoxy.soln = \u041d\u0430\u0439\u043a\u0440\u0430\u0449\u0438\u043c \u043d\u0435\u0433\u0430\u0439\u043d\u0438\u043c \u0440\u0456\u0448\u0435\u043d\u043d\u044f\u043c \u0454 \u0431\u043b\u043e\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u043f\u0440\u043e\u043a\u0441\u0456-\u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u044f\u043a\u043e\u043c\u043e\u0433\u0430 \u0440\u0430\u043d\u0456\u0448\u0435, \u0434\u043e \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u043e\u043d\u0438 \u043f\u043e\u0442\u0440\u0430\u043f\u043b\u044f\u0442\u044c \u0434\u043e \u0432\u0430\u0448\u043e\u0433\u043e \u0434\u043e\u0434\u0430\u0442\u043a\u0443.

ascanbeta.httpsashttp.desc = Content which was initially accessed via HTTPS (i.e.\: using SSL/TLS encryption) is also accessible via HTTP (without encryption).
ascanbeta.httpsashttp.name = HTTPS-\u0432\u043c\u0456\u0441\u0442 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0447\u0435\u0440\u0435\u0437 HTTP
ascanbeta.httpsashttp.otherinfo = \u0421\u043f\u0440\u043e\u0431\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f ZAP \u0447\u0435\u0440\u0435\u0437\: {0}
ascanbeta.httpsashttp.refs = https\://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\nhttps\://owasp.org/www-community/Security_Headers\nhttps\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttps\://caniuse.com/stricttransportsecurity\nhttps\://datatracker.ietf.org/doc/html/rfc6797
ascanbeta.httpsashttp.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448\u0456 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0443, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0456 \u0442.\u043f. \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0430\u043a\u043e\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0443 \u043b\u0438\u0448\u0435 \u0447\u0435\u0440\u0435\u0437 HTTPS. \u0420\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f HTTP Strict Transport Security.

ascanbeta.insecurehttpmethod.connect.exploitable.desc = The insecure HTTP method [{0}] is enabled for this resource, and is exploitable. It was found to be possible to establish a tunneled socket connection to a third party service, using this HTTP method. This would allow the service to be used as an anonymous spam relay, or as a web proxy, bypassing network restrictions. It also allows it to be used to establish a tunneled VPN, effectively extending the network perimeter to include untrusted components.
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo = \u041c\u0435\u0442\u043e\u0434 CONNECT \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0441\u043e\u043a\u0435\u0442\u043d\u0435 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u0434\u043e [{0}], \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440.
ascanbeta.insecurehttpmethod.delete.exploitable.desc = \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u0441\u0435\u0440\u0432\u0456\u0441\u0430\u0445 REST. \u0412\u0456\u043d \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u0449\u043e\u0431 \u0432\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0440\u0435\u0441\u0443\u0440\u0441.
ascanbeta.insecurehttpmethod.delete.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.desc = \u041d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0432\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 HTTP [{0}]. \u0417\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0442\u0430 \u0431\u0430\u0437\u043e\u0432\u043e\u0457 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0437\u0430 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0430\u0431\u043e \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0440\u0438\u0434\u0430\u0442\u043d\u0438\u043c \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f. \u041c\u0435\u0442\u043e\u0434\u0438 TRACK \u0456 TRACE \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u0434\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0442\u043e\u043a\u0435\u043d\u0443 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457/\u0441\u0435\u0441\u0456\u0439\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 cookie \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u0438\u0439 \u0444\u0430\u0439\u043b cookie \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043f\u0440\u0430\u043f\u043e\u0440\u043e\u043c "HttpOnly". \u0414\u043b\u044f \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0430\u0442\u0430\u043a\u0430 \u0431\u0443\u043b\u0430 \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u044e, \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u044f\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0430\u0431\u043e \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u043c\u0430\u0454 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u043e\u0431\u0445\u043e\u0434\u0443 SOP (Same Origin Policy - \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u043e\u0434\u043d\u0430\u043a\u043e\u0432\u043e\u0433\u043e \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f). \u041c\u0435\u0442\u043e\u0434 ''CONNECT'' \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0432\u0435\u0431\u043a\u043b\u0456\u0454\u043d\u0442\u043e\u043c \u0434\u043b\u044f \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043d\u044f HTTP-\u0442\u0443\u043d\u0435\u043b\u044e \u0434\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0445 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0456\u0432 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0456\u0432.
ascanbeta.insecurehttpmethod.detailed.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 HTTP - {0}
ascanbeta.insecurehttpmethod.extrainfo = \u041c\u0435\u0442\u043e\u0434 OPTIONS \u0440\u043e\u0437\u043a\u0440\u0438\u0432 \u0441\u0442\u0456\u043b\u044c\u043a\u0438 \u0430\u043a\u0442\u0438\u0432\u043d\u0438\u0445 HTTP \u043c\u0435\u0442\u043e\u0434\u0456\u0432 \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443\: [{0}]
ascanbeta.insecurehttpmethod.insecure = \u041a\u043e\u0434 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 {0} \u0434\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e HTTP \u041c\u0415\u0422\u041e\u0414\u0423
ascanbeta.insecurehttpmethod.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 HTTP \u041c\u0435\u0442\u043e\u0434
ascanbeta.insecurehttpmethod.options.exploitable.desc = \u0426\u0435 \u0434\u0456\u0430\u0433\u043d\u043e\u0441\u0442\u0438\u0447\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434, \u0456 \u0439\u043e\u0433\u043e \u043d\u0456\u043a\u043e\u043b\u0438 \u043d\u0435 \u0441\u043b\u0456\u0434 \u0432\u043c\u0438\u043a\u0430\u0442\u0438 \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0447\u043e\u043c\u0443 \u0440\u0435\u0436\u0438\u043c\u0456.
ascanbeta.insecurehttpmethod.options.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u043d\u0430 stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.patch.exploitable.desc = \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u0441\u0435\u0440\u0432\u0456\u0441\u0430\u0445 REST, PATCH \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u0449\u043e\u0431 **\u0437\u043c\u0456\u043d\u0438\u0442\u0438** \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456. \u0417\u0430\u043f\u0438\u0442 PATCH \u043c\u0430\u0454 \u043b\u0438\u0448\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u043c\u0456\u043d\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0430 \u043d\u0435 \u0432\u0435\u0441\u044c \u0440\u0435\u0441\u0443\u0440\u0441.
ascanbeta.insecurehttpmethod.patch.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.potentiallyinsecure = \u043a\u043e\u0434 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 {0} \u0434\u043e \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e HTTP \u041c\u0415\u0422\u041e\u0414\u0423
ascanbeta.insecurehttpmethod.put.exploitable.desc = This method was originally intended for file management operations. It is now most commonly used in REST services, PUT is most-often utilized for **update** capabilities, PUT-ing to a known resource URI with the request body containing the newly-updated representation of the original resource.
ascanbeta.insecurehttpmethod.put.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u043c\u0435\u0442\u043e\u0434\u0438 TRACK, TRACE, \u0442\u0430 CONNECT \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0442\u0430 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0431\u0430\u0437\u043e\u0432\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443 \u043d\u0435 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u043c\u0435\u0442\u043e\u0434\u0438.
ascanbeta.insecurehttpmethod.trace.exploitable.desc = \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 HTTP-\u043c\u0435\u0442\u043e\u0434 [{0}], \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438. \u041c\u0435\u0442\u043e\u0434\u0438 TRACK \u0456 TRACE \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u0434\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457 \u043c\u0430\u0440\u043a\u0435\u0440\u0443 \u0430\u0431\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 cookie \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u0438\u0439 \u0444\u0430\u0439\u043b cookie \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043f\u0440\u0430\u043f\u043e\u0440\u043e\u043c "HttpOnly".
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo = \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0437\u0430\u043f\u0438\u0442\u0443 \u0431\u0443\u043b\u043e \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0437\u0430\u043f\u0438\u0442 TRACE \u0437\u0456 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c cookie [{0}]. \u0426\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f cookie \u0431\u0443\u043b\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u043e \u0432 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0449\u043e \u043f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0438\u043b\u043e \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c.
ascanbeta.insecurehttpmethod.webdav.exploitable.desc = \u0426\u0435\u0439 HTTP-\u043c\u0435\u0442\u043e\u0434 \u0454 \u043c\u0435\u0442\u043e\u0434\u043e\u043c WEBDAV\: {0}. \u042f\u043a\u0449\u043e \u0446\u0435\u0439 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0435 \u043f\u0440\u043e\u043f\u043e\u043d\u0443\u0454 \u0436\u043e\u0434\u043d\u0438\u0445 \u043f\u043e\u0441\u043b\u0443\u0433 WEBDAV services, \u0446\u0456 \u043c\u0435\u0442\u043e\u0434\u0438 \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c\u0438.
ascanbeta.insecurehttpmethod.webdav.exploitable.extrainfo = \u0414\u0438\u0432\u0456\u0442\u044c\u0441\u044f \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u043d\u0430 stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods

ascanbeta.integeroverflow.desc = \u0423\u043c\u043e\u0432\u0430 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u0446\u0456\u043b\u043e\u0433\u043e \u0447\u0438\u0441\u043b\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454, \u043a\u043e\u043b\u0438 \u0446\u0456\u043b\u0435 \u0447\u0438\u0441\u043b\u043e, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0443 \u0441\u043a\u043e\u043c\u043f\u0456\u043b\u044c\u043e\u0432\u0430\u043d\u0456\u0439 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456, \u0432\u0438\u0445\u043e\u0434\u0438\u0442\u044c \u0437\u0430 \u043c\u0435\u0436\u0456 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0443 \u0456 \u043d\u0435 \u0431\u0443\u043b\u043e \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u043e \u0437 \u0432\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0443.
ascanbeta.integeroverflow.error1 = Potential Integer Overflow. Status code changed on the input of a long string of random integers.
ascanbeta.integeroverflow.error2 = Potential Integer Overflow. Status code changed on the input of a long string of zeros.
ascanbeta.integeroverflow.error3 = Potential Integer Overflow. Status code changed on the input of a long string of ones.
ascanbeta.integeroverflow.error4 = Potential Integer Overflow. Status code changed on the input of a long string of nines.
ascanbeta.integeroverflow.name = \u041f\u043e\u043c\u0438\u043b\u043a\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f
ascanbeta.integeroverflow.refs = https\://en.wikipedia.org/wiki/Integer_overflow\nhttps\://cwe.mitre.org/data/definitions/190.html
ascanbeta.integeroverflow.soln = \u0429\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f\u043c \u0456 \u043f\u043e\u043c\u0438\u043b\u043a\u0430\u043c \u0434\u0456\u043b\u0435\u043d\u043d\u044f \u043d\u0430 0 (\u043d\u0443\u043b\u044c) \u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456, \u0431\u0443\u0434\u044c \u043b\u0430\u0441\u043a\u0430, \u043f\u0435\u0440\u0435\u043f\u0438\u0448\u0456\u0442\u044c \u0431\u0435\u043a\u0435\u043d\u0434-\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0432\u0448\u0438, \u0447\u0438 \u0437\u043d\u0430\u0445\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0446\u0456\u043b\u0438\u0445 \u0447\u0438\u0441\u0435\u043b, \u0449\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f, \u0432 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u043e\u043c\u0443 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0456 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438. \u0426\u0435 \u0432\u0438\u043c\u0430\u0433\u0430\u0442\u0438\u043c\u0435 \u043f\u0435\u0440\u0435\u043a\u043e\u043c\u043f\u0456\u043b\u044f\u0446\u0456\u0457 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 \u0431\u0435\u043a\u0435\u043d\u0434\u0430.

ascanbeta.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f - \u0431\u0435\u0442\u0430

ascanbeta.noanticsrftokens.desc = \u0423 HTML-\u0444\u043e\u0440\u043c\u0456 \u043f\u043e\u0434\u0430\u043d\u043d\u044f \u043d\u0435 \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0436\u043e\u0434\u043d\u0438\u0445 \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF.
ascanbeta.noanticsrftokens.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF

ascanbeta.oobxss.name = Out of Band XSS
ascanbeta.oobxss.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.

ascanbeta.proxydisclosure.attack = \u041c\u0435\u0442\u043e\u0434\u0438 TRACE, OPTIONS \u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c 'Max-Forwards'. \u041c\u0435\u0442\u043e\u0434 TRACK.
ascanbeta.proxydisclosure.desc = {0} proxy server(s) were detected or fingerprinted. This information helps a potential attacker to determine\n- A list of targets for an attack against the application.\n - Potential vulnerabilities on the proxy servers that service the application.\n - The presence or absence of any proxy-based components that might cause attacks against the application to be detected, prevented, or mitigated.
ascanbeta.proxydisclosure.extrainfo.proxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.proxyserver.header = Using the TRACE, OPTIONS, and TRACK methods, the following proxy servers have been identified between ZAP and the application/web server\:
ascanbeta.proxydisclosure.extrainfo.silentproxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.silentproxyserver.header = \u0411\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0456 'silent' \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438. \u0427\u0435\u0440\u0435\u0437 \u0457\u0445\u043d\u044e \u043f\u043e\u0432\u0435\u0434\u0456\u043d\u043a\u0443 \u043d\u0435\u0432\u0456\u0434\u043e\u043c\u043e, \u0432 \u044f\u043a\u0456\u0439 \u0442\u043e\u0447\u0446\u0456 \u0442\u043e\u043f\u043e\u043b\u043e\u0433\u0456\u0457 \u043c\u0435\u0440\u0435\u0436\u0456 \u0437\u043d\u0430\u0445\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u0446\u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438\:
ascanbeta.proxydisclosure.extrainfo.traceenabled = The 'TRACE' method is enabled on one or more of the proxy servers, or on the origin server. This method leaks all information submitted from the web browser and proxies back to the user agent. This may facilitate 'Cross Site Tracing' attacks.
ascanbeta.proxydisclosure.extrainfo.unknown = \u041d\u0435\u0432\u0456\u0434\u043e\u043c\u043e
ascanbeta.proxydisclosure.extrainfo.webserver = - {0}
ascanbeta.proxydisclosure.extrainfo.webserver.header = The following web/application server has been identified\:
ascanbeta.proxydisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0434\u043e\u0432\u0456\u0440\u0435\u043d\u0438\u0445 \u043e\u0441\u0456\u0431
ascanbeta.proxydisclosure.refs = https\://tools.ietf.org/html/rfc7231\#section-5.1.2
ascanbeta.proxydisclosure.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043c\u0435\u0442\u043e\u0434 'TRACE' \u043d\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043d\u0430 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456/\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432.\n\u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043c\u0435\u0442\u043e\u0434 'OPTIONS' \u043d\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043d\u0430 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456/\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u044f\u043a\u0449\u043e \u0432\u0456\u043d \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u0438\u0439 \u0434\u043b\u044f \u0456\u043d\u0448\u0438\u0445 \u0446\u0456\u043b\u0435\u0439, \u044f\u043a 'CORS' (Cross Origin Resource Sharing).\n\u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0442\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432 \u0437\u0456 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u043c\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u043f\u043e\u043c\u0438\u043b\u043e\u043a, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0432\u0438\u0442\u043e\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u0432\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043e\u043a, \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440\u043d\u0438\u0445 \u0434\u043b\u044f \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0443, \u0443 \u0440\u0430\u0437\u0456 \u0432\u0438\u043d\u0438\u043a\u043d\u0435\u043d\u043d\u044f \u043f\u043e\u043c\u0438\u043b\u043e\u043a HTTP, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u0430\u043f\u0438\u0442\u0438 'TRACK' \u0434\u043b\u044f \u043d\u0435\u0456\u0441\u043d\u0443\u044e\u0447\u0438\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a.\n\u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0441\u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432 \u0456 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0442\u0430\u043a, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0456\u044e \u0442\u0430 \u0432\u0435\u0440\u0441\u0456\u044e \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 'Server' \u0456 'X-Powered-By'.

ascanbeta.relativepathconfusion.desc = \u0412\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u043d\u0430\u0434\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 \u043d\u0430 \u043d\u0435\u043e\u0434\u043d\u043e\u0437\u043d\u0430\u0447\u043d\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0442\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0449\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043f\u043b\u0443\u0442\u0430\u043d\u0438\u043d\u0438 \u0449\u043e\u0434\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0433\u043e \u00ab\u0432\u0456\u0434\u043d\u043e\u0441\u043d\u043e\u0433\u043e \u0448\u043b\u044f\u0445\u0443\u00bb \u0434\u043b\u044f URL-\u0430\u0434\u0440\u0435\u0441\u0438. \u0420\u0435\u0441\u0443\u0440\u0441\u0438 (CSS, \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e) \u0442\u0430\u043a\u043e\u0436 \u0432\u043a\u0430\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445, \u0430 \u043d\u0435 \u0430\u0431\u0441\u043e\u043b\u044e\u0442\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441. \u041f\u0456\u0434 \u0447\u0430\u0441 \u0430\u0442\u0430\u043a\u0438, \u044f\u043a\u0449\u043e \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0454 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u00ab\u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443\u00bb \u0434\u043e\u0437\u0432\u0456\u043b\u044c\u043d\u0438\u043c \u0441\u043f\u043e\u0441\u043e\u0431\u043e\u043c \u0430\u0431\u043e \u0439\u043e\u0433\u043e \u043c\u043e\u0436\u043d\u0430 \u043e\u0431\u043c\u0430\u043d\u043e\u043c \u0437\u043c\u0443\u0441\u0438\u0442\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0432\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u00ab\u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443\u00bb, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0442\u0430\u043a\u0456 \u043c\u0435\u0442\u043e\u0434\u0438, \u044f\u043a \u0444\u0440\u0435\u0439\u043c\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u043e\u0434\u0456 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u043c\u043e\u0436\u043d\u0430 \u043e\u0431\u0434\u0443\u0440\u0438\u0442\u0438, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0430\u0446\u0456\u044f HTML \u044f\u043a CSS (\u0430\u0431\u043e \u0456\u043d\u0448\u0438\u0445 \u0442\u0438\u043f\u0456\u0432 \u0432\u043c\u0456\u0441\u0442\u0443), \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 XSS.
ascanbeta.relativepathconfusion.extrainfo.contenttypeenabled = A Content Type of "{0}" was specified. If the web browser is employing strict parsing rules, this will prevent cross-content attacks from succeeding. Quirks Mode in the web browser would disable strict parsing.
ascanbeta.relativepathconfusion.extrainfo.framingallowed = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Frame-Options \u043d\u0435 \u0432\u043a\u0430\u0437\u0430\u043d\u043e, \u0442\u043e\u043c\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u043c\u043e\u0436\u043d\u0430 \u043f\u043e\u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0432 \u0440\u0430\u043c\u043a\u0443, \u0456 \u0446\u0435 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0432\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043d\u044f \u0440\u0435\u0436\u0438\u043c\u0443 \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.extrainfo.morethanonebasetag = \u0411\u0456\u043b\u044c\u0448 \u043d\u0456\u0436 \u043e\u0434\u0438\u043d \u0442\u0435\u0433 <base> \u0431\u0443\u043b\u043e \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u0432 \u0442\u0435\u0433\u0443 HTML <head> \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441, \u0449\u043e \u0454 \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u043c.
ascanbeta.relativepathconfusion.extrainfo.nobasetag = \u0422\u0435\u0433 <base> \u043d\u0435 \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u0432 \u0442\u0435\u0433\u0443 <head> HTML \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441.
ascanbeta.relativepathconfusion.extrainfo.nocontenttype = No Content Type was specified, so Quirks Mode is not required to exploit the vulnerability in the web browser.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e <meta http-equiv\="{0}", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0441\u0442\u0430\u0440\u043e\u0433\u043e DOCTYPE \u0437 PUBLIC id "{0}", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 \u0443 \u043f\u0435\u0432\u043d\u0438\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u0445.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u043d\u0435\u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u043e\u0441\u0442\u0456 DOCTYPE, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.name = \u041f\u043b\u0443\u0442\u0430\u043d\u0438\u043d\u0430 \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u043e\u0433\u043e \u0448\u043b\u044f\u0445\u0443
ascanbeta.relativepathconfusion.refs = https\://arxiv.org/abs/1811.00917\nhttps\://hsivonen.fi/doctype/\nhttps\://www.w3schools.com/tags/tag_base.asp
ascanbeta.relativepathconfusion.soln = Web servers and frameworks should be updated to be configured to not serve responses to ambiguous URLs in such a way that the relative path of such URLs could be mis-interpreted by components on either the client side, or server side.\nWithin the application, the correct use of the "<base>" HTML tag in the HTTP response will unambiguously specify the base URL for all relative URLs in the document.\nUse the "Content-Type" HTTP response header to make it harder for the attacker to force the web browser to mis-interpret the content type of the response.\nUse the "X-Content-Type-Options\: nosniff" HTTP response header to prevent the web browser from "sniffing" the content type of the response.\nUse a modern DOCTYPE such as "<\!doctype html>" to prevent the page from being rendered in the web browser using "Quirks Mode", since this results in the content type being ignored by the web browser.\nSpecify the "X-Frame-Options" HTTP response header to prevent Quirks Mode from being enabled in the web browser using framing attacks.

ascanbeta.sessionfixation.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionfixation.alert.cookie.extrainfo = \u0424\u0430\u0439\u043b cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c, \u043a\u043e\u043b\u0438 \u043f\u043e\u043b\u0435 cookie [{0}] \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL\: [{1}]\n\u0424\u0430\u0439\u043b cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456\u0437 \u0437\u0430\u043f\u043e\u0437\u0438\u0447\u0435\u043d\u0438\u043c (\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u043c) \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c cookie \u0443 \u0437\u0430\u043f\u0438\u0442\u0456 [{1}] \: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.\n\n\u0426\u044e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0432\u0448\u0438, \u0447\u0438 \u0442\u043e\u043a\u0435\u043d \u0441\u0435\u0430\u043d\u0441\u0443, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0432\u0445\u043e\u0434\u0443, \u0437\u0430\u043b\u0438\u0448\u0430\u0454\u0442\u044c\u0441\u044f \u0434\u0456\u0439\u0441\u043d\u0438\u043c \u043f\u0456\u0441\u043b\u044f \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443, \u0456 \u0449\u043e \u043c\u0430\u0440\u043a\u0435\u0440 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u0440\u044f\u043c\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438/\u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0434\u043b\u044f \u044f\u043a\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0443\u0432\u0456\u0439\u0442\u0438 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionfixation.alert.url.extrainfo = \u0406\u043c\u043e\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u0437\u2019\u044f\u0432\u0438\u043b\u043e\u0441\u044f \u0432 URL-\u0430\u0434\u0440\u0435\u0441\u0430\u0445 \u0443 \u0432\u0438\u0432\u0435\u0434\u0435\u043d\u0438\u0445 HTML-\u0430\u0434\u0440\u0435\u0441\u0430\u0445, \u043a\u043e\u043b\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 URL-\u0430\u0434\u0440\u0435\u0441\u0438/\u043f\u0441\u0435\u0432\u0434\u043e\u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 URL-\u0430\u0434\u0440\u0435\u0441\u0438 [{0}] \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL\: [{1}]\n\u041a\u043e\u043b\u0438 \u0446\u0435\u0439 \u00ab\u043f\u043e\u0437\u0438\u0447\u0435\u043d\u0438\u0439\u00bb \u0441\u0435\u0430\u043d\u0441 [{1}] \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u043e\u043c\u0443 \u0437\u0430\u043f\u0438\u0442\u0456 \u0434\u043b\u044f \u0446\u0456\u0454\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u043d\u043e\u0432\u0438\u0439 \u0441\u0435\u0430\u043d\u0441 \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0454\u0442\u044c\u0441\u044f.
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.
ascanbeta.sessionfixation.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0430 \u0444\u0456\u043a\u0441\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443. \u042f\u043a\u0449\u043e \u0446\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0437 URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e \u0432\u0445\u043e\u0434\u0443 (\u0434\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456), \u0442\u043e\u0434\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u0434\u0430\u0442\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0443 \u0440\u0430\u0437\u043e\u043c \u0456\u0437 \u0444\u0456\u043a\u0441\u043e\u0432\u0430\u043d\u0438\u043c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u043e\u043c \u0441\u0435\u0430\u043d\u0441\u0443 \u0436\u0435\u0440\u0442\u0432\u0456, \u0449\u043e\u0431 \u043f\u0456\u0437\u043d\u0456\u0448\u0435 \u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u0442\u0438 \u043e\u0441\u043e\u0431\u0443 \u0436\u0435\u0440\u0442\u0432\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443. \u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0437\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u043e\u044e \u0431\u0435\u0437 \u0432\u0445\u043e\u0434\u0443, URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0442\u0430 \u0444\u0456\u043a\u0441\u043e\u0432\u0430\u043d\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u043b\u0438\u0448\u0435 \u0434\u043b\u044f \u0432\u0456\u0434\u0441\u0442\u0435\u0436\u0435\u043d\u043d\u044f \u0434\u0456\u0439 \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u042f\u043a\u0449\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0432 \u043f\u043e\u043b\u0456 cookie \u0430\u0431\u043e \u043f\u043e\u043b\u0456 \u0444\u043e\u0440\u043c\u0438 (\u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 POST), \u0430 \u043d\u0435 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 (GET), \u0442\u043e \u043c\u043e\u0436\u0435 \u0437\u043d\u0430\u0434\u043e\u0431\u0438\u0442\u0438\u0441\u044f \u044f\u043a\u0430\u0441\u044c \u0456\u043d\u0448\u0430 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u043f\u043e\u043b\u0435 cookie \u0443 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456 \u0436\u0435\u0440\u0442\u0432\u0438, \u0449\u043e\u0431 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0442\u0438 \u0435\u043a\u0441\u043f\u043b\u0443\u0430\u0442\u0430\u0446\u0456\u0457.
ascanbeta.sessionfixation.name = \u0424\u0456\u043a\u0441\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443
ascanbeta.sessionfixation.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication\nhttps\://owasp.org/www-community/attacks/Session_fixation\nhttps\://acrossecurity.com/papers/session_fixation.pdf\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html
ascanbeta.sessionfixation.soln = 1) Prevent the attacker from gaining a session id by enforcing strict session ids, and by only allocating session ids upon successful authentication to the application.\n2) The server should always create a new session id upon authentication, regardless of whether a session is already in place.\n3) Bind the session id to some identifiable client attribute combination, such as IP address, SSL client certificate.\n4) Sessions, when destroyed, must be destroyed on the server, as well as on the client.\n5) Implement a logout mechanism which will destroy all previous sessions for the client.\n6) Implement absolute session timeouts.\n7)Switch from a URL based to a cookie or form based session id implementation, as the latter typically require additional vulnerabilities, in order to be exploitable by an attacker.

ascanbeta.sessionidaccessiblebyjavascript.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo = session identifier {0} field [{1}], value [{2}] may be accessed using JavaScript in the web browser.
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage = The URL on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionidaccessiblebyjavascript.desc = A Session Id cookie sent by the server (when the URL is modified by setting the named parameter field to NULL) may be accessed by JavaScript on the client. In conjunction with another vulnerability, this may allow the session to be hijacked.
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 Cookie \u0414\u043e\u0441\u0442\u0443\u043f\u043d\u043e \u0434\u043b\u044f JavaScript
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.soln = 1) Use the 'httponly' flag when setting a cookie containing a session id, to prevent it from being accessed by JavaScript in the web browser.

ascanbeta.sessionidexpiry.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidexpiry.alert.extrainfo = \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 {0} \u043f\u043e\u043b\u0435 [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0435 \u0434\u043e [{3}] (\u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 cookie \u0431\u0443\u043b\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0432 {4}), \u044f\u043a\u0449\u043e \u0442\u0456\u043b\u044c\u043a\u0438 \u0441\u0435\u0430\u043d\u0441 \u043d\u0435 \u0431\u0443\u0434\u0435 \u0437\u043d\u0438\u0449\u0435\u043d\u043e.
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionidexpiry.browserclose = \u0417\u0430\u043a\u0440\u0438\u0442\u0438 \u0431\u0440\u0430\u0443\u0437\u0435\u0440
ascanbeta.sessionidexpiry.desc = A Session Id cookie sent by the server (when the URL is modified by setting the named parameter field to NULL) is set to be valid for an excessive period of time. This may be exploitable by an attacker if the user forgets to log out, if the logout functionality does not correctly destroy the session, or if the session id is compromised by some other means.
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name = \u0427\u0430\u0441 \u0434\u0456\u0457 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443/\u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u0438\u0439 \u0432\u0456\u043a \u043d\u0430\u0434\u043c\u0456\u0440\u043d\u043e \u0434\u043e\u0432\u0433\u0438\u0439
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.soln = 1) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0449\u043e\u0434\u043e \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u00abExpire\u00bb \u0430\u0431\u043e \u00abMax-Age\u00bb, \u043a\u043e\u043b\u0438 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454\u0442\u0435 cookie, \u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0439\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0441\u0442\u0456 \u043f\u0440\u043e\u0442\u044f\u0433\u043e\u043c \u0442\u0440\u0438\u0432\u0430\u043b\u0438\u0445 \u043f\u0435\u0440\u0456\u043e\u0434\u0456\u0432 \u0447\u0430\u0441\u0443.\n2) \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u044f \u0432\u0438\u0445\u043e\u0434\u0443 \u0437 \u0441\u0438\u0441\u0442\u0435\u043c\u0438 \u0456\u0441\u043d\u0443\u0454 \u0442\u0430 \u0449\u043e \u0432\u043e\u043d\u0430 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0440\u0443\u0439\u043d\u0443\u0454 \u0441\u0435\u0430\u043d\u0441.\n3) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0456\u043d\u0448\u0456 \u0437\u0430\u043f\u043e\u0431\u0456\u0436\u043d\u0456 \u0437\u0430\u0445\u043e\u0434\u0438, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u044f\u043a\u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u043e, \u0432\u0456\u043d \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0438\u0439.
ascanbeta.sessionidexpiry.timeexpired = \u0422\u0435\u0440\u043c\u0456\u043d \u0434\u0456\u0457 \u043c\u0438\u043d\u0443\u0432
ascanbeta.sessionidexpiry.timelessthanonehour = \u041c\u0435\u043d\u0448\u0435, \u043d\u0456\u0436 \u0433\u043e\u0434\u0438\u043d\u0443
ascanbeta.sessionidexpiry.timemorethanoneday = \u041c\u0435\u043d\u0448\u0435, \u043d\u0456\u0436 \u0434\u0435\u043d\u044c
ascanbeta.sessionidexpiry.timemorethanonehour = \u0411\u0456\u043b\u044c\u0448\u0435, \u043d\u0456\u0436 \u0433\u043e\u0434\u0438\u043d\u0443
ascanbeta.sessionidexpiry.timemorethanoneweek = \u0411\u0456\u043b\u044c\u0448\u0435, \u043d\u0456\u0436 \u0442\u0438\u0436\u0434\u0435\u043d\u044c

ascanbeta.sessionidexposedinurl.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidexposedinurl.alert.extrainfo = {0} \u043f\u043e\u043b\u044f [{1}] \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 [{2}]
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionidexposedinurl.desc = A session id is exposed in the URL. By sharing such a website URL (containing the session id), a naive user may be inadvertently granting access to their data, compromising its confidentiality, integrity, and availability. URLs containing the session identifier also appear in web browser bookmarks, web server log files, and proxy server log files.
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name = \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidexposedinurl.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456\u0448\u0443 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044e \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u043e\u043c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434 \u0442\u0430\u043a\u0443, \u044f\u043a\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0444\u0430\u0439\u043b\u0438 \u0441\u0435\u0430\u043d\u0441\u0443 cookie, \u044f\u043a\u0438\u043c\u0438 \u043d\u0435 \u0442\u0430\u043a \u043b\u0435\u0433\u043a\u043e \u0432\u0438\u043f\u0430\u0434\u043a\u043e\u0432\u043e \u043f\u043e\u0434\u0456\u043b\u0438\u0442\u0438\u0441\u044f, \u0456 \u044f\u043a\u0456 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043d\u0435 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u044e\u0442\u044c\u0441\u044f \u0443 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0447\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043a\u0430\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430.

ascanbeta.sessionidsentinsecurely.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidsentinsecurely.alert.extrainfo = session identifier {0} field [{1}], value [{2}] may be sent via an insecure mechanism.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset = \u041f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u00ab\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439\u00bb \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0456 cookie \u0441\u0435\u0430\u043d\u0441\u0443, \u044f\u043a\u0438\u0439 \u043d\u0430\u0434\u0430\u0454 \u0441\u0435\u0440\u0432\u0435\u0440.
ascanbeta.sessionidsentinsecurely.desc = A session id may be sent via an insecure mechanism. In the case of a cookie sent in the request, this occurs when HTTP, rather than HTTPS, is used. In the case of a cookie sent by the server in response (when the URL is modified by setting the named parameter field to NULL), the 'secure' flag is not set, allowing the cookie to be sent later via HTTP rather than via HTTPS. This may allow a passive eavesdropper on the network path to gain full access to the victim's session.
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u043e \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u043e
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidsentinsecurely.soln = 1) Use the latest available version of SSL/TLS (for HTTPS) for all pages where a session id is communicated between the browser and the web server.\n2) Do not allow the communication to be forced down to the unencrypted HTTP protocol.\n3) Use the 'secure' flag when setting a cookie containing a session id, to prevent its subsequent transmission by an insecure mechanism.\n4) Forward non-secure HTTP page requests to the secure HTTPS equivalent page.

ascanbeta.shellshock.desc = The server is running a version of the Bash shell that allows remote attackers to execute arbitrary code.
ascanbeta.shellshock.extrainfo = \u0412\u0456\u0434 CVE-2014-6271\: GNU Bash \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 4.3 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454 \u043a\u0456\u043d\u0446\u0435\u0432\u0456 \u0440\u044f\u0434\u043a\u0438 \u043f\u0456\u0441\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u044c \u0444\u0443\u043d\u043a\u0446\u0456\u0439 \u0443 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u0445 \u0437\u043c\u0456\u043d\u043d\u0438\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434 \u0447\u0435\u0440\u0435\u0437 \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0435 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0435, \u044f\u043a \u043f\u0440\u043e\u0434\u0435\u043c\u043e\u043d\u0441\u0442\u0440\u043e\u0432\u0430\u043d\u043e \u0432\u0435\u043a\u0442\u043e\u0440\u0430\u043c\u0438, \u0449\u043e \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c \u0444\u0443\u043d\u043a\u0446\u0456\u044e ForceCommand \u0443 OpenSSH sshd, \u043c\u043e\u0434\u0443\u043b\u0456 mod_cgi \u0442\u0430 mod_cgid \u043d\u0430 HTTP-\u0441\u0435\u0440\u0432\u0435\u0440\u0456 Apache, \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457, \u0449\u043e \u0432\u0438\u043a\u043e\u043d\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u043c\u0438 \u043a\u043b\u0456\u0454\u043d\u0442\u0430\u043c\u0438 DHCP, \u0442\u0430 \u0456\u043d\u0448\u0456 \u0441\u0438\u0442\u0443\u0430\u0446\u0456\u0457, \u0443 \u044f\u043a\u0438\u0445 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430 \u0432\u0456\u0434\u0431\u0443\u0432\u0430\u0454\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u043c\u0435\u0436\u0456 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0432\u0456\u0434 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f Bash, \u0442\u0430\u043a\u043e\u0436 \u0432\u0456\u0434\u043e\u043c\u043e\u0433\u043e \u044f\u043a \u00abShellShock\u00bb. \u041f\u0420\u0418\u041c\u0406\u0422\u041a\u0410\: \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0435 \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0446\u0456\u0454\u0457 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438 \u0431\u0443\u043b\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0438\u043c; CVE-2014-7169 \u0431\u0443\u043b\u043e \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0434\u043b\u044f \u043f\u043e\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456, \u044f\u043a\u0430 \u0432\u0441\u0435 \u0449\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u043d\u044f \u043f\u0456\u0441\u043b\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.
ascanbeta.shellshock.name = \u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443 - Shell Shock
ascanbeta.shellshock.ref = https\://nvd.nist.gov/vuln/detail/CVE-2014-6271\nhttps\://www.troyhunt.com/everything-you-need-to-know-about2/
ascanbeta.shellshock.soln = Update Bash on the server to the latest version.
ascanbeta.shellshock.timingbased.evidence = \u0417\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0430\u0442\u0430\u043a\u0438 \u0431\u0443\u043b\u043e \u0441\u043f\u0440\u0438\u0447\u0438\u043d\u0435\u043d\u043e \u0442\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0437\u0430\u0442\u0440\u0438\u043c\u043a\u0443 \u0442\u0440\u0438\u0432\u0430\u043b\u0456\u0441\u0442\u044e \u0432 \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445\: {0}

ascanbeta.sourcecodedisclosure.desc = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u043f\u043e\u0442\u043e\u0447\u043d\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.
ascanbeta.sourcecodedisclosure.gitbased.evidence = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0434\u043b\u044f [{0}] \u0437\u0434\u043e\u0431\u0443\u043b\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0432\u0448\u0438 [{1}]
ascanbeta.sourcecodedisclosure.gitbased.name = Source Code Disclosure - Git
ascanbeta.sourcecodedisclosure.gitbased.soln = Ensure that Git metadata files are not deployed to the web server or application server.
ascanbeta.sourcecodedisclosure.lfibased.extrainfo = \u0412\u0438\u0445\u0456\u0434 \u0434\u043b\u044f \u043d\u0430\u0437\u0432\u0438 \u0444\u0430\u0439\u043b\u0443 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 [{0}] \u0437\u043d\u0430\u0447\u043d\u043e \u0432\u0456\u0434\u0440\u0456\u0437\u043d\u044f\u0454\u0442\u044c\u0441\u044f \u0432\u0456\u0434 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u043e\u0432\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{1}] \u043d\u0430 [{2}%] \u0443 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u0456 \u0437 \u043f\u043e\u0440\u043e\u0433\u043e\u0432\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{3}%]
ascanbeta.sourcecodedisclosure.lfibased.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - \u0434\u043e\u0434\u0430\u0432\u0430\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0456\u0432
ascanbeta.sourcecodedisclosure.svnbased.extrainfo = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0434\u043b\u044f [{0}] \u0437\u043d\u0430\u0439\u0448\u043b\u0438 \u0432 [{1}]
ascanbeta.sourcecodedisclosure.svnbased.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln = Ensure that SVN metadata files are not deployed to the web server or application server.

ascanbeta.sourcecodedisclosurecve-2012-1823.desc = \u0414\u0435\u044f\u043a\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 PHP, \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0440\u043e\u0431\u043e\u0442\u0443 \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c CGI, \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c \u0440\u044f\u0434\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443, \u0443 \u044f\u043a\u0438\u0445 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u043d\u0435\u0435\u043a\u0440\u0430\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0441\u0438\u043c\u0432\u043e\u043b "\=", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 PHP \u0456 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434. \u0423 \u0446\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0432\u043c\u0456\u0441\u0442 \u0444\u0430\u0439\u043b\u0443 PHP \u0431\u0443\u043b\u043e \u043f\u043e\u0434\u0430\u043d\u043e \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0443 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440. \u0426\u0435\u0439 \u0432\u0438\u0445\u0456\u0434 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043c\u0456\u0441\u0442\u0438\u0442\u0438\u043c\u0435 PHP, \u0445\u043e\u0447\u0430 \u0432\u0456\u043d \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0439 HTML.
ascanbeta.sourcecodedisclosurecve-2012-1823.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c PHP \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0441\u0442\u0430\u0431\u0456\u043b\u044c\u043d\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 Apache \u0456 \u043c\u043e\u0434\u0443\u043b\u044c mod_rewrite \u0434\u043b\u044f \u0444\u0456\u043b\u044c\u0442\u0440\u0430\u0446\u0456\u0457 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432 "RewriteCond" \u0456 "RewriteRule".

ascanbeta.ssrf.desc = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0442\u0440\u0438\u043c\u0443\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0443 \u0430\u0434\u0440\u0435\u0441\u0443 \u0456 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0432\u043c\u0456\u0441\u0442 \u0446\u0456\u0454\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u0430\u043b\u0435 \u0446\u044c\u043e\u0433\u043e \u043d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043d\u044c\u043e \u0434\u043b\u044f \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0433\u0430\u0440\u0430\u043d\u0442\u0443\u0432\u0430\u0442\u0438, \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0431\u0443\u0434\u0435 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0434\u043e \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u043c\u0456\u0441\u0446\u044f \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f.
ascanbeta.ssrf.name = \u041f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0437\u0456 \u0441\u0442\u043e\u0440\u043e\u043d\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanbeta.ssrf.otherinfo.canaryinbody = \u0423 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043c\u0430\u0440\u043a\u0435\u0440 canary \u0437\u0456 \u0441\u043b\u0443\u0436\u0431\u0438 \u0437\u0430 \u043c\u0435\u0436\u0430\u043c\u0438 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0443.
ascanbeta.ssrf.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html
ascanbeta.ssrf.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.
ascanbeta.ssrf.soln = \u041d\u0435 \u043f\u0440\u0438\u0439\u043c\u0430\u0439\u0442\u0435 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0456 \u0430\u0434\u0440\u0435\u0441\u0438 \u044f\u043a \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0437\u0430\u043f\u0438\u0442\u0443 \u0456, \u044f\u043a\u0449\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u043e\u043d\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0456 \u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u0441\u043f\u0438\u0441\u043a\u0443 \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c.

ascanbeta.text4shell.desc = Apache Commons Text \u0434\u043e 1.10.0 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 RCE, \u043a\u043e\u043b\u0438 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043e \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u043e\u0433\u043e \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u0457 \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c.\nApache Commons Text \u0432\u0438\u043a\u043e\u043d\u0443\u0454 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u044e \u0437\u043c\u0456\u043d\u043d\u0438\u0445, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u043e \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u0442\u0430 \u0440\u043e\u0437\u0448\u0438\u0440\u044e\u0432\u0430\u0442\u0438 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0456.\n\u0411\u0443\u043b\u043e \u043f\u043e\u043a\u0430\u0437\u0430\u043d\u043e, \u0449\u043e \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u0443\u0454 \u0437 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c\u0438 \u0447\u0435\u0440\u0435\u0437 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u044e \u0437\u043c\u0456\u043d\u043d\u0438\u0445 \u0456 \u0446\u0456\u043b\u043a\u043e\u043c \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e Remote Code Execution (RCE).
ascanbeta.text4shell.name = Text4shell (CVE-2022-42889)
ascanbeta.text4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-42889\nhttps\://securitylab.github.com/advisories/GHSL-2022-018_Apache_Commons_Text/
ascanbeta.text4shell.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.
ascanbeta.text4shell.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Apache Commons Text \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 1.10.0 \u0430\u0431\u043e \u043d\u043e\u0432\u0456\u0448\u043e\u0457.

ascanbeta.usernameenumeration.alert.attack = Manipulate [{0}] field\: [{1}] and monitor the output
ascanbeta.usernameenumeration.alert.extrainfo = [{0}] parameter [{1}] leaks information on whether a user exists. The [{5}] differences in output, for the valid original username value [{2}], and invalid username value [{3}] are\:\n[{4}].
ascanbeta.usernameenumeration.desc = It may be possible to enumerate usernames, based on differing HTTP responses when valid and invalid usernames are provided. This would greatly increase the probability of success of password brute-forcing attacks against the system. Note that false positives may sometimes be minimised by increasing the 'Attack Strength' Option in ZAP. Please manually check the 'Other Info' field to confirm if this is actually an issue.
ascanbeta.usernameenumeration.name = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u043f\u0435\u0440\u0435\u0440\u0430\u0445\u0443\u0432\u0430\u043d\u043d\u044f \u0456\u043c\u0435\u043d \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432
ascanbeta.usernameenumeration.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/03-Identity_Management_Testing/04-Testing_for_Account_Enumeration_and_Guessable_User_Account.html\nhttps\://dl.ifip.org/db/conf/sec/sec2011/FreilingS11.pdf\nhttps\://cwe.mitre.org/data/definitions/204.html
ascanbeta.usernameenumeration.soln = \u041d\u0435 \u0440\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0443\u0439\u0442\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0442\u0435, \u0447\u0438 \u0454 \u0456\u043c'\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0434\u0456\u0439\u0441\u043d\u0438\u043c \u0430\u0431\u043e \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u043c. \u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u043f\u0440\u0438 \u043d\u0435\u0432\u0434\u0430\u043b\u0438\u0445 \u0441\u043f\u0440\u043e\u0431\u0430\u0445 \u0432\u0445\u043e\u0434\u0443 \u043d\u0435 \u0440\u043e\u0437\u0440\u0456\u0437\u043d\u044f\u0439\u0442\u0435 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0456 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u043f\u0430\u0440\u043e\u043b\u044c \u0443 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u0456 \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443, \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0432\u043c\u0456\u0441\u0442\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445 HTTP \u0430\u0431\u043e \u043b\u043e\u0433\u0456\u0446\u0456 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.

