#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanbeta.desc=\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3 \u30eb\u30fc\u30eb - \u30d9\u30fc\u30bf

ascanbeta.backupfiledisclosure.name=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7 \u30d5\u30a1\u30a4\u30eb\u306e\u9732\u898b
ascanbeta.backupfiledisclosure.desc=Web \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u304c\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002
ascanbeta.backupfiledisclosure.soln=Web\u30b5\u30fc\u30d0\u3067\u516c\u958b\u3057\u3066\u3044\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u76f4\u63a5\u7de8\u96c6\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u307e\u305f\u3001\u96a0\u3057\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3081\u3001\u4e0d\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u304cWeb\u30b5\u30fc\u30d0\u3067\u516c\u958b\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.backupfiledisclosure.evidence=[{0}] \u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u304c [{1}] \u3067\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002

ascanbeta.crossdomain.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9
#the refs cannot be customised for each sub-category (Adobe, Silverlight, etc)
ascanbeta.crossdomain.refs=http\://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html\nhttp\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttp\://msdn.microsoft.com/en-US/library/cc197955%28v\=vs.95%29.aspx\nhttp\://msdn.microsoft.com/en-us/library/cc838250%28v\=vs.95%29.aspx
ascanbeta.crossdomain.adobe.read.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Read
ascanbeta.crossdomain.adobe.send.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Send
ascanbeta.crossdomain.adobe.desc=Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u3063\u3066\u3001Flash \u307e\u305f\u306f Silverlight \u3092\u7528\u3044\u305f \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.adobe.read.soln=\u3053\u306e Web \u30b5\u30fc\u30d0\u3078\u306e\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8aad\u307f\u53d6\u308a\u3092\u5236\u9650\u3059\u308b\u305f\u3081\u3001crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u69cb\u6210\u3057\u3001 <allow-access-from domain\="example.com"> \u3092\u7528\u3044\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u4f5c\u6210\u3057\u3066\u4e0b\u3055\u3044\u3002\u30b5\u30fc\u30d3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3084\u500b\u4eba\u60c5\u5831\u3092\u30db\u30b9\u30c8\u3057\u306a\u3044\u5834\u5408\u306b\u306e\u307f\u3001"*"(\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3)\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.crossdomain.adobe.read.extrainfo=\u5916\u90e8\u306e\u4efb\u610f\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089 Web \u30b5\u30fc\u30d0\u304c\u5b58\u5728\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u306b\u5bfe\u3057\u3001Flash/Silverlight \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u4f7f\u7528\u3057\u305f\u60aa\u610f\u3042\u308b\u30c9\u30e1\u30a4\u30f3\u9593\u306e\u30c7\u30fc\u30bf\u8aad\u307f\u8fbc\u307f\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002\n\n\u88ab\u5bb3\u8005\u3068\u306a\u308b\u30e6\u30fc\u30b6\u304c\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u5834\u5408\u3001\u60aa\u610f\u306e\u3042\u308b\u8aad\u307f\u8fbc\u307f\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u88ab\u5bb3\u8005\u306e\u6a29\u9650\u3092\u4f7f\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001\u88ab\u5bb3\u8005\u306e Web \u30d6\u30e9\u30a6\u30b6\u3092\u4ecb\u3057\u3066\u3001\u4e0d\u6b63\u306a\u5916\u90e8\u306e Web \u30b5\u30a4\u30c8\u306e\u30c7\u30fc\u30bf\u3092\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u672c\u6765\u306e\u30c7\u30fc\u30bf\u306b\u6df7\u5165\u3055\u305b\u308b\u3068\u3044\u3063\u305f\u4e8b\u304c\u53ef\u80fd\u3068\u306a\u308a\u307e\u3059\u3002\n\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u7279\u306b\u30af\u30c3\u30ad\u30fc \u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5b9f\u88c5\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u554f\u984c\u3068\u306a\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u304f\u306a\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.adobe.send.soln=\u3053\u306e Web \u30b5\u30fc\u30d0\u3078\u306e\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u9001\u4fe1(\u53d7\u4fe1\u306e\u5236\u9650\u306f\u5fc5\u305a\u3057\u3082\u5fc5\u8981\u3068\u306f\u306a\u308a\u307e\u305b\u3093)\u3092\u5236\u9650\u3059\u308b\u305f\u3081\u3001crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u69cb\u6210\u3057\u3001  <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh">\u3092\u7528\u3044\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u4f5c\u6210\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u30b5\u30fc\u30d3\u30b9\u306b\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea(CSRF)\u306e\u8106\u5f31\u6027\u304c\u5b58\u5728\u3057\u306a\u3044\u4e8b\u304c\u78ba\u304b\u306a\u5834\u5408\u306b\u306e\u307f\u3001"*"(\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3)\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.crossdomain.adobe.send.extrainfo=\u5916\u90e8\u306e\u4efb\u610f\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089 Web \u30b5\u30fc\u30d0\u304c\u5b58\u5728\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u306b\u5bfe\u3057\u3001Flash/Silverlight \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u4f7f\u7528\u3057\u305f\u60aa\u610f\u3042\u308b\u30c9\u30e1\u30a4\u30f3\u9593\u306e\u30c7\u30fc\u30bf\u9001\u4fe1(\u5fc5\u305a\u3057\u3082\u8aad\u307f\u8fbc\u307f\u306f\u884c\u308f\u306a\u3044)\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002\n\n\u88ab\u5bb3\u8005\u3068\u306a\u308b\u30e6\u30fc\u30b6\u304c\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u5834\u5408\u3001\u60aa\u610f\u306e\u3042\u308b\u8aad\u307f\u8fbc\u307f\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u88ab\u5bb3\u8005\u306e\u6a29\u9650\u3092\u4f7f\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001\u88ab\u5bb3\u8005\u306e Web \u30d6\u30e9\u30a6\u30b6\u3092\u4ecb\u3057\u3066\u3001\u4e0d\u6b63\u306a\u5916\u90e8\u306e Web \u30b5\u30a4\u30c8\u306e\u30c7\u30fc\u30bf\u3092\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u672c\u6765\u306e\u30c7\u30fc\u30bf\u306b\u6df7\u5165\u3055\u305b\u308b\u3068\u3044\u3063\u305f\u4e8b\u304c\u53ef\u80fd\u3068\u306a\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea(CSRF)\u306e\u653b\u6483\u306b\u7e4b\u304c\u308b\u6050\u308c\u3082\u3042\u308a\u307e\u3059\u3002\n\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u7279\u306b\u30af\u30c3\u30ad\u30fc \u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5b9f\u88c5\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u554f\u984c\u3068\u306a\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u304f\u306a\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.silverlight.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Silverlight
ascanbeta.crossdomain.silverlight.desc=Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u3063\u3066\u3001Silverlight \u3092\u7528\u3044\u305f \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.silverlight.soln=\u3053\u306e Web \u30b5\u30fc\u30d0\u3078\u306e\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5236\u9650\u3059\u308b\u305f\u3081\u3001clientaccesspolicy.xml \u30d5\u30a1\u30a4\u30eb\u3092\u69cb\u6210\u3057\u3001 <domain uri\="https\://example.com" />\u3092\u7528\u3044\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u4f5c\u6210\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u30b5\u30fc\u30d3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3084\u500b\u4eba\u60c5\u5831\u3092\u30db\u30b9\u30c8\u3057\u306a\u3044\u5834\u5408\u306b\u306e\u307f\u3001"*"(\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3)\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.crossdomain.silverlight.extrainfo=\u5916\u90e8\u306e\u4efb\u610f\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089 Web \u30b5\u30fc\u30d0\u304c\u5b58\u5728\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u306b\u5bfe\u3057\u3001Silverlight \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u4f7f\u7528\u3057\u305f\u60aa\u610f\u3042\u308b\u30c9\u30e1\u30a4\u30f3\u9593\u306e\u30c7\u30fc\u30bf\u8aad\u307f\u8fbc\u307f\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002\n\n\u88ab\u5bb3\u8005\u3068\u306a\u308b\u30e6\u30fc\u30b6\u304c\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u5834\u5408\u3001\u60aa\u610f\u306e\u3042\u308b\u8aad\u307f\u8fbc\u307f\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u88ab\u5bb3\u8005\u306e\u6a29\u9650\u3092\u4f7f\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001\u88ab\u5bb3\u8005\u306e Web \u30d6\u30e9\u30a6\u30b6\u3092\u4ecb\u3057\u3066\u3001\u4e0d\u6b63\u306a\u5916\u90e8\u306e Web \u30b5\u30a4\u30c8\u306e\u30c7\u30fc\u30bf\u3092\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u672c\u6765\u306e\u30c7\u30fc\u30bf\u306b\u6df7\u5165\u3055\u305b\u308b\u3068\u3044\u3063\u305f\u4e8b\u304c\u53ef\u80fd\u3068\u306a\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea(CSRF)\u306e\u653b\u6483\u306b\u7e4b\u304c\u308b\u6050\u308c\u3082\u3042\u308a\u307e\u3059\u3002\n\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u7279\u306b\u30af\u30c3\u30ad\u30fc \u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5b9f\u88c5\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u554f\u984c\u3068\u306a\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u304f\u306a\u308a\u307e\u3059\u3002

ascanbeta.csrftokenscan.name=\u30a2\u30f3\u30c1CSRF\u30c8\u30fc\u30af\u30f3\u30b9\u30ad\u30e3\u30ca\u30fc
ascanbeta.csrftokenscan.extrainfo.annotation=This is an informational alert as the form has a security annotation indicating that it does not need an anti-CSRF Token. This should be tested manually to ensure the annotation is correct.

ascanbeta.heartbleed.name=Heartbleed OpenSSL \u306e\u8106\u5f31\u6027
ascanbeta.heartbleed.desc=OpenSSL \u306e\u30d0\u30fc\u30b8\u30e7\u30f3 1.0.1g \u3088\u308a\u524d\u306e 1.0.1 \u7cfb\u306b\u306f\u3001Heartbeat\u62e1\u5f35\u30d1\u30b1\u30c3\u30c8\u3092\u6b63\u3057\u304f\u51e6\u7406\u3057\u306a\u3044\u8106\u5f31\u6027\u304c\u5b58\u5728\u3057\u307e\u3059\u3002\u3053\u308c\u3092\u60aa\u7528\u3059\u308b\u3088\u3046\u7d30\u5de5\u3055\u308c\u305f\u30d1\u30b1\u30c3\u30c8\u306b\u3088\u3063\u3066\u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30ea\u30fc\u30c9\u3092\u5f15\u304d\u8d77\u3053\u3057\u3001\u30ea\u30e2\u30fc\u30c8\u306e\u653b\u6483\u8005\u306b\u30d7\u30ed\u30bb\u30b9\u306e\u30e1\u30e2\u30ea\u304b\u3089\u6a5f\u5bc6\u60c5\u5831\u3092\u53d6\u5f97\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.heartbleed.soln=OpenSSL \u3092 1.0.1g \u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u66f4\u65b0\u3057\u3001HTTPS \u8a3c\u660e\u66f8\u3092\u518d\u767a\u884c\u3057\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u975e\u5bfe\u79f0\u79d8\u5bc6\u9375\u3068\u3001\u5171\u6709\u79d8\u5bc6\u9375\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u6050\u308c\u304c\u3042\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3001\u3053\u308c\u3089\u3092\u5909\u66f4\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
ascanbeta.heartbleed.extrainfo=\u3053\u306e\u554f\u984c\u306f {0} \u3092\u4f7f\u7528\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30c7\u30fc\u30bf\u3092 \u7a83\u53d6\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u8aa4\u691c\u77e5\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u4f4e\u3044\u3067\u3059\u3002

ascanbeta.HTTPParamPoll.name=HTTP \u30d1\u30e9\u30e1\u30fc\u30bf\u6c5a\u67d3
ascanbeta.HTTPParamPoll.desc=HTTP Parameter Pollution (HPP) attacks consist of injecting encoded query string delimiters into other existing parameters. If a web application does not properly sanitize the user input, a malicious user can compromise the logic of the application to perform either client-side or server-side attacks. One consequence of HPP attacks is that the attacker can potentially override existing hard-coded HTTP parameters to modify the behavior of an application, bypass input validation checkpoints, and access and possibly exploit variables that may be out of direct reach.
ascanbeta.HTTPParamPoll.sol=\u30e6\u30fc\u30b6\u304c\u5165\u529b\u3057\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u533a\u5207\u308a\u6587\u5b57\u3092\u9069\u5207\u306b\u30b5\u30cb\u30bf\u30a4\u30ba\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.HTTPParamPoll.alert.attack=HTTP \u30d1\u30e9\u30e1\u30fc\u30bf\u6c5a\u67d3
ascanbeta.HTTPParamPoll.extrainfo=http\://www.google.com/search?q\=http+parameter+pollution

ascanbeta.insecurehttpmethod.name=Insecure HTTP Method
ascanbeta.insecurehttpmethod.detailed.name=Insecure HTTP Method - {0}
ascanbeta.insecurehttpmethod.desc=The insecure HTTP method [{0}] is enabled on the web server for this resource. Depending on the web server configuration, and the underlying implementation responsible for serving the resource, this might or might not be exploitable. The TRACK and TRACE methods may be used by an attacker, to gain access to the authorisation token/session cookie of an application user, even if the session cookie is protected using the ''HttpOnly'' flag. For the attack to be successful, the application user must typically be using an older web browser, or a web browser which has a Same Origin Policy (SOP) bypass vulnerability. The ''CONNECT'' method can be used by a web client to create an HTTP tunnel to third party websites or services.
ascanbeta.insecurehttpmethod.trace.exploitable.desc=The insecure HTTP method [{0}] is enabled for this resource, and is exploitable. The TRACK and TRACE methods may be used by an attacker, to gain access to the authorisation token/session cookie of an application user, even if the session cookie is protected using the ''HttpOnly'' flag. For the attack to be successful, the application user must typically be using an older web browser, or a web browser which has a Same Origin Policy (SOP) bypass vulnerability.
ascanbeta.insecurehttpmethod.connect.exploitable.desc=The insecure HTTP method [{0}] is enabled for this resource, and is exploitable. It was found to be possible to establish a tunneled socket connection to a third party service, using this HTTP method.  This would allow the service to be used as an anonymous spam relay, or as a web proxy, bypassing network restrictions. It also allows it to be used to establish a tunneled VPN, effectively extending the network perimeter to include untrusted components. 
ascanbeta.insecurehttpmethod.extrainfo=The OPTIONS method disclosed the following enabled HTTP methods for this resource\: [{0}]
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo=A TRACE request was sent for this request, with a custom cookie value [{0}]. This cookie value was disclosed in the HTTP response, confirming the vulnerability.
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo=The CONNECT method was used to establish a socket connection to [{0}], via the web server.
ascanbeta.insecurehttpmethod.soln=Disable insecure methods such as TRACK, TRACE, and CONNECT on the web server, and ensure that the underlying service implementation does not support insecure methods.


ascanbeta.integeroverflow.name=Integer Overflow Error
ascanbeta.integeroverflow.desc=An integer overflow condition exists when an integer, which has not been properly checked from the input stream is used within a compiled program. 
ascanbeta.integeroverflow.soln=Rewrite the background program using proper checking of the size of integer being input to prevent overflows and divide by 0 errors.  This will require a recompile of the background executable.
ascanbeta.integeroverflow.refs=https\://www.owasp.org/index.php/Integer_overflow \u3068 http\://projects.webappsec.org/w/page/13246946/Integer%20Overflows
ascanbeta.integeroverflow.error1=Potential Integer Overflow.  Status code changed on the input of a long string of random integers.
ascanbeta.integeroverflow.error2=Potential Integer Overflow.  Status code changed on the input of a long string of zeros.
ascanbeta.integeroverflow.error3=Potential Integer Overflow.  Status code changed on the input of a long string of ones.
ascanbeta.integeroverflow.error4=Potential Integer Overflow.  Status code changed on the input of a long string of nines.

ascanbeta.noanticsrftokens.name=\u30a2\u30f3\u30c1CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044
ascanbeta.noanticsrftokens.desc=HTML \u9001\u4fe1\u30d5\u30a9\u30fc\u30e0\u3067\u30a2\u30f3\u30c1CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002

ascanbeta.remotecodeexecution.cve-2012-1823.name=Remote Code Execution - CVE-2012-1823
ascanbeta.remotecodeexecution.cve-2012-1823.desc=Some PHP versions, when configured to run using CGI, do not correctly handle query strings that lack an unescaped "\=" character, enabling arbitrary code execution. In this case, an operating system command was caused to be executed on the web server, and the results were returned to the web browser. 
ascanbeta.remotecodeexecution.cve-2012-1823.soln=Upgrade to the latest stable version of PHP, or use the Apache web server and the mod_rewrite module to filter out malicious requests using the "RewriteCond" and "RewriteRule" directives.

ascanbeta.sessionfixation.name=\u30bb\u30c3\u30b7\u30e7\u30f3 \u30d5\u30a3\u30af\u30bb\u30fc\u30b7\u30e7\u30f3
ascanbeta.sessionfixation.desc=Session Fixation may be possible. If this issue occurs with a login URL (where the user authenticates themselves to the application), then the URL may be given by an attacker, along with a fixed session id, to a victim, in order to later assume the identity of the victim using the given session id. If the issue occurs with a non-login page, the URL and fixed session id may only be used by an attacker to track an unauthenticated user's actions. If the vulnerability occurs on a cookie field or a form field (POST parameter) rather than on a URL (GET) parameter, then some other vulnerability may also be required in order to set the cookie field on the victim's browser, to allow the vulnerability to be exploited.
ascanbeta.sessionfixation.soln=1) Prevent the attacker from gaining a session id by enforcing strict session ids, and by only allocating session ids upon successful authentication to the application.\n2) The server should always create a new session id upon authentication, regardless of whether a session is already in place.\n3) Bind the session id to some identificable client attribute combination, such as IP address, SSL client certificate.\n4) Sessions, when destroyed, must be destroyed on the server, as well as on the client.\n5) Implement a logout mechanism which will destroy all previous sessions for the client.\n6) Implement absolute session timeouts.\n7)Switch from a URL based to a cookie or form based session id implementation, as the latter typically require additional vulnerabilities, in order to be exploitable by an attacker\n
ascanbeta.sessionfixation.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Session_fixation\nhttp\://www.acros.si/papers/session_fixation.pdf\nhttp\://www.technicalinfo.net/papers/WebBasedSessionManagement.html\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionfixation.alert.cookie.extrainfo=Cookie set in response when cookie field [{0}] is set to NULL\: [{1}]\nCookie set in response with borrowed (valid) cookie value in request [{1}] \: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionfixation.alert.url.extrainfo=A likely session value has appeared in URLs in the HTML output when URL parameter/pseudo URL parameter [{0}] is set to NULL\: [{1}]\nWhen this ''borrowed'' session [{1}] is used in a subsequent request for this URL, a new session is not created.
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionfixation.alert.attack={0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name=\u30bb\u30c3\u30b7\u30e7\u30f3 ID\u306e\u516c\u958b
ascanbeta.sessionidexposedinurl.desc=A session id is exposed in the URL. By sharing such a website URL (containing the session id), a naiive user may be inadvertently granting access to their data, compromising its confidentiality, integrity, and availability.  URLs containing the session identifier also appear in web browser bookmarks, web server log files, and proxy server log files. 
ascanbeta.sessionidexposedinurl.soln=Use a more secure session management implementation, such as one that uses session cookies, which are not as easily shared inadvertently, and which do not typically appear in server log files or web browser bookmarks.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management
ascanbeta.sessionidexposedinurl.alert.extrainfo={0} field [{1}] contains an exposed session identifier [{2}]
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionidexposedinurl.alert.attack={0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name=Session ID Transmitted Insecurely
ascanbeta.sessionidsentinsecurely.desc=A session id may be sent via an insecure mechanism. In the case of a cookie sent in the request, this occurs when HTTP, rather than HTTPS, is used.  In the case of a cookie sent by the server in response (when the URL is modified by setting the named parameter field to NULL), the 'secure' flag is not set, allowing the cookie to be sent later via HTTP rather than via HTTPS. This may allow a passive eavesdropper on the network path to gain full access to the victim's session.  
ascanbeta.sessionidsentinsecurely.soln=1) Use the latest available version of SSL/TLS (for HTTPS) for all pages where a session id is communicated between the browser and the web server.\n2) Do not allow the communication to be forced down to the unencrypted HTTP protocol.\n3) Use the 'secure' flag when setting a cookie containing a session id, to prevent its subsequent transmission by an insecure mechanism.\n4) Forward non-secure HTTP page requests to the secure HTTPS equivalent page.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionidsentinsecurely.alert.extrainfo=session identifier {0} field [{1}], value [{2}] may be sent via an insecure mechanism.  
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset=The 'secure' flag was not set on the session cookie supplied by the server.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionidsentinsecurely.alert.attack={0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name=Session ID Cookie Accessible to JavaScript
ascanbeta.sessionidaccessiblebyjavascript.desc=A Session Id cookie sent by the server (when the URL is modified by setting the named parameter field to NULL) may be accessed by JavaScript on the client. In conjunction with another vulnerability, this may allow the session to be hijacked.  
ascanbeta.sessionidaccessiblebyjavascript.soln=1) Use the 'httponly' flag when setting a cookie containing a session id, to prevent it from being accessed by JavaScript in the web browser.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.refs=
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo=session identifier {0} field [{1}], value [{2}] may be accessed using JavaScript in the web browser
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionidaccessiblebyjavascript.alert.attack={0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name=Session ID Expiry Time/Max-Age is Excessive
ascanbeta.sessionidexpiry.desc=A Session Id cookie sent by the server (when the URL is modified by setting the named parameter field to NULL) is set to be valid for an excessive period of time. This may be exploitable by an attacker if the user forgets to log out, if the logout functionality does not correctly destroy the session, or if the session id is compromised by some other means.     
ascanbeta.sessionidexpiry.soln=1) Use the 'Expire' or 'Max-Age' cookie directives when setting a cookie containing a session id, to prevent it from being available for prolonged periods of time.\n2) Ensure that logout functionality exists, and that it correctly destroys the session.\n3) Use other preventative measures to ensure that if a session id is compromised, it may not be exploited.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.refs=
ascanbeta.sessionidexpiry.alert.extrainfo=session identifier {0} field [{1}], value [{2}] may be accessed until [{3}] (since cookie was received at {4}), unless the session is destroyed.
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage=The url on which the issue was discovered was flagged as a logon page.
ascanbeta.sessionidexpiry.alert.attack={0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionidexpiry.browserclose=browser close
ascanbeta.sessionidexpiry.timemorethanoneweek=More than one week
ascanbeta.sessionidexpiry.timemorethanoneday=More than one day
ascanbeta.sessionidexpiry.timemorethanonehour=More than one hour
ascanbeta.sessionidexpiry.timelessthanonehour=Less than one hour
ascanbeta.sessionidexpiry.timeexpired=Expired

ascanbeta.shellshock.name=Remote Code Execution - Shell Shock
ascanbeta.shellshock.desc=The server is running a version of the Bash shell that allows remote attackers to execute arbitrary code 
ascanbeta.shellshock.extrainfo=From CVE-2014-6271\: GNU Bash through 4.3 processes trailing strings after function definitions in the values of environment variables, which allows remote attackers to execute arbitrary code via a crafted environment, as demonstrated by vectors involving the ForceCommand feature in OpenSSH sshd, the mod_cgi and mod_cgid modules in the Apache HTTP Server, scripts executed by unspecified DHCP clients, and other situations in which setting the environment occurs across a privilege boundary from Bash execution, aka "ShellShock." NOTE\: the original fix for this issue was incorrect; CVE-2014-7169 has been assigned to cover the vulnerability that is still present after the incorrect fix.
ascanbeta.shellshock.soln=Update Bash on the server to the latest version
ascanbeta.shellshock.ref=http\://web.nvd.nist.gov/view/vuln/detail?vulnId\=CVE-2014-6271\nhttp\://www.troyhunt.com/2014/09/everything-you-need-to-know-about.html
ascanbeta.shellshock.timingbased.evidence=Using the attack, a delay of [{0}] milliseconds was induced and detected

ascanbeta.sqlinjection.mysql.name=SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - MySQL
ascanbeta.sqlinjection.hypersonic.name=SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3- Hypersonic SQL
ascanbeta.sqlinjection.oracle.name=SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3- Oracle
ascanbeta.sqlinjection.postgres.name=SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - PostgreSQL
ascanbeta.sqlinjection.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027
ascanbeta.sqlinjection.soln=Do not trust client side input, even if there is client side validation in place. \nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply an 'allow list' of allowed characters, or a 'deny list' of disallowed characters in user input.\nApply the privilege of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanbeta.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
#ascanbeta.sqlinjection.alert.errorbased.attack={1}
ascanbeta.sqlinjection.alert.errorbased.differentiation.attack=\u5143\u306e\u5024\: [{0}]\u3002\u5909\u66f4\u5f8c\u306e\u5024\: [{1}]\u3002\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u5024\: [{2}]
ascanbeta.sqlinjection.alert.booleanbased.attack=field\: [{0}], value [{1}]
ascanbeta.sqlinjection.alert.unionbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanbeta.sqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] likely, given error message fragment [{1}] in HTML results
ascanbeta.sqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] likely, given UNION-specific message fragment [{1}] in HTML results
ascanbeta.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Unmodified message gave HTTP status [{0}], modified message gave HTTP status [{1}]
ascanbeta.sqlinjection.alert.errorbased.differentiation.extrainfo=Unmodified message gave HTTP status [{0}], body of length [{1}], modified message gave HTTP status [{2}], body of length [{3}]. A third (non-SQL injection inducing value) gave HTTP status [{4}], body of length [{5}]
ascanbeta.sqlinjection.alert.booleanbased.extrainfo=The page results were successfully manipulated using the boolean conditions [{0}] and [{1}]
ascanbeta.sqlinjection.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds 

ascanbeta.sourcecodedisclosure.desc=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304cWeb\u30b5\u30fc\u30d0\u304b\u3089\u53c2\u7167\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002

ascanbeta.sourcecodedisclosurecve-2012-1823.name=Source Code Disclosure - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.desc=Some PHP versions, when configured to run using CGI, do not correctly handle query strings that lack an unescaped "\=" character, enabling PHP source code disclosure, and arbitrary code execution. In this case, the contents of the PHP file were served directly to the web browser. This output will typically contain PHP, although it may also contain straight HTML.
ascanbeta.sourcecodedisclosurecve-2012-1823.soln=Upgrade to the latest stable version of PHP, or use the Apache web server and the mod_rewrite module to filter out malicious requests using the "RewriteCond" and "RewriteRule" directives.

ascanbeta.sourcecodedisclosure.svnbased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln=SVN \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304c Web \u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3092\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanbeta.sourcecodedisclosure.svnbased.extrainfo=[{0}] \u306e\u30bd\u30fc\u30b9 \u30b3\u30fc\u30c9\u304c [{1}] \u304b\u3089\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002

ascanbeta.sourcecodedisclosurewebinf.name=Source Code Disclosure - /WEB-INF folder
ascanbeta.sourcecodedisclosurewebinf.desc=Java source code was disclosed by the web server in Java class files in the WEB-INF folder. The class files can be dis-assembled to produce source code which very closely matches the original source code.  
ascanbeta.sourcecodedisclosurewebinf.soln=The web server should be configured to not serve the /WEB-INF folder or its contents to web browsers, since it contains sensitive information such as compiled Java source code and properties files which may contain credentials. Java classes deployed with the application should be obfuscated, as an additional layer of defence in a "defence-in-depth" approach.

ascanbeta.sourcecodedisclosurewebinf.propertiesfile.name=Properties File Disclosure - /WEB-INF folder
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.desc=A Java class in the /WEB-INF folder disclosed the presence of the properties file. Properties file are not intended to be publicly accessible, and typically contain configuration information, application credentials, or cryptographic keys.   
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.soln=The web server should be configured to not serve the /WEB-INF folder or its contents to web browsers.  It may also be possible to remove the /WEB-INF folder.  
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.extrainfo=The reference to the properties file was found in the dis-assembled Java source code for Java class [{0}].

ascanbeta.usernameenumeration.name=Possible Username Enumeration
ascanbeta.usernameenumeration.desc=It may be possible to enumerate usernames, based on differing HTTP responses when valid and invalid usernames are provided. This would greatly increase the probability of success of password brute-forcing attacks against the system. Note that false positives may sometimes be minimised by increasing the 'Attack Strength' Option in ZAP.  Please manually check the 'Other Info' field to confirm if this is actually an issue. 
ascanbeta.usernameenumeration.soln=Do not divulge details of whether a username is valid or invalid. In particular, for unsuccessful login attempts, do not differentiate between an invalid user and an invalid password in the error message, page title, page contents, HTTP headers, or redirection logic.
ascanbeta.usernameenumeration.refs=https\://www.owasp.org/index.php/Testing_for_user_enumeration_%28OWASP-AT-002%29\nhttp\://sebastian-schinzel.de/_download/ifip-sec2011.pdf
ascanbeta.usernameenumeration.alert.extrainfo=[{0}] parameter [{1}] leaks information on whether a user exists. The [{5}] differences in output, for the valid original username value [{2}], and invalid username value [{3}] are\:\n[{4}]
ascanbeta.usernameenumeration.alert.attack=Manipulate [{0}] field\: [{1}] and monitor the output 

ascanbeta.paddingoracle.name=Generic Padding Oracle
ascanbeta.paddingoracle.desc=By manipulating the padding on an encrypted string, an attacker is able to generate an error message that indicates a likely 'padding oracle' vulnerability. Such a vulnerability can affect any application or framework that uses encryption improperly, such as some versions of ASP.net, Java Server Faces, and Mono. An attacker may exploit this issue to decrypt data and recover encryption keys, potentially viewing and modifying confidential data. This plugin should detect the MS10-070 padding oracle vulnerability in ASP.net if CustomErrors are enabled for that.
ascanbeta.paddingoracle.soln=Update the affected server software, or modify the scripts so that they properly validate encrypted data before attempting decryption.
ascanbeta.paddingoracle.refs=http\://netifera.com/research/\nhttp\://www.microsoft.com/technet/security/bulletin/ms10-070.mspx\nhttp\://www.mono-project.com/Vulnerabilities\#ASP.NET_Padding_Oracle\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799

ascanbeta.elinjection.name=EL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanbeta.elinjection.desc=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c Java Server Page (JSP) \u306e Expression Language Statement (EL\u5f0f) \u3067\u69cb\u6210\u3055\u308c\u3001\u5916\u90e8\u304b\u3089\u306e\u5165\u529b\u3092\u4e0a\u6d41\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u53d7\u3051\u53d6\u308b\u969b\u3001\u5165\u529b\u5024\u304c\u9069\u5207\u306b\u7121\u5bb3\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u7279\u5b9a\u306e\u8981\u7d20\u3092\u57cb\u3081\u8fbc\u3080\u3053\u3068\u3067\u5b9f\u884c\u524d\u306eEL\u5f0f\u3092\u66f8\u304d\u63db\u3048\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\n\nSprint 3.0.5 \u3088\u308a\u4ee5\u524d\u306e\u7279\u5b9a\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u306f\u8106\u5f31\u6027(CVE-2011-2730)\u304c\u5b58\u5728\u3057\u3001EL\u5f0f\u304c2\u5ea6\u8a55\u4fa1\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306bEL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u5f15\u304d\u8d77\u3053\u3055\u308c\u307e\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Spring \u306b\u304a\u3044\u3066\u3082\u8a2d\u5b9a\u6b21\u7b2c\u3067\u6709\u52b9\u3068\u306a\u308a\u307e\u3059\u3002
ascanbeta.elinjection.soln=\u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u30c7\u30fc\u30bf\u306b\u5bfe\u3057\u3066\u3001\u59a5\u5f53\u306a\u30d0\u30ea\u30c7\u30fc\u30b7\u30e7\u30f3\u3092\u884c\u3063\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u5165\u529b\u30c7\u30fc\u30bf\u304cEL\u5f0f\u306e\u4e00\u90e8\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u308b\u524d\u306b\u30a8\u30f3\u30b3\u30fc\u30c9\u3092\u884c\u3063\u3066\u4e0b\u3055\u3044\u3002\u3053\u308c\u3089\u306b\u3088\u3063\u3066\u3001\u30a4\u30f3\u30bf\u30d7\u30ea\u30bf\u306b\u3088\u3063\u3066\u8a55\u4fa1\u3055\u308c\u308b\u524d\u306b\u3001\u30e6\u30fc\u30b6\u5165\u529b\u5024\u306b\u30e1\u30bf\u6587\u5b57\u304c\u542b\u307e\u308c\u306a\u3044\u72b6\u614b\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u6700\u3082\u5358\u7d14\u306a\u691c\u51fa\u30d1\u30bf\u30fc\u30f3\u306f\u3001 ${ \u3068 \#{ \u3067\u3059\u3002\u305f\u3060\u3057\u3001\u3053\u308c\u3089\u306e\u30c7\u30fc\u30bf\u306f\u30a8\u30f3\u30b3\u30fc\u30c9\u307e\u305f\u306f\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection\nhttp\://cwe.mitre.org/data/definitions/917.html

ascanbeta.xxeplugin.name=XML External Entity Attack
ascanbeta.xxeplugin.nocallback=callback functionality not available

ascanbeta.xpathinjectionplugin.name=XPath \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3

