ascanbeta.HTTPParamPoll.desc = HTTP\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u6c5a\u67d3 (HPP) \u653b\u6483\u306f\u3001\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u305f\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306e\u533a\u5207\u308a\u6587\u5b57\u3092\u65e2\u5b58\u306e\u4ed6\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u6ce8\u5165\u3059\u308b\u624b\u6cd5\u3067\u3059\u3002Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u306e\u9069\u5207\u306a\u30b5\u30cb\u30bf\u30a4\u30ba\u304c\u884c\u308f\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u653b\u6483\u8005\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30ed\u30b8\u30c3\u30af\u3092\u4fb5\u5bb3\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u30fb\u30b5\u30fc\u30d0\u30fc\u5074\u306e\u4e21\u65b9\u3067\u653b\u6483\u3092\u5b9f\u884c\u3067\u304d\u307e\u3059\u3002HPP\u653b\u6483\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u306f\u65e2\u5b58\u306e\u30cf\u30fc\u30c9\u30b3\u30fc\u30c9\u3055\u308c\u305fHTTP\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4e0a\u66f8\u304d\u3057\u3066\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u52d5\u4f5c\u3092\u5909\u66f4\u3057\u3001\u5165\u529b\u691c\u8a3c\u3092\u8fc2\u56de\u3057\u3066\u3001\u901a\u5e38\u306f\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u5909\u6570\u3078\u306e\u5230\u9054\u30fb\u60aa\u7528\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanbeta.HTTPParamPoll.extrainfo = https\://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/07-Input_Validation_Testing/04-Testing_for_HTTP_Parameter_Pollution
ascanbeta.HTTPParamPoll.name = HTTP\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u6c5a\u67d3
ascanbeta.HTTPParamPoll.sol = \u30e6\u30fc\u30b6\u304c\u5165\u529b\u3057\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u533a\u5207\u308a\u6587\u5b57\u3092\u9069\u5207\u306b\u30b5\u30cb\u30bf\u30a4\u30ba\u3057\u3066\u4e0b\u3055\u3044\u3002

ascanbeta.backupfiledisclosure.desc = Web\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u304c\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002
ascanbeta.backupfiledisclosure.name = \u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u306e\u9732\u898b
ascanbeta.backupfiledisclosure.otherinfo = [{0}] \u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u304c [{1}] \u3067\u5229\u7528\u53ef\u80fd\u3067\u3059
ascanbeta.backupfiledisclosure.refs = https\://cwe.mitre.org/data/definitions/530.html\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/04-Review_Old_Backup_and_Unreferenced_Files_for_Sensitive_Information.html
ascanbeta.backupfiledisclosure.soln = Web\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u306f\u30d5\u30a1\u30a4\u30eb\u3092\u76f4\u63a5\u7de8\u96c6\u305b\u305a\u3001\u307e\u305f\u3001\u4e0d\u8981\u306a\u30d5\u30a1\u30a4\u30eb (\u96a0\u3057\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080) \u304cWeb\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u78ba\u5b9f\u306b\u524a\u9664\u3055\u308c\u3066\u3044\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.cookieslack.affect.response.no = \u3053\u308c\u3089\u306eCookie\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u5f71\u97ff\u3057\u307e\u305b\u3093\u3067\u3057\u305f\: 
ascanbeta.cookieslack.affect.response.yes = \u3053\u308c\u3089\u306eCookie\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u5f71\u97ff\u3092\u4e0e\u3048\u307e\u3057\u305f\: 
ascanbeta.cookieslack.desc = \u7e70\u308a\u8fd4\u3057GET\u30ea\u30af\u30a8\u30b9\u30c8\u5b9f\u884c\: \u6bce\u56de\u7570\u306a\u308bCookie\u3092\u524a\u9664\u3057\u3066\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\u3057\u3001\u7d9a\u3044\u3066\u3059\u3079\u3066\u306eCookie\u3092\u542b\u3080\u901a\u5e38\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u5fa9\u65e7\u3055\u305b\u3001\u5143\u306e\u30d9\u30fc\u30b9\u30e9\u30a4\u30f3GET\u3068\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u6bd4\u8f03\u3057\u307e\u3059\u3002\u3053\u306e\u624b\u6cd5\u306b\u3088\u308a\u3001Cookie\u30d9\u30fc\u30b9\u8a8d\u8a3c\u30fb\u5c5e\u6027\u5236\u5fa1\u304c\u5b9f\u969b\u306b\u306f\u6a5f\u80fd\u3057\u3066\u3044\u306a\u3044\u7b87\u6240\u3092\u7279\u5b9a\u3067\u304d\u307e\u3059\u3002
ascanbeta.cookieslack.endline = \n
ascanbeta.cookieslack.name = Cookie\u30b9\u30e9\u30c3\u30af\u691c\u51fa (Cookie Slack Detector)
ascanbeta.cookieslack.otherinfo.intro = \u671f\u5f85\u3055\u308c\u308b\u52b9\u679c\u3092\u6301\u305f\u306a\u3044Cookie\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b8\u30c3\u30af\u306b\u304a\u3051\u308b\u6b20\u9665\u3092\u660e\u3089\u304b\u306b\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u6700\u60aa\u306e\u5834\u5408\u3001\u3053\u308c\u306fCookie\u30c8\u30fc\u30af\u30f3\u306b\u3088\u308b\u8a8d\u8a3c\u304c\u5b9f\u969b\u306b\u5f37\u5236\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u6240\u3092\u660e\u3089\u304b\u306b\u3059\u308b\u3053\u3068\u306b\u3064\u306a\u304c\u308a\u307e\u3059\u3002
ascanbeta.cookieslack.separator = ,
ascanbeta.cookieslack.session.destroyed = \u3053\u306eCookie\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u306b\u306a\u3063\u305f\u3088\u3046\u3067\u3059\: [{0}]\n\u3059\u3079\u3066\u306e\u5143\u306eCookie\u3092\u542b\u3080\u5f8c\u7d9a\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3082\u3001\u5143\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3068\u306f\u7570\u306a\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.cookieslack.session.warning = \u6ce8\u610f\: \u305d\u306e\u540d\u524d\u304b\u3089\u3053\u306e\u30af\u30c3\u30ad\u30fc\u306f\u91cd\u8981\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u304c\u3001\u524a\u9664\u3057\u3066\u3082\u52b9\u679c\u304c\u306a\u3044\u3088\u3046\u3067\u3059\: [{0}]

ascanbeta.cors.info.desc = \u30aa\u30ea\u30b8\u30f3\u9593\u30ea\u30bd\u30fc\u30b9\u5171\u6709 (CORS) \u306f\u30b5\u30fc\u30d0\u30fc\u304c\u81ea\u8eab\u4ee5\u5916\u306e\u30aa\u30ea\u30b8\u30f3\u304b\u3089\u306e\u30ea\u30bd\u30fc\u30b9\u30a2\u30af\u30bb\u30b9\u3092\u30d6\u30e9\u30a6\u30b6\u306b\u8a31\u53ef\u3059\u308bHTTP\u30d8\u30c3\u30c0\u30fc\u6a5f\u80fd\u3067\u3001\u540c\u4e00\u30aa\u30ea\u30b8\u30f3\u30dd\u30ea\u30b7\u30fc\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u5236\u9650\u3092\u7de9\u548c\u3057\u307e\u3059\u3002
ascanbeta.cors.info.name = CORS\u30d8\u30c3\u30c0\u30fc
ascanbeta.cors.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/CORS\nhttps\://portswigger.net/web-security/cors
ascanbeta.cors.soln = \u6a5f\u5bc6\u60c5\u5831\u3092\u542b\u3080Web\u30ea\u30bd\u30fc\u30b9\u3067\u306f\u3001Access-Control-Allow-Origin \u30d8\u30c3\u30c0\u30fc\u3067\u8a31\u53ef\u3059\u308b\u30aa\u30ea\u30b8\u30f3\u3092\u53b3\u683c\u306b\u5236\u9650\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u5fc5\u8981\u6700\u5c0f\u9650\u306e\u4fe1\u983c\u3067\u304d\u308b\u30b5\u30a4\u30c8\u306e\u307f\u3092\u3001HTTPS\u7b49\u306e\u6700\u3082\u5b89\u5168\u306a\u30d7\u30ed\u30c8\u30b3\u30eb\u3067\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u91cd\u8981\u3067\u3059\u3002
ascanbeta.cors.vuln.desc = \u3053\u306eCORS\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u306f\u88ab\u5bb3\u8005\u306e\u30d6\u30e9\u30a6\u30b6\u306b\u8aad\u307f\u8fbc\u307e\u308c\u305f\u60aa\u610f\u306e\u3042\u308b\u30da\u30fc\u30b8\u304b\u3089\u3001\u8106\u5f31\u306aWeb\u30b5\u30a4\u30c8\u3078Ajax \u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\u8a8d\u8a3c\u60c5\u5831\u3092\u542b\u3080Ajax \u30ea\u30af\u30a8\u30b9\u30c8\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u3067 "Access-Control-Allow-Credentials\: true" \u3092\u8a2d\u5b9a\u3057\u3001"Access-Control-Allow-Origin" \u3092null\u307e\u305f\u306f\u653b\u6483\u8005\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u8a8d\u8a3c\u60c5\u5831\u4ed8\u304d\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u8a31\u53ef\u3055\u308c\u306a\u3044\u5834\u5408\u3067\u3082\u3001\u8a8d\u8a3c\u4e0d\u8981\u306e\u6a5f\u5bc6\u60c5\u5831 (\u30a4\u30f3\u30c8\u30e9\u30cd\u30c3\u30c8\u30b5\u30a4\u30c8\u7b49) \u3078\u306e\u30a2\u30af\u30bb\u30b9\u306f\u53ef\u80fd\u3067\u3059\u3002\u653b\u6483\u306b\u4f7f\u7528\u3055\u308c\u308b\u30da\u30fc\u30b8\u306f\u3001\u60aa\u610f\u306e\u3042\u308b\u30b5\u30a4\u30c8\u306e\u3082\u306e\u3067\u3042\u308b\u5834\u5408\u3082\u3042\u308c\u3070\u3001XSS\u3084TLS\u672a\u5bfe\u5fdc\u306b\u3088\u308bMITM\u653b\u6483\u306a\u3069\u306e\u8106\u5f31\u6027\u3092\u6301\u3064\u4fe1\u983c\u3055\u308c\u305f\u30b5\u30a4\u30c8\u306e\u3082\u306e\u3067\u3042\u308b\u5834\u5408\u3082\u3042\u308a\u307e\u3059\u3002
ascanbeta.cors.vuln.name = CORS\u306e\u8a2d\u5b9a\u30df\u30b9

ascanbeta.crossdomain.adobe.desc = Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u308a\u3001Flash\u307e\u305f\u306fSilverlight\u30d9\u30fc\u30b9\u306e\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u304c\u53ef\u80fd\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.adobe.read.extrainfo = \u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u4efb\u610f\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u914d\u4fe1\u3055\u308c\u308bFlash/Silverlight\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u308b\u60aa\u610f\u306e\u3042\u308b\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u30c7\u30fc\u30bf\u8aad\u307f\u53d6\u308a\u653b\u6483\u3092\u8a31\u53ef\u3059\u308b\u8a2d\u5b9a\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002\u88ab\u5bb3\u8005\u304c\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u6e08\u307f\u306e\u5834\u5408\u3001\u653b\u6483\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u88ab\u5bb3\u8005\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u60aa\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u3001\u653b\u6483\u8005\u306e\u5236\u5fa1\u4e0b\u306b\u3042\u308b\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30b5\u30a4\u30c8\u304c\u88ab\u5bb3\u8005\u306e\u30d6\u30e9\u30a6\u30b6\u7d4c\u7531\u3067\u30c7\u30fc\u30bf\u3092\u4e0d\u6b63\u53d6\u5f97\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u7279\u306bCookie\u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u74b0\u5883\u3067\u306f\u3001\u3053\u306e\u8106\u5f31\u6027\u304c\u9855\u8457\u306b\u73fe\u308c\u307e\u3059\u3002
ascanbeta.crossdomain.adobe.read.name = \u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Read
ascanbeta.crossdomain.adobe.read.soln = crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u8a2d\u5b9a\u3057\u3001\u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u8aad\u307f\u53d6\u308a\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u8a31\u53ef\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u5236\u9650\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u8a2d\u5b9a\u306b\u306f <allow-access-from domain\="example.com"> \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"*"\uff08\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3\uff09\u3078\u306e\u30a2\u30af\u30bb\u30b9\u8a31\u53ef\u306f\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3001\u500b\u4eba\u60c5\u5831\u3001\u307e\u305f\u306f\u6a5f\u5bc6\u30c7\u30fc\u30bf\u3092\u4e00\u5207\u30db\u30b9\u30c8\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u304c\u78ba\u5b9f\u306a\u5834\u5408\u306b\u306e\u307f\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.crossdomain.adobe.send.extrainfo = \u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u4efb\u610f\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u63d0\u4f9b\u3055\u308c\u308b Flash/Silverlight \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u8d77\u56e0\u3059\u308b\u3001\u60aa\u610f\u306e\u3042\u308b\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u3067\u306e\u30c7\u30fc\u30bf\u9001\u4fe1\u30ea\u30af\u30a8\u30b9\u30c8 (\u5fc5\u305a\u3057\u3082\u8aad\u307f\u53d6\u308a\u306f\u5fc5\u8981\u306a\u3044) \u3092\u53d7\u3051\u5165\u308c\u307e\u3059\u3002\n\n\u88ab\u5bb3\u8005\u3068\u306a\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u5834\u5408\u3001\u305d\u306e\u60aa\u610f\u306e\u3042\u308b\u9001\u4fe1\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u88ab\u5bb3\u8005\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u4f7f\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u3001Web\u30d6\u30e9\u30a6\u30b6\u3092\u4ecb\u3057\u3066CSRF (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea) \u653b\u6483\u3092\u5f15\u304d\u8d77\u3053\u3059\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\n\u3053\u308c\u306f\u3001Cookie\u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u5b9f\u88c5\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u3001\u7279\u306b\u767a\u751f\u3057\u3084\u3059\u3044\u554f\u984c\u3067\u3059\u3002
ascanbeta.crossdomain.adobe.send.name = \u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Send
ascanbeta.crossdomain.adobe.send.soln = crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u8a2d\u5b9a\u3057\u3001\u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3059\u308b\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u9001\u4fe1\u30ea\u30af\u30a8\u30b9\u30c8 (\u8aad\u307f\u53d6\u308a\u306f\u5fc5\u305a\u3057\u3082\u8a31\u53ef\u3055\u308c\u306a\u3044) \u3092\u8a31\u53ef\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u5236\u9650\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u8a2d\u5b9a\u306b\u306f <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh"> \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"*"\uff08\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3\uff09\u3078\u306e\u30a2\u30af\u30bb\u30b9\u8a31\u53ef\u306f\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u304cCSRF (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea) \u653b\u6483\u306b\u5bfe\u3057\u3066\u8106\u5f31\u3067\u306a\u3044\u3053\u3068\u304c\u78ba\u5b9f\u306a\u5834\u5408\u306b\u306e\u307f\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.crossdomain.name = \u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u8a2d\u5b9a\u30df\u30b9
ascanbeta.crossdomain.refs = https\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc197955(v\=vs.95)\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc838250(v\=vs.95)
ascanbeta.crossdomain.silverlight.desc = Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u308a\u3001Silverlight\u30d9\u30fc\u30b9\u306eCSRF (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea) \u653b\u6483\u304c\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.crossdomain.silverlight.extrainfo = \u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u4efb\u610f\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u63d0\u4f9b\u3055\u308c\u308b Silverlight \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u8d77\u56e0\u3059\u308b\u3001\u60aa\u610f\u306e\u3042\u308b\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u53d7\u3051\u5165\u308c\u307e\u3059\u3002\n\n\u88ab\u5bb3\u8005\u3068\u306a\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u5834\u5408\u3001\u305d\u306e\u60aa\u610f\u306e\u3042\u308b\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u88ab\u5bb3\u8005\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u4f7f\u7528\u3057\u3066\u51e6\u7406\u3055\u308c\u3001\u88ab\u5bb3\u8005\u306eWeb\u30d6\u30e9\u30a6\u30b6\u3092\u4ecb\u3057\u3066\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306e\u30c7\u30fc\u30bf\u304c\u4e0d\u6b63\u306a\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3Web\u30b5\u30a4\u30c8\u306b\u3088\u3063\u3066\u7a83\u53d6\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\n\u307e\u305f\u3001CSRF (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea) \u653b\u6483\u3092\u5f15\u304d\u8d77\u3053\u3059\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u3001Cookie\u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u5b9f\u88c5\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u3001\u7279\u306b\u767a\u751f\u3057\u3084\u3059\u3044\u554f\u984c\u3067\u3059\u3002
ascanbeta.crossdomain.silverlight.name = \u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Silverlight
ascanbeta.crossdomain.silverlight.soln = crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u8a2d\u5b9a\u3057\u3001\u3053\u306eWeb\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u884c\u3046\u3053\u3068\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u5236\u9650\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u8a2d\u5b9a\u306b\u306f <domain uri\="https\://example.com" /> \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\n"*"\uff08\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3\uff09\u3078\u306e\u30a2\u30af\u30bb\u30b9\u8a31\u53ef\u306f\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3001\u500b\u4eba\u60c5\u5831\u3001\u307e\u305f\u306f\u6a5f\u5bc6\u30c7\u30fc\u30bf\u3092\u4e00\u5207\u30db\u30b9\u30c8\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u304c\u78ba\u5b9f\u306a\u5834\u5408\u306b\u306e\u307f\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.csrftoken.extrainfo.annotation = \u3053\u306e\u30d5\u30a9\u30fc\u30e0\u306b\u306fAnti-CSRF\u30c8\u30fc\u30af\u30f3\u3092\u5fc5\u8981\u3068\u3057\u306a\u3044\u3053\u3068\u3092\u793a\u3059\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6ce8\u91c8\u304c\u3042\u308b\u305f\u3081\u3001\u3053\u308c\u306f\u60c5\u5831\u30ec\u30d9\u30eb\u306e\u30a2\u30e9\u30fc\u30c8\u3067\u3059\u3002\n\u3053\u306e\u6ce8\u91c8\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u3001\u624b\u52d5\u3067\u30c6\u30b9\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.csrftoken.name = Anti-CSRF\u30c8\u30fc\u30af\u30f3\u30c1\u30a7\u30c3\u30af

ascanbeta.desc = \u30d9\u30fc\u30bf\u7248\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

ascanbeta.elinjection.desc = \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306f\u4e0a\u6d41\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u306e\u5916\u90e8\u5165\u529b\u3092\u4f7f\u7528\u3057\u3066\u3001Java Server Page (JSP) \u5185\u306e\u5f0f\u8a00\u8a9e (EL) \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5168\u4f53\u307e\u305f\u306f\u4e00\u90e8\u3092\u69cb\u7bc9\u3057\u307e\u3059\u304c\u3001\u5b9f\u884c\u524d\u306b\u610f\u56f3\u3055\u308c\u305fEL\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u5909\u66f4\u3059\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u7279\u6b8a\u306a\u8981\u7d20\u3092\u7121\u5bb3\u5316\u3057\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u4e0d\u9069\u5207\u306b\u7121\u5bb3\u5316\u3057\u3066\u3044\u307e\u3059\u3002\n\nSpring 3.0.5 \u4ee5\u524d\u306e\u7279\u5b9a\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u306f\u3001\u5f0f\u8a00\u8a9e\u30bf\u30b0\u304c2\u5ea6\u8a55\u4fa1\u3055\u308c\u308b\u8106\u5f31\u6027 (CVE-2011-2730) \u304c\u3042\u308a\u3001\u7d50\u679c\u3068\u3057\u3066\u3059\u3079\u3066\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304cEL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u5371\u967a\u306b\u6652\u3055\u308c\u3066\u3044\u307e\u3057\u305f\u3002\u3057\u304b\u3057\u3001\u305d\u308c\u4ee5\u964d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3082\u3001\u69cb\u6210\u306b\u3088\u3063\u3066\u306f\u3053\u306e\u8106\u5f31\u6027\u304c\u4f9d\u7136\u3068\u3057\u3066\u5b58\u5728\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.elinjection.name = EL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanbeta.elinjection.refs = https\://owasp.org/www-community/vulnerabilities/Expression_Language_Injection\nhttps\://cwe.mitre.org/data/definitions/917.html
ascanbeta.elinjection.soln = \u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u306b\u5bfe\u3059\u308b\u30c7\u30fc\u30bf\u691c\u8a3c\u306e\u30d9\u30b9\u30c8\u30d7\u30e9\u30af\u30c6\u30a3\u30b9\u3092\u9069\u7528\u3057\u3001\u30c7\u30fc\u30bf\u304cEL (\u5f0f\u8a00\u8a9e) \u30ec\u30a4\u30e4\u30fc\u306b\u5230\u9054\u3057\u305f\u969b\u306b\u51fa\u529b\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u304c\u9069\u7528\u3055\u308c\u308b\u3053\u3068\u3092\u78ba\u5b9f\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u8a55\u4fa1\u524d\u306b\u30a4\u30f3\u30bf\u30fc\u30d7\u30ea\u30bf\u304c\u30e6\u30fc\u30b6\u30fc\u30b3\u30f3\u30c6\u30f3\u30c4\u5185\u306e\u30e1\u30bf\u6587\u5b57\u3092\u691c\u51fa\u3057\u306a\u3044\u3088\u3046\u306b\u3057\u307e\u3059\u3002\n\u6700\u3082\u660e\u767d\u306a\u691c\u51fa\u30d1\u30bf\u30fc\u30f3\u306b\u306f ${ \u3084 \#{ \u304c\u542b\u307e\u308c\u307e\u3059\u304c\u3001\u3053\u306e\u30c7\u30fc\u30bf\u306f\u30a8\u30f3\u30b3\u30fc\u30c9\u307e\u305f\u306f\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

ascanbeta.entityExpansion.desc = \u6307\u6570\u95a2\u6570\u7684\u306a\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u5c55\u958b\u3001\u307e\u305f\u306f\u300c\u30d3\u30ea\u30aa\u30f3\u30fb\u30e9\u30d5\u30ba\u300d\u653b\u6483\u306f\u3001\u30b5\u30fc\u30d3\u30b9\u59a8\u5bb3 (DoS) \u653b\u6483\u306e\u4e00\u7a2e\u3067\u3059\u3002\u3053\u308c\u306f\u3001XML\u3084YAML\u306e\u3088\u3046\u306a\u30de\u30fc\u30af\u30a2\u30c3\u30d7\u8a00\u8a9e\u306e\u3001\u30de\u30af\u30ed\u5c55\u958b\u3092\u8a31\u53ef\u3059\u308b\u30d1\u30fc\u30b5\u30fc\u3092\u6a19\u7684\u3068\u3057\u3066\u3044\u307e\u3059\u3002
ascanbeta.entityExpansion.name = \u6307\u6570\u95a2\u6570\u7684\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u5c55\u958b\uff08Billion Laughs\u653b\u6483\uff09
ascanbeta.entityExpansion.other = \u653b\u6483HTTP\u30ea\u30af\u30a8\u30b9\u30c8\u306f {0}\u79d2\u5f8c\u306b\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
ascanbeta.entityExpansion.refs = https\://ja.wikipedia.org/wiki/Billion_laughs%E6%94%BB%E6%92%83\nhttps\://owasp.org/www-community/vulnerabilities/XML_External_Entity_(XXE)_Processing\nhttps\://cwe.mitre.org/data/definitions/776.html
ascanbeta.entityExpansion.soln = \u3053\u306e\u653b\u6483\u3078\u306e\u5bfe\u7b56\u3068\u3057\u3066\u3001\u6587\u66f8\u306e\u4e00\u90e8\u640d\u5931\u304c\u8a31\u5bb9\u3067\u304d\u308b\u5834\u5408\u306f\u30d1\u30fc\u30b5\u30fc\u306e\u30e1\u30e2\u30ea\u4f7f\u7528\u91cf\u306b\u4e0a\u9650\u3092\u8a2d\u5b9a\u3059\u308b\u65b9\u6cd5\u3001\u307e\u305f\u306fXML\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3092\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u306b\u51e6\u7406\u3057\u3001\u5b9f\u969b\u306b\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u5fc5\u8981\u3068\u306a\u3063\u305f\u6642\u70b9\u3067\u306e\u307f\u5fc5\u8981\u306a\u90e8\u5206\u3060\u3051\u3092\u5c55\u958b\u3059\u308b\u9045\u5ef6\u8a55\u4fa1\u65b9\u5f0f\u304c\u3042\u308a\u307e\u3059\u3002

ascanbeta.forbiddenBypass.desc = 403 \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u30d0\u30a4\u30d1\u30b9\u304c\u53ef\u80fd\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u304c\u30da\u30a4\u30ed\u30fc\u30c9\u3092\u9001\u4fe1\u3057\u305f\u3068\u3053\u308d\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306b\u306a\u308a\u307e\u3057\u305f (\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9 200)\u3002
ascanbeta.forbiddenBypass.name = 403\u306e\u30d0\u30a4\u30d1\u30b9
ascanbeta.forbiddenBypass.refs = https\://www.acunetix.com/blog/articles/a-fresh-look-on-reverse-proxy-related-attacks/\nhttps\://i.blackhat.com/us-18/Wed-August-8/us-18-Orange-Tsai-Breaking-Parser-Logic-Take-Your-Path-Normalization-Off-And-Pop-0days-Out-2.pdf\nhttps\://seclists.org/fulldisclosure/2011/Oct/273

ascanbeta.httponlysite.desc = \u30b5\u30a4\u30c8\u306fHTTPS\u3067\u306f\u306a\u304fHTTP\u306e\u307f\u3067\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u3059\u3002
ascanbeta.httponlysite.name = HTTP\u306e\u307f\u306e\u30b5\u30a4\u30c8
ascanbeta.httponlysite.otherinfo = {0}\nZAP\u306f {1} \u3092\u4ecb\u3057\u3066\u63a5\u7d9a\u3092\u8a66\u307f\u307e\u3057\u305f\u3002
ascanbeta.httponlysite.otherinfo.connectionfail = \u63a5\u7d9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
ascanbeta.httponlysite.otherinfo.differenthosts = \u7570\u306a\u308b\u30db\u30b9\u30c8
ascanbeta.httponlysite.otherinfo.noredirection = \u81ea\u52d5\u7684\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
ascanbeta.httponlysite.otherinfo.nossl = \u30b5\u30a4\u30c8\u306fSSL/TLS\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
ascanbeta.httponlysite.otherinfo.redirectionlimit = \u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u5236\u9650\u306b\u9054\u3057\u307e\u3057\u305f\u3002
ascanbeta.httponlysite.otherinfo.redirecttohttp = HTTP\u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.httponlysite.otherinfo.urinotencoded = \u30ea\u30c0\u30a4\u30ec\u30af\u30c8URI\u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
ascanbeta.httponlysite.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\nhttps\://letsencrypt.org/
ascanbeta.httponlysite.soln = Web\u30b5\u30fc\u30d0\u30fc\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3092SSL (https) \u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.httpoxy.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u30ea\u30af\u30a8\u30b9\u30c8\u306eHTTP Proxy\u30d8\u30c3\u30c0\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30ad\u30b7\u3092\u4f7f\u7528\u3057\u3066\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002Httpoxy\u8106\u5f31\u6027\u306f\u4e3b\u306bCGI\u304a\u3088\u3073\u985e\u4f3c\u306e\u5b9f\u884c\u74b0\u5883\u306b\u5f71\u97ff\u3057\u3001\u653b\u6483\u8005\u306b\u4ee5\u4e0b\u306e\u60aa\u7528\u3092\u8a31\u53ef\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\uff1a\n* Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5916\u90e8HTTP\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u653b\u6483\u8005\u306e\u30d7\u30ed\u30ad\u30b7\u7d4c\u7531\u3067\u5b9f\u884c\n* \u653b\u6483\u8005\u304c\u6307\u5b9a\u3057\u305fIP\u30a2\u30c9\u30ec\u30b9\u30fb\u30dd\u30fc\u30c8\u3078\u306e\u4e0d\u6b63\u306a\u5916\u90e8\u63a5\u7d9a\u3092\u5f37\u5236\n* \u60aa\u610f\u306e\u3042\u308b\u30d7\u30ed\u30ad\u30b7\u3092\u7d4c\u7531\u3055\u305b\u308b\u3053\u3068\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u30ea\u30bd\u30fc\u30b9\u306e\u67af\u6e07\u653b\u6483
ascanbeta.httpoxy.name = Httpoxy - Proxy\u30d8\u30c3\u30c0\u30fc\u306e\u8aa4\u7528
ascanbeta.httpoxy.otherinfo = {0} \u3078\u306e\u9001\u4fe1\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001ZAP \u304c HTTP Proxy \u30d8\u30c3\u30c0\u30fc\u306b\u6ce8\u5165\u3057\u305f\u30db\u30b9\u30c8\u3068\u30dd\u30fc\u30c8\u3092\u4ecb\u3057\u3066\u30d7\u30ed\u30ad\u30b7\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.httpoxy.refs = https\://httpoxy.org/
ascanbeta.httpoxy.skipped = \u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u62e1\u5f35\u6a5f\u80fd\u304c\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
ascanbeta.httpoxy.soln = \u6700\u3082\u52b9\u679c\u7684\u3067\u5373\u6642\u7684\u306a\u7de9\u548c\u7b56\u306f\u3001Proxy\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30fc\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5230\u9054\u3059\u308b\u524d\u306b\u3001\u3067\u304d\u308b\u3060\u3051\u65e9\u3044\u6bb5\u968e\u3067\u30d6\u30ed\u30c3\u30af\u3059\u308b\u3053\u3068\u3067\u3059\u3002\n

ascanbeta.httpsashttp.desc = \u6700\u521d\u306bHTTPS (SSL/TLS\u6697\u53f7\u5316\u3092\u4f7f\u7528) \u3067\u30a2\u30af\u30bb\u30b9\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u3001HTTP (\u6697\u53f7\u5316\u306a\u3057) \u3067\u3082\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3067\u3059\u3002
ascanbeta.httpsashttp.name = HTTPS\u30b3\u30f3\u30c6\u30f3\u30c4\u304cHTTP\u7d4c\u7531\u3067\u30a2\u30af\u30bb\u30b9\u53ef\u80fd
ascanbeta.httpsashttp.otherinfo = ZAP\u306f {0} \u3092\u4ecb\u3057\u3066\u63a5\u7d9a\u3092\u8a66\u307f\u307e\u3057\u305f\u3002
ascanbeta.httpsashttp.refs = https\://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\nhttps\://owasp.org/www-community/Security_Headers\nhttps\://ja.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttps\://caniuse.com/stricttransportsecurity\nhttps\://datatracker.ietf.org/doc/html/rfc6797
ascanbeta.httpsashttp.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001\u305d\u306e\u3088\u3046\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u3092HTTPS\u7d4c\u7531\u3067\u306e\u307f\u63d0\u4f9b\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u307e\u305f\u3001HTTP Strict Transport Security (HSTS) \u306e\u5b9f\u88c5\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.insecurehttpmethod.connect.exploitable.desc = \u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9 [{0}] \u304c\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u3067\u6709\u52b9\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u60aa\u7528\u304c\u53ef\u80fd\u3067\u3059\u3002\u3053\u306eHTTP\u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u7b2c\u4e09\u8005\u306e\u30b5\u30fc\u30d3\u30b9\u3078\u306e\u30c8\u30f3\u30cd\u30eb\u5316\u3055\u308c\u305f\u30bd\u30b1\u30c3\u30c8\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u308b\u3053\u3068\u304c\u5224\u660e\u3057\u307e\u3057\u305f\u3002\n\n\u3053\u308c\u306b\u3088\u308a\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9 (\u30b5\u30fc\u30d0\u30fc) \u304c\u533f\u540d\u306e\u30b9\u30d1\u30e0\u4e2d\u7d99\u3084\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5236\u9650\u3092\u56de\u907f\u3059\u308b\u305f\u3081\u306eWeb\u30d7\u30ed\u30ad\u30b7\u3068\u3057\u3066\u5229\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u30c8\u30f3\u30cd\u30eb\u5316\u3055\u308c\u305fVPN\u3092\u78ba\u7acb\u3059\u308b\u305f\u3081\u306b\u3082\u5229\u7528\u3067\u304d\u3001\u4fe1\u983c\u3067\u304d\u306a\u3044\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5883\u754c\u5185\u306b\u542b\u3081\u308b\u5f62\u3067\u3001\u4e8b\u5b9f\u4e0a\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5883\u754c\u3092\u62e1\u5f35\u3057\u3066\u3057\u307e\u3044\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo = Web\u30b5\u30fc\u30d0\u30fc\u3092\u4ecb\u3057\u3066\u3001[{0}] \u3078\u306e\u30bd\u30b1\u30c3\u30c8\u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u305f\u3081\u306b CONNECT \u30e1\u30bd\u30c3\u30c9\u304c\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.insecurehttpmethod.delete.exploitable.desc = \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u3001REST\u30b5\u30fc\u30d3\u30b9\u3067\u6700\u3082\u4e00\u822c\u7684\u306b\u4f7f\u7528\u3055\u308c\u3001\u30ea\u30bd\u30fc\u30b9\u3092\u524a\u9664\u3059\u308b\u305f\u3081\u306b\u4f7f\u308f\u308c\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.delete.exploitable.extrainfo = \u30b9\u30bf\u30c3\u30af\u30fb\u30a8\u30af\u30b9\u30c1\u30a7\u30f3\u30b8\u3067\u306e\u8b70\u8ad6\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nhttps\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.desc = \u3053\u306e\u30ea\u30bd\u30fc\u30b9\u306eWeb\u30b5\u30fc\u30d0\u30fc\u3067\u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9 [{0}] \u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u304a\u3088\u3073\u30ea\u30bd\u30fc\u30b9\u63d0\u4f9b\u3092\u62c5\u5f53\u3059\u308b\u57fa\u76e4\u5b9f\u88c5\u306b\u3088\u3063\u3066\u3001\u3053\u308c\u304c\u60aa\u7528\u53ef\u80fd\u304b\u3069\u3046\u304b\u306f\u6c7a\u307e\u308a\u307e\u3059\u3002TRACK \u304a\u3088\u3073 TRACE \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u304c\u300cHttpOnly\u300d\u30d5\u30e9\u30b0\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3067\u3082\u3001\u653b\u6483\u8005\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u30c8\u30fc\u30af\u30f3\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u653b\u6483\u304c\u6210\u529f\u3059\u308b\u306b\u306f\u3001\u901a\u5e38\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30e6\u30fc\u30b6\u30fc\u304c\u53e4\u3044Web\u30d6\u30e9\u30a6\u30b6\u3001\u307e\u305f\u306f\u540c\u4e00\u30aa\u30ea\u30b8\u30f3\u30dd\u30ea\u30b7\u30fc (SOP) \u30d0\u30a4\u30d1\u30b9\u8106\u5f31\u6027\u3092\u6301\u3064Web\u30d6\u30e9\u30a6\u30b6\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u300cCONNECT\u300d\u30e1\u30bd\u30c3\u30c9\u306f\u3001Web\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u306eWeb\u30b5\u30a4\u30c8\u3084\u30b5\u30fc\u30d3\u30b9\u3078\u306eHTTP\u30c8\u30f3\u30cd\u30eb\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.detailed.name = \u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9 - {0}
ascanbeta.insecurehttpmethod.extrainfo = OPTIONS \u30e1\u30bd\u30c3\u30c9\u306b\u3088\u308a\u3001\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u3067\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u4ee5\u4e0b\u306eHTTP\u30e1\u30bd\u30c3\u30c9\u304c\u516c\u958b\u3055\u308c\u307e\u3057\u305f\: [{0}]
ascanbeta.insecurehttpmethod.insecure = \u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9\u306b\u5bfe\u3059\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30fc\u30c9\u306f {0} \u3067\u3059\u3002
ascanbeta.insecurehttpmethod.name = \u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9
ascanbeta.insecurehttpmethod.options.exploitable.desc = \u3053\u308c\u306f\u8a3a\u65ad\u30e1\u30bd\u30c3\u30c9\u3067\u3042\u308a\u3001\u672c\u756a\u74b0\u5883 (\u30d7\u30ed\u30c0\u30af\u30b7\u30e7\u30f3\u30e2\u30fc\u30c9) \u3067\u306f\u6c7a\u3057\u3066\u6709\u52b9\u306b\u3059\u3079\u304d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ascanbeta.insecurehttpmethod.options.exploitable.extrainfo = \u30b9\u30bf\u30c3\u30af\u30fb\u30a8\u30af\u30b9\u30c1\u30a7\u30f3\u30b8\u3067\u306e\u8b70\u8ad6\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nhttps\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.patch.exploitable.desc = \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u73fe\u5728\u3001REST\u30b5\u30fc\u30d3\u30b9\u3067\u6700\u3082\u4e00\u822c\u7684\u306b\u4f7f\u7528\u3055\u308c\u3066\u304a\u308a\u3001**\u5909\u66f4**\u6a5f\u80fd\u306b\u7528\u3044\u3089\u308c\u307e\u3059\u3002PATCH \u30ea\u30af\u30a8\u30b9\u30c8\u306f\u3001\u30ea\u30bd\u30fc\u30b9\u5168\u4f53\u3067\u306f\u306a\u304f\u3001\u5909\u66f4\u70b9\u306e\u307f\u3092\u542b\u3080\u3060\u3051\u3067\u6e08\u307f\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.patch.exploitable.extrainfo = \u30b9\u30bf\u30c3\u30af\u30fb\u30a8\u30af\u30b9\u30c1\u30a7\u30f3\u30b8\u3067\u306e\u8b70\u8ad6\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nhttps\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.potentiallyinsecure = \u6f5c\u5728\u7684\u306b\u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9\u306b\u5bfe\u3059\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30fc\u30c9\u306f {0} \u3067\u3059\u3002
ascanbeta.insecurehttpmethod.put.exploitable.desc = PUT \u30e1\u30bd\u30c3\u30c9\u306f\u5f53\u521d\u30d5\u30a1\u30a4\u30eb\u7ba1\u7406\u3092\u76ee\u7684\u3068\u3057\u3066\u8a2d\u8a08\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u73fe\u5728\u3067\u306fREST\u30b5\u30fc\u30d3\u30b9\u306b\u304a\u3051\u308b**\u30ea\u30bd\u30fc\u30b9\u66f4\u65b0**\u64cd\u4f5c\u3067\u5e83\u304f\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u5178\u578b\u7684\u306a\u5229\u7528\u65b9\u6cd5\u3067\u306f\u3001\u65e2\u5b58\u306e\u30ea\u30bd\u30fc\u30b9URI\u306b\u5bfe\u3057\u3066PUT\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\u3057\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u30dc\u30c7\u30a3\u306b\u66f4\u65b0\u5f8c\u306e\u30ea\u30bd\u30fc\u30b9\u30c7\u30fc\u30bf\u3092\u542b\u3081\u3066\u30ea\u30bd\u30fc\u30b9\u306e\u72b6\u614b\u3092\u5909\u66f4\u3057\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.put.exploitable.extrainfo = \u30b9\u30bf\u30c3\u30af\u30fb\u30a8\u30af\u30b9\u30c1\u30a7\u30f3\u30b8\u3067\u306e\u8b70\u8ad6\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nhttps\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.soln = Web\u30b5\u30fc\u30d0\u30fc\u3067\u3001TRACK\u3001TRACE\u3001CONNECT\u3068\u3044\u3063\u305f\u5b89\u5168\u3067\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u7121\u52b9\u5316\u3057\u3001\u57fa\u76e4\u3068\u306a\u308b\u30b5\u30fc\u30d3\u30b9\u5b9f\u88c5\u304c\u5b89\u5168\u3067\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.insecurehttpmethod.trace.exploitable.desc = \u3053\u306e\u30ea\u30bd\u30fc\u30b9\u3067\u5b89\u5168\u3067\u306a\u3044HTTP\u30e1\u30bd\u30c3\u30c9 [{0}] \u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u60aa\u7528\u53ef\u80fd\u3067\u3059\u3002TRACK \u304a\u3088\u3073 TRACE \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u304c\u300cHttpOnly\u300d\u30d5\u30e9\u30b0\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3067\u3082\u3001\u653b\u6483\u8005\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u30c8\u30fc\u30af\u30f3\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u653b\u6483\u304c\u6210\u529f\u3059\u308b\u306b\u306f\u3001\u901a\u5e38\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30e6\u30fc\u30b6\u30fc\u304c\u53e4\u3044Web\u30d6\u30e9\u30a6\u30b6\u3001\u307e\u305f\u306f\u540c\u4e00\u30aa\u30ea\u30b8\u30f3\u30dd\u30ea\u30b7\u30fc (SOP) \u30d0\u30a4\u30d1\u30b9\u8106\u5f31\u6027\u3092\u6301\u3064Web\u30d6\u30e9\u30a6\u30b6\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo = \u3053\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u30ab\u30b9\u30bf\u30e0Cookie\u5024 [{0}] \u3092\u542b\u3080TRACE\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u9001\u4fe1\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306eCookie\u5024\u304cHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u958b\u793a\u3055\u308c\u3001\u8106\u5f31\u6027\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.insecurehttpmethod.webdav.exploitable.desc = \u3053\u306eHTTP\u30e1\u30bd\u30c3\u30c9\u306f WEBDAV \u30e1\u30bd\u30c3\u30c9\u3067\u3059\: {0}\u3002\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u304cWEBDAV\u30b5\u30fc\u30d3\u30b9\u3092\u63d0\u4f9b\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u3053\u308c\u3089\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u5229\u7528\u53ef\u80fd\u3067\u3042\u308b\u3079\u304d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ascanbeta.insecurehttpmethod.webdav.exploitable.extrainfo = \u30b9\u30bf\u30c3\u30af\u30fb\u30a8\u30af\u30b9\u30c1\u30a7\u30f3\u30b8\u3067\u306e\u8b70\u8ad6\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nhttps\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods

ascanbeta.integeroverflow.desc = \u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u305f\u30d7\u30ed\u30b0\u30e9\u30e0\u3067\u4f7f\u7528\u3055\u308c\u308b\u6574\u6570\u304c\u3001\u7bc4\u56f2\u306e\u9650\u754c\u3092\u8d85\u3048\u3066\u304a\u308a\u3001\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304b\u3089\u9069\u5207\u306b\u30c1\u30a7\u30c3\u30af\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306b\u3001\u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u72b6\u614b\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
ascanbeta.integeroverflow.error1 = \u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u9577\u3044\u30e9\u30f3\u30c0\u30e0\u306a\u6574\u6570\u306e\u6587\u5b57\u5217\u3092\u5165\u529b\u3059\u308b\u3068\u3001\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.integeroverflow.error2 = \u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u9577\u3044\u30bc\u30ed\u306e\u6587\u5b57\u5217\u3092\u5165\u529b\u3059\u308b\u3068\u3001\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.integeroverflow.error3 = \u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u9577\u30441\u306e\u6587\u5b57\u5217\u3092\u5165\u529b\u3059\u308b\u3068\u3001\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.integeroverflow.error4 = \u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u9577\u30449\u306e\u6587\u5b57\u5217\u3092\u5165\u529b\u3059\u308b\u3068\u3001\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.integeroverflow.name = \u6574\u6570\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u30a8\u30e9\u30fc
ascanbeta.integeroverflow.refs = https\://en.wikipedia.org/wiki/Integer_overflow\nhttps\://cwe.mitre.org/data/definitions/190.html
ascanbeta.integeroverflow.soln = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306e\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u304a\u3088\u30730\u9664\u7b97\u30a8\u30e9\u30fc\u3092\u9632\u6b62\u3059\u308b\u305f\u3081\u306b\u3001\u51e6\u7406\u3055\u308c\u308b\u6574\u6570\u5024\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8a31\u53ef\u7bc4\u56f2\u5185\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u3088\u3046\u3001\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u66f8\u304d\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u306f\u3001\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306e\u518d\u30b3\u30f3\u30d1\u30a4\u30eb\u304c\u5fc5\u8981\u306b\u306a\u308a\u307e\u3059\u3002

ascanbeta.name = \u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb - Beta

ascanbeta.noanticsrftokens.desc = HTML \u9001\u4fe1\u30d5\u30a9\u30fc\u30e0\u3067Anti-CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
ascanbeta.noanticsrftokens.name = Anti-CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044

ascanbeta.oobxss.name = \u30a2\u30a6\u30c8\u30aa\u30d6\u30d0\u30f3\u30c9XSS
ascanbeta.oobxss.skipped = Active Scan OAST\u30b5\u30fc\u30d3\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093

ascanbeta.proxydisclosure.attack = TRACE\u3001OPTIONS\u30e1\u30bd\u30c3\u30c9 (Max-Forwards \u30d8\u30c3\u30c0\u30fc\u4ed8\u304d)\u3002TRACK\u30e1\u30bd\u30c3\u30c9\u3002
ascanbeta.proxydisclosure.desc = {0}\u53f0\u306e\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u304c\u691c\u51fa\u307e\u305f\u306f\u30d5\u30a3\u30f3\u30ac\u30fc\u30d7\u30ea\u30f3\u30c8\u3055\u308c\u307e\u3057\u305f\u3002\n\u3053\u306e\u60c5\u5831\u306f\u6f5c\u5728\u7684\u306a\u653b\u6483\u8005\u304c\u4ee5\u4e0b\u3092\u5224\u65ad\u3059\u308b\u306e\u306b\u5f79\u7acb\u3061\u307e\u3059\uff1a\n - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b\u653b\u6483\u306e\u6a19\u7684\u30ea\u30b9\u30c8\n - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30b5\u30fc\u30d3\u30b9\u3092\u63d0\u4f9b\u3059\u308b\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u306e\u6f5c\u5728\u7684\u8106\u5f31\u6027\n - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b\u653b\u6483\u3092\u691c\u51fa\u3001\u9632\u6b62\u3001\u307e\u305f\u306f\u8efd\u6e1b\u3059\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u30d7\u30ed\u30ad\u30b7\u30d9\u30fc\u30b9\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u6709\u7121
ascanbeta.proxydisclosure.extrainfo.proxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.proxyserver.header = TRACE\u3001OPTIONS\u3001TRACK \u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u3001ZAP \u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3/Web\u30b5\u30fc\u30d0\u30fc\u306e\u9593\u306b\u4ee5\u4e0b\u306e\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u304c\u7279\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.proxydisclosure.extrainfo.silentproxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.silentproxyserver.header = \u4ee5\u4e0b\u306e\u300c\u30b5\u30a4\u30ec\u30f3\u30c8\u300d\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u304c\u7279\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u305d\u308c\u3089\u306e\u632f\u308b\u821e\u3044\u306b\u3088\u308a\u3001\u3053\u308c\u3089\u306e\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u304c\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30c8\u30dd\u30ed\u30b8\u30fc\u306e\u3069\u306e\u5730\u70b9\u306b\u5b58\u5728\u3059\u308b\u304b\u306f\u4e0d\u660e\u3067\u3059\u3002
ascanbeta.proxydisclosure.extrainfo.traceenabled = \u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u307e\u305f\u306f\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u3067\u300cTRACE\u300dHTTP\u30e1\u30bd\u30c3\u30c9\u304c\u6709\u52b9\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002TRACE\u30e1\u30bd\u30c3\u30c9\u306fWeb\u30d6\u30e9\u30a6\u30b6\u304b\u3089\u9001\u4fe1\u3055\u308c\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u5185\u5bb9 (\u30d8\u30c3\u30c0\u30fc\u60c5\u5831\u3092\u542b\u3080) \u3092\u305d\u306e\u307e\u307e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u8fd4\u9001\u3059\u308b\u305f\u3081\u3001\u6a5f\u5bc6\u60c5\u5831\u306e\u6f0f\u6d29\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u300c\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30c8\u30ec\u30fc\u30b7\u30f3\u30b0 (XST)\u300d\u653b\u6483\u304c\u5b9f\u884c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.proxydisclosure.extrainfo.unknown = \u4e0d\u660e
ascanbeta.proxydisclosure.extrainfo.webserver = - {0}
ascanbeta.proxydisclosure.extrainfo.webserver.header = \u4ee5\u4e0b\u306eWeb/\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u304c\u7279\u5b9a\u3055\u308c\u307e\u3057\u305f\uff1a
ascanbeta.proxydisclosure.name = \u30d7\u30ed\u30ad\u30b7\u60c5\u5831\u306e\u9732\u898b
ascanbeta.proxydisclosure.refs = https\://datatracker.ietf.org/doc/html/rfc7231\#section-5.1.2
ascanbeta.proxydisclosure.soln = HTTP\u30e1\u30bd\u30c3\u30c9\u8a2d\u5b9a\uff1a\n\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u30fb\u30aa\u30ea\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u3067\u300cTRACE\u300d\u30e1\u30bd\u30c3\u30c9\u3092\u7121\u52b9\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u300cOPTIONS\u300d\u30e1\u30bd\u30c3\u30c9\u306b\u3064\u3044\u3066\u306f\u3001CORS (\u30aa\u30ea\u30b8\u30f3\u9593\u30ea\u30bd\u30fc\u30b9\u5171\u6709) \u7b49\u3067\u5fc5\u8981\u3067\u306a\u3051\u308c\u3070\u540c\u69d8\u306b\u7121\u52b9\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u8a2d\u5b9a\uff1a\n\u30ab\u30b9\u30bf\u30e0\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u3092\u8a2d\u5b9a\u3057\u3001\u5b58\u5728\u3057\u306a\u3044\u30da\u30fc\u30b8\u3078\u306e\u300cTRACK\u300d\u30ea\u30af\u30a8\u30b9\u30c8\u7b49\u306eHTTP\u30a8\u30e9\u30fc\u6642\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u88fd\u54c1\u3092\u7279\u5b9a\u53ef\u80fd\u306a\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u306e\u8868\u793a\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30d8\u30c3\u30c0\u30fc\u60c5\u5831\u306e\u79d8\u533f\uff1a\n\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc (\u30d7\u30ed\u30ad\u30b7\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fbWeb) \u3067\u300cServer\u300d\u3001\u300cX-Powered-By\u300d\u30d8\u30c3\u30c0\u30fc\u304b\u3089\u306e\u6280\u8853\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u60c5\u5831\u6f0f\u6d29\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.relativepathconfusion.desc = \u76f8\u5bfeURL\u30fb\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u6df7\u540c\u8106\u5f31\u6027\u691c\u51fa\uff1a\n\u554f\u984c\: \u30b5\u30fc\u30d0\u30fc\u306e\u66d6\u6627\u306aURL\u51e6\u7406\u3068\u76f8\u5bfeURL\u4f7f\u7528\u306b\u3088\u308a\u3001\u30d6\u30e9\u30a6\u30b6\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u89e3\u91c8\u306b\u6df7\u4e71\u304c\u751f\u3058\u3066\u3044\u307e\u3059\u3002\n\n\u653b\u6483\u30b7\u30ca\u30ea\u30aa\uff1a\n* \u653b\u6483\u8005\u304c\u7279\u5225\u306b\u7d30\u5de5\u3057\u305fURL\u3067\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u9001\u4fe1\n* \u30d6\u30e9\u30a6\u30b6\u304c\u76f8\u5bfe\u30d1\u30b9\u89e3\u6c7a\u6642\u306b\u653b\u6483\u8005\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53c2\u7167\n* HTML\u304cCSS\u7b49\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u3001XSS\u304c\u5b9f\u884c\u3055\u308c\u308b\n\n\u5f71\u97ff\: \u30b9\u30af\u30ea\u30d7\u30c8\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u3001\u30c7\u30fc\u30bf\u7a83\u53d6
ascanbeta.relativepathconfusion.extrainfo.contenttypeenabled = Content Type "{0}" \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002Web\u30d6\u30e9\u30a6\u30b6\u304c\u53b3\u683c\u306aMIME\u89e3\u6790\u3092\u5b9f\u884c\u3059\u308b\u5834\u5408\u3001\u3053\u308c\u306b\u3088\u308aMIME\u63a8\u6e2c\u653b\u6483\u3084\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u507d\u88c5\u653b\u6483\u3092\u9632\u3050\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u30d6\u30e9\u30a6\u30b6\u306eQuirks Mode (\u4e92\u63db\u30e2\u30fc\u30c9) \u3067\u306f\u53b3\u683c\u306a\u89e3\u6790\u304c\u7121\u52b9\u5316\u3055\u308c\u3001\u4fdd\u8b77\u52b9\u679c\u304c\u6e1b\u5c11\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.relativepathconfusion.extrainfo.framingallowed = X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u305d\u306e\u305f\u3081\u3001\u3053\u306e\u30da\u30fc\u30b8\u306f\u30d5\u30ec\u30fc\u30e0\u5185\u306b\u8868\u793a\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u3001\u3053\u308c\u304c\u539f\u56e0\u3067\u30d6\u30e9\u30a6\u30b6\u304c\u4e92\u63db\u30e2\u30fc\u30c9 (Quirks Mode) \u306b\u306a\u308a\u3001\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u304c\u30d0\u30a4\u30d1\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.relativepathconfusion.extrainfo.morethanonebasetag = HTML\u306e <head> \u30bf\u30b0\u5185\u306b\u3001\u76f8\u5bfeURL\u306e\u57fa\u6e96\u4f4d\u7f6e\u3092\u5b9a\u7fa9\u3059\u308b <base> \u30bf\u30b0\u304c\u8907\u6570\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u7121\u52b9\u3067\u3059\u3002
ascanbeta.relativepathconfusion.extrainfo.nobasetag = HTML\u306e <head> \u30bf\u30b0\u5185\u306b\u3001\u76f8\u5bfeURL\u306e\u57fa\u6e96\u4f4d\u7f6e\u3092\u5b9a\u7fa9\u3059\u308b <base> \u30bf\u30b0\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\n
ascanbeta.relativepathconfusion.extrainfo.nocontenttype = Content-Type \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u305d\u306e\u305f\u3081\u3001\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u3067\u8106\u5f31\u6027\u3092\u60aa\u7528\u3059\u308b\u305f\u3081\u306b\u4e92\u63db\u30e2\u30fc\u30c9 (Quirks Mode) \u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly = \u4e92\u63db\u30e2\u30fc\u30c9 (Quirks Mode) \u306f <meta http-equiv\="{0}"> \u306b\u3088\u3063\u3066\u660e\u793a\u7684\u306b\u6709\u52b9\u5316\u3055\u308c\u3066\u304a\u308a\u3001\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u304c\u30d0\u30a4\u30d1\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly = \u53e4\u3044DOCTYPE\u5ba3\u8a00\u3068 PUBLIC ID "{0}" \u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u4e92\u63db\u30e2\u30fc\u30c9 (Quirks Mode) \u304c\u6697\u9ed9\u7684\u306b\u6709\u52b9\u5316\u3055\u308c\u3001\u4e00\u90e8\u306eWeb\u30d6\u30e9\u30a6\u30b6\u3067\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u304c\u30d0\u30a4\u30d1\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype = DOCTYPE \u5ba3\u8a00\u304c\u306a\u3044\u305f\u3081\u3001\u4e92\u63db\u30e2\u30fc\u30c9 (Quirks Mode) \u304c\u6697\u9ed9\u7684\u306b\u6709\u52b9\u306b\u306a\u308a\u3001\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u304c\u30d0\u30a4\u30d1\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.relativepathconfusion.name = \u76f8\u5bfe\u30d1\u30b9\u6df7\u4e71
ascanbeta.relativepathconfusion.refs = https\://arxiv.org/abs/1811.00917\nhttps\://hsivonen.fi/doctype/\nhttps\://www.w3schools.com/tags/tag_base.asp
ascanbeta.relativepathconfusion.soln = Web\u30b5\u30fc\u30d0\u30fc\u3068\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u307e\u305f\u306f\u30b5\u30fc\u30d0\u30fc\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u76f8\u5bfe\u30d1\u30b9\u3092\u8aa4\u3063\u3066\u89e3\u91c8\u3059\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u3001\u66d6\u6627\u306aURL\u306b\u5fdc\u7b54\u3057\u306a\u3044\u3088\u3046\u306b\u8a2d\u5b9a\u3092\u66f4\u65b0\u3059\u3079\u304d\u3067\u3059\u3002\n\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5185\u3067\u306f\u3001HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u306b <base> HTML\u30bf\u30b0\u3092\u6b63\u3057\u304f\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u5185\u306e\u3059\u3079\u3066\u306e\u76f8\u5bfeURL\u306e\u57fa\u6e96\u3068\u306a\u308bURL\u3092\u660e\u78ba\u306b\u6307\u5b9a\u3057\u307e\u3059\u3002\n\n\u653b\u6483\u8005\u304cWeb\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u3092\u8aa4\u89e3\u91c8\u3055\u305b\u308b\u3053\u3068\u3092\u56f0\u96e3\u306b\u3059\u308b\u305f\u3081\u3001Content-Type HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\nWeb\u30d6\u30e9\u30a6\u30b6\u30fc\u304c\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u3092\u300c\u30b9\u30cb\u30c3\u30d5\u30a3\u30f3\u30b0\u300d(MIME\u30bf\u30a4\u30d7\u3092\u63a8\u5b9a) \u3059\u308b\u306e\u3092\u9632\u3050\u305f\u3081\u3001X-Content-Type-Options\: nosniff HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\nWeb\u30d6\u30e9\u30a6\u30b6\u30fc\u304c\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u3092\u7121\u8996\u3059\u308b\u539f\u56e0\u3068\u306a\u308b\u300c\u5f8c\u65b9\u4e92\u63db\u30e2\u30fc\u30c9\u300d(Quirks Mode) \u3067\u30da\u30fc\u30b8\u304c\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u3055\u308c\u308b\u306e\u3092\u9632\u3050\u305f\u3081\u3001<\!doctype html> \u306e\u3088\u3046\u306a\u30e2\u30c0\u30f3\u306aDOCTYPE\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u60aa\u610f\u306e\u3042\u308b\u30b5\u30a4\u30c8\u304c\u81ea\u30b5\u30a4\u30c8\u3092 <iframe> \u306b\u57cb\u3081\u8fbc\u307f\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u9a19\u3057\u3066\u8aa4\u64cd\u4f5c\u3055\u305b\u308b\u300c\u30af\u30ea\u30c3\u30af\u30b8\u30e3\u30c3\u30ad\u30f3\u30b0\u300d\u653b\u6483\u3092\u9632\u3050\u305f\u3081\u3001Content-Security-Policy (CSP) \u306e frame-ancestors \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.sessionfixation.alert.attack = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionfixation.alert.cookie.extrainfo = \u30ea\u30af\u30a8\u30b9\u30c8\u3067Cookie\u30d5\u30a3\u30fc\u30eb\u30c9 [{0}] \u304cNULL\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u969b\u306e\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u8a2d\u5b9a\u3055\u308c\u305fCookie\: [{1}]\n\u30ea\u30af\u30a8\u30b9\u30c8 [{1}] \u3067\u501f\u308a\u305f (\u6709\u52b9\u306a) Cookie\u5024\u304c\u8a2d\u5b9a\u3055\u308c\u305f\u969b\u306e\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u8a2d\u5b9a\u3055\u308c\u305fCookie\: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage = \u3053\u306e\u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u306f\u3001\u30ed\u30b0\u30aa\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u8b58\u5225\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\n\u3053\u306e\u554f\u984c\u306b\u3064\u3044\u3066\u306f\u3001\u624b\u52d5\u3067\u306e\u691c\u8a3c\u304c\u5fc5\u8981\u3067\u3059\u3002\u30ed\u30b0\u30aa\u30f3\u30da\u30fc\u30b8\u3067\u8a2d\u5b9a\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u30ed\u30b0\u30a4\u30f3\u5f8c\u3082\u6709\u52b9\u3067\u3042\u308a\u7d9a\u3051\u308b\u3053\u3068\u3001\u305d\u3057\u3066\u305d\u306e\u30c8\u30fc\u30af\u30f3\u3092\u4f7f\u3063\u3066\u3001\u672c\u6765\u30ed\u30b0\u30a4\u30f3\u304c\u5fc5\u8981\u306a\u30da\u30fc\u30b8\u3084\u30ea\u30bd\u30fc\u30b9\u306b\u76f4\u63a5\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.sessionfixation.alert.url.extrainfo = URL\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc/\u7591\u4f3cURL\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{0}] \u304cNULL\u306b\u8a2d\u5b9a\u3055\u308c\u305fHTML\u51fa\u529b\u306eURL\u306b\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u5024\u306e\u53ef\u80fd\u6027\u304c\u3042\u308b\u3082\u306e\u304c\u51fa\u73fe\u3057\u307e\u3057\u305f\: [{1}]\n\u3053\u306e\u300c\u501f\u7528\u300d\u30bb\u30c3\u30b7\u30e7\u30f3 [{1}] \u3092\u3053\u306eURL\u3078\u306e\u5f8c\u7d9a\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u4f7f\u7528\u3059\u308b\u3068\u3001\u65b0\u3057\u3044\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u4f5c\u6210\u3055\u308c\u307e\u305b\u3093\u3002
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage = \u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u304c\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u30d5\u30e9\u30b0\u4ed8\u3051\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sessionfixation.desc = \u30bb\u30c3\u30b7\u30e7\u30f3\u56fa\u5b9a\u5316\u653b\u6483\u304c\u53ef\u80fd\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u554f\u984c\u304c\u30ed\u30b0\u30a4\u30f3URL (\u30e6\u30fc\u30b6\u30fc\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u8a8d\u8a3c\u3092\u884c\u3046\u5834\u6240) \u3067\u767a\u751f\u3059\u308b\u5834\u5408\u3001\u653b\u6483\u8005\u306f\u56fa\u5b9a\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3068\u5171\u306b\u305d\u306eURL\u3092\u88ab\u5bb3\u8005\u306b\u63d0\u4f9b\u3057\u3001\u5f8c\u3067\u305d\u306e\u6307\u5b9a\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u4f7f\u7528\u3057\u3066\u88ab\u5bb3\u8005\u306e\u8eab\u5143\u3092\u4e57\u3063\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u554f\u984c\u304c\u975e\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3067\u767a\u751f\u3059\u308b\u5834\u5408\u3001URL\u3068\u56fa\u5b9a\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3ID\u306f\u653b\u6483\u8005\u304c\u8a8d\u8a3c\u3055\u308c\u3066\u3044\u306a\u3044\u30e6\u30fc\u30b6\u30fc\u306e\u884c\u52d5\u3092\u8ffd\u8de1\u3059\u308b\u305f\u3081\u306b\u306e\u307f\u4f7f\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u8106\u5f31\u6027\u304cURL (GET) \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u306f\u306a\u304f\u3001Cookie\u30d5\u30a3\u30fc\u30eb\u30c9\u3084\u30d5\u30a9\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9 (POST\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc) \u3067\u767a\u751f\u3059\u308b\u5834\u5408\u3001\u8106\u5f31\u6027\u3092\u60aa\u7528\u53ef\u80fd\u306b\u3059\u308b\u305f\u3081\u306b\u88ab\u5bb3\u8005\u306e\u30d6\u30e9\u30a6\u30b6\u306bCookie\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u8a2d\u5b9a\u3059\u308b\u4ed6\u306e\u8106\u5f31\u6027\u3082\u5fc5\u8981\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.sessionfixation.name = \u30bb\u30c3\u30b7\u30e7\u30f3\u56fa\u5b9a\u5316
ascanbeta.sessionfixation.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication\nhttps\://owasp.org/www-community/attacks/Session_fixation\nhttps\://acrossecurity.com/papers/session_fixation.pdf\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html
ascanbeta.sessionfixation.soln = 1. \u53b3\u5bc6\u306a\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u5f37\u5236\u3057\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3078\u306e\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u306e\u307f\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u3067\u3001\u653b\u6483\u8005\u304c\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n2. \u65e2\u306b\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u5b58\u5728\u3059\u308b\u304b\u3069\u3046\u304b\u306b\u95a2\u4fc2\u306a\u304f\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u8a8d\u8a3c\u6642\u306b\u5e38\u306b\u65b0\u3057\u3044\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u4f5c\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n3. IP\u30a2\u30c9\u30ec\u30b9\u3001SSL\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u306a\u3069\u306e\u8b58\u5225\u53ef\u80fd\u306a\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5c5e\u6027\u306e\u7d44\u307f\u5408\u308f\u305b\u306b\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u7d50\u3073\u4ed8\u3051\u3066\u304f\u3060\u3055\u3044\u3002\n4. \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7834\u68c4\u3055\u308c\u308b\u969b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u3060\u3051\u3067\u306a\u304f\u3001\u30b5\u30fc\u30d0\u30fc\u5074\u3067\u3082\u7834\u68c4\u3055\u308c\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\n5. \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u4ee5\u524d\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u3059\u3079\u3066\u7834\u68c4\u3059\u308b\u30ed\u30b0\u30a2\u30a6\u30c8\u6a5f\u80fd\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n6. \u7d76\u5bfe\u7684\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n7. URL\u30d9\u30fc\u30b9\u304b\u3089\u3001Cookie\u307e\u305f\u306f\u30d5\u30a9\u30fc\u30e0\u30d9\u30fc\u30b9\u306e\u30bb\u30c3\u30b7\u30e7\u30f3ID\u5b9f\u88c5\u306b\u5207\u308a\u66ff\u3048\u3066\u304f\u3060\u3055\u3044\u3002\u5f8c\u8005\u306f\u901a\u5e38\u3001\u653b\u6483\u8005\u304c\u60aa\u7528\u3059\u308b\u305f\u3081\u306b\u8ffd\u52a0\u306e\u8106\u5f31\u6027\u3092\u5fc5\u8981\u3068\u3059\u308b\u305f\u3081\u3067\u3059\u3002

ascanbeta.sessionidaccessiblebyjavascript.alert.attack = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo = \u30bb\u30c3\u30b7\u30e7\u30f3\u8b58\u5225\u5b50 {0} \u306e\u30d5\u30a3\u30fc\u30eb\u30c9 [{1}]\u3001\u5024 [{2}] \u304c\u3001\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u3067JavaScript\u3092\u4f7f\u3063\u3066\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage = \u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u304c\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u30d5\u30e9\u30b0\u4ed8\u3051\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sessionidaccessiblebyjavascript.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u9001\u4fe1\u3057\u305f\u30bb\u30c3\u30b7\u30e7\u30f3ID Cookie (\u6307\u5b9a\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3092NULL\u306b\u8a2d\u5b9a\u3057\u3066URL\u304c\u5909\u66f4\u3055\u308c\u305f\u969b) \u304c\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u3067JavaScript\u306b\u3088\u3063\u3066\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u4ed6\u306e\u8106\u5f31\u6027\u3068\u7d44\u307f\u5408\u308f\u305b\u308b\u3053\u3068\u3067\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u3055\u308c\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name = \u30bb\u30c3\u30b7\u30e7\u30f3ID\u30af\u30c3\u30ad\u30fc\u304cJavaScript\u304b\u3089\u30a2\u30af\u30bb\u30b9\u53ef\u80fd
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.soln = 1. \u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u542b\u3080 Cookie \u3092\u8a2d\u5b9a\u3059\u308b\u969b\u3001Web\u30d6\u30e9\u30a6\u30b6\u306eJavaScript\u304b\u3089\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u306e\u3092\u9632\u3050\u305f\u3081\u306b\u3001HttpOnly \u30d5\u30e9\u30b0\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.sessionidexpiry.alert.attack = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionidexpiry.alert.extrainfo = \u30bb\u30c3\u30b7\u30e7\u30f3\u8b58\u5225\u5b50 {0} \u306e\u30d5\u30a3\u30fc\u30eb\u30c9 [{1}]\u3001\u5024 [{2}] \u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7834\u68c4\u3055\u308c\u306a\u3044\u9650\u308a\u3001{4} \u306bCookie\u304c\u53d7\u4fe1\u3055\u308c\u3066\u304b\u3089 [{3}] \u307e\u3067\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage = \u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u304c\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u30d5\u30e9\u30b0\u4ed8\u3051\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sessionidexpiry.browserclose = \u30d6\u30e9\u30a6\u30b6\u3092\u9589\u3058\u307e\u3057\u305f
ascanbeta.sessionidexpiry.desc = \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u9001\u4fe1\u3055\u308c\u308b\u30bb\u30c3\u30b7\u30e7\u30f3ID Cookie (URL\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6307\u5b9a\u30d5\u30a3\u30fc\u30eb\u30c9\u304cNULL\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5834\u5408) \u306e\u6709\u52b9\u671f\u9650\u304c\u904e\u5ea6\u306b\u9577\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u5fd8\u308c\u305f\u5834\u5408\u3001\u30ed\u30b0\u30a2\u30a6\u30c8\u6a5f\u80fd\u304c\u9069\u5207\u306b\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u7834\u68c4\u3057\u306a\u3044\u5834\u5408\u3001\u307e\u305f\u306f\u4ed6\u306e\u624b\u6bb5\u306b\u3088\u3063\u3066\u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u5834\u5408\u306b\u3001\u653b\u6483\u8005\u306b\u3088\u3063\u3066\u60aa\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name = \u30bb\u30c3\u30b7\u30e7\u30f3ID\u306e\u6709\u52b9\u671f\u9650/\u6700\u5927\u7d4c\u904e\u6642\u9593 (Max-Age) \u304c\u904e\u5270
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.soln = 1. \u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u542b\u3080\u30af\u30c3\u30ad\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u969b\u306f\u3001'Expire' \u307e\u305f\u306f 'Max-Age' \u30af\u30c3\u30ad\u30fc\u5c5e\u6027\u3092\u4f7f\u7528\u3057\u3066\u3001\u9577\u671f\u9593\u6709\u52b9\u306a\u72b6\u614b\u3092\u9632\u3044\u3067\u304f\u3060\u3055\u3044\u3002\n2) \u30ed\u30b0\u30a2\u30a6\u30c8\u6a5f\u80fd\u304c\u5b9f\u88c5\u3055\u308c\u3066\u304a\u308a\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u9069\u5207\u306b\u7834\u68c4\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n3) \u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u5834\u5408\u3067\u3082\u60aa\u7528\u3092\u9632\u3050\u305f\u3081\u3001\u305d\u306e\u4ed6\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u5bfe\u7b56\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.sessionidexpiry.timeexpired = \u671f\u9650\u5207\u308c
ascanbeta.sessionidexpiry.timelessthanonehour = 1\u6642\u9593\u672a\u6e80
ascanbeta.sessionidexpiry.timemorethanoneday = 1\u65e5\u4ee5\u4e0a
ascanbeta.sessionidexpiry.timemorethanonehour = 1\u6642\u9593\u4ee5\u4e0a
ascanbeta.sessionidexpiry.timemorethanoneweek = 1\u9031\u9593\u4ee5\u4e0a

ascanbeta.sessionidexposedinurl.alert.attack = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionidexposedinurl.alert.extrainfo = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\u306e [{1}] \u306b\u3001\u516c\u958b\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u8b58\u5225\u5b50 [{2}] \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage = \u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u304c\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u30d5\u30e9\u30b0\u4ed8\u3051\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sessionidexposedinurl.desc = \u30bb\u30c3\u30b7\u30e7\u30f3ID\u304cURL\u306b\u9732\u51fa\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u542b\u3080Web\u30b5\u30a4\u30c8URL\u3092\u5171\u6709\u3059\u308b\u3053\u3068\u3067\u3001\u4e00\u822c\u30e6\u30fc\u30b6\u30fc\u304c\u7121\u610f\u8b58\u306e\u3046\u3061\u306b\u81ea\u5206\u306e\u30c7\u30fc\u30bf\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3057\u3066\u3057\u307e\u3044\u3001\u30c7\u30fc\u30bf\u306e\u6a5f\u5bc6\u6027\u3001\u5b8c\u5168\u6027\u3001\u53ef\u7528\u6027\u304c\u4fb5\u5bb3\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u542b\u3080URL\u306f\u3001Web\u30d6\u30e9\u30a6\u30b6\u306e\u30d6\u30c3\u30af\u30de\u30fc\u30af\u3001Web\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3001\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306b\u3082\u8a18\u9332\u3055\u308c\u307e\u3059\u3002
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name = \u30bb\u30c3\u30b7\u30e7\u30f3 ID\u306e\u516c\u958b
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidexposedinurl.soln = \u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u3092\u4f7f\u7528\u3059\u308b\u306a\u3069\u3001\u3088\u308a\u5b89\u5168\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306e\u5b9f\u88c5\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306f\u3001\u610f\u56f3\u305b\u305a\u306b\u5171\u6709\u3055\u308c\u308b\u3053\u3068\u304c\u5c11\u306a\u304f\u3001\u901a\u5e38\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3084Web\u30d6\u30e9\u30a6\u30b6\u306e\u30d6\u30c3\u30af\u30de\u30fc\u30af\u306b\u8868\u793a\u3055\u308c\u307e\u305b\u3093\u3002

ascanbeta.sessionidsentinsecurely.alert.attack = {0} \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]
ascanbeta.sessionidsentinsecurely.alert.extrainfo = \u30bb\u30c3\u30b7\u30e7\u30f3\u8b58\u5225\u5b50 {0} \u306e\u30d5\u30a3\u30fc\u30eb\u30c9 [{1}]\u3001\u5024 [{2}] \u304c\u3001\u5b89\u5168\u3067\u306a\u3044\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4ecb\u3057\u3066\u9001\u4fe1\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage = \u554f\u984c\u304c\u767a\u898b\u3055\u308c\u305fURL\u304c\u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3068\u3057\u3066\u30d5\u30e9\u30b0\u4ed8\u3051\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset = \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u63d0\u4f9b\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306b\u3001'secure' \u30d5\u30e9\u30b0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
ascanbeta.sessionidsentinsecurely.desc = \u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u975e\u30bb\u30ad\u30e5\u30a2\u306a\u65b9\u6cd5\u3067\u9001\u4fe1\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u9001\u4fe1\u3055\u308c\u308bCookie\u306e\u5834\u5408\u3001HTTPS\u3067\u306f\u306a\u304fHTTP\u304c\u4f7f\u7528\u3055\u308c\u308b\u969b\u306b\u767a\u751f\u3057\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u9001\u4fe1\u3055\u308c\u308bCookie\u306e\u5834\u5408 (URL\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6307\u5b9a\u30d5\u30a3\u30fc\u30eb\u30c9\u304cNULL\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5834\u5408)\u3001'secure' \u5c5e\u6027\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001Cookie\u304cHTTPS\u7d4c\u7531\u3067\u306f\u306a\u304fHTTP\u7d4c\u7531\u3067\u9001\u4fe1\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u7d4c\u8def\u4e0a\u306e\u653b\u6483\u8005\u304c\u901a\u4fe1\u3092\u508d\u53d7\u3057\u3001\u88ab\u5bb3\u8005\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3078\u306e\u5b8c\u5168\u306a\u30a2\u30af\u30bb\u30b9\u6a29\u3092\u53d6\u5f97\u3059\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name = \u5b89\u5168\u3067\u306a\u3044\u30bb\u30c3\u30b7\u30e7\u30f3ID\u306e\u9001\u4fe1
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidsentinsecurely.soln = 1. \u30d6\u30e9\u30a6\u30b6\u3068Web\u30b5\u30fc\u30d0\u30fc\u9593\u3067\u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u901a\u4fe1\u3055\u308c\u308b\u5168\u3066\u306e\u30da\u30fc\u30b8\u3067\u3001HTTPS\u7528\u306eSSL/TLS\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n2. \u901a\u4fe1\u304c\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044HTTP\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u964d\u683c\u3055\u308c\u308b\u3053\u3068\u3092\u9632\u3044\u3067\u304f\u3060\u3055\u3044\u3002\n3. \u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u542b\u3080Cookie\u3092\u8a2d\u5b9a\u3059\u308b\u969b\u306f secure \u5c5e\u6027\u3092\u4f7f\u7528\u3057\u3001\u975e\u30bb\u30ad\u30e5\u30a2\u306a\u65b9\u6cd5\u306b\u3088\u308b\u5f8c\u7d9a\u306e\u9001\u4fe1\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n4. \u30bb\u30ad\u30e5\u30a2\u3067\u306a\u3044HTTP\u30da\u30fc\u30b8\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u3001\u5bfe\u5fdc\u3059\u308b\u30bb\u30ad\u30e5\u30a2\u306aHTTPS\u30da\u30fc\u30b8\u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.shellshock.desc = \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30ea\u30e2\u30fc\u30c8\u306e\u653b\u6483\u8005\u304c\u4efb\u610f\u30b3\u30fc\u30c9\u3092\u5b9f\u884c\u3067\u304d\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u306eBash\u30b7\u30a7\u30eb\u3092\u5b9f\u884c\u3057\u3066\u3044\u307e\u3059\u3002
ascanbeta.shellshock.extrainfo = CVE-2014-6271\u3088\u308a\: GNU Bash 4.3\u4ee5\u524d\u3067\u306f\u3001\u74b0\u5883\u5909\u6570\u306e\u5024\u5185\u3067\u95a2\u6570\u5b9a\u7fa9\u306e\u5f8c\u306b\u7d9a\u304f\u6587\u5b57\u5217\u3092\u89e3\u6790\u30fb\u5b9f\u884c\u3059\u308b\u305f\u3081\u3001\u30ea\u30e2\u30fc\u30c8\u653b\u6483\u8005\u304c\u7d30\u5de5\u3055\u308c\u305f\u74b0\u5883\u5909\u6570\u3092\u901a\u3058\u3066\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u3092\u5b9f\u884c\u53ef\u80fd\u3067\u3059\u3002\u3053\u306e\u8106\u5f31\u6027\u306f\u3001OpenSSH sshd\u306e ForceCommand \u6a5f\u80fd\u3001Apache HTTP\u30b5\u30fc\u30d0\u30fc\u306e mod_cgi \u304a\u3088\u3073 mod_cgid \u30e2\u30b8\u30e5\u30fc\u30eb\u3001\u7279\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044DHCP\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u3088\u3063\u3066\u5b9f\u884c\u3055\u308c\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u3001\u304a\u3088\u3073Bash\u306e\u5b9f\u884c\u74b0\u5883\u306b\u304a\u3044\u3066\u7279\u6a29\u5883\u754c\u3092\u8d8a\u3048\u3066\u74b0\u5883\u5909\u6570\u304c\u8a2d\u5b9a\u3055\u308c\u308b\u305d\u306e\u4ed6\u306e\u72b6\u6cc1\u306b\u304a\u3051\u308b\u653b\u6483\u624b\u6cd5\u306b\u3088\u3063\u3066\u5b9f\u8a3c\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u8106\u5f31\u6027\u306f\u300cShellShock\u300d\u3068\u547c\u3070\u308c\u3066\u3044\u307e\u3059\u3002\n\u6ce8\u610f\: \u3053\u306e\u554f\u984c\u306b\u5bfe\u3059\u308b\u6700\u521d\u306e\u4fee\u6b63\u306f\u4e0d\u5b8c\u5168\u3067\u3057\u305f\u3002\u4e0d\u5b8c\u5168\u306a\u4fee\u6b63\u5f8c\u3082\u6b8b\u308b\u8106\u5f31\u6027\u306b\u3064\u3044\u3066\u306f\u3001CVE-2014-7169\u304c\u5225\u9014\u5272\u308a\u5f53\u3066\u3089\u308c\u3066\u3044\u307e\u3059\u3002
ascanbeta.shellshock.name = \u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c - Shell Shock
ascanbeta.shellshock.ref = https\://nvd.nist.gov/vuln/detail/CVE-2014-6271\nhttps\://www.troyhunt.com/everything-you-need-to-know-about2/
ascanbeta.shellshock.soln = Bash\u3092\u6700\u65b0\u7248\u306b\u30a2\u30c3\u30d7\u30c7\u30fc\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.shellshock.timingbased.evidence = \u653b\u6483\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001[{0}]\u30df\u30ea\u79d2\u306e\u9045\u5ef6\u304c\u8a98\u767a\u30fb\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

ascanbeta.sourcecodedisclosure.desc = \u73fe\u5728\u306e\u30da\u30fc\u30b8\u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304c\u3001Web\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u958b\u793a\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sourcecodedisclosure.gitbased.evidence = [{1}] \u3092\u4f7f\u7528\u3057\u3066\u3001[{0}] \u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304c\u62bd\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sourcecodedisclosure.gitbased.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - Git
ascanbeta.sourcecodedisclosure.gitbased.soln = Git \u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304cWeb\u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.sourcecodedisclosure.lfibased.extrainfo = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u540d [{0}] \u306e\u51fa\u529b\u306f\u3001\u30e9\u30f3\u30c0\u30e0\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{1}] \u306e\u51fa\u529b\u3068\u6bd4\u8f03\u3057\u3066 [{2}%] \u306e\u5dee\u7570\u304c\u3042\u308a\u3001\u8a2d\u5b9a\u3055\u308c\u305f\u3057\u304d\u3044\u5024 [{3}%] \u3092\u4e0a\u56de\u308b\u6709\u610f\u5dee\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.sourcecodedisclosure.lfibased.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - \u30d5\u30a1\u30a4\u30eb\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3
ascanbeta.sourcecodedisclosure.svnbased.extrainfo = [{0}] \u306e\u30bd\u30fc\u30b9 \u30b3\u30fc\u30c9\u304c [{1}] \u304b\u3089\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002
ascanbeta.sourcecodedisclosure.svnbased.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln = SVN \u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304cWeb\u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.sourcecodedisclosurecve-2012-1823.desc = \u4e00\u90e8\u306ePHP\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u306f\u3001CGI\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u3059\u308b\u3088\u3046\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u3066\u3044\u306a\u3044 "\=" \u6587\u5b57\u3092\u542b\u307e\u306a\u3044\u30af\u30a8\u30ea\u6587\u5b57\u5217\u3092\u9069\u5207\u306b\u51e6\u7406\u3067\u304d\u306a\u3044\u305f\u3081\u3001PHP\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u958b\u793a\u3068\u4efb\u610f\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u5834\u5408\u3001PHP\u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u304cWeb\u30d6\u30e9\u30a6\u30b6\u306b\u305d\u306e\u307e\u307e\u9001\u4fe1\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u51fa\u529b\u306b\u306f\u901a\u5e38PHP\u30b3\u30fc\u30c9\u304c\u542b\u307e\u308c\u307e\u3059\u304c\u3001\u7d14\u7c8b\u306aHTML\u304c\u542b\u307e\u308c\u308b\u5834\u5408\u3082\u3042\u308a\u307e\u3059\u3002
ascanbeta.sourcecodedisclosurecve-2012-1823.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.soln = PHP\u306e\u6700\u65b0\u5b89\u5b9a\u7248\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u304b\u3001Apache \u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u3068 mod_rewrite \u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001RewriteCond \u304a\u3088\u3073 RewriteRule \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u4f7f\u3044\u60aa\u610f\u306e\u3042\u308b\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.ssrf.desc = Web\u30b5\u30fc\u30d0\u30fc\u306f\u30ea\u30e2\u30fc\u30c8\u30a2\u30c9\u30ec\u30b9\u3092\u53d7\u3051\u53d6\u308a\u3001\u3053\u306eURL\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u5f97\u3057\u307e\u3059\u304c\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u610f\u56f3\u3057\u305f\u5b9b\u5148\u306b\u9001\u4fe1\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u5341\u5206\u306b\u4fdd\u8a3c\u3057\u3066\u3044\u307e\u305b\u3093\u3002
ascanbeta.ssrf.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30fb\u30ea\u30af\u30a8\u30b9\u30c8\u30fb\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea (SSRF) 
ascanbeta.ssrf.otherinfo.canaryinbody = \u30a2\u30a6\u30c8\u30aa\u30d6\u30d0\u30f3\u30c9\u30b5\u30fc\u30d3\u30b9\u304b\u3089\u306e\u30ab\u30ca\u30ea\u30fc\u30c8\u30fc\u30af\u30f3\u304c\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u5185\u3067\u767a\u898b\u3055\u308c\u307e\u3057\u305f\u3002
ascanbeta.ssrf.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html
ascanbeta.ssrf.skipped = Active Scan OAST\u30b5\u30fc\u30d3\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093
ascanbeta.ssrf.soln = \u30ea\u30af\u30a8\u30b9\u30c8\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u30ea\u30e2\u30fc\u30c8\u30a2\u30c9\u30ec\u30b9\u3092\u53d7\u3051\u5165\u308c\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u3082\u3057\u53d7\u3051\u5165\u308c\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u5834\u5408\u306f\u3001\u305d\u308c\u3089\u304c\u671f\u5f85\u3055\u308c\u308b\u5024\u306e\u8a31\u53ef\u30ea\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u691c\u8a3c\u3055\u308c\u308b\u3053\u3068\u3092\u78ba\u5b9f\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.text4shell.desc = Apache Commons Text 1.10.0\u672a\u6e80\u3067\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u88dc\u9593\u8a2d\u5b9a\u304c\u5b89\u5168\u3067\u306a\u3044\u305f\u3081\u3001\u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u306b\u9069\u7528\u3055\u308c\u305f\u5834\u5408\u306b\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c (RCE) \u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002Apache Commons Text \u306f\u5909\u6570\u88dc\u9593\u6a5f\u80fd\u3092\u63d0\u4f9b\u3057\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u52d5\u7684\u306b\u8a55\u4fa1\u30fb\u5c55\u958b\u3057\u307e\u3059\u3002\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u3001\u5909\u6570\u88dc\u9593\u3092\u901a\u3058\u3066\u30ea\u30e2\u30fc\u30c8\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u5916\u90e8\u63a5\u7d9a\u304c\u691c\u51fa\u3055\u308c\u3066\u304a\u308a\u3001\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u653b\u6483\u306b\u5bfe\u3057\u3066\u8106\u5f31\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanbeta.text4shell.name = Text4shell (CVE-2022-42889)
ascanbeta.text4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-42889\nhttps\://securitylab.github.com/advisories/GHSL-2022-018_Apache_Commons_Text/
ascanbeta.text4shell.skipped = Active Scan OAST\u30b5\u30fc\u30d3\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093
ascanbeta.text4shell.soln = Apache Commons Text\u3092\u30d0\u30fc\u30b8\u30e7\u30f31.10.0\u4ee5\u964d\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanbeta.usernameenumeration.alert.attack = [{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}] \u3092\u64cd\u4f5c\u3057\u3001\u51fa\u529b\u3092\u76e3\u8996\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.usernameenumeration.alert.extrainfo = [{0}] \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{1}] \u306f\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u5b58\u5728\u3059\u308b\u304b\u3069\u3046\u304b\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u6f0f\u6d29\u3057\u3066\u3044\u307e\u3059\u3002\u6709\u52b9\u306a\u5143\u306e\u30e6\u30fc\u30b6\u30fc\u540d [{2}] \u3068\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d [{3}] \u306e\u51fa\u529b\u306b\u304a\u3051\u308b [{5}] \u306e\u9055\u3044\u306f\u3001\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059\uff1a\n[{4}]
ascanbeta.usernameenumeration.desc = \u6709\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u306b\u5bfe\u3059\u308bHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u9055\u3044\u306b\u57fa\u3065\u3044\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u63a8\u6e2c\u304c\u53ef\u80fd\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30b7\u30b9\u30c6\u30e0\u306b\u5bfe\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u7dcf\u5f53\u305f\u308a\u653b\u6483\u306e\u6210\u529f\u78ba\u7387\u304c\u5927\u5e45\u306b\u5411\u4e0a\u3057\u3066\u3057\u307e\u3044\u307e\u3059\u3002\u306a\u304a\u3001\u507d\u967d\u6027 (\u8aa4\u691c\u51fa) \u306f ZAP \u306e\u300c\u653b\u6483\u5f37\u5ea6\u300d\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4e0a\u3052\u308b\u3053\u3068\u3067\u6e1b\u3089\u3059\u3053\u3068\u304c\u3067\u304d\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u304c\u5b9f\u969b\u306e\u8106\u5f31\u6027\u3067\u3042\u308b\u304b\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u3001\u300c\u8ffd\u52a0\u60c5\u5831\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u624b\u52d5\u3067\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanbeta.usernameenumeration.name = \u30e6\u30fc\u30b6\u30fc\u540d\u5217\u6319\u306e\u53ef\u80fd\u6027
ascanbeta.usernameenumeration.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/03-Identity_Management_Testing/04-Testing_for_Account_Enumeration_and_Guessable_User_Account.html\nhttps\://dl.ifip.org/db/conf/sec/sec2011/FreilingS11.pdf\nhttps\://cwe.mitre.org/data/definitions/204.html
ascanbeta.usernameenumeration.soln = \u30e6\u30fc\u30b6\u30fc\u540d\u306e\u6709\u52b9\u6027\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u958b\u793a\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u7279\u306b\u3001\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u6642\u306b\u306f\u3001\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u30da\u30fc\u30b8\u30bf\u30a4\u30c8\u30eb\u3001\u30da\u30fc\u30b8\u5185\u5bb9\u3001HTTP\u30d8\u30c3\u30c0\u30fc\u3001\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u51e6\u7406\u306b\u304a\u3044\u3066\u3001\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u7121\u52b9\u306a\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u533a\u5225\u305b\u305a\u3001\u540c\u4e00\u306e\u5fdc\u7b54\u3092\u8fd4\u3059\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

