ascanbeta.HTTPParamPoll.desc = \u0410\u0442\u0430\u043a\u0438, \u0441\u043f\u0440\u044f\u043c\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0437\u0430\u0431\u0440\u0443\u0434\u043d\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443 HTTP (HPP-\u0430\u0442\u0430\u043a\u0438), \u043f\u043e\u043b\u044f\u0433\u0430\u044e\u0442\u044c \u0443 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0438\u0445 \u0440\u043e\u0437\u0434\u0456\u043b\u044c\u043d\u0438\u043a\u0456\u0432 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0432 \u0456\u043d\u0448\u0456 \u043d\u0430\u044f\u0432\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438. \u042f\u043a\u0449\u043e \u0432\u0435\u0431\u0434\u043e\u0434\u0430\u0442\u043e\u043a \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0454 \u043d\u0430\u043b\u0435\u0436\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0434\u0430\u043d\u0438\u0445, \u0449\u043e \u0432\u0432\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u0443\u0432\u0430\u0442\u0438 \u043b\u043e\u0433\u0456\u043a\u0443 \u0440\u043e\u0431\u043e\u0442\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0443 \u0456 \u0437\u0434\u0456\u0439\u0441\u043d\u0438\u0442\u0438 \u0430\u0442\u0430\u043a\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0430\u0431\u043e \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u041e\u0434\u0438\u043d \u0437 \u043d\u0430\u0441\u043b\u0456\u0434\u043a\u0456\u0432 HPP-\u0430\u0442\u0430\u043a\u0438 \u2014 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430 \u0456\u0433\u043d\u043e\u0440\u0443\u0432\u0430\u0442\u0438 \u043d\u0430\u044f\u0432\u043d\u0456, \u0436\u043e\u0440\u0441\u0442\u043a\u043e-\u0437\u0430\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438  HTTP, \u0449\u043e\u0431 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440 \u0440\u043e\u0431\u043e\u0442\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0443, \u043e\u0431\u0456\u0439\u0442\u0438 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u0456 \u0442\u043e\u0447\u043a\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0432\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0456, \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0437\u043c\u0456\u043d\u043d\u0438\u0445, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u043d\u0435 \u0432 \u043c\u0435\u0436\u0430\u0445 \u0432\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443.
ascanbeta.HTTPParamPoll.extrainfo = https\://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/07-Input_Validation_Testing/04-Testing_for_HTTP_Parameter_Pollution
ascanbeta.HTTPParamPoll.name = \u0417\u0430\u0431\u0440\u0443\u0434\u043d\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443 HTTP
ascanbeta.HTTPParamPoll.sol = \u0412\u0438\u043a\u043e\u043d\u0443\u0439\u0442\u0435 \u043d\u0430\u043b\u0435\u0436\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0434\u0430\u043d\u0438\u0445, \u0449\u043e \u0432\u0432\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c, \u0434\u043b\u044f \u0440\u043e\u0437\u0434\u0456\u043b\u044e\u0432\u0430\u0447\u0456\u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432

ascanbeta.backupfiledisclosure.desc = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0440\u043e\u0437\u043a\u0440\u0438\u0432 \u0440\u0435\u0437\u0435\u0440\u0432\u043d\u0443 \u043a\u043e\u043f\u0456\u044e \u0444\u0430\u0439\u043b\u0443
ascanbeta.backupfiledisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0440\u0435\u0437\u0435\u0440\u0432\u043d\u043e\u0457 \u043a\u043e\u043f\u0456\u0457 \u0444\u0430\u0439\u043b\u0443
ascanbeta.backupfiledisclosure.otherinfo = \u0420\u0435\u0437\u0435\u0440\u0432\u043d\u0430 \u043a\u043e\u043f\u0456\u044f \u0444\u0430\u0439\u043b\u0443 [{0}] \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430 \u0432 [{1}]
ascanbeta.backupfiledisclosure.refs = https\://cwe.mitre.org/data/definitions/530.html\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/04-Review_Old_Backup_and_Unreferenced_Files_for_Sensitive_Information.html
ascanbeta.backupfiledisclosure.soln = \u041d\u0435 \u0440\u0435\u0434\u0430\u0433\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b\u0438 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0442\u0430 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043d\u0435\u0432\u0430\u0436\u043b\u0438\u0432\u0456 \u0444\u0430\u0439\u043b\u0438 (\u0443 \u0442\u043e\u043c\u0443 \u0447\u0438\u0441\u043b\u0456 \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0456) \u0432\u0438\u0434\u0430\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430. 

ascanbeta.cookieslack.affect.response.no = \u0426\u0456 \u0444\u0430\u0439\u043b\u0438 cookie \u041d\u0415 \u0432\u043f\u043b\u0438\u043d\u0443\u043b\u0438 \u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c\: 
ascanbeta.cookieslack.affect.response.yes = \u0426\u0456 \u0444\u0430\u0439\u043b\u0438 cookie \u0432\u043f\u043b\u0438\u043d\u0443\u043b\u0438 \u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c\: 
ascanbeta.cookieslack.desc = \u041f\u043e\u0432\u0442\u043e\u0440\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 GET\: \u0449\u043e\u0440\u0430\u0437\u0443 \u0441\u043a\u0438\u0434\u0430\u0439\u0442\u0435 \u0440\u0456\u0437\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 cookie, \u043f\u0456\u0441\u043b\u044f \u0447\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0443\u0439\u0442\u0435 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437 \u0443\u0441\u0456\u043c\u0430 \u0444\u0430\u0439\u043b\u0430\u043c\u0438 cookie, \u0449\u043e\u0431 \u0441\u0442\u0430\u0431\u0456\u043b\u0456\u0437\u0443\u0432\u0430\u0442\u0438 \u0441\u0435\u0441\u0456\u044e, \u0456 \u043f\u043e\u0440\u0456\u0432\u043d\u044e\u0439\u0442\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437 \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0438\u043c GET. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u0442\u0438 \u0434\u0456\u043b\u044f\u043d\u043a\u0438, \u0434\u0435 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044f \u0447\u0438 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0438, \u044f\u043a\u0456 \u0431\u0430\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0430 \u0444\u0430\u0439\u043b\u0430\u0445 cookie, \u043d\u0430\u0441\u043f\u0440\u0430\u0432\u0434\u0456 \u043d\u0435 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f.
ascanbeta.cookieslack.endline = \n
ascanbeta.cookieslack.name = \u0414\u0435\u0442\u0435\u043a\u0442\u043e\u0440 \u0441\u043b\u0430\u0431\u0438\u0445 \u0444\u0430\u0439\u043b\u0456\u0432 cookie
ascanbeta.cookieslack.otherinfo.intro = \u0424\u0430\u0439\u043b\u0438 cookie, \u044f\u043a\u0456 \u043d\u0435 \u043c\u0430\u044e\u0442\u044c \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u0435\u0444\u0435\u043a\u0442\u0443, \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u043d\u0435\u0434\u043e\u043b\u0456\u043a\u0438 \u0432 \u043b\u043e\u0433\u0456\u0446\u0456 \u0440\u043e\u0431\u043e\u0442\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438. \u0423 \u043d\u0430\u0439\u0433\u0456\u0440\u0448\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0432\u0438\u044f\u0432\u0438\u0442\u0438, \u0434\u0435 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044f \u0447\u0435\u0440\u0435\u0437 \u043c\u0430\u0440\u043a\u0435\u0440\u0438 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0454\u0442\u044c\u0441\u044f.
ascanbeta.cookieslack.separator = ,
ascanbeta.cookieslack.session.destroyed = \u0421\u043a\u0438\u0434\u0430\u043d\u043d\u044f \u0446\u044c\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 cookie \u0437\u0440\u043e\u0431\u0438\u043b\u043e \u0441\u0435\u0430\u043d\u0441 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u043c\: [{0}] \u041f\u043e\u0432\u0442\u043e\u0440\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437 \u0443\u0441\u0456\u043c\u0430 \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0438\u043c\u0438 \u0444\u0430\u0439\u043b\u0430\u043c\u0438 cookie \u0432\u0441\u0435 \u043e\u0434\u043d\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c, \u044f\u043a\u0430 \u0432\u0456\u0434\u0440\u0456\u0437\u043d\u044f\u043b\u0430\u0441\u044f \u0432\u0456\u0434 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u0437\u0430\u043f\u0438\u0442\u0443.
ascanbeta.cookieslack.session.warning = \u041f\u0420\u0418\u041c\u0406\u0422\u041a\u0410\: \u0427\u0435\u0440\u0435\u0437 \u0439\u043e\u0433\u043e \u0456\u043c''\u044f \u0446\u0435\u0439 \u0444\u0430\u0439\u043b cookie \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0430\u0436\u043b\u0438\u0432\u0438\u043c, \u0430\u043b\u0435 \u0439\u043e\u0433\u043e \u0432\u0438\u043b\u0443\u0447\u0435\u043d\u043d\u044f \u043d\u0435 \u043c\u0430\u0454 \u0435\u0444\u0435\u043a\u0442\u0443\: [{0}] 

ascanbeta.cors.info.desc = \u0421\u043f\u0456\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432 \u0437 \u0440\u0456\u0437\u043d\u0438\u0445 \u0434\u0436\u0435\u0440\u0435\u043b (CORS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0438\u0439 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0441\u0435\u0440\u0432\u0435\u0440\u0443 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0435 \u0456\u043d\u0448\u0435 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f (\u0434\u043e\u043c\u0435\u043d, \u0441\u0445\u0435\u043c\u0443 \u0447\u0438 \u043f\u043e\u0440\u0442), \u0430 \u043d\u0435 \u0432\u043b\u0430\u0441\u043d\u0435, \u0437 \u044f\u043a\u043e\u0433\u043e \u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432. \u0426\u0435 \u043f\u043e\u0441\u043b\u0430\u0431\u043b\u044e\u0454 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0443 \u0442\u043e\u0433\u043e \u0436 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f (SOP).
ascanbeta.cors.info.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a CORS
ascanbeta.cors.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/CORS\nhttps\://portswigger.net/web-security/cors
ascanbeta.cors.soln = \u042f\u043a\u0449\u043e \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0430 \u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u043d\u0430\u043b\u0435\u0436\u043d\u043e \u043e\u043f\u0438\u0441\u0430\u043d\u0430 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 "Access-Control-Allow-Origin". \u0423 \u0446\u044c\u043e\u043c\u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0441\u043b\u0456\u0434 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u043b\u0438\u0448\u0435 \u043d\u0430\u0434\u0456\u0439\u043d\u0456 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0438, \u044f\u043a\u0438\u043c \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0446\u0435\u0439 \u0440\u0435\u0441\u0443\u0440\u0441, \u0437 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u043e\u044e \u043d\u0430\u0439\u0431\u0456\u043b\u044c\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0443.
ascanbeta.cors.vuln.desc = \u0422\u0430\u043a\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f CORS \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 AJAX-\u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443 \u0437\u0456 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043e\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u043c \u0430\u0433\u0435\u043d\u0442\u043e\u043c \u0436\u0435\u0440\u0442\u0432\u0438.   \u0414\u043b\u044f \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0445 AJAX-\u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0431\u0443\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a "Access-Control-Allow-Credentials\: true", \u0430 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a "Access-Control-Allow-Origin" \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f null \u0430\u0431\u043e \u0434\u043e\u043c\u0435\u043d \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438. \u041d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0446\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u043d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0456 AJAX-\u0437\u0430\u043f\u0438\u0442\u0438, \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442 \u0432\u0441\u0435 \u043e\u0434\u043d\u043e \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0438 \u0456\u043d\u0442\u0440\u0430\u043c\u0435\u0440\u0435\u0436\u0456). \u0428\u043a\u0456\u0434\u043b\u0438\u0432\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043c\u043e\u0436\u0435 \u043d\u0430\u043b\u0435\u0436\u0430\u0442\u0438 \u044f\u043a \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443, \u0442\u0430\u043a \u0456 \u0434\u043e\u0432\u0456\u0440\u0435\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443 \u0437 \u043d\u0435\u0434\u043e\u043b\u0456\u043a\u0430\u043c\u0438 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, XSS, \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0430 HTTP \u0431\u0435\u0437 TLS, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0443\u0432\u0430\u0442\u0438 \u043a\u043e\u0434 \u0447\u0435\u0440\u0435\u0437 MITM \u0442\u043e\u0449\u043e).
ascanbeta.cors.vuln.name = \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f CORS

ascanbeta.crossdomain.adobe.desc = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0430 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 Flash/Silverlight \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456.
ascanbeta.crossdomain.adobe.read.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0438\u043c \u0437\u0430\u043f\u0438\u0442\u0430\u043c \u043d\u0430 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u0434\u0430\u043d\u0438\u0445, \u0449\u043e \u043f\u043e\u0445\u043e\u0434\u044f\u0442\u044c \u0432\u0456\u0434 Flash/Silverlight \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443, \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u042f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447-\u0436\u0435\u0440\u0442\u0432\u0430 \u0443\u0432\u0456\u0439\u0448\u043e\u0432 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0436\u0435\u0440\u0442\u0432\u0438, \u0449\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u0434\u0430\u043d\u0456 \u0437 \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443 \u0431\u0443\u0434\u0443\u0442\u044c \u0443\u0440\u0430\u0436\u0435\u043d\u0456 \u043d\u0435\u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u043c \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u043e\u043c \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0436\u0435\u0440\u0442\u0432\u0438. \u0426\u0435 \u043e\u0441\u043e\u0431\u043b\u0438\u0432\u043e \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u044f\u043a\u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.
ascanbeta.crossdomain.adobe.read.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Adobe - Read
ascanbeta.crossdomain.adobe.read.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b crossdomain.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <allow-access-from domain\="example.com">. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f "*" (\u0432\u0441\u0456\u043c \u0434\u043e\u043c\u0435\u043d\u0430\u043c), \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0436\u043e\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u043c \u0434\u043e\u0441\u0442\u0443\u043f\u043e\u043c, \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445.
ascanbeta.crossdomain.adobe.send.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u0442\u0438 (\u0430\u043b\u0435 \u043d\u0435 \u043e\u0431\u043e\u0432'\u044f\u0437\u043a\u043e\u0432\u043e \u0447\u0438\u0442\u0430\u0442\u0438) \u043d\u0430 \u0446\u0435\u0439 \u0434\u043e\u043c\u0435\u043d \u0437\u0430\u043f\u0438\u0442\u0438, \u0449\u043e \u043f\u043e\u0445\u043e\u0434\u044f\u0442\u044c \u0432\u0456\u0434 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 Flash/Silverlight, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u042f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447-\u0436\u0435\u0440\u0442\u0432\u0430 \u0437\u0430\u0440\u0435\u0454\u0441\u0442\u0440\u043e\u0432\u0430\u043d\u0438\u0439 \u0432 \u0446\u044c\u043e\u043c\u0443 \u0441\u0435\u0440\u0432\u0456\u0441\u0456, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0432\u0456\u0434\u043f\u0440\u0430\u0432\u043a\u0443 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0436\u0435\u0440\u0442\u0432\u0438 \u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0430\u0442\u0430\u043a\u0438 \u0442\u0438\u043f\u0443 Cross Site Request Forgery (CSRF) \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0436\u0435\u0440\u0442\u0432\u0438. \u0426\u0435 \u043e\u0441\u043e\u0431\u043b\u0438\u0432\u043e \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u044f\u043a\u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.
ascanbeta.crossdomain.adobe.send.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Adobe - Send
ascanbeta.crossdomain.adobe.send.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b crossdomain.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u043d\u043d\u044f (\u043d\u0435 \u043e\u0431\u043e\u0432'\u044f\u0437\u043a\u043e\u0432\u043e \u0447\u0438\u0442\u0430\u043d\u043d\u044f) \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh">. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0442\u0456\u043b\u044c\u043a\u0438 "*" (\u0432\u0441\u0456\u043c \u0434\u043e\u043c\u0435\u043d\u0430\u043c), \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0430 \u0434\u043e \u0430\u0442\u0430\u043a Cross Site Request Forgery (CSRF).
ascanbeta.crossdomain.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f
ascanbeta.crossdomain.refs = https\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc197955(v\=vs.95)\nhttps\://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc838250(v\=vs.95)
ascanbeta.crossdomain.silverlight.desc = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0430 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 Silverlight \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456.
ascanbeta.crossdomain.silverlight.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0438\u043c \u0437\u0430\u043f\u0438\u0442\u0430\u043c, \u0449\u043e \u043f\u043e\u0445\u043e\u0434\u044f\u0442\u044c \u0432\u0456\u0434 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 Silverlight, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443, \u043f\u043e\u0442\u0440\u0430\u043f\u043b\u044f\u0442\u0438 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u042f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447-\u0436\u0435\u0440\u0442\u0432\u0430 \u0443\u0432\u0456\u0439\u0448\u043e\u0432 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443, \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0436\u0435\u0440\u0442\u0432\u0438, \u0449\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u0434\u0430\u043d\u0456 \u0437 \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443 \u0431\u0443\u0434\u0443\u0442\u044c \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u0438\u043c \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u043e\u043c \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0436\u0435\u0440\u0442\u0432\u0438. \u0426\u0435 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438 \u0430\u0442\u0430\u043a\u0438 \u0442\u0438\u043f\u0443 Cross Site Request Forgery (CSRF). \u0426\u0435 \u043e\u0441\u043e\u0431\u043b\u0438\u0432\u043e \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u044f\u043a\u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.
ascanbeta.crossdomain.silverlight.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f - Silverlight
ascanbeta.crossdomain.silverlight.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0444\u0430\u0439\u043b clientaccesspolicy.xml, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u043c\u0435\u043d\u0456\u0432, \u044f\u043a\u0438\u043c \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0440\u043e\u0431\u0438\u0442\u0438 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 <domain uri\="https\://example.com" />. \u0412\u0430\u043c \u0432\u0430\u0440\u0442\u043e \u043d\u0430\u0434\u0430\u0432\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e "*" (\u0432\u0441\u0456\u0445 \u0434\u043e\u043c\u0435\u043d\u0456\u0432), \u0442\u0456\u043b\u044c\u043a\u0438 \u044f\u043a\u0449\u043e \u0432\u0438 \u0432\u043f\u0435\u0432\u043d\u0435\u043d\u0456, \u0449\u043e \u0446\u044f \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0436\u043e\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u043c \u0434\u043e\u0441\u0442\u0443\u043f\u043e\u043c, \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445.

ascanbeta.csrftoken.extrainfo.annotation = \u0426\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439\u043d\u0435 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u0436\u0435\u043d\u043d\u044f, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0444\u043e\u0440\u043c\u0430 \u043c\u0430\u0454 \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0430 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0442\u0435, \u0449\u043e \u0457\u0439 \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0430\u043d\u0442\u0438-CSRF \u043c\u0430\u0440\u043a\u0435\u0440. \u0426\u0435 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044f \u0454 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u044e.
ascanbeta.csrftoken.name = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0430\u043d\u0442\u0438-CSRF \u0442\u043e\u043a\u0435\u043d\u0456\u0432

ascanbeta.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

ascanbeta.elinjection.desc = \u041f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u043f\u043e\u0432\u043d\u0456\u0441\u0442\u044e \u0430\u0431\u043e \u0447\u0430\u0441\u0442\u043a\u043e\u0432\u043e \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 Expression Language (EL) \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043d\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 Java (JSP), \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0432\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u0437 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u044c\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430, \u0430\u043b\u0435 \u043d\u0435 \u0437\u043d\u0435\u0448\u043a\u043e\u0434\u0436\u0443\u0454 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0437\u043d\u0435\u0448\u043a\u043e\u0434\u0436\u0443\u0454 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0456 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0438, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u043f\u0435\u0440\u0435\u0434\u0431\u0430\u0447\u0443\u0432\u0430\u043d\u0438\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 EL \u0434\u043e \u0439\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f. \u0423 \u043f\u0435\u0432\u043d\u0438\u0445 \u0432\u0435\u0440\u0441\u0456\u044f\u0445 Spring 3.0.5 \u0442\u0430 \u0441\u0442\u0430\u0440\u0456\u0448\u0438\u0445 \u0431\u0443\u043b\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0435 \u043c\u0456\u0441\u0446\u0435 (CVE-2011-2730), \u0443 \u044f\u043a\u043e\u043c\u0443 \u0442\u0435\u0433\u0438 Expression Language \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u043b\u0438\u0441\u044f \u0431 \u0434\u0432\u0456\u0447\u0456, \u0449\u043e \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e \u0440\u043e\u0431\u0438\u043b\u043e \u0431\u0443\u0434\u044c-\u044f\u043a\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u044e \u0434\u043e EL-\u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f. \u041e\u0434\u043d\u0430\u043a, \u043d\u0430\u0432\u0456\u0442\u044c \u0443 \u043d\u043e\u0432\u0456\u0448\u0438\u0445 \u0432\u0435\u0440\u0441\u0456\u044f\u0445 \u0446\u044f \u0441\u043b\u0430\u0431\u043a\u0456\u0441\u0442\u044c \u0449\u0435 \u0439 \u0434\u043e\u0441\u0456 \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0432 \u0437\u0430\u043b\u0435\u0436\u043d\u043e\u0441\u0442\u0456 \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457.
ascanbeta.elinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f Expression Language
ascanbeta.elinjection.refs = https\://owasp.org/www-community/vulnerabilities/Expression_Language_Injection\nhttps\://cwe.mitre.org/data/definitions/917.html
ascanbeta.elinjection.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043d\u0430\u0439\u043a\u0440\u0430\u0449\u0456 \u043f\u0440\u0430\u043a\u0442\u0438\u043a\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0434\u0430\u043d\u0438\u0445 \u043f\u0440\u043e\u0442\u0438 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0445 \u0432\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0456 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0435 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u043a\u043e\u043b\u0438 \u0434\u0430\u043d\u0456 \u043d\u0430\u0434\u0445\u043e\u0434\u044f\u0442\u044c \u043d\u0430 \u0440\u0456\u0432\u0435\u043d\u044c EL, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0430\u0442\u043e\u0440 \u043d\u0435 \u0437\u043d\u0430\u0439\u0448\u043e\u0432 \u0436\u043e\u0434\u043d\u043e\u0433\u043e \u043c\u0435\u0442\u0430\u0441\u0438\u043c\u0432\u043e\u043b\u0443 \u0432 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u043e\u043c\u0443 \u0432\u043c\u0456\u0441\u0442\u0456 \u043f\u0435\u0440\u0435\u0434 \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u043d\u043d\u044f\u043c. \u041d\u0430\u0439\u0431\u0456\u043b\u044c\u0448 \u043e\u0447\u0435\u0432\u0438\u0434\u043d\u0456 \u043c\u043e\u0434\u0435\u043b\u0456, \u044f\u043a\u0456 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u044f\u0432\u0438\u0442\u0438, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c ${ \u0456 \#{, \u0430\u043b\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u043e \u0437\u0430\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0443\u0432\u0430\u0442\u0438 \u0446\u0456 \u0434\u0430\u043d\u0456.

ascanbeta.entityExpansion.desc = \u0415\u043a\u0441\u043f\u043e\u043d\u0435\u043d\u0446\u0456\u0430\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u043e\u0431'\u0454\u043a\u0442\u0456\u0432, \u0430\u0431\u043e \u0430\u0442\u0430\u043a\u0430 \u043a\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0438\u0431\u0443\u0445\u0443 \u2014 \u0446\u0435 \u0442\u0438\u043f \u0430\u0442\u0430\u043a\u0438 \u043d\u0430 \u0432\u0456\u0434\u043c\u043e\u0432\u0443 \u0432 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u0456 (DoS). \u0412\u043e\u043d\u0430 \u0441\u043f\u0440\u044f\u043c\u043e\u0432\u0430\u043d\u0430 \u043d\u0430 \u043f\u0430\u0440\u0441\u0435\u0440\u0438 \u043c\u0430\u0440\u043a\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u0445 \u043c\u043e\u0432, \u044f\u043a XML \u0447\u0438 YAML, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u043c\u0430\u043a\u0440\u043e\u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f.
ascanbeta.entityExpansion.name = \u0415\u043a\u0441\u043f\u043e\u043d\u0435\u043d\u0446\u0456\u0430\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u043e\u0431'\u0454\u043a\u0442\u0456\u0432 (\u0430\u0442\u0430\u043a\u0430 \u043a\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0438\u0431\u0443\u0445\u0443)
ascanbeta.entityExpansion.other = \u041a\u0456\u043b\u044c\u043a\u0456\u0441\u0442\u044c \u0441\u0435\u043a\u0443\u043d\u0434, \u0447\u0435\u0440\u0435\u0437 \u044f\u043a\u0456 \u0430\u0442\u0430\u043a\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u0439 HTTP-\u0437\u0430\u043f\u0438\u0442 \u043e\u0442\u0440\u0438\u043c\u0430\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c\: {0}
ascanbeta.entityExpansion.refs = https\://en.wikipedia.org/wiki/Billion_laughs_attack\nhttps\://owasp.org/www-community/vulnerabilities/XML_External_Entity_(XXE)_Processing\nhttps\://cwe.mitre.org/data/definitions/776.html
ascanbeta.entityExpansion.soln = \u0417\u0430\u0445\u0438\u0441\u0442 \u043f\u0440\u043e\u0442\u0438 \u0442\u0430\u043a\u043e\u0433\u043e \u0442\u0438\u043f\u0443 \u0430\u0442\u0430\u043a \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u043d\u044f \u043f\u0430\u043c'\u044f\u0442\u0456, \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043e\u0457 \u0434\u043b\u044f \u043e\u043a\u0440\u0435\u043c\u043e\u0433\u043e \u043f\u0430\u0440\u0441\u0435\u0440\u0430, \u044f\u043a\u0449\u043e \u0432\u0442\u0440\u0430\u0442\u0430 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430 \u0454 \u043f\u0440\u0438\u0439\u043d\u044f\u0442\u043d\u043e\u044e, \u0430\u0431\u043e \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0447\u043d\u0435 \u043f\u043e\u0432\u043e\u0434\u0436\u0435\u043d\u043d\u044f \u0437 \u043e\u0431'\u0454\u043a\u0442\u0430\u043c\u0438 \u0442\u0430 \u0457\u0445 \u043f\u043e\u0432\u0456\u043b\u044c\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0442\u0456\u043b\u044c\u043a\u0438 \u0442\u043e\u0434\u0456, \u043a\u043e\u043b\u0438 (\u0456 \u0442\u043e\u044e \u043c\u0456\u0440\u043e\u044e, \u0432 \u044f\u043a\u0456\u0439) \u0457\u0445 \u0432\u043c\u0456\u0441\u0442 \u0431\u0443\u0434\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e.

ascanbeta.forbiddenBypass.desc = \u041e\u0431\u0445\u0456\u0434 \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0445 \u0442\u043e\u0447\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043a\u0438 403 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u043c, \u044f\u043a\u0449\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043b\u043e \u0432\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0432 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u043a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 200).
ascanbeta.forbiddenBypass.name = \u041e\u0431\u0445\u0456\u0434 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 403
ascanbeta.forbiddenBypass.refs = https\://www.acunetix.com/blog/articles/a-fresh-look-on-reverse-proxy-related-attacks/\nhttps\://i.blackhat.com/us-18/Wed-August-8/us-18-Orange-Tsai-Breaking-Parser-Logic-Take-Your-Path-Normalization-Off-And-Pop-0days-Out-2.pdf\nhttps\://www.contextis.com/en/blog/server-technologies-reverse-proxy-bypass

ascanbeta.httponlysite.desc = \u0421\u0430\u0439\u0442 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437\u0430 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u043e\u043c HTTP, \u0430 \u043d\u0435 HTTPS.
ascanbeta.httponlysite.name = \u0421\u0430\u0439\u0442 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437\u0430 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u043e\u043c HTTP
ascanbeta.httponlysite.otherinfo = {0}\n\u0421\u043f\u0440\u043e\u0431\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f ZAP \u0447\u0435\u0440\u0435\u0437\: {1}
ascanbeta.httponlysite.otherinfo.connectionfail = \u041f\u043e\u043c\u0438\u043b\u043a\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f.
ascanbeta.httponlysite.otherinfo.differenthosts = \u0420\u0456\u0437\u043d\u0456 \u0445\u043e\u0441\u0442\u0438
ascanbeta.httponlysite.otherinfo.noredirection = \u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u043d\u0435 \u0431\u0443\u043b\u043e.
ascanbeta.httponlysite.otherinfo.nossl = \u0421\u0430\u0439\u0442 \u043d\u0435 \u043c\u0430\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0438 SSL/TLS
ascanbeta.httponlysite.otherinfo.redirectionlimit = \u041b\u0456\u043c\u0456\u0442 \u043f\u0435\u0440\u0435\u0441\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u044f\u0433\u043d\u0443\u0442\u043e.
ascanbeta.httponlysite.otherinfo.redirecttohttp = \u041f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043e \u0434\u043e HTTP.
ascanbeta.httponlysite.otherinfo.urinotencoded = \u041d\u0435 \u0432\u0434\u0430\u043b\u043e\u0441\u044f \u0437\u0430\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 URI \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.
ascanbeta.httponlysite.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\nhttps\://letsencrypt.org/
ascanbeta.httponlysite.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432 \u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f SSL (https).

ascanbeta.httpoxy.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u0456\u043d\u0456\u0446\u0456\u044e\u0432\u0430\u0432 \u043f\u0440\u043e\u043a\u0441\u0456-\u0437\u0430\u043f\u0438\u0442 \u0447\u0435\u0440\u0435\u0437 \u043f\u0440\u043e\u043a\u0441\u0456, \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 HTTP Proxy \u0437\u0430\u043f\u0438\u0442\u0443.Httpoxy \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0432\u043f\u043b\u0438\u0432\u0430\u0454 \u043d\u0430 \u043a\u043e\u0434, \u0449\u043e \u043f\u0440\u0430\u0446\u044e\u0454 \u0432 CGI \u0430\u0431\u043e CGI-\u043f\u043e\u0434\u0456\u0431\u043d\u0438\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430\u0445.\n\u0426\u0435 \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c\:\n* \u041a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u043c\u0438 HTTP-\u0437\u0430\u043f\u0438\u0442\u0430\u043c\u0438, \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u0438\u043c\u0438 \u0432\u0435\u0431\u0434\u043e\u0434\u0430\u0442\u043a\u043e\u043c\n* \u0421\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u0442\u0438 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0445 \u0437'\u0454\u0434\u043d\u0430\u043d\u044c \u043d\u0430 \u043e\u0431\u0440\u0430\u043d\u0443 \u043d\u0438\u043c\u0438 \u0430\u0434\u0440\u0435\u0441\u0443 \u0456 \u043f\u043e\u0440\u0442 \u0430\u0431\u043e\n* \u0417\u0430\u0431\u043b\u043e\u043a\u0443\u0432\u0430\u0442\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0437\u043c\u0443\u0441\u0438\u0432\u0448\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0438\u0439 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440
ascanbeta.httpoxy.name = Httpoxy - \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanbeta.httpoxy.otherinfo = \u0412\u0438\u0445\u0456\u0434\u043d\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u0434\u043e {0} \u0431\u0443\u043b\u043e \u0441\u043a\u0435\u0440\u043e\u0432\u0430\u043d\u0435 \u0447\u0435\u0440\u0435\u0437 \u0445\u043e\u0441\u0442 \u0442\u0430 \u043f\u043e\u0440\u0442, \u044f\u043a\u0456 ZAP \u0432\u0441\u0442\u0430\u0432\u0438\u0432 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u043f\u0440\u043e\u043a\u0441\u0456.
ascanbeta.httpoxy.refs = https\://httpoxy.org/
ascanbeta.httpoxy.skipped = \u043c\u0435\u0440\u0435\u0436\u0435\u0432\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0432\u0438\u043c\u043a\u043d\u0435\u043d\u043e
ascanbeta.httpoxy.soln = \u041d\u0430\u0439\u043a\u0440\u0430\u0449\u0438\u043c \u043d\u0435\u0433\u0430\u0439\u043d\u0438\u043c \u0440\u0456\u0448\u0435\u043d\u043d\u044f\u043c \u0454 \u0431\u043b\u043e\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u043f\u0440\u043e\u043a\u0441\u0456-\u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u044f\u043a\u043e\u043c\u043e\u0433\u0430 \u0440\u0430\u043d\u0456\u0448\u0435, \u0434\u043e \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u043e\u043d\u0438 \u043f\u043e\u0442\u0440\u0430\u043f\u043b\u044f\u0442\u044c \u0434\u043e \u0432\u0430\u0448\u043e\u0433\u043e \u0434\u043e\u0434\u0430\u0442\u043a\u0443.

ascanbeta.httpsashttp.desc = \u0412\u043c\u0456\u0441\u0442, \u0434\u043e \u044f\u043a\u043e\u0433\u043e \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u0431\u0443\u0432 \u0434\u043e\u0441\u0442\u0443\u043f \u0447\u0435\u0440\u0435\u0437 HTTPS (\u0442\u043e\u0431\u0442\u043e \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u0448\u0438\u0444\u0440\u0443\u0432\u0430\u043d\u043d\u044f SSL/TLS), \u0442\u0430\u043a\u043e\u0436 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0447\u0435\u0440\u0435\u0437 HTTP (\u0431\u0435\u0437 \u0448\u0438\u0444\u0440\u0443\u0432\u0430\u043d\u043d\u044f). 
ascanbeta.httpsashttp.name = HTTPS-\u0432\u043c\u0456\u0441\u0442 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0447\u0435\u0440\u0435\u0437 HTTP
ascanbeta.httpsashttp.otherinfo = \u0421\u043f\u0440\u043e\u0431\u0430 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f ZAP \u0447\u0435\u0440\u0435\u0437\: {0}
ascanbeta.httpsashttp.refs = https\://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\nhttps\://owasp.org/www-community/Security_Headers\nhttps\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttps\://caniuse.com/stricttransportsecurity\nhttps\://datatracker.ietf.org/doc/html/rfc6797
ascanbeta.httpsashttp.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448\u0456 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0443, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0456 \u0442.\u043f. \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0430\u043a\u043e\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0443 \u043b\u0438\u0448\u0435 \u0447\u0435\u0440\u0435\u0437 HTTPS. \u0420\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f HTTP Strict Transport Security.

ascanbeta.insecurehttpmethod.connect.exploitable.desc = \u041c\u0435\u0442\u043e\u0434 \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e HTTP [{0}] \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0442\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e. \u0412\u0438\u044f\u0432\u0438\u043b\u043e\u0441\u044f, \u0449\u043e \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0446\u044c\u043e\u0433\u043e HTTP-\u043c\u0435\u0442\u043e\u0434\u0443 \u043c\u043e\u0436\u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0442\u0443\u043d\u0435\u043b\u044c\u043e\u0432\u0430\u043d\u0435 \u0437''\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u0437\u0456 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u043c \u0441\u0435\u0440\u0432\u0456\u0441\u043e\u043c.  \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u043b\u043e \u0431 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0441\u0435\u0440\u0432\u0456\u0441 \u044f\u043a \u0430\u043d\u043e\u043d\u0456\u043c\u043d\u0438\u0439 \u0440\u0435\u0442\u0440\u0430\u043d\u0441\u043b\u044f\u0442\u043e\u0440 \u0441\u043f\u0430\u043c\u0443 \u0430\u0431\u043e \u044f\u043a \u0432\u0435\u0431\u043f\u0440\u043e\u043a\u0441\u0456, \u043e\u0431\u0456\u0439\u0448\u043e\u0432\u0448\u0438 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u043d\u044f \u043c\u0435\u0440\u0435\u0436\u0456. \u0426\u0435 \u0442\u0430\u043a\u043e\u0436 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0439\u043e\u0433\u043e, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0442\u0443\u043d\u0435\u043b\u044c\u043e\u0432\u0430\u043d\u0438\u0439 VPN, \u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u043e \u0440\u043e\u0437\u0448\u0438\u0440\u0438\u0432\u0448\u0438 \u043f\u0435\u0440\u0438\u043c\u0435\u0442\u0440 \u043c\u0435\u0440\u0435\u0436\u0456, \u0432\u043a\u043b\u044e\u0447\u0438\u0432\u0448\u0438 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0456 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0438. 
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo = \u041c\u0435\u0442\u043e\u0434 CONNECT \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0441\u043e\u043a\u0435\u0442\u043d\u0435 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u0434\u043e [{0}], \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440.
ascanbeta.insecurehttpmethod.delete.exploitable.desc = \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u0441\u0435\u0440\u0432\u0456\u0441\u0430\u0445 REST. \u0412\u0456\u043d \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u0449\u043e\u0431 \u0432\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0440\u0435\u0441\u0443\u0440\u0441.
ascanbeta.insecurehttpmethod.delete.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.desc = \u041d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0432\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 HTTP [{0}]. \u0417\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0442\u0430 \u0431\u0430\u0437\u043e\u0432\u043e\u0457 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0437\u0430 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043d\u043d\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0430\u0431\u043e \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0440\u0438\u0434\u0430\u0442\u043d\u0438\u043c \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f. \u041c\u0435\u0442\u043e\u0434\u0438 TRACK \u0456 TRACE \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u0434\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0442\u043e\u043a\u0435\u043d\u0443 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457/\u0441\u0435\u0441\u0456\u0439\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 cookie \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u0438\u0439 \u0444\u0430\u0439\u043b cookie \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043f\u0440\u0430\u043f\u043e\u0440\u043e\u043c "HttpOnly". \u0414\u043b\u044f \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0430\u0442\u0430\u043a\u0430 \u0431\u0443\u043b\u0430 \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u044e, \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u044f\u043a \u043f\u0440\u0430\u0432\u0438\u043b\u043e, \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0430\u0431\u043e \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u043c\u0430\u0454 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u043e\u0431\u0445\u043e\u0434\u0443 SOP (Same Origin Policy - \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u043e\u0434\u043d\u0430\u043a\u043e\u0432\u043e\u0433\u043e \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f). \u041c\u0435\u0442\u043e\u0434 ''CONNECT'' \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0432\u0435\u0431\u043a\u043b\u0456\u0454\u043d\u0442\u043e\u043c \u0434\u043b\u044f \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043d\u044f HTTP-\u0442\u0443\u043d\u0435\u043b\u044e \u0434\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0445 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0456\u0432 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0456\u0432.
ascanbeta.insecurehttpmethod.detailed.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 HTTP - {0}
ascanbeta.insecurehttpmethod.extrainfo = \u041c\u0435\u0442\u043e\u0434 OPTIONS \u0440\u043e\u0437\u043a\u0440\u0438\u0432 \u0441\u0442\u0456\u043b\u044c\u043a\u0438 \u0430\u043a\u0442\u0438\u0432\u043d\u0438\u0445 HTTP \u043c\u0435\u0442\u043e\u0434\u0456\u0432 \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443\: [{0}]
ascanbeta.insecurehttpmethod.insecure = \u041a\u043e\u0434 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 {0} \u0434\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e HTTP \u041c\u0415\u0422\u041e\u0414\u0423
ascanbeta.insecurehttpmethod.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 HTTP \u041c\u0435\u0442\u043e\u0434
ascanbeta.insecurehttpmethod.options.exploitable.desc = \u0426\u0435 \u0434\u0456\u0430\u0433\u043d\u043e\u0441\u0442\u0438\u0447\u043d\u0438\u0439 \u043c\u0435\u0442\u043e\u0434, \u0456 \u0439\u043e\u0433\u043e \u043d\u0456\u043a\u043e\u043b\u0438 \u043d\u0435 \u0441\u043b\u0456\u0434 \u0432\u043c\u0438\u043a\u0430\u0442\u0438 \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0447\u043e\u043c\u0443 \u0440\u0435\u0436\u0438\u043c\u0456.
ascanbeta.insecurehttpmethod.options.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u043d\u0430 stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods
ascanbeta.insecurehttpmethod.patch.exploitable.desc = \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u0441\u0435\u0440\u0432\u0456\u0441\u0430\u0445 REST, PATCH \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f, \u0449\u043e\u0431 **\u0437\u043c\u0456\u043d\u0438\u0442\u0438** \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456. \u0417\u0430\u043f\u0438\u0442 PATCH \u043c\u0430\u0454 \u043b\u0438\u0448\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u043c\u0456\u043d\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0430 \u043d\u0435 \u0432\u0435\u0441\u044c \u0440\u0435\u0441\u0443\u0440\u0441.
ascanbeta.insecurehttpmethod.patch.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.potentiallyinsecure = \u043a\u043e\u0434 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 {0} \u0434\u043e \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e HTTP \u041c\u0415\u0422\u041e\u0414\u0423
ascanbeta.insecurehttpmethod.put.exploitable.desc = \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0430\u0432\u0441\u044f \u0434\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439 \u0437 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f\u043c \u0444\u0430\u0439\u043b\u0430\u043c\u0438. \u0417\u0430\u0440\u0430\u0437 \u0432\u043e\u043d\u0430 \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 REST-\u0441\u0435\u0440\u0432\u0456\u0441\u0430\u0445, PUT \u043d\u0430\u0439\u0447\u0430\u0441\u0442\u0456\u0448\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043b\u044f **\u043e\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f** \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0435\u0439, PUT \u0434\u043e \u0432\u0456\u0434\u043e\u043c\u043e\u0433\u043e URI \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0437 \u0442\u0456\u043b\u043e\u043c \u0437\u0430\u043f\u0438\u0442\u0443, \u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043d\u0435\u0449\u043e\u0434\u0430\u0432\u043d\u043e \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u0435 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443..
ascanbeta.insecurehttpmethod.put.exploitable.extrainfo = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0449\u043e\u0434\u043e stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods, \u0449\u043e\u0431 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0457 REST, \u0434\u0438\u0432.\: https\://www.restapitutorial.com/lessons/httpmethods.html
ascanbeta.insecurehttpmethod.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u043c\u0435\u0442\u043e\u0434\u0438 TRACK, TRACE, \u0442\u0430 CONNECT \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0442\u0430 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u0431\u0430\u0437\u043e\u0432\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0456\u0441\u0443 \u043d\u0435 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u043c\u0435\u0442\u043e\u0434\u0438.
ascanbeta.insecurehttpmethod.trace.exploitable.desc = \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0443 \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 HTTP-\u043c\u0435\u0442\u043e\u0434 [{0}], \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438. \u041c\u0435\u0442\u043e\u0434\u0438 TRACK \u0456 TRACE \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u0434\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457 \u043c\u0430\u0440\u043a\u0435\u0440\u0443 \u0430\u0431\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 cookie \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0441\u0435\u0441\u0456\u0439\u043d\u0438\u0439 \u0444\u0430\u0439\u043b cookie \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043f\u0440\u0430\u043f\u043e\u0440\u043e\u043c "HttpOnly".
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo = \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0437\u0430\u043f\u0438\u0442\u0443 \u0431\u0443\u043b\u043e \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0437\u0430\u043f\u0438\u0442 TRACE \u0437\u0456 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c cookie [{0}]. \u0426\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f cookie \u0431\u0443\u043b\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u043e \u0432 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0449\u043e \u043f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0438\u043b\u043e \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c.
ascanbeta.insecurehttpmethod.webdav.exploitable.desc = \u0426\u0435\u0439 HTTP-\u043c\u0435\u0442\u043e\u0434 \u0454 \u043c\u0435\u0442\u043e\u0434\u043e\u043c WEBDAV\: {0}. \u042f\u043a\u0449\u043e \u0446\u0435\u0439 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0435 \u043f\u0440\u043e\u043f\u043e\u043d\u0443\u0454 \u0436\u043e\u0434\u043d\u0438\u0445 \u043f\u043e\u0441\u043b\u0443\u0433 WEBDAV services, \u0446\u0456 \u043c\u0435\u0442\u043e\u0434\u0438 \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c\u0438.
ascanbeta.insecurehttpmethod.webdav.exploitable.extrainfo = \u0414\u0438\u0432\u0456\u0442\u044c\u0441\u044f \u043e\u0431\u0433\u043e\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u043d\u0430 stackexchange\: https\://security.stackexchange.com/questions/21413/how-to-exploit-http-methods

ascanbeta.integeroverflow.desc = \u0423\u043c\u043e\u0432\u0430 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u0446\u0456\u043b\u043e\u0433\u043e \u0447\u0438\u0441\u043b\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454, \u043a\u043e\u043b\u0438 \u0446\u0456\u043b\u0435 \u0447\u0438\u0441\u043b\u043e, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0443 \u0441\u043a\u043e\u043c\u043f\u0456\u043b\u044c\u043e\u0432\u0430\u043d\u0456\u0439 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456, \u0432\u0438\u0445\u043e\u0434\u0438\u0442\u044c \u0437\u0430 \u043c\u0435\u0436\u0456 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0443 \u0456 \u043d\u0435 \u0431\u0443\u043b\u043e \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u043e \u0437 \u0432\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0443.
ascanbeta.integeroverflow.error1 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f.  \u041a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 \u0437\u043c\u0456\u043d\u0438\u0432\u0441\u044f \u043f\u0440\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0434\u043e\u0432\u0433\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u0432\u0438\u043f\u0430\u0434\u043a\u043e\u0432\u0438\u0445 \u0446\u0456\u043b\u0438\u0445 \u0447\u0438\u0441\u0435\u043b.
ascanbeta.integeroverflow.error2 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f.  \u041a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 \u0437\u043c\u0456\u043d\u0438\u0432\u0441\u044f \u043f\u0440\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0434\u043e\u0432\u0433\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u043d\u0443\u043b\u0456\u0432.
ascanbeta.integeroverflow.error3 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f.  \u041a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 \u0437\u043c\u0456\u043d\u0438\u0432\u0441\u044f \u043f\u0440\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0434\u043e\u0432\u0433\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u043e\u0434\u0438\u043d\u0438\u0446\u044c.
ascanbeta.integeroverflow.error4 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f.  \u041a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443 \u0437\u043c\u0456\u043d\u0438\u0432\u0441\u044f \u043f\u0440\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u0434\u043e\u0432\u0433\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u0434\u0435\u0432'\u044f\u0442\u043e\u043a.
ascanbeta.integeroverflow.name = \u041f\u043e\u043c\u0438\u043b\u043a\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f
ascanbeta.integeroverflow.refs = https\://en.wikipedia.org/wiki/Integer_overflow\nhttps\://cwe.mitre.org/data/definitions/190.html
ascanbeta.integeroverflow.soln = \u0429\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f\u043c \u0456 \u043f\u043e\u043c\u0438\u043b\u043a\u0430\u043c \u0434\u0456\u043b\u0435\u043d\u043d\u044f \u043d\u0430 0 (\u043d\u0443\u043b\u044c) \u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456, \u0431\u0443\u0434\u044c \u043b\u0430\u0441\u043a\u0430, \u043f\u0435\u0440\u0435\u043f\u0438\u0448\u0456\u0442\u044c \u0431\u0435\u043a\u0435\u043d\u0434-\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0432\u0448\u0438, \u0447\u0438 \u0437\u043d\u0430\u0445\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0446\u0456\u043b\u0438\u0445 \u0447\u0438\u0441\u0435\u043b, \u0449\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c\u0441\u044f, \u0432 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u043e\u043c\u0443 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0456 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438. \u0426\u0435 \u0432\u0438\u043c\u0430\u0433\u0430\u0442\u0438\u043c\u0435 \u043f\u0435\u0440\u0435\u043a\u043e\u043c\u043f\u0456\u043b\u044f\u0446\u0456\u0457 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 \u0431\u0435\u043a\u0435\u043d\u0434\u0430.

ascanbeta.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f - \u0431\u0435\u0442\u0430

ascanbeta.noanticsrftokens.desc = \u0423 HTML-\u0444\u043e\u0440\u043c\u0456 \u043f\u043e\u0434\u0430\u043d\u043d\u044f \u043d\u0435 \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0436\u043e\u0434\u043d\u0438\u0445 \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF.
ascanbeta.noanticsrftokens.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF

ascanbeta.oobxss.name = Out of Band XSS
ascanbeta.oobxss.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.

ascanbeta.proxydisclosure.attack = \u041c\u0435\u0442\u043e\u0434\u0438 TRACE, OPTIONS \u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c 'Max-Forwards'. \u041c\u0435\u0442\u043e\u0434 TRACK.
ascanbeta.proxydisclosure.desc = {0} \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440(\u0456\u0432) \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0430\u0431\u043e \u0437\u043d\u044f\u0442\u043e \u0432\u0456\u0434\u0431\u0438\u0442\u043a\u0438 \u043f\u0430\u043b\u044c\u0446\u0456\u0432. \u0426\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u043c\u0443 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438\n  - \u0421\u043f\u0438\u0441\u043e\u043a \u0446\u0456\u043b\u0435\u0439 \u0434\u043b\u044f \u0430\u0442\u0430\u043a\u0438 \u043d\u0430 \u0434\u043e\u0434\u0430\u0442\u043e\u043a.\n  - \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u043d\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445, \u044f\u043a\u0456 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c \u0434\u043e\u0434\u0430\u0442\u043e\u043a.\n  - \u041d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u0430\u0431\u043e \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0441\u0442\u044c \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043f\u0440\u043e\u043a\u0441\u0456, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0441\u043f\u0440\u0438\u0447\u0438\u043d\u0438\u0442\u0438 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043d\u044f, \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0430\u043d\u043d\u044f \u0430\u0431\u043e \u043f\u043e\u043c\u2019\u044f\u043a\u0448\u0435\u043d\u043d\u044f \u0430\u0442\u0430\u043a \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443.
ascanbeta.proxydisclosure.extrainfo.proxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.proxyserver.header = \u0417\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043c\u0435\u0442\u043e\u0434\u0456\u0432 TRACE, OPTIONS \u0456 TRACK \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u043c\u0456\u0436 ZAP \u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u043c/\u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c\: 
ascanbeta.proxydisclosure.extrainfo.silentproxyserver = - {0}
ascanbeta.proxydisclosure.extrainfo.silentproxyserver.header = \u0411\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0456 'silent' \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438. \u0427\u0435\u0440\u0435\u0437 \u0457\u0445\u043d\u044e \u043f\u043e\u0432\u0435\u0434\u0456\u043d\u043a\u0443 \u043d\u0435\u0432\u0456\u0434\u043e\u043c\u043e, \u0432 \u044f\u043a\u0456\u0439 \u0442\u043e\u0447\u0446\u0456 \u0442\u043e\u043f\u043e\u043b\u043e\u0433\u0456\u0457 \u043c\u0435\u0440\u0435\u0436\u0456 \u0437\u043d\u0430\u0445\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u0446\u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438\:
ascanbeta.proxydisclosure.extrainfo.traceenabled = \u041c\u0435\u0442\u043e\u0434 "TRACE" \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043d\u0430 \u043e\u0434\u043d\u043e\u043c\u0443 \u0430\u0431\u043e \u0434\u0435\u043a\u0456\u043b\u044c\u043a\u043e\u0445 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445 \u0430\u0431\u043e \u043d\u0430 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456. \u0426\u0435\u0439 \u043c\u0435\u0442\u043e\u0434 \u043f\u0435\u0440\u0435\u0434\u0430\u0454 \u0432\u0441\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u0443 \u0437 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0456\u0432, \u043d\u0430\u0437\u0430\u0434  \u0430\u0433\u0435\u043d\u0442\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u043b\u0435\u0433\u0448\u0438\u0442\u0438 \u043f\u0440\u043e\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0430\u0442\u0430\u043a "\u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e \u0432\u0456\u0434\u0441\u0442\u0435\u0436\u0435\u043d\u043d\u044f".
ascanbeta.proxydisclosure.extrainfo.unknown = \u041d\u0435\u0432\u0456\u0434\u043e\u043c\u043e
ascanbeta.proxydisclosure.extrainfo.webserver = - {0}
ascanbeta.proxydisclosure.extrainfo.webserver.header = \u0411\u0443\u043b\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440/\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432\: 
ascanbeta.proxydisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0434\u043e\u0432\u0456\u0440\u0435\u043d\u0438\u0445 \u043e\u0441\u0456\u0431
ascanbeta.proxydisclosure.refs = https\://tools.ietf.org/html/rfc7231\#section-5.1.2
ascanbeta.proxydisclosure.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043c\u0435\u0442\u043e\u0434 'TRACE' \u043d\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043d\u0430 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456/\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432.\n\u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043c\u0435\u0442\u043e\u0434 'OPTIONS' \u043d\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u0445, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043d\u0430 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456/\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u044f\u043a\u0449\u043e \u0432\u0456\u043d \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u0438\u0439 \u0434\u043b\u044f \u0456\u043d\u0448\u0438\u0445 \u0446\u0456\u043b\u0435\u0439, \u044f\u043a 'CORS' (Cross Origin Resource Sharing).\n\u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0442\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432 \u0437\u0456 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u043c\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u043f\u043e\u043c\u0438\u043b\u043e\u043a, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0432\u0438\u0442\u043e\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u0432\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043e\u043a, \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440\u043d\u0438\u0445 \u0434\u043b\u044f \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0443, \u0443 \u0440\u0430\u0437\u0456 \u0432\u0438\u043d\u0438\u043a\u043d\u0435\u043d\u043d\u044f \u043f\u043e\u043c\u0438\u043b\u043e\u043a HTTP, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u0430\u043f\u0438\u0442\u0438 'TRACK' \u0434\u043b\u044f \u043d\u0435\u0456\u0441\u043d\u0443\u044e\u0447\u0438\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a.\n\u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0441\u0456 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432 \u0456 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0442\u0430\u043a, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0456\u044e \u0442\u0430 \u0432\u0435\u0440\u0441\u0456\u044e \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 'Server' \u0456 'X-Powered-By'.

ascanbeta.relativepathconfusion.desc = \u0412\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u043d\u0430\u0434\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 \u043d\u0430 \u043d\u0435\u043e\u0434\u043d\u043e\u0437\u043d\u0430\u0447\u043d\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0442\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0449\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043f\u043b\u0443\u0442\u0430\u043d\u0438\u043d\u0438 \u0449\u043e\u0434\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0433\u043e \u00ab\u0432\u0456\u0434\u043d\u043e\u0441\u043d\u043e\u0433\u043e \u0448\u043b\u044f\u0445\u0443\u00bb \u0434\u043b\u044f URL-\u0430\u0434\u0440\u0435\u0441\u0438. \u0420\u0435\u0441\u0443\u0440\u0441\u0438 (CSS, \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e) \u0442\u0430\u043a\u043e\u0436 \u0432\u043a\u0430\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445, \u0430 \u043d\u0435 \u0430\u0431\u0441\u043e\u043b\u044e\u0442\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441. \u041f\u0456\u0434 \u0447\u0430\u0441 \u0430\u0442\u0430\u043a\u0438, \u044f\u043a\u0449\u043e \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0454 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u00ab\u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443\u00bb \u0434\u043e\u0437\u0432\u0456\u043b\u044c\u043d\u0438\u043c \u0441\u043f\u043e\u0441\u043e\u0431\u043e\u043c \u0430\u0431\u043e \u0439\u043e\u0433\u043e \u043c\u043e\u0436\u043d\u0430 \u043e\u0431\u043c\u0430\u043d\u043e\u043c \u0437\u043c\u0443\u0441\u0438\u0442\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0432\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u00ab\u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443\u00bb, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0442\u0430\u043a\u0456 \u043c\u0435\u0442\u043e\u0434\u0438, \u044f\u043a \u0444\u0440\u0435\u0439\u043c\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u043e\u0434\u0456 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u043c\u043e\u0436\u043d\u0430 \u043e\u0431\u0434\u0443\u0440\u0438\u0442\u0438, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0430\u0446\u0456\u044f HTML \u044f\u043a CSS (\u0430\u0431\u043e \u0456\u043d\u0448\u0438\u0445 \u0442\u0438\u043f\u0456\u0432 \u0432\u043c\u0456\u0441\u0442\u0443), \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 XSS.
ascanbeta.relativepathconfusion.extrainfo.contenttypeenabled = \u0412\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 "{0}". \u042f\u043a\u0449\u043e \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u0432\u043e\u0440\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u0438\u043d\u0442\u0430\u043a\u0441\u0438\u0447\u043d\u043e\u0433\u043e \u0430\u043d\u0430\u043b\u0456\u0437\u0443, \u0446\u0435 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0430\u0442\u0438\u043c\u0435 \u0443\u0441\u043f\u0456\u0445\u0443 \u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u0438\u0445 \u0430\u0442\u0430\u043a \u043d\u0430 \u0432\u043c\u0456\u0441\u0442. \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u0443 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456 \u0432\u0438\u043c\u043a\u043d\u0435 \u0441\u0443\u0432\u043e\u0440\u0438\u0439 \u0430\u043d\u0430\u043b\u0456\u0437.
ascanbeta.relativepathconfusion.extrainfo.framingallowed = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Frame-Options \u043d\u0435 \u0432\u043a\u0430\u0437\u0430\u043d\u043e, \u0442\u043e\u043c\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u043c\u043e\u0436\u043d\u0430 \u043f\u043e\u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0432 \u0440\u0430\u043c\u043a\u0443, \u0456 \u0446\u0435 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0432\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043d\u044f \u0440\u0435\u0436\u0438\u043c\u0443 \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.extrainfo.morethanonebasetag = \u0411\u0456\u043b\u044c\u0448 \u043d\u0456\u0436 \u043e\u0434\u0438\u043d \u0442\u0435\u0433 <base> \u0431\u0443\u043b\u043e \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u0432 \u0442\u0435\u0433\u0443 HTML <head> \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441, \u0449\u043e \u0454 \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u043c.
ascanbeta.relativepathconfusion.extrainfo.nobasetag = \u0422\u0435\u0433 <base> \u043d\u0435 \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u0432 \u0442\u0435\u0433\u0443 <head> HTML \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441.
ascanbeta.relativepathconfusion.extrainfo.nocontenttype = \u0422\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 \u043d\u0435 \u0432\u043a\u0430\u0437\u0430\u043d\u043e, \u0442\u043e\u043c\u0443 \u0440\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0443 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e <meta http-equiv\="{0}", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0441\u0442\u0430\u0440\u043e\u0433\u043e DOCTYPE \u0437 PUBLIC id "{0}", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 \u0443 \u043f\u0435\u0432\u043d\u0438\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u0445.
ascanbeta.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype = \u0420\u0435\u0436\u0438\u043c \u0441\u0443\u043c\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u043d\u0435\u044f\u0432\u043d\u043e \u0432\u043c\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u043e\u0441\u0442\u0456 DOCTYPE, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043e\u0431\u0456\u0439\u0442\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443.
ascanbeta.relativepathconfusion.name = \u041f\u043b\u0443\u0442\u0430\u043d\u0438\u043d\u0430 \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u043e\u0433\u043e \u0448\u043b\u044f\u0445\u0443
ascanbeta.relativepathconfusion.refs = https\://arxiv.org/abs/1811.00917\nhttps\://hsivonen.fi/doctype/\nhttps\://www.w3schools.com/tags/tag_base.asp
ascanbeta.relativepathconfusion.soln = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u0442\u0430 \u0444\u0440\u0435\u0439\u043c\u0432\u043e\u0440\u043a\u0438 \u0441\u043b\u0456\u0434 \u043e\u043d\u043e\u0432\u0438\u0442\u0438 \u0442\u0430 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u0442\u0438 \u0442\u0430\u043a, \u0449\u043e\u0431 \u0432\u043e\u043d\u0438 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u043b\u0438 \u043d\u0430 \u043d\u0435\u043e\u0434\u043d\u043e\u0437\u043d\u0430\u0447\u043d\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0442\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0449\u043e \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0439 \u0448\u043b\u044f\u0445 \u0434\u043e \u0442\u0430\u043a\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430\u043c\u0438 \u044f\u043a \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u0442\u0430\u043a \u0456 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.\n\u0423 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0443 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f HTML-\u0442\u0435\u0433\u0430 "<base>" \u0443 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043e\u0434\u043d\u043e\u0437\u043d\u0430\u0447\u043d\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u044c \u0431\u0430\u0437\u043e\u0432\u0443 URL-\u0430\u0434\u0440\u0435\u0441\u0443 \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0438\u0445 URL-\u0430\u0434\u0440\u0435\u0441 \u0443 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0456.\n\u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "Content-Type", \u0449\u043e\u0431 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u0431\u0443\u043b\u043e \u0441\u043a\u043b\u0430\u0434\u043d\u0456\u0448\u0435 \u0437\u043c\u0443\u0441\u0438\u0442\u0438 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0443\u0432\u0430\u0442\u0438 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.\n\u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "X-Content-Type-Options\: nosniff", \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 "\u0432\u0438\u043d\u044e\u0445\u0443\u0432\u0430\u043d\u043d\u044e" \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.\n\u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 DOCTYPE, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, "<\!doctype html>", \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0443 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456 \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c "Quirks Mode", \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0446\u0435 \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u0456\u0433\u043d\u043e\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c.\n\u0412\u043a\u0430\u0436\u0456\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "X-Frame-Options", \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0432\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043d\u044e \u0440\u0435\u0436\u0438\u043c\u0443 Quirks Mode \u0443 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0444\u0440\u0435\u0439\u043c\u0432\u043e\u0440\u043a\u043e\u0432\u0438\u0445 \u0430\u0442\u0430\u043a.\n\n\n\n

ascanbeta.sessionfixation.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionfixation.alert.cookie.extrainfo = \u0424\u0430\u0439\u043b cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c, \u043a\u043e\u043b\u0438 \u043f\u043e\u043b\u0435 cookie [{0}] \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL\: [{1}]\n\u0424\u0430\u0439\u043b cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456\u0437 \u0437\u0430\u043f\u043e\u0437\u0438\u0447\u0435\u043d\u0438\u043c (\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u043c) \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c cookie \u0443 \u0437\u0430\u043f\u0438\u0442\u0456 [{1}] \: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.\n\n\u0426\u044e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0432\u0448\u0438, \u0447\u0438 \u0442\u043e\u043a\u0435\u043d \u0441\u0435\u0430\u043d\u0441\u0443, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439 \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0432\u0445\u043e\u0434\u0443, \u0437\u0430\u043b\u0438\u0448\u0430\u0454\u0442\u044c\u0441\u044f \u0434\u0456\u0439\u0441\u043d\u0438\u043c \u043f\u0456\u0441\u043b\u044f \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443, \u0456 \u0449\u043e \u043c\u0430\u0440\u043a\u0435\u0440 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u0440\u044f\u043c\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438/\u0440\u0435\u0441\u0443\u0440\u0441\u0443, \u0434\u043b\u044f \u044f\u043a\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0443\u0432\u0456\u0439\u0442\u0438 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionfixation.alert.url.extrainfo = \u0406\u043c\u043e\u0432\u0456\u0440\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443 \u0437\u2019\u044f\u0432\u0438\u043b\u043e\u0441\u044f \u0432 URL-\u0430\u0434\u0440\u0435\u0441\u0430\u0445 \u0443 \u0432\u0438\u0432\u0435\u0434\u0435\u043d\u0438\u0445 HTML-\u0430\u0434\u0440\u0435\u0441\u0430\u0445, \u043a\u043e\u043b\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 URL-\u0430\u0434\u0440\u0435\u0441\u0438/\u043f\u0441\u0435\u0432\u0434\u043e\u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 URL-\u0430\u0434\u0440\u0435\u0441\u0438 [{0}] \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL\: [{1}]\n\u041a\u043e\u043b\u0438 \u0446\u0435\u0439 \u00ab\u043f\u043e\u0437\u0438\u0447\u0435\u043d\u0438\u0439\u00bb \u0441\u0435\u0430\u043d\u0441 [{1}] \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u043e\u043c\u0443 \u0437\u0430\u043f\u0438\u0442\u0456 \u0434\u043b\u044f \u0446\u0456\u0454\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u043d\u043e\u0432\u0438\u0439 \u0441\u0435\u0430\u043d\u0441 \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0454\u0442\u044c\u0441\u044f.
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.
ascanbeta.sessionfixation.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0430 \u0444\u0456\u043a\u0441\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443. \u042f\u043a\u0449\u043e \u0446\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0437 URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e \u0432\u0445\u043e\u0434\u0443 (\u0434\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0454\u0442\u044c\u0441\u044f \u0432 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0456), \u0442\u043e\u0434\u0456 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u0434\u0430\u0442\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0443 \u0440\u0430\u0437\u043e\u043c \u0456\u0437 \u0444\u0456\u043a\u0441\u043e\u0432\u0430\u043d\u0438\u043c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u043e\u043c \u0441\u0435\u0430\u043d\u0441\u0443 \u0436\u0435\u0440\u0442\u0432\u0456, \u0449\u043e\u0431 \u043f\u0456\u0437\u043d\u0456\u0448\u0435 \u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u0442\u0438 \u043e\u0441\u043e\u0431\u0443 \u0436\u0435\u0440\u0442\u0432\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0432\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443. \u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0437\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u043e\u044e \u0431\u0435\u0437 \u0432\u0445\u043e\u0434\u0443, URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0442\u0430 \u0444\u0456\u043a\u0441\u043e\u0432\u0430\u043d\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u043b\u0438\u0448\u0435 \u0434\u043b\u044f \u0432\u0456\u0434\u0441\u0442\u0435\u0436\u0435\u043d\u043d\u044f \u0434\u0456\u0439 \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u042f\u043a\u0449\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0438\u043d\u0438\u043a\u0430\u0454 \u0432 \u043f\u043e\u043b\u0456 cookie \u0430\u0431\u043e \u043f\u043e\u043b\u0456 \u0444\u043e\u0440\u043c\u0438 (\u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 POST), \u0430 \u043d\u0435 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 (GET), \u0442\u043e \u043c\u043e\u0436\u0435 \u0437\u043d\u0430\u0434\u043e\u0431\u0438\u0442\u0438\u0441\u044f \u044f\u043a\u0430\u0441\u044c \u0456\u043d\u0448\u0430 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u043f\u043e\u043b\u0435 cookie \u0443 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456 \u0436\u0435\u0440\u0442\u0432\u0438, \u0449\u043e\u0431 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0442\u0438 \u0435\u043a\u0441\u043f\u043b\u0443\u0430\u0442\u0430\u0446\u0456\u0457.
ascanbeta.sessionfixation.name = \u0424\u0456\u043a\u0441\u0430\u0446\u0456\u044f \u0441\u0435\u0430\u043d\u0441\u0443
ascanbeta.sessionfixation.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication\nhttps\://owasp.org/www-community/attacks/Session_fixation\nhttps\://acrossecurity.com/papers/session_fixation.pdf\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html
ascanbeta.sessionfixation.soln = 1) \u041d\u0435 \u0434\u0430\u0439\u0442\u0435 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443, \u0437\u0430\u043f\u0440\u043e\u0432\u0430\u0434\u0438\u0432\u0448\u0438 \u0441\u0443\u0432\u043e\u0440\u0456 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0438 \u0441\u0435\u0430\u043d\u0441\u0456\u0432 \u0442\u0430 \u0432\u0438\u0434\u0456\u043b\u044f\u044e\u0447\u0438 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0438 \u0441\u0435\u0430\u043d\u0441\u0456\u0432 \u043b\u0438\u0448\u0435 \u043f\u0456\u0441\u043b\u044f \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u0457 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0432 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0443.\n2) \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u0437\u0430\u0432\u0436\u0434\u0438 \u0441\u0442\u0432\u043e\u0440\u044e\u0432\u0430\u0442\u0438 \u043d\u043e\u0432\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043f\u0456\u0441\u043b\u044f \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457, \u043d\u0435\u0437\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u0442\u043e\u0433\u043e, \u0447\u0438 \u0432\u0436\u0435 \u0456\u0441\u043d\u0443\u0454 \u0441\u0435\u0430\u043d\u0441.\n3) \u041f\u0440\u0438\u0432'\u044f\u0436\u0456\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0434\u043e \u043f\u0435\u0432\u043d\u043e\u0457 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u044f\u043a\u0443 \u043c\u043e\u0436\u043d\u0430 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0432\u0430\u0442\u0438, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, IP-\u0430\u0434\u0440\u0435\u0441\u0438, \u0441\u0435\u0440\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u0430 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 SSL.\n4) \u0421\u0435\u0441\u0456\u0457 \u043f\u0440\u0438 \u0437\u043d\u0438\u0449\u0435\u043d\u043d\u0456 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0437\u043d\u0438\u0449\u0435\u043d\u0456 \u044f\u043a \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456, \u0442\u0430\u043a \u0456 \u043d\u0430 \u043a\u043b\u0456\u0454\u043d\u0442\u0456.\n5) \u0420\u0435\u0430\u043b\u0456\u0437\u0443\u0439\u0442\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0432\u0438\u0445\u043e\u0434\u0443 \u0437 \u0441\u0438\u0441\u0442\u0435\u043c\u0438, \u044f\u043a\u0438\u0439 \u0437\u043d\u0438\u0449\u0438\u0442\u044c \u0432\u0441\u0456 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u0456 \u0441\u0435\u0430\u043d\u0441\u0438 \u0434\u043b\u044f \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n6) \u0417\u0430\u043f\u0440\u043e\u0432\u0430\u0434\u044c\u0442\u0435 \u0447\u0430\u0441 \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443.\n7) \u041f\u0435\u0440\u0435\u0439\u0434\u0456\u0442\u044c \u0432\u0456\u0434 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0434\u043e \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0430\u0431\u043e \u0444\u043e\u0440\u043c, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u043e\u0441\u0442\u0430\u043d\u043d\u0456 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0432\u0438\u043c\u0430\u0433\u0430\u044e\u0442\u044c \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0445 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0435\u0439, \u0449\u043e\u0431 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0438\u043c\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c.\n

ascanbeta.sessionidaccessiblebyjavascript.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo = \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 {0} \u043f\u043e\u043b\u0435 [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}] \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e JavaScript \u0443 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.
ascanbeta.sessionidaccessiblebyjavascript.desc = \u0424\u0430\u0439\u043b cookie \u0437 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u043e\u043c \u0441\u0435\u0430\u043d\u0441\u0443, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u0438\u0439 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c (\u043a\u043e\u043b\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0437\u043c\u0456\u043d\u044e\u0454\u0442\u044c\u0441\u044f \u0448\u043b\u044f\u0445\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u043f\u043e\u043b\u044f \u043d\u0430\u0437\u0432\u0430\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u0432 NULL), \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e JavaScript \u043d\u0430 \u043a\u043b\u0456\u0454\u043d\u0442\u0441\u044c\u043a\u0456\u0439 \u0441\u0442\u043e\u0440\u043e\u043d\u0456. \u0423 \u043f\u043e\u0454\u0434\u043d\u0430\u043d\u043d\u0456 \u0437 \u0456\u043d\u0448\u043e\u044e \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044e \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043f\u0435\u0440\u0435\u0445\u043e\u043f\u043b\u0435\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443.
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 Cookie \u0414\u043e\u0441\u0442\u0443\u043f\u043d\u043e \u0434\u043b\u044f JavaScript
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.refs=
ascanbeta.sessionidaccessiblebyjavascript.soln = 1) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043f\u0440\u0430\u043f\u043e\u0440\u0435\u0446\u044c "httponly" \u043f\u0440\u0438 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u0456 \u0444\u0430\u0439\u043b\u0443 cookie, \u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0441\u0456\u0457, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e JavaScript \u0443 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456.

ascanbeta.sessionidexpiry.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidexpiry.alert.extrainfo = \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 {0} \u043f\u043e\u043b\u0435 [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0435 \u0434\u043e [{3}] (\u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 cookie \u0431\u0443\u043b\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0432 {4}), \u044f\u043a\u0449\u043e \u0442\u0456\u043b\u044c\u043a\u0438 \u0441\u0435\u0430\u043d\u0441 \u043d\u0435 \u0431\u0443\u0434\u0435 \u0437\u043d\u0438\u0449\u0435\u043d\u043e.
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionidexpiry.browserclose = \u0417\u0430\u043a\u0440\u0438\u0442\u0438 \u0431\u0440\u0430\u0443\u0437\u0435\u0440
ascanbeta.sessionidexpiry.desc = \u0424\u0430\u0439\u043b cookie \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u0438\u0439 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c (\u044f\u043a\u0449\u043e URL-\u0430\u0434\u0440\u0435\u0441\u0443 \u0437\u043c\u0456\u043d\u0435\u043d\u043e \u0448\u043b\u044f\u0445\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL \u0434\u043b\u044f \u043f\u043e\u043b\u044f \u0456\u043c\u0435\u043d\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430), \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u044f\u043a \u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u043f\u0440\u043e\u0442\u044f\u0433\u043e\u043c \u043d\u0430\u0434\u043c\u0456\u0440\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0456\u043e\u0434\u0443 \u0447\u0430\u0441\u0443. \u0426\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c, \u044f\u043a\u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0437\u0430\u0431\u0443\u0434\u0435 \u0432\u0438\u0439\u0442\u0438, \u044f\u043a\u0449\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u044f \u0432\u0438\u0445\u043e\u0434\u0443 \u043d\u0435 \u0437\u043d\u0438\u0449\u0438\u0442\u044c \u0441\u0435\u0430\u043d\u0441 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0430\u0431\u043e \u044f\u043a\u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u043e \u0456\u043d\u0448\u0438\u043c \u0441\u043f\u043e\u0441\u043e\u0431\u043e\u043c.
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name = \u0427\u0430\u0441 \u0434\u0456\u0457 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443/\u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u0438\u0439 \u0432\u0456\u043a \u043d\u0430\u0434\u043c\u0456\u0440\u043d\u043e \u0434\u043e\u0432\u0433\u0438\u0439
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.refs=
ascanbeta.sessionidexpiry.soln = 1) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0449\u043e\u0434\u043e \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u00abExpire\u00bb \u0430\u0431\u043e \u00abMax-Age\u00bb, \u043a\u043e\u043b\u0438 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454\u0442\u0435 cookie, \u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0439\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0441\u0442\u0456 \u043f\u0440\u043e\u0442\u044f\u0433\u043e\u043c \u0442\u0440\u0438\u0432\u0430\u043b\u0438\u0445 \u043f\u0435\u0440\u0456\u043e\u0434\u0456\u0432 \u0447\u0430\u0441\u0443.\n2) \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u044f \u0432\u0438\u0445\u043e\u0434\u0443 \u0437 \u0441\u0438\u0441\u0442\u0435\u043c\u0438 \u0456\u0441\u043d\u0443\u0454 \u0442\u0430 \u0449\u043e \u0432\u043e\u043d\u0430 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0440\u0443\u0439\u043d\u0443\u0454 \u0441\u0435\u0430\u043d\u0441.\n3) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0456\u043d\u0448\u0456 \u0437\u0430\u043f\u043e\u0431\u0456\u0436\u043d\u0456 \u0437\u0430\u0445\u043e\u0434\u0438, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u044f\u043a\u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u043e, \u0432\u0456\u043d \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0438\u0439.
ascanbeta.sessionidexpiry.timeexpired = \u0422\u0435\u0440\u043c\u0456\u043d \u0434\u0456\u0457 \u043c\u0438\u043d\u0443\u0432
ascanbeta.sessionidexpiry.timelessthanonehour = \u041c\u0435\u043d\u0448\u0435, \u043d\u0456\u0436 \u0433\u043e\u0434\u0438\u043d\u0443
ascanbeta.sessionidexpiry.timemorethanoneday = \u041c\u0435\u043d\u0448\u0435, \u043d\u0456\u0436 \u0434\u0435\u043d\u044c
ascanbeta.sessionidexpiry.timemorethanonehour = \u0411\u0456\u043b\u044c\u0448\u0435, \u043d\u0456\u0436 \u0433\u043e\u0434\u0438\u043d\u0443
ascanbeta.sessionidexpiry.timemorethanoneweek = \u0411\u0456\u043b\u044c\u0448\u0435, \u043d\u0456\u0436 \u0442\u0438\u0436\u0434\u0435\u043d\u044c

ascanbeta.sessionidexposedinurl.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidexposedinurl.alert.extrainfo = {0} \u043f\u043e\u043b\u044f [{1}] \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438\u0439 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 [{2}]
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443 \u0432 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanbeta.sessionidexposedinurl.desc = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438\u0439 \u0432 URL-\u0430\u0434\u0440\u0435\u0441\u0456. \u041d\u0430\u0434\u0430\u044e\u0447\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0442\u0430\u043a\u043e\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443 (\u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443), \u043d\u0430\u0457\u0432\u043d\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043c\u043e\u0436\u0435 \u043d\u0435\u043d\u0430\u0432\u043c\u0438\u0441\u043d\u043e \u043d\u0430\u0434\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0441\u0432\u043e\u0457\u0445 \u0434\u0430\u043d\u0438\u0445, \u043f\u043e\u0441\u0442\u0430\u0432\u0438\u0432\u0448\u0438 \u043f\u0456\u0434 \u0437\u0430\u0433\u0440\u043e\u0437\u0443 \u0457\u0445\u043d\u044e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456\u0441\u0442\u044c, \u0446\u0456\u043b\u0456\u0441\u043d\u0456\u0441\u0442\u044c \u0456 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0456\u0441\u0442\u044c. URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u0449\u043e \u043c\u0456\u0441\u0442\u044f\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443, \u0442\u0430\u043a\u043e\u0436 \u0437'\u044f\u0432\u043b\u044f\u044e\u0442\u044c\u0441\u044f \u0432 \u0437\u0430\u043a\u043b\u0430\u0434\u043a\u0430\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430, \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0456 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430.
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name = \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidexposedinurl.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456\u0448\u0443 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044e \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u043e\u043c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434 \u0442\u0430\u043a\u0443, \u044f\u043a\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0444\u0430\u0439\u043b\u0438 \u0441\u0435\u0430\u043d\u0441\u0443 cookie, \u044f\u043a\u0438\u043c\u0438 \u043d\u0435 \u0442\u0430\u043a \u043b\u0435\u0433\u043a\u043e \u0432\u0438\u043f\u0430\u0434\u043a\u043e\u0432\u043e \u043f\u043e\u0434\u0456\u043b\u0438\u0442\u0438\u0441\u044f, \u0456 \u044f\u043a\u0456 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043d\u0435 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u044e\u0442\u044c\u0441\u044f \u0443 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0447\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043a\u0430\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430.

ascanbeta.sessionidsentinsecurely.alert.attack = \u041f\u043e\u043b\u0435 {0}\: [{1}]
ascanbeta.sessionidsentinsecurely.alert.extrainfo = \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 {0}, \u043f\u043e\u043b\u0435 [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage = URL-\u0430\u0434\u0440\u0435\u0441\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0431\u0443\u043b\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0445\u043e\u0434\u0443.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset = \u041f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u00ab\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439\u00bb \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0456 cookie \u0441\u0435\u0430\u043d\u0441\u0443, \u044f\u043a\u0438\u0439 \u043d\u0430\u0434\u0430\u0454 \u0441\u0435\u0440\u0432\u0435\u0440.
ascanbeta.sessionidsentinsecurely.desc = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c. \u0423 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0444\u0430\u0439\u043b\u0456\u0432 cookie, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u0438\u0445 \u0443 \u0437\u0430\u043f\u0438\u0442\u0456, \u0446\u0435 \u0432\u0456\u0434\u0431\u0443\u0432\u0430\u0454\u0442\u044c\u0441\u044f, \u043a\u043e\u043b\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f HTTP, \u0430 \u043d\u0435 HTTPS. \u0423 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0444\u0430\u0439\u043b\u0443 cookie, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u043a\u043e\u043b\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0443 \u0437\u043c\u0456\u043d\u0435\u043d\u043e \u0448\u043b\u044f\u0445\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u043f\u043e\u043b\u044f \u0456\u043c\u0435\u043d\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f NULL), \u043f\u0440\u0430\u043f\u043e\u0440 \u00ab\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u0433\u043e\u00bb \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0444\u0430\u0439\u043b cookie \u043f\u0456\u0437\u043d\u0456\u0448\u0435 \u0447\u0435\u0440\u0435\u0437 HTTP, \u0430 \u043d\u0435 \u0447\u0435\u0440\u0435\u0437 HTTPS . \u0426\u0435 \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u043c\u0443 \u043f\u0456\u0434\u0441\u043b\u0443\u0445\u0443\u0432\u0430\u0447\u0443 \u043d\u0430 \u043c\u0435\u0440\u0435\u0436\u0435\u0432\u043e\u043c\u0443 \u0448\u043b\u044f\u0445\u0443 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u043f\u043e\u0432\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0441\u0435\u0430\u043d\u0441\u0443 \u0436\u0435\u0440\u0442\u0432\u0438.
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u043e \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u043e
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs = https\://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A2-Broken_Authentication
ascanbeta.sessionidsentinsecurely.soln = 1) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043e\u0441\u0442\u0430\u043d\u043d\u044e \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0443 \u0432\u0435\u0440\u0441\u0456\u044e SSL/TLS (\u0434\u043b\u044f HTTPS) \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a, \u0434\u0435 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043f\u0435\u0440\u0435\u0434\u0430\u0454\u0442\u044c\u0441\u044f \u043c\u0456\u0436 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c \u0456 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.\n2) \u041d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0439\u0442\u0435 \u0437\u0432\u2019\u044f\u0437\u043a\u0443 \u043f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e \u043f\u0435\u0440\u0435\u0439\u0442\u0438 \u0434\u043e \u043d\u0435\u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0443 HTTP.\n3) \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043f\u043e\u0437\u043d\u0430\u0447\u043a\u0443 \u00ab\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u00bb \u043f\u0456\u0434 \u0447\u0430\u0441 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0443 cookie, \u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0439\u043e\u0433\u043e \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0456\u0439 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0456 \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c.\n4) \u041f\u0435\u0440\u0435\u0441\u0438\u043b\u0430\u0439\u0442\u0435 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 HTTP \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443, \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u0443 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u043c\u0443 HTTPS.

ascanbeta.shellshock.desc = \u041d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043f\u0440\u0430\u0446\u044e\u0454 \u0432\u0435\u0440\u0441\u0456\u044f \u043e\u0431\u043e\u043b\u043e\u043d\u043a\u0438 Bash, \u044f\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434
ascanbeta.shellshock.extrainfo = \u0412\u0456\u0434 CVE-2014-6271\: GNU Bash \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 4.3 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454 \u043a\u0456\u043d\u0446\u0435\u0432\u0456 \u0440\u044f\u0434\u043a\u0438 \u043f\u0456\u0441\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u044c \u0444\u0443\u043d\u043a\u0446\u0456\u0439 \u0443 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u0445 \u0437\u043c\u0456\u043d\u043d\u0438\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434 \u0447\u0435\u0440\u0435\u0437 \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0435 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0435, \u044f\u043a \u043f\u0440\u043e\u0434\u0435\u043c\u043e\u043d\u0441\u0442\u0440\u043e\u0432\u0430\u043d\u043e \u0432\u0435\u043a\u0442\u043e\u0440\u0430\u043c\u0438, \u0449\u043e \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c \u0444\u0443\u043d\u043a\u0446\u0456\u044e ForceCommand \u0443 OpenSSH sshd, \u043c\u043e\u0434\u0443\u043b\u0456 mod_cgi \u0442\u0430 mod_cgid \u043d\u0430 HTTP-\u0441\u0435\u0440\u0432\u0435\u0440\u0456 Apache, \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457, \u0449\u043e \u0432\u0438\u043a\u043e\u043d\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u043c\u0438 \u043a\u043b\u0456\u0454\u043d\u0442\u0430\u043c\u0438 DHCP, \u0442\u0430 \u0456\u043d\u0448\u0456 \u0441\u0438\u0442\u0443\u0430\u0446\u0456\u0457, \u0443 \u044f\u043a\u0438\u0445 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430 \u0432\u0456\u0434\u0431\u0443\u0432\u0430\u0454\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u043c\u0435\u0436\u0456 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432 \u0432\u0456\u0434 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f Bash, \u0442\u0430\u043a\u043e\u0436 \u0432\u0456\u0434\u043e\u043c\u043e\u0433\u043e \u044f\u043a \u00abShellShock\u00bb. \u041f\u0420\u0418\u041c\u0406\u0422\u041a\u0410\: \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0435 \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0446\u0456\u0454\u0457 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438 \u0431\u0443\u043b\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0438\u043c; CVE-2014-7169 \u0431\u0443\u043b\u043e \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0434\u043b\u044f \u043f\u043e\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456, \u044f\u043a\u0430 \u0432\u0441\u0435 \u0449\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u043d\u044f \u043f\u0456\u0441\u043b\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.
ascanbeta.shellshock.name = \u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443 - Shell Shock
ascanbeta.shellshock.ref = https\://nvd.nist.gov/vuln/detail/CVE-2014-6271\nhttps\://www.troyhunt.com/everything-you-need-to-know-about2/
ascanbeta.shellshock.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Bash \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457
ascanbeta.shellshock.timingbased.evidence = \u0417\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0430\u0442\u0430\u043a\u0438 \u0431\u0443\u043b\u043e \u0441\u043f\u0440\u0438\u0447\u0438\u043d\u0435\u043d\u043e \u0442\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0437\u0430\u0442\u0440\u0438\u043c\u043a\u0443 \u0442\u0440\u0438\u0432\u0430\u043b\u0456\u0441\u0442\u044e \u0432 \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434\u0430\u0445\: {0}

ascanbeta.sourcecodedisclosure.desc = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u043f\u043e\u0442\u043e\u0447\u043d\u043e\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.
ascanbeta.sourcecodedisclosure.gitbased.evidence = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0434\u043b\u044f [{0}] \u0437\u0434\u043e\u0431\u0443\u043b\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0432\u0448\u0438 [{1}]
ascanbeta.sourcecodedisclosure.gitbased.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - Git 
ascanbeta.sourcecodedisclosure.gitbased.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u0444\u0430\u0439\u043b\u0456\u0432 Git \u043d\u0435 \u043e\u043f\u043e\u0440\u044f\u0434\u0436\u0430\u044e\u0442\u044c\u0441\u044f \u0434\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0443 \u0434\u043e\u0434\u0430\u0442\u043a\u0443
ascanbeta.sourcecodedisclosure.lfibased.extrainfo = \u0412\u0438\u0445\u0456\u0434 \u0434\u043b\u044f \u043d\u0430\u0437\u0432\u0438 \u0444\u0430\u0439\u043b\u0443 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 [{0}] \u0437\u043d\u0430\u0447\u043d\u043e \u0432\u0456\u0434\u0440\u0456\u0437\u043d\u044f\u0454\u0442\u044c\u0441\u044f \u0432\u0456\u0434 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u043e\u0432\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{1}] \u043d\u0430 [{2}%] \u0443 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u0456 \u0437 \u043f\u043e\u0440\u043e\u0433\u043e\u0432\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{3}%]
ascanbeta.sourcecodedisclosure.lfibased.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - \u0434\u043e\u0434\u0430\u0432\u0430\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0456\u0432
ascanbeta.sourcecodedisclosure.svnbased.extrainfo = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0434\u043b\u044f [{0}] \u0437\u043d\u0430\u0439\u0448\u043b\u0438 \u0432 [{1}]
ascanbeta.sourcecodedisclosure.svnbased.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0444\u0430\u0439\u043b\u0438 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0438\u0445 SVN \u043d\u0435 \u0440\u043e\u0437\u0433\u043e\u0440\u043d\u0443\u0442\u0456 \u043d\u0430 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043f\u0440\u043e\u0433\u0440\u0430\u043c

ascanbeta.sourcecodedisclosurecve-2012-1823.desc = \u0414\u0435\u044f\u043a\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 PHP, \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0440\u043e\u0431\u043e\u0442\u0443 \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c CGI, \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c \u0440\u044f\u0434\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443, \u0443 \u044f\u043a\u0438\u0445 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u043d\u0435\u0435\u043a\u0440\u0430\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0441\u0438\u043c\u0432\u043e\u043b "\=", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 PHP \u0456 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434. \u0423 \u0446\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0432\u043c\u0456\u0441\u0442 \u0444\u0430\u0439\u043b\u0443 PHP \u0431\u0443\u043b\u043e \u043f\u043e\u0434\u0430\u043d\u043e \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0443 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440. \u0426\u0435\u0439 \u0432\u0438\u0445\u0456\u0434 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043c\u0456\u0441\u0442\u0438\u0442\u0438\u043c\u0435 PHP, \u0445\u043e\u0447\u0430 \u0432\u0456\u043d \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0439 HTML.
ascanbeta.sourcecodedisclosurecve-2012-1823.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c PHP \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0441\u0442\u0430\u0431\u0456\u043b\u044c\u043d\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 Apache \u0456 \u043c\u043e\u0434\u0443\u043b\u044c mod_rewrite \u0434\u043b\u044f \u0444\u0456\u043b\u044c\u0442\u0440\u0430\u0446\u0456\u0457 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432 "RewriteCond" \u0456 "RewriteRule".

ascanbeta.ssrf.desc = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0442\u0440\u0438\u043c\u0443\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0443 \u0430\u0434\u0440\u0435\u0441\u0443 \u0456 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0432\u043c\u0456\u0441\u0442 \u0446\u0456\u0454\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u0430\u043b\u0435 \u0446\u044c\u043e\u0433\u043e \u043d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043d\u044c\u043e \u0434\u043b\u044f \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0433\u0430\u0440\u0430\u043d\u0442\u0443\u0432\u0430\u0442\u0438, \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0431\u0443\u0434\u0435 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u043e \u0434\u043e \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u043c\u0456\u0441\u0446\u044f \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f.
ascanbeta.ssrf.name = \u041f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0437\u0456 \u0441\u0442\u043e\u0440\u043e\u043d\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanbeta.ssrf.otherinfo.canaryinbody = \u0423 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043c\u0430\u0440\u043a\u0435\u0440 canary \u0437\u0456 \u0441\u043b\u0443\u0436\u0431\u0438 \u0437\u0430 \u043c\u0435\u0436\u0430\u043c\u0438 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d\u0443.
ascanbeta.ssrf.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html
ascanbeta.ssrf.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.
ascanbeta.ssrf.soln = \u041d\u0435 \u043f\u0440\u0438\u0439\u043c\u0430\u0439\u0442\u0435 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0456 \u0430\u0434\u0440\u0435\u0441\u0438 \u044f\u043a \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0437\u0430\u043f\u0438\u0442\u0443 \u0456, \u044f\u043a\u0449\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u043e\u043d\u0438 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0456 \u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u0441\u043f\u0438\u0441\u043a\u0443 \u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c.

ascanbeta.text4shell.desc = Apache Commons Text \u0434\u043e 1.10.0 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 RCE, \u043a\u043e\u043b\u0438 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043e \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u043e\u0433\u043e \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u0457 \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c.\nApache Commons Text \u0432\u0438\u043a\u043e\u043d\u0443\u0454 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u044e \u0437\u043c\u0456\u043d\u043d\u0438\u0445, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u043e \u043e\u0446\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u0442\u0430 \u0440\u043e\u0437\u0448\u0438\u0440\u044e\u0432\u0430\u0442\u0438 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0456.\n\u0411\u0443\u043b\u043e \u043f\u043e\u043a\u0430\u0437\u0430\u043d\u043e, \u0449\u043e \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u0443\u0454 \u0437 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c\u0438 \u0447\u0435\u0440\u0435\u0437 \u0456\u043d\u0442\u0435\u0440\u043f\u043e\u043b\u044f\u0446\u0456\u044e \u0437\u043c\u0456\u043d\u043d\u0438\u0445 \u0456 \u0446\u0456\u043b\u043a\u043e\u043c \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e Remote Code Execution (RCE).
ascanbeta.text4shell.name = Text4shell (CVE-2022-42889)
ascanbeta.text4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-42889\nhttps\://securitylab.github.com/advisories/GHSL-2022-018_Apache_Commons_Text/
ascanbeta.text4shell.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.
ascanbeta.text4shell.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Apache Commons Text \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 1.10.0 \u0430\u0431\u043e \u043d\u043e\u0432\u0456\u0448\u043e\u0457.

ascanbeta.usernameenumeration.alert.attack = \u041a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u043f\u043e\u043b\u0435\u043c [{0}]\: [{1}] \u0456 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442
ascanbeta.usernameenumeration.alert.extrainfo = \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] [{1}] \u0441\u0442\u0432\u043e\u0440\u044e\u0454 \u0432\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0442\u0435, \u0447\u0438 \u0456\u0441\u043d\u0443\u0454 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447. \u0412\u0456\u0434\u043c\u0456\u043d\u043d\u043e\u0441\u0442\u0456 [{5}] \u0443 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0434\u043b\u044f \u0434\u0456\u0439\u0441\u043d\u043e\u0433\u043e \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u043e\u0433\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0456\u043c\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 [{2}] \u0456 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u043e\u0433\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0456\u043c\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 [{3}] \u0442\u0430\u043a\u0456\:\n[{4}]
ascanbeta.usernameenumeration.desc = \u0404 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u043f\u0435\u0440\u0435\u0440\u0430\u0445\u0443\u0432\u0430\u0442\u0438 \u0456\u043c\u0435\u043d\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0440\u0456\u0437\u043d\u0438\u0445 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 HTTP, \u044f\u043a\u0449\u043e \u043d\u0430\u0434\u0430\u0442\u0438 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u0456 \u0442\u0430 \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u0456 \u0456\u043c\u0435\u043d\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432. \u0426\u0435 \u0437\u043d\u0430\u0447\u043d\u043e \u043f\u0456\u0434\u0432\u0438\u0449\u0438\u0442\u044c \u0456\u043c\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044c \u0443\u0441\u043f\u0456\u0445\u0443 \u0430\u0442\u0430\u043a \u043f\u0456\u0434\u0431\u043e\u0440\u0443 \u043f\u0430\u0440\u043e\u043b\u044f \u043f\u0440\u043e\u0442\u0438 \u0441\u0438\u0441\u0442\u0435\u043c\u0438. \u0417\u0430\u0443\u0432\u0430\u0436\u0442\u0435, \u0449\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u043e\u0432\u0456 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u0456\u043d\u043e\u0434\u0456 \u043c\u043e\u0436\u043d\u0430 \u043c\u0456\u043d\u0456\u043c\u0456\u0437\u0443\u0432\u0430\u0442\u0438, \u0437\u0431\u0456\u043b\u044c\u0448\u0438\u0432\u0448\u0438 \u043e\u043f\u0446\u0456\u044e \u00ab\u0421\u0438\u043b\u0430 \u0430\u0442\u0430\u043a\u0438\u00bb \u0432 ZAP. \u0411\u0443\u0434\u044c \u043b\u0430\u0441\u043a\u0430, \u0432\u0440\u0443\u0447\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u043f\u043e\u043b\u0435 \u00ab\u0406\u043d\u0448\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f\u00bb, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438, \u0447\u0438 \u0456\u0441\u043d\u0443\u0454 \u0446\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430.
ascanbeta.usernameenumeration.name = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u043f\u0435\u0440\u0435\u0440\u0430\u0445\u0443\u0432\u0430\u043d\u043d\u044f \u0456\u043c\u0435\u043d \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432
ascanbeta.usernameenumeration.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/03-Identity_Management_Testing/04-Testing_for_Account_Enumeration_and_Guessable_User_Account.html\nhttps\://dl.ifip.org/db/conf/sec/sec2011/FreilingS11.pdf\nhttps\://cwe.mitre.org/data/definitions/204.html
ascanbeta.usernameenumeration.soln = \u041d\u0435 \u0440\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0443\u0439\u0442\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0442\u0435, \u0447\u0438 \u0454 \u0456\u043c'\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0434\u0456\u0439\u0441\u043d\u0438\u043c \u0430\u0431\u043e \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u043c. \u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u043f\u0440\u0438 \u043d\u0435\u0432\u0434\u0430\u043b\u0438\u0445 \u0441\u043f\u0440\u043e\u0431\u0430\u0445 \u0432\u0445\u043e\u0434\u0443 \u043d\u0435 \u0440\u043e\u0437\u0440\u0456\u0437\u043d\u044f\u0439\u0442\u0435 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0456 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u043f\u0430\u0440\u043e\u043b\u044c \u0443 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u0456 \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443, \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0432\u043c\u0456\u0441\u0442\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445 HTTP \u0430\u0431\u043e \u043b\u043e\u0433\u0456\u0446\u0456 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f.

