#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanbeta.desc=R\u00e8gles de scan actif - b\u00eata

ascanbeta.backupfiledisclosure.name=Divulgation de fichier de sauvegarde
ascanbeta.backupfiledisclosure.desc=Une sauvegarde du fichier a \u00e9t\u00e9 d\u00e9voil\u00e9e par le serveur web
ascanbeta.backupfiledisclosure.soln=Ne modifiez pas les fichiers in situ sur le serveur web, et faites en sorte que les fichiers inutiles (y compris les fichiers cach\u00e9s) soient supprim\u00e9s du serveur web.
ascanbeta.backupfiledisclosure.evidence=Une sauvegarde de [{0}] est disponible \u00e0 [{1}]

ascanbeta.crossdomain.name=Mauvaise configuration inter-domaines
#the refs cannot be customised for each sub-category (Adobe, Silverlight, etc)
ascanbeta.crossdomain.refs=http\://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html\nhttp\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttp\://msdn.microsoft.com/en-US/library/cc197955%28v\=vs.95%29.aspx\nhttp\://msdn.microsoft.com/en-us/library/cc838250%28v\=vs.95%29.aspx
ascanbeta.crossdomain.adobe.read.name=Mauvaise configuration inter-domaine - Adobe - Read
ascanbeta.crossdomain.adobe.send.name=Mauvaise configuration inter-domaine - Adobe - Send
ascanbeta.crossdomain.adobe.desc=Contrefa\u00e7on de requ\u00eate inter-site de type Flash/Silverlight possible, en raison d'un probl\u00e8me de configuration sur le serveur web. 
ascanbeta.crossdomain.adobe.read.soln=Configurez le fichier crossdomain.xml pour restreindre la liste des domaines autoris\u00e9s \u00e0 faire des requ\u00eates inter-domaines en lecture \u00e0 ce serveur web, \u00e0 l'aide de <allow-access-from domain\="example.com">. Vous devriez donner uniquement acc\u00e8s \u00e0 "*" (tous domaines) si vous \u00eates certain que ce service n'h\u00e9berge pas des donn\u00e9es sous contr\u00f4le d'acc\u00e8s, personnalis\u00e9es ou priv\u00e9es.
ascanbeta.crossdomain.adobe.read.extrainfo=Le serveur internet permet des requ\u00eates inter-domaines malveillantes pour la lecture de donn\u00e9es en provenance des composants Flash/Silverlight, servies de n'importe quel domaine de tierce partie \u00e0 ce domaine. Si l'utilisateur et victime est connect\u00e9 \u00e0 ce service, les requ\u00eates de lecture malveillantes sont trait\u00e9es en utilisant les privil\u00e8ges de la victime, ce qui conduirait \u00e0 la compromission des donn\u00e9es de ce service par un site internet tiers non autoris\u00e9, via le navigateur internet de la victime. Ceci sera d'autant plus probl\u00e9matique si une impl\u00e9mentation de session bas\u00e9e sur les cookies est utilis\u00e9e. 
ascanbeta.crossdomain.adobe.send.soln=Configurez le fichier crossdomain.xml pour restreindre la liste des domaines autoris\u00e9s \u00e0 faire  des requ\u00eates d'envoi inter-domaines (mais pas n\u00e9cessairement de lecture) \u00e0 ce serveur internet, en utilisant <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh">. Vous ne devriez donner acc\u00e8s \u00e0 "*" (tous domaines) que si vous \u00eates certain que ce service n'est pas vuln\u00e9rable \u00e0 l'usurpation de requ\u00eates inter-site (Cross Site Request Forgery - CSRF).
ascanbeta.crossdomain.adobe.send.extrainfo=Le serveur internet permet des requ\u00eates inter-domaines malveillantes pour la lecture (mais pas  n\u00e9cessairement pour l'\u00e9criture) de donn\u00e9es en provenance des composants Flash/Silverlight, servies de n'importe quel domaine d'une tierce partie \u00e0 ce domaine. Si l'utilisateur et victime est connect\u00e9 \u00e0 ce service, les requ\u00eates d'envoi malveillantes sont trait\u00e9es en utilisant les privil\u00e8ges de la victime, conduisant ainsi \u00e0 des attaques de type contrefa\u00e7on de requ\u00eates inter-site (CSRF) via le navigateur de la victime. Ceci est particuli\u00e8rement probl\u00e9matique si l'impl\u00e9mentation de la session est bas\u00e9e sur les cookies.
ascanbeta.crossdomain.silverlight.name=Mauvaise configuration inter-domaine - Silverlight
ascanbeta.crossdomain.silverlight.desc=Contrefa\u00e7on de requ\u00eate inter-site de type Silverlight possible, en raison d'un probl\u00e8me de configuration sur le serveur web.
ascanbeta.crossdomain.silverlight.soln=Configurez le fichier clientaccesspolicy.xml pour restreindre la liste des domaines autoris\u00e9s \u00e0 faire des requ\u00eates inter-domaines en lecture \u00e0 ce serveur web, \u00e0 l'aide de <domain uri\="https\://example.com" />. Vous devriez donner acc\u00e8s \u00e0 "*" (tous domaines) que si vous \u00eates certain que ce service n'h\u00e9berge pas des donn\u00e9es sous contr\u00f4le d'acc\u00e8s, personnalis\u00e9es ou priv\u00e9es.
ascanbeta.crossdomain.silverlight.extrainfo=Le serveur internet permet des requ\u00eates inter-domaines malveillantes pour la lecture en provenance de composants Silverlight, envoy\u00e9es de n'importe quel domaine d'une tierce partie \u00e0 ce domaine. Si l'utilisateur et victime est connect\u00e9 \u00e0 ce service, les requ\u00eates sont trait\u00e9es en utilisant les privil\u00e8ges de la victime, ce qui conduirait \u00e0 la compromission des donn\u00e9es de ce service par un site internet tiers non autoris\u00e9, via le navigateur internet de la victime. Il peut \u00e9galement se pr\u00e9senter des attaques de type contrefa\u00e7on de requ\u00eates inter-site (CSRF). Ceci sera d'autant plus probl\u00e9matique si l'impl\u00e9mentation de la session est  bas\u00e9e sur les cookies.

ascanbeta.heartbleed.name=Vuln\u00e9rabilit\u00e9 OpenSSL Heartbleed
ascanbeta.heartbleed.desc=L'impl\u00e9mentation de TLS dans OpenSSL 1.0.1 avant 1.0.1g ne g\u00e8re pas correctement les paquets Heartbeat Extension, ce qui permet \u00e0 des attaquants distants d'obtenir des informations sensibles de la m\u00e9moire de processus via des paquets con\u00e7us pour d\u00e9clencher un d\u00e9passement de tampon, avec le potentiel de divulguer des informations sensibles.
ascanbeta.heartbleed.soln=Mettez \u00e0 jour OpenSSL avec la version 1.0.1g ou ult\u00e9rieure. R\u00e9-\u00e9mettez les certificats HTTPS. Changer les cl\u00e9s priv\u00e9es asym\u00e9triques et les cl\u00e9s secr\u00e8tes partag\u00e9es, car elles peuvent avoir \u00e9t\u00e9 compromises, sans aucun avertissement dans les fichiers journaux du serveur.
ascanbeta.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
ascanbeta.heartbleed.extrainfo=Ce probl\u00e8me a \u00e9t\u00e9 confirm\u00e9 par l'exfiltration de donn\u00e9es depuis le serveur, \u00e0 l'aide de {0}. Un faux positif est peu probable.

ascanbeta.HTTPParamPoll.name=Analyseur de pollution de param\u00e8tre HTTP
ascanbeta.HTTPParamPoll.desc=Les attaques par pollution de param\u00e8tre HTTP (HPP\: HTTP Parameter Pollution) consistent \u00e0 injecter des d\u00e9limiteurs de cha\u00eene de requ\u00eate encod\u00e9e dans des param\u00e8tres existants. Si une application web n'assaini pas bien les entr\u00e9es d'utilisateur, un utilisateur malveillant peut compromettre la logique de l'application pour lancer des attaques c\u00f4t\u00e9 client ou c\u00f4t\u00e9 serveur. Une cons\u00e9quence des attaques HPP est que l'agresseur peut potentiellement substituer des param\u00e8tres HTTP existants cod\u00e9s en dur pour modifier le comportement d'une application, contourner les points de contr\u00f4le de validation d'entr\u00e9e et acc\u00e9der et exploiter \u00e9ventuellement des variables qui peuvent \u00eatre hors de port\u00e9e directe.
ascanbeta.HTTPParamPoll.sol=Assainissez correctement les d\u00e9limiteurs de param\u00e8tre des donn\u00e9es d'utilisateur 
ascanbeta.HTTPParamPoll.alert.attack=Pollution de param\u00e8tre HTTP
ascanbeta.HTTPParamPoll.extrainfo=http\://www.google.com/search?q\=http+parameter+pollution

ascanbeta.insecurehttpmethod.name=M\u00e9thode HTTP non s\u00e9curis\u00e9e
ascanbeta.insecurehttpmethod.detailed.name=M\u00e9thode HTTP non s\u00e9curis\u00e9e - {0}
ascanbeta.insecurehttpmethod.desc=La m\u00e9thode HTTP non s\u00e9curis\u00e9e [{0}] est activ\u00e9e sur le serveur internet pour cette ressource. Selon la configuration du serveur et l'impl\u00e9mentation du service de la ressource, cela pourrait exploitable ou pas. Les m\u00e9thodes TRACK et TRACE peuvent \u00eatre utilis\u00e9es par un attaquant pour acc\u00e9der au jeton d'autorisation/cookie de session d'un utilisateur de l'application, m\u00eame si le cookie de session est prot\u00e9g\u00e9 \u00e0 l'aide de l'indicateur 'HttpOnly'. Pour que l'attaque r\u00e9ussisse, l'utilisateur de l'application doit g\u00e9n\u00e9ralement utiliser un navigateur internet plus ancien, ou un navigateur qui a une faille dans la politique de m\u00eame origine (SOP). La m\u00e9thode 'CONNECT' peut \u00eatre utilis\u00e9e par un client int ernetpour cr\u00e9er un tunnel HTTP vers des sites ou des services tiers.
ascanbeta.insecurehttpmethod.trace.exploitable.desc=La m\u00e9thode HTTP non s\u00e9curis\u00e9e [{0}] est activ\u00e9e pour cette ressource et est exploitable. Les m\u00e9thodes TRACK and TRACE peuvent \u00eatre utilis\u00e9es par un attaquant pour acc\u00e9der au  jeton d'autorisation/cookie de session d'un utilisateur de l'application, m\u00eame si le cookie de session est prot\u00e9g\u00e9 \u00e0 l'aide de l'indicateur 'HttpOnly'. Pour que l'attaque r\u00e9ussisse, l'utilisateur de l'application doit g\u00e9n\u00e9ralement utiliser un navigateur internet plus ancien, ou un navigateur qui a une faille dans la politique de m\u00eame origine (SOP).
ascanbeta.insecurehttpmethod.connect.exploitable.desc=La m\u00e9thode HTTP non s\u00e9curis\u00e9e [{0}] est activ\u00e9e pour cette ressource et est exploitable. Il s'est av\u00e9r\u00e9 possible d'\u00e9tablir une connexion tunnel par un socket vers le service d'un tiers, gr\u00e2ce \u00e0 cette m\u00e9thode HTTP.  Cela permettrait au service d'\u00eatre utilis\u00e9 comme un relais de spam anonyme, ou comme un proxy web, contournant ainsi les restrictions du r\u00e9seau. Il serait \u00e9galement de l'utiliser pour \u00e9tablir un tunnel VPN, \u00e9tendant en fait le p\u00e9rim\u00e8tre du r\u00e9seau pour y inclure des composants indignes de confiance. 
ascanbeta.insecurehttpmethod.extrainfo=La m\u00e9thode OPTIONS a d\u00e9voil\u00e9 les m\u00e9thodes HTTP suivantes pour cette ressource\: [{0}]
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo=Une requ\u00eate TRACE a \u00e9t\u00e9 envoy\u00e9e pour cette requ\u00eate avec une valeur de cookie personnalis\u00e9e [{0}]. Cette valeur de cookie a \u00e9t\u00e9 d\u00e9voil\u00e9e dans la r\u00e9ponse HTTP, confirmant la vuln\u00e9rabilit\u00e9.
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo=La m\u00e9thode CONNECT a \u00e9t\u00e9 utilis\u00e9e pour \u00e9tablir une connexion de socket vers [{0}], via le serveur internet.
ascanbeta.insecurehttpmethod.soln=D\u00e9sactivez les m\u00e9thodes non s\u00e9curis\u00e9es comme TRACK, TRACE et CONNECT sur le serveur internet et faites en sorte que l'impl\u00e9mentation sous-jacente du service ne supporte pas de m\u00e9thodes non s\u00e9curis\u00e9es.

ascanbeta.ldapinjection.name=Injection LDAP
ascanbeta.ldapinjection.desc=Une injection de LDAP peut \u00eatre possible. Un pirate pourrait contourner les contr\u00f4les d'authentification et afficher et modifier des donn\u00e9es arbitraires dans le r\u00e9pertoire LDAP. 
ascanbeta.ldapinjection.soln=Validez et/ou \u00e9chappez toutes les entr\u00e9es d'utilisateur avant de les utiliser pour cr\u00e9er une requ\u00eate LDAP. Les caract\u00e8res suivants (ou leurs combinaisons) devraient en particulier \u00eatre inscrits sur une liste noire\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNUL character\n 
ascanbeta.ldapinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A9\nhttp\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection\nhttps\://www.owasp.org/index.php/LDAP_injection
#ascanbeta.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.extrainfo=param\u00e8tre [{0}] sur [{1}] [{2}] peut \u00eatre vuln\u00e9rable \u00e0 l'injection de LDAP \u00e0 l'aide d'une attaque par meta-caract\u00e8res LDAP [{3}], donnant le message d'erreur [{4}] connu [{5}], qui n'\u00e9tait pas pr\u00e9sent dans la r\u00e9ponse originale.
ascanbeta.ldapinjection.alert.evidence={0}
ascanbeta.ldapinjection.booleanbased.alert.extrainfo=param\u00e8tre [{0}] sur [{1}] [{2}] peut \u00eatre vuln\u00e9rable \u00e0 l'injection de LDAP \u00e0 l'aide de l'expression logiquement \u00e9quivalente [{3}] et l'expression 'Faux' [{4}].
#ascanbeta.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanbeta.ldapinjection.alert.attack=param\u00e8tre [{0}] renseign\u00e9 \u00e0 [{1}]
ascanbeta.ldapinjection.booleanbased.alert.attack=Expression LDAP \u00e9quivalente\: [{0}]. Param\u00e8tre al\u00e9atoire\: [{1}].
#ascanbeta.ldapinjection.alert.logmessage=A likely LDAP injection vulnerability has been found with [{0}] URL [{1}] on [{2}] field [{3}], using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.logmessage=Une vuln\u00e9rabilit\u00e9 probable par injection LDAP a \u00e9t\u00e9 trouv\u00e9e avec [{0}] URL [{1}] sur le param\u00e8tre [{2}], en utilisant une attaque par meta-caract\u00e8res LDAP [{3}], donnant le message d'erreur [{4}] connu [{5}], qui n'\u00e9tait pas pr\u00e9sent dans la r\u00e9ponse originale.
ascanbeta.ldapinjection.booleanbased.alert.logmessage=Une vuln\u00e9rabilit\u00e9 probable par injection LDAP a \u00e9t\u00e9 trouv\u00e9e avec [{0}] URL [{1}] sur le param\u00e8tre [{2}], en utilisant [{3}] pour simuler une condition logiquement \u00e9quivalente et [{4}] pour simuler une condition FALSE. 
# a colon delimited list of the known LDAP implementations (used to reference "ldapinjection.<implementation>.errormessages" here)  
ascanbeta.ldapinjection.knownimplementations=activedirectory\:openldap\:389directoryserver\:apachedirectoryservices
# OpenLDAP Error messages
# error messages may be localised, so in this case, pull them from the local version of OpenLDAP source, using the following command
# grep -Eo "\"[^\"]+\"" openldap-2.4.31/libraries/libldap/error.c
# the list will then need to be manually filtered slightly (remove common strings, and ensure that the messages contain no colons, which would mess up the colon delimiting used here)
ascanbeta.ldapinjection.openldap.errormessages=Operations error\:Protocol error\:Time limit exceeded\:Size limit exceeded\:Compare False\:Compare True\:Authentication method not supported\:Strong(er) authentication required\:Administrative limit exceeded\:Critical extension is unavailable\:Confidentiality required\:SASL bind in progress\:No such attribute\:Undefined attribute type\:Inappropriate matching\:Constraint violation\:Type or value exists\:Invalid syntax\:No such object\:Alias problem\:Invalid DN syntax\:Alias dereferencing problem\:Inappropriate authentication\:Invalid credentials\:Insufficient access\:Server is busy\:Server is unavailable\:Server is unwilling to perform\:Loop detected\:Naming violation\:Object class violation\:Operation not allowed on non-leaf\:Operation not allowed on RDN\:Already exists\:Cannot modify object class\:Operation affects multiple DSAs\:Virtual List View error\:Other (e.g., implementation specific) error\:Partial results and referral received\:Entry is a leaf\:Results too large\:No Operation to Cancel\:Too Late to Cancel\:Cannot Cancel\:Assertion Failed\:Assertion Failed (X)\:Proxied Authorization Denied\:Proxy Authorization Failure (X)\:Content Sync Refresh Required\:Content Sync Refresh Required (X)\:No Operation (X)\:LCUP Resources Exhausted\:LCUP Security Violation\:LCUP Invalid Data\:LCUP Unsupported Scheme\:LCUP Reload Required\:TXN specify okay\:TXN ID is invalid\:Can't contact LDAP server\:Local error\:Encoding error\:Decoding error\:Timed out\:Unknown authentication method\:Bad search filter\:User cancelled operation\:Bad parameter to an ldap routine\:Out of memory\:Connect error\:Not Supported\:Control not found\:No results returned\:More results to return\:Client Loop\:Referral Limit Exceeded\:Unknown API error\:Unknown (extension) error\:Unknown (private extension) error\:Unknown error
# Active Directory error messages, from http://support.microsoft.com/kb/232282 
ascanbeta.ldapinjection.activedirectory.errormessages=0x00005011L\:0x00005012L\:0x00005013L\:0x80005000L\:0x80005001L\:0x80005002L\:0x80005003L\:0x80005004L\:0x80005005L\:0x80005006L\:0x80005007L\:0x80005008L\:0x80005009L\:0x8000500AL\:0x8000500BL\:0x8000500CL\:0x8000500DL\:0x8000500EL\:0x8000500FL\:0x80005010L\:0x80005014L\:A bad parameter was passed to a routine\:Administration limit on the server has exceeded\:An invalid ADSI path name was passed\:An unknown ADSI computer object was requested\:An unknown ADSI domain object was requested\:An unknown ADSI object was requested\:An unknown ADSI user object was requested\:Authentication is inappropriate\:Cannot contact the LDAP server\:Cannot dereference the alias\:Cannot establish the connection\:Cannot modify object class\:Client loop was detected\:Compare yielded FALSE\:Compare yielded TRUE\:Confidentiality is required\:Critical extension is unavailable\:Decoding error occurred\:E_ADS_BAD_PARAMETER\:E_ADS_BAD_PATHNAME\:E_ADS_CANT_CONVERT_DATATYPE\:E_ADS_COLUMN_NOT_SET\:E_ADS_INVALID_COMPUTER_OBJECT\:E_ADS_INVALID_DOMAIN_OBJECT\:E_ADS_INVALID_FILTER\:E_ADS_INVALID_USER_OBJECT\:E_ADS_OBJECT_EXISTS\:E_ADS_OBJECT_UNBOUND\:E_ADS_PROPERTY_INVALID\:E_ADS_PROPERTY_MODIFIED\:E_ADS_PROPERTY_NOT_FOUND\:E_ADS_PROPERTY_NOT_MODIFIED\:E_ADS_PROPERTY_NOT_SET\:E_ADS_PROPERTY_NOT_SUPPORTED\:E_ADS_SCHEMA_VIOLATION\:E_ADS_UNKNOWN_OBJECT\:Encoding error occurred\:ERROR_ACCESS_DENIED\:ERROR_CANCELLED\:ERROR_CONNECTION_REFUSED\:ERROR_DS_ADMIN_LIMIT_EXCEEDED\:ERROR_DS_AFFECTS_MULTIPLE_DSAS\:ERROR_DS_ALIAS_DEREF_PROBLEM\:ERROR_DS_ALIAS_PROBLEM\:ERROR_DS_ATTRIBUTE_OR_VALUE_EXISTS\:ERROR_DS_ATTRIBUTE_TYPE_UNDEFINED\:ERROR_DS_AUTH_METHOD_NOT_SUPPORTED\:ERROR_DS_AUTH_UNKNOWN\:ERROR_DS_BUSY\:ERROR_DS_CANT_MOD_OBJ_CLASS\:ERROR_DS_CANT_ON_NON_LEAF\:ERROR_DS_CANT_ON_RDN\:ERROR_DS_CLIENT_LOOP\:ERROR_DS_COMPARE_FALSE\:ERROR_DS_COMPARE_TRUE\:ERROR_DS_CONFIDENTIALITY_REQUIRED\:ERROR_DS_CONSTRAINT_VIOLATION\:ERROR_DS_CONTROL_NOT_FOUND\:ERROR_DS_DECODING_ERROR\:ERROR_DS_ENCODING_ERROR\:ERROR_DS_FILTER_UNKNOWN\:ERROR_DS_INAPPROPRIATE_AUTH\:ERROR_DS_INAPPROPRIATE_MATCHING\:ERROR_DS_INVALID_ATTRIBUTE_SYNTAX\:ERROR_DS_INVALID_DN_SYNTAX\:ERROR_DS_IS_LEAF\:ERROR_DS_LOCAL_ERROR\:ERROR_DS_LOOP_DETECT\:ERROR_DS_NAMING_VIOLATION\:ERROR_DS_NO_ATTRIBUTE_OR_VALUE\:ERROR_DS_NO_RESULTS_RETURNED\:ERROR_DS_NO_SUCH_OBJECT\:ERROR_DS_NOT_SUPPORTED\:ERROR_DS_OBJ_CLASS_VIOLATION\:ERROR_DS_OBJECT_RESULTS_TOO_LARGE\:ERROR_DS_OPERATIONS_ERROR\:ERROR_DS_PARAM_ERROR\:ERROR_DS_PROTOCOL_ERROR\:ERROR_DS_REFERRAL\:ERROR_DS_REFERRAL_LIMIT_EXCEEDED\:ERROR_DS_SERVER_DOWN\:ERROR_DS_SIZELIMIT_EXCEEDED\:ERROR_DS_STRONG_AUTH_REQUIRED\:ERROR_DS_TIMELIMIT_EXCEEDED\:ERROR_DS_UNAVAILABLE\:ERROR_DS_UNAVAILABLE_CRIT_EXTENSION\:ERROR_DS_UNWILLING_TO_PERFORM\:ERROR_GEN_FAILURE\:ERROR_LOGON_FAILURE\:ERROR_MORE_DATA\:ERROR_MORE_DATA\:ERROR_NOT_ENOUGH_MEMORY\:ERROR_OBJECT_ALREADY_EXISTS\:ERROR_TIMEOUT\:LDAP_ADMIN_LIMIT_EXCEEDED\:LDAP_AFFECTS_MULTIPLE_DSAS\:LDAP_ALIAS_DEREF_PROBLEM\:LDAP_ALIAS_PROBLEM\:LDAP_ALREADY_EXISTS\:LDAP_ATTRIBUTE_OR_VALUE_EXISTS\:LDAP_AUTH_METHOD_NOT_SUPPORTED\:LDAP_AUTH_UNKNOWN\:LDAP_BUSY\:LDAP_CLIENT_LOOP\:LDAP_COMPARE_FALSE\:LDAP_COMPARE_TRUE\:LDAP_CONFIDENTIALITY_REQUIRED\:LDAP_CONNECT_ERROR\:LDAP_CONSTRAINT_VIOLATION\:LDAP_CONTROL_NOT_FOUND\:LDAP_DECODING_ERROR\:LDAP_ENCODING_ERROR\:LDAP_FILTER_ERROR\:LDAP_INAPPROPRIATE_AUTH\:LDAP_INAPPROPRIATE_MATCHING\:LDAP_INSUFFICIENT_RIGHTS\:LDAP_INVALID_CREDENTIALS\:LDAP_INVALID_DN_SYNTAX\:LDAP_INVALID_SYNTAX\:LDAP_IS_LEAF\:LDAP_LOCAL_ERROR\:LDAP_LOOP_DETECT\:LDAP_MORE_RESULTS_TO_RETURN\:LDAP_NAMING_VIOLATION\:LDAP_NO_MEMORY\:LDAP_NO_OBJECT_CLASS_MODS\:LDAP_NO_RESULTS_RETURNED\:LDAP_NO_SUCH_ATTRIBUTE\:LDAP_NO_SUCH_OBJECT\:LDAP_NOT_ALLOWED_ON_NONLEAF\:LDAP_NOT_ALLOWED_ON_RDN\:LDAP_NOT_SUPPORTED\:LDAP_OBJECT_CLASS_VIOLATION\:LDAP_OPERATIONS_ERROR\:LDAP_OTHER\:LDAP_PARAM_ERROR\:LDAP_PARTIAL_RESULTS\:LDAP_PROTOCOL_ERROR\:LDAP_REFERRAL                       \:LDAP_REFERRAL_LIMIT_EXCEEDED\:LDAP_RESULTS_TOO_LARGE\:LDAP_SERVER_DOWN\:LDAP_SIZELIMIT_EXCEEDED\:LDAP_STRONG_AUTH_REQUIRED\:LDAP_TIMELIMIT_EXCEEDED\:LDAP_TIMEOUT\:LDAP_UNAVAILABLE\:LDAP_UNAVAILABLE_CRIT_EXTENSION\:LDAP_UNDEFINED_TYPE\:LDAP_UNWILLING_TO_PERFORM\:LDAP_USER_CANCELLED\:Local error occurred\:Loop was detected\:More results are to be returned\:Multiple directory service agents are affected\:Object does not exist\:One or more errors occurred\:One or more input parameters are invalid\:Operation is not allowed on a non leaf object\:Operation is not allowed on RDN\:Operations error occurred\:Partial results and referrals received\:Protocol error occurred\:Requested attribute does not exist\:Results are not returned\:Results returned are too large\:S_ADS_ERRORSOCCURRED\:S_ADS_NOMORE_COLUMNS\:S_ADS_NOMORE_ROWS\:Size limit has exceeded \:Strong authentication is required\:The ADSI data type cannot be converted to/from a native DS data type\:The ADSI object exists\:The ADSI property cannot be found in the cache\:The alias is invalid\:The attempted action violates the directory service schema rules\:The attribute exists or the value has been assigned\:The authentication method is not supported\:The control was not found\:The distinguished name has an invalid syntax\:The feature is not supported\:The object already exists\:The object is a leaf\:The referral limit has exceeded\:The search filter is bad\:The search operation has reached the last column for the current row\:The search operation has reached the last row\:The search was timed out\:The server is busy\:The server is not available\:The server is unwilling to perform\:The specified ADSI object has been modified\:The specified ADSI object has not been modified\:The specified ADSI object is not bound to a remote resource\:The specified ADSI property is invalid\:The specified ADSI property is not supported\:The specified ADSI property was not set\:The specified column in the ADSI was not set\:The specified search filter is invalid\:The supplied credential is invalid\:The syntax is invalid\:The system is out of memory\:The user has canceled the operation\:The user has insufficient access right\:There was a constrain violation\:There was a naming violation\:There was an inappropriate matching\:There was an object class violation\:Time limit has exceeded\:Type is not defined\:Unknown authentication error occurred\:Unknown error occurred
# 389 Directory Server error messages, using command: grep -Eo "\"[^\"]+\"" ./lib/ldaputil/errors.c 
ascanbeta.ldapinjection.389directoryserver.errormessages=ldap search didn't find an ldap entry\:Cert mapping function failed\:Cert search function failed\:Cert verify function failed\:Certmap InitFn function failed\:invalid local ldap database url prefix\:base dn is missing in ldapdb url\:out of memory\:Couldn't initialize connection to the ldap directory server\:Couldn't initialize connection to the local ldap directory\:ldap_set_option failed for local ldap database\:default cert database not initialized when using LDAP over SSL\:Circular groups were detected during group membership check\:Invalid string\:Invalid string index\:Missing attribute value from the search result\:cannot open the config file\:database name is missing\:database property is missing\:illegal directive in the config file\:internal error - LDAPU_ERR_NOT_PROPVAL\:cannot extract issuer DN from the cert\:issuer DN missing for non-default certmap\:cert to ldap entry mapping information is missing\:Found malformed subject DN in the certificate\:Certificate couldn't be mapped to an ldap entry\:Unable to load certmap plugin library\:InitFn must be provided when using certmap plugin library\:Could not find InitFn in the certmap plugin library\:Could not matching certificate in User's LDAP entry\:User's LDAP entry doesn't have any certificates to compare\:Library name is missing in the config file\:Init function name is missing in the config file\:ldaputil API function called with wrong arguments\:Renaming of file failed\:VerifyCert property value must be on or off\:Cert issuer name is missing\:property name is missing\:unknown cert attribute\:ldap search returned empty result\:ldap search returned multiple matches when one expected\:Could not extract entry from the ldap search result\:ldap entry is missing the 'uid' attribute value\:invalid argument passed to the certmap API function\:invalid LDAP directory suffix\:Couldn't extract the subject DN from the certificate\:Couldn't extract the issuer DN from the certificate\:Couldn't extract the original DER encoding from the certificate\:function not implemented yet\:ldaputil internal error\:internal error - unknown error code
# Apache Directory Service (starting point: cat ./i18n/src/main/resources/org/apache/directory/server/i18n/errors.properties | sed -re '/^#/ d; /^$/d;' | cut -d"=" -f2)
ascanbeta.ldapinjection.apachedirectoryservices.errormessages=Failed to identify OID for\:A system index on attribute\:A user index on attribute\:no EQUALITY MatchingRule defined\:by unauthenticated caller.\:Authentication error\:Cannot create a digested password for algorithm\:The rootDSE cannot be deleted, moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can del, move or rename\:failed to parse entryACI\:failed to parse subentryACI\:The rootDSE cannot be deleted\!\:The Administrators group cannot be deleted\!\:does not have permission to delete the admin account. \:does not have permission to delete the user account\:does not have permission to delete the group entry\:The rootDSE cannot be modified\!\:does not have permission to modify the account of the admin user.\:does not have permission to modify the account of the user\:does not have permission to modify the group entry\:The Administrators group cannot be moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can move or rename\:does not have permission to move or rename the user account\:does not have permission to move or rename the group entry\:Access to user account\:Access to group\:Access to admin account not permitted for user\:due to syntax error. Cannot add ACITuples to TupleCache\:Cannot set a changeLog store when one is already active\:operational attribute cannot be modified by a user\:The ModifiersName operational attribute cannot be modified by a user\:The ModifyTimestamp operational attribute cannot be modified by a user\:failed to LOG version properties\:No partition with suffix\:can be found in the NamingContexts\:An LDAPURL should not contains a scope\:An LDAPURL should not contains filters\:An LDAPURL should not contains any description attribute list\:An LDAPURL should not contains any extension\:An LDAPURL should not contains any critical extension\:An LDAPURL should contains a non-empty DN\:An entry with a 'referral' ObjectClass must contains a 'ref' Attribute\:does not have any OID. It should be a wrong AttributeType.\:Wrong AttributeType, does not have an associated OID\:The value stored in an Human Readable attribute as a byte\:The value stored in a non Human Readable attribute as a String should be convertible to a byte\:A filter should not be null\:A Substring filter should be used only on Human Readable attributes\:A Extensible filter should be used only on Human Readable attributes\:Cannot modify the attribute\:The new Attribute or one of its value is incorrect\:Cannot add a value which is already present\:Trying to remove an non-existant attribute\:Cannot remove an absent value from attribute\:An ABSTRACT ObjectClass cannot inherit from an objectClass which is not ABSTRACT\:An AUXILiARY ObjectClass cannot inherit from an objectClass which is not ABSTRACT or AUXILIARY\:Cannot have a superior which does not exist\:does not contain a STRUCTURAL ObjectClass\:contains more than one STRUCTURAL ObjectClass\:attributeType, which is part of the RDN\:The value stored in a not Human Readable attribute as a String should be convertible to a byte\:The value is not valid. It should be a String or a byte\:Failed to access certificate in DIT.\:Failed on attempt to compare certificate bytes to determine alias.\:Failed on attempt to extract key.\:Exception while searching the DIT for class\:Encountered failure while searching directory for class\:failed to parse the new subtreeSpecification\:failed to parse entryTrigger\:TriggerSpecification parser failure on\:SynchWorker failed to synch directory.\:ChangeType unknown\:Reverts of change type\:Encountered a failure while trying to revert to a previous revision\:Cannot build an entry for\:The replicaId must be in\:Cannot inject the following entry\:Schema entity containers of objectClass organizationalUnit should be 3 name components in length.\:Expecting organizationalUnit with one of the following names\:Cannot add an entry on\:Unwilling to perform modify on\:Unwilling to enable a not loaded schema\:DitContentRule loading NYI\:DitStructureRule loading NYI\:MatchingRuleUse loading NYI\:NameForm loading NYI\:Failed to initialize wrapped partition.\:Attempt to destroy wrapped partition failed.\:Could not create directory\:Could not delete file or directory\:Unable to create a DirectoryService instance for unknow reason\:Failed to delete the working directory.\:Failed to delete\:Unsupported changetype found in LDIF\:Error encountered while delivering notifications.\:Encountered exception during event handling.\:Failed to configure the jetty http server\:Failed to configure the web application(s)\:Error encoding EncryptionKey.\:Failed to close an index.\:Closed master table for\:Failed to close the master.\:Failed to close the record manager\:Failed to identify OID for \:Error while adding\:Error while adding\:Exception while removing\:Cannot deserialize the entry\:Cannot create a ticket for the\:Cannot create a ticket\:Cannot encode the Ticket object, the PDU size is\:The PDU buffer size is too small \!\:Cannot encode the AuthorizationData object, the PDU size is\:Cannot encode the Checksum object, the PDU size is\:Cannot encode the EncryptedData object, the PDU size is\:Cannot encode the EncryptionKey object, the PDU size is\:Cannot encode the HostAddress object, the PDU size is\:Cannot encode the HostAddresses object, the PDU size is\:Cannot encode the PreAuthenticationData object, the PDU size is\:Cannot encode the principalName object, the PDU size is\:Cannot encode the TransitedEncoding object, the PDU size is\:Cannot put a PDU in a null buffer \!\:More than one server entry found for kerberos principal name\:Cannot initialize a partition without a valid suffix\:can't be created\:Unexpected exception\:Error in request monitor\:Error in context monitor\:Error in reply monitor\:Failed to get catalog context \:Failed to get initial context \:failed to rebind ldap service\:Failed to write GracefulShutdownResponse to client\:mechanism not supported. Please check the server.xml configuration file (supportedMechanisms field)\:Handler unavailable for\:Only LDAP v3 is supported.\:Only LDAP v3 is supported.\:failed to properly abandon this persistent search\:Reference will be ignored.\:Failed to close the search cursor for message\:Got back more than one entry for search on RootDSE which means Cursor is not functioning properly\!\:failed on list.close()\:failed to unbind session properly\:Failed to send a search request with RefreshAndPersist mode\:Failed to bind an LDAP service\:Failing on cursor close\:LDIF file does not exist.\:Failed to import LDIF into backing store.\:failed to close stream\:Error closing NamingEnumeration on PSearchListener\:Error closing connection on PSearchListener\:PSearchListener encountered error\:could not get canonical path\:Cannot load the ldif file\:Failed to run the class\:Failed to run the method\:Error while scanning index on attribute\:help for usage.\:Unknown command\:forced configuration load (-c) requires the -i option\:Command line parsing failed for\:unknown command\:port value of\:is larger than max port number\:is smaller than the minimum port number\:Partition directory\:delay value of\:is larger than max delay (seconds) allowed\:delay value of\:timeOffline value of\:is larger than max timeOffline (minutes) allowed\:is less than zero and makes no sense\:failed for the following reasons provided by the server\:Import failed...\:ldif file name must be provided\:No Normalizer present for attribute type\:in memory index cannot store the data on disk\:in memory index doesn't support explicit caching\:Cannot store a ClonedServerEntry\:Id for parent\:contains no objectClass attribute\:Not a normalized name\:contains no entryCsn attribute\:contains no entryUuid attribute\:Unidentified modification operation\:Cannot call store method\:aliasDereferencingProblem - attempt to create alias to itself.\:aliasDereferencingProblem - attempt to create alias with cycle to relative\:aliasDereferencingProblem - the alias points to an entry outside of the\:aliasProblem - the alias when dereferenced would not name a known object the aliasedObjectName must be set to a valid existing entry.\:aliasDereferencingProblem - the alias points to another alias.  Alias chaining is not supported by this backend.\:Anonymous bind NOT permitted\!\:Cannot authenticate user\:Password not correct for user\:Failed to lookup user for authentication\:Unexpected protectedItem\:Unexpected userClass\:The rootDSE cannot be moved or renamed\!\:Undefined modify operation value of\:The ChangeLog has not been enabled.\:The underlying changelog store does not support searching through it's logs\:The underlying changelog store does not support searching through it's tags\:revision must be greater than or equal to 0\:revision must be less than or equal to the current revision\:Collective attributes cannot be stored in non-collectiveAttributeSubentries\:Cannot operate on collective attributes in non-collectiveAttributeSubentries\:Negation has no child\:Unrecognized branch node operator\:Unrecognized leaf node type\:Unknown match type\:Unrecognized search scope\!\:had incorrect syntax\:The global schema subentry cannot be added since it exists by default.\:already exists\!\:Attempt to add entry\:Can not allow the deletion of the subschemaSubentry\:Trying to add existing value\:Can not allow the renaming of the subschemaSubentry\:A CollectiveAttribute Subentry must have at least one collective Attribute\:Can not allow the move of the subschemaSubentry\:Attempt to search under non-existant entry\:Unknown assertion type\:Failed to expand node\:System partition has wrong name\:Duplicate partition suffix\:The id cannot be set for the partition nexus.\:Grouping many exceptions on root nexus sync()\:not found within the attributeType registry\:The current partition does not have any suffix\:Cannot find a partition for\:userRoot() in org.apache.directory.server.prefs.ServerPreferencesFactory not implemented\!\:Failed to set up node.\:Failed to get SPI.\:Modify operation leaves no structural objectClass for entry\:Modify operation attempts to delete RDN attribute\:Modify operation attempts to delete RDN attribute values in use for\:not found in attribute registry\!\:At least two name components are expected for the dn\:not declared in objectClasses of entry\:More than one value has been provided for the single-valued attribute\:Required attributes\:is syntactically incorrect\:The value is not a valid String\:The value stored in an Human Readable attribute is not a String\:Modify REPLACE operations on schema subentries are not allowed\:Undefined modify operation\:Unknown index into handler array\:Failed to get BC Certificate factory for algorithm\:Bad certificate format.\:Failed to get key factory for algorithm\:Bad private key format.\:Bad public key format.\:Cannot generate key pair for TLS\:Cannot generate self signed certificate.\:not found in DIT.\:is not supported.\:node cannot be null\:objectClasses cannot be null\:Attribute objectClasses should be of id 'objectClass'\:Unrecognized assertion type for refinement node\:Refinement leaf node attribute was\:objectClasses argument cannot be null\:objectClasses attribute must be for ID 'objectClass'\:A subentry must have an objectClass attribute\:does not contain an administrativeRole attribute\! An administrativeRole attribute in the administrative point is required to add a subordinate subentry.\:Failed while parsing subtreeSpecification for\:Will not allow rename operation on entries with administrative descendants.\:Bad value for the OID\:The change log must be enabled to revert to previous log revisions.\:There must be at least one tag to revert to the latest tag.\:can't rename the rootDSE\:Invalid operation on Name\:revision must be less than the current revision\:cannot create an entry under a referral when the Context.REFERRAL is set to 'ignore'\:Directory service is not started.\:Schema load failed\:Cannot execute indirect lookup if it is not the next operation.\:The throwReferral method is not implemented for a Bind operation\:The isReferralThrown method is not implemented for a Bind operation\:The ignoreReferral method is not implemented for a Bind operation\:The isReferralIgnored method is not implemented for a Bind operation\:Cannot set the empty operation context to anything other than the EmptyDN\:NewSuperior must not be null\:The new superior cannot be null for\:represents a move and rename operation.\:newRdn must not be null for a rename\:Failed to initialize interceptor chain.\:Interceptor not found\:Unknown interceptor name\:Other interceptor is using name\:Unexpected exception.\:for new schema entity is not unique.\:for new schema entity does not exist.\:The parent dn of a attributeType should be at most 3 name components in length.\:should be an organizationalUnit.\:should have a relative name of ou\:as this schema already contains this element\:as this schema is not loaded\:as this schema does not contain this element\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' AttributeTypes\:Cannot move a schemaObject from a not loaded schema\:Cannot move a schemaObject to a not loaded schema\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:into the registries, the resulting registries would be inconsistent\:cannot have it's OID changed until all matchingRules using that comparator have been deleted.\:cannot be moved to another schema until all matchingRules using that comparator have been deleted.\:for new schema comparator is not unique.\:The parent dn of a comparator should be at most 3 name components in length.\:The parent entry of a comparator should be an organizationalUnit.\:The parent entry of a comparator should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:The parent dn of a matchingRule should be at most 3 name components in length.\:The parent entry of a matchingRule should be an organizationalUnit.\:The parent entry of a syntax should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:into the registries, we have got some errors\:as there are some dependant SchemaObjects\:cannot have it's OID changed until all matchingRules using that normalizer have been deleted.\:cannot be moved to another schema until all matchingRules using that normalizer have been deleted.\:for new schema normalizer is not unique.\:The parent dn of a normalizer should be at most 3 name components in length.\:The parent entry of a normalizer should be an organizationalUnit.\:The parent entry of a normalizer should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' ObjectClasses\:The parent entry of a objectClass should be an organizationalUnit.\:The parent entry of a attributeType should have a relative name of ou\:Only schema entity containers of objectClass organizationalUnit with 3 name components in length can be deleted.\:Can only delete organizationalUnit entity containers with one of the following names\:The parent dn of a schema should be\:Cannot delete schema that has dependents\:Cannot allow rename with rdnAttribute set to\:Moving around schemas is not allowed.\:Unknown modify operation type\:Unwilling to perform operation on schema with missing dependencies\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:for new schema syntaxChecker is not unique.\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:cannot be moved to another schema until all syntax using that syntaxChecker have been deleted.\:The parent dn of a syntaxChecker should be at most 3 name components in length.\:The parent entry of a syntaxChecker should be an organizationalUnit.\:into the registries, the resulting registries would be inconsistent\:into the registries, the resulting registries would be inconsistent\:cannot be deleted until all entities using this syntax have also been deleted. The following dependees exist\:The parent dn of a syntax should be at most 3 name components in length.\:The parent entry of a syntax should be an organizationalUnit.\:The following does not conform to the syntaxCheckerDescription syntax\:The following does not conform to the normalizerDescription syntax\:The following does not conform to the comparatorDescription syntax\:The following does not conform to the attributeTypeDescription syntax\:Cannot permit the addition of an attributeType with an invalid super type\:Cannot permit the addition of an attributeType with an invalid syntax\:Cannot permit the addition of an attributeType with an invalid EQUALITY matchingRule\:Cannot permit the addition of an attributeType with an invalid ORDERING matchingRule\:Cannot permit the addition of an attributeType with an invalid SUBSTRINGS matchingRule\:Cannot permit the addition of an attributeType with an no EQUALITY matchingRule\:Cannot permit the addition of an attributeType with which cannot resolve an EQUALITY matchingRule from it's super type.\:Cannot permit the addition of an attributeType with no syntax\:The following does not conform to the objectClassDescription syntax\:Cannot permit the addition of an objectClass with an invalid superior objectClass\:Cannot permit the addition of an objectClass with an invalid attributeType in the mayList\:Cannot permit the addition of an objectClass with an invalid attributeType in the mustList\:The following does not conform to the matchingRuleUseDescription syntax\:The following does not conform to the ldapSyntax description syntax\:Cannot permit the addition of a syntax without the prior creation of a\:The following does not conform to the matchingRuleDescription syntax\:Cannot create a matchingRule that depends on non-existant syntax\:The following does not conform to the ditStructureRuleDescription syntax\:The following does not conform to the ditContentRuleDescription syntax\:The following does not conform to the nameFormDescription syntax\:Not allowed to set the wrappedPartition after initialization.\:Got more than one matchingRule for oid of\:Got more than one attributeType for oid of\:Got more than one syntax for oid of\:Got more than one syntaxChecker for oid of\:Attribute of second rdn in dn\:Got more than one result for the entity name\:Names used for principals must be normalized\!\:Unknown JNDI Context.REFERRAL value of\:Bad serialization, tree\:Null or empty data array is invalid.\:wrong array serialized data format\:Bad tree\:wrong AvlTree serialized data format\:This singleton AvlTree does not support changes since the behavior of alterations on a singleton are undefined.\:Could not find class\:This cursor locks down the key so keywise advances are not allowed.\:singleton must not be null\:orderedSet must not be null\:Cannot request singleton when in ordered set mode.\:Cannot set a singleton when using multiple values\:Already in singleton mode.\:Cannot get ordered set in singleton mode.\:Cannot set a orderedSet when in singleton mode\:Already in ordered set mode.\:Cannot use standard serialization for a ServerAttribute\:Cannot use standard serialization for a ServerEntry\:undefined modification type\:Cannot figure out attribute ID if both args are null\:Cannot take union of attributes with different IDs\!\:does not exist in the schema\:Encountered NamingException on underlying enumeration.\:Not a valid value\:expected string to normalize\:expected byte\:can't move the root DSE\:Unidentified change type value\:Cannot find directory service in environment\:Can't convert\:De-serialization of\:object deserialization stream close() failure\:Serialization of\:object serialization stream close() failure\:Don't know how to interpret\:but could not find it in env\!\:but it was set to null in env\!\:cannot be null.\:cannot specify simple authentication with supplying credentials\:does not contains the mandatory 'cn' attribute for JavaContainer ObjectClass\!\:can't delete the rootDSE\:Do not know how to store Referenceables yet\!\:Do not know how to store References yet\!\:Can't find a way to bind\:using object factories within the context's environment.\:is not an ancestor of this entry\:Both obj and attrs args are null. At least one of these parameters must not be null.\:Encountered parse exception while parsing the filter\:could not parse filter\:Config partition cannot be null\:the config partition is not initialized\:system partition doesn't exist\:yet to implement\:Invalid interceptor order\:Cannot overwrite, config output directory already exists\:Cannot copy non-existant source file\:Should not be hitting root without config/config pattern.\:parent cannot be null\:Failed to authenticate user\:Error during underflow\:Key not found\:BPage not ordered\:Invalid child subordinate key\:Argument 'recman' is null\:Argument 'comparator' is null\:Argument 'comparator' must be serializable\:Argument 'pageSize' must be even\:Argument 'key' is null\:Argument 'value' is null\:Argument 'obj1' is null\:Argument 'obj2' is null\:Platform doesn't support UTF8 encoding\:MRU cache must contain at least one entry\:Cannot add null listener.\:Internal cache cannot be null.\:key cannot be null.\:value cannot be null.\:Cannot create bucket with depth > MAX_DEPTH+1. Depth\:Cannot create deeper directory. Depth\:Argument 'recid' is invalid\:Name directory must exist\:RecordManager has been closed\:bogus block id\:BlockId assigned for transaction block\:transaction count on block\:Argument 'cache' is null\:DataPage.setFirst\:file header magic not OK\:couldn't obtain free translation\:page header magic for block\:page header magic not OK\:allocate of free page?\:free free page?\:free header page?\:Soft reference cache not implemented\:Weak reference cache not implemented\:Invalid cache type\:double get for block\:bad blockid\:in use list not empty at commit time\:in use list not empty at rollback time\:in txn list not empty at rollback time\:In transaction not empty\:Dirty blocks at close time\:inUse blocks at close time\:Offset too large for record header\:Argument 'maxTxns' must be greater than 0.\:Cannot change setting while transactions are pending in the log\:Bad magic on log file\:Unexcepted exception\:Invalid record manager provider\:Not a serialized BTreeRedirect object\:Not a serialized BTreeRedirect object\:this is not an arrayTree container\:this is not a btreeRedirect container\:This cursor can only be used with tables that have duplicate keys enabled.\:Value based advances not supported.\:No Equality MatchingRule available for attribute\:property for an index cannot be set after it has been initialized.\:Cannot set jdbm store property\:Errors encountered on destroy()\:when dereferenced would not name a known object. The aliased ObjectName\:Key comparator cannot be null.\:Value comparator must not be null for tables with duplicate keys.\:Unfortunately this Table without duplicates enabled does not contain a value comparator which is needed to answer your ordering question.\:null for key or value is not valid\:This Cursor does not support duplicate keys.\:Encoder unavailable for\:Error instantiating encoder for\:Decoder unavailable for\:Error accessing decoder for\:Error instantiating decoder for\:AS-REQ PA-ENC-TIMESTAMP padata timestamp, encrypted with the client key\:AS-REP Ticket and TGS-REP Ticket (includes TGS session key or application session key), encrypted with the service key\:AS-REP encrypted part (includes TGS session key or application session key), encrypted with the client key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS session key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS authenticator subkey\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator cksum, keyed with the TGS session key\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator (includes TGS authenticator subkey), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS authenticator subkey\:AP-REQ Authenticator cksum, keyed with the application session key\:AP-REQ Authenticator (includes application authenticator subkey), encrypted with the application session key\:AP-REP encrypted part (includes application session subkey), encrypted with the application session key\:KRB-PRIV encrypted part, encrypted with a key chosen by the application\:is not a supported encryption type.\:Callback not supported\:File is too large\:Could not completely read file\:Cannot encode the AuthorizationDataEntry object, the PDU size is\:Account Kerberos key attribute\:Failed to get catalog context\:Failed to get initial context\:Kerberos key should not be a String.\:Can't get a session\:An empty name is not valid in a kerberos name\:A '/' at the end of a Kerberos Name is not valid.\:Failed to connect to the server\:The specified configuration dir\:The expected context entry does not exist\:The entry already exists\:maxObjectSize\:No ASCII encoding\:Can't set option value\:Can't parse string representation\:illegal address\:is not a descendant of DhcpOption\:Can't initialize option field classes\:Max data length\:ASCII encoding unavailable\:Record type to objectClass mapping has not been set.\:ResourceRecord requires STRUCTURAL objectClass\:Invalid search base\:Can't get context at\:Invalid enum value\:SamSubsystem not enabled with key integrity checker\:Entry has null SAM type\:Could not find property\:Expecting entries with SAM type of\:Could not find verifier class\:No public default constructor on class\:Failed on default constructor invocation for class\:column index max is\:not found at search base DN\:Cannot receive NTLM message before sending Type 2 challenge.\:Cannot receive NTLM message after Type 3 has been received.\:Sasl challenge response already completed.\:Cannot send Type 2 challenge before Type 1 response.\:Cannot send Type 2 after it's already sent.\:response was null\:response with zero bytes\:There was a failure during NTLM Type 1 message handling.\:There was a failure during NTLM Type 3 message handling.\:Authentication attempted but the credentials were invalid..\:response with no auhcid or no password\:'0' chars are not allowed in authcid or no password\:The given InitialReponse is incorrect\:Cannot authenticate an invalid authcid DN\:Cannot authenticate the user\:Failed authorization in callback handler.\:Failed on keystore load which should never really happen.\:Failed to create KeyManagerFactory\:Failed to initialize KeyManagerFactory\:Failed to create SSLContext\:Failed to initialize SSLContext\:Failed to create a SSL context.\:Although ExtendedRequests are SingleReplyRequests they're not handled using this base class. They have no target entry unlike the rest of the SingleReplyRequests\:Unidentified single reply request/response type\:Unexpected base scope.\:TimeUnit not supported\:Unsupported protocol type\:Failed to add the extended operation of type\:Failed to add the SASL mechanism with the name\:Failed to add NTLM provider\:Empty ID\:Invalid replica ID\:The following schema directory from the installation layout could not be found\:Unknown SchemaObject type\:Could not find entry at\:Cannot delete entry\:not in value range\:Bind requests only tunnel down into partitions if there are no authenticators to handle the mechanism\:This cursor is empty and cannot return elements\!\:Cannot efficiently search the DIB w/o an index on attribute\:Cannot access element if positioned before first.\:Cannot access element if positioned after last.\:AndCursors are not ordered and do not support positioning by element.\:Cursor has not been positioned yet.\:Could not find matchingRule to use for EqualityNode evaluation\:Unrecognized leaf node\:Unrecognized branch node type\:Unrecognized search scope value for filter scope node\:EqualityCursors only support positioning by element when a user index exists on the asserted attribute.\:Could not find matchingRule to use for GreaterEqNode evaluation\:LessEqCursors only support positioning by element when a user index exists on the asserted attribute.\:chingRule to use for LessEqNode evaluation\:NotCursors are not ordered and do not support positioning by element.\:Scope Cursors are not ordered and do not support positioning by element.\:ScopeNode is not of onelevel scope.\:This is too inefficient without getId() on ServerEntry\:OrCursors are not ordered and do not support positioning by element.\:Must have 2 or more sub-expression Cursors for a disjunction\:PresenceCursors do not support positioning by element without a user index on the presence attribute.\:SubstringCursors may not be ordered and do not support positioning by element.\:Can't delete file\:ScopeNode is not of subtree scope.\:There can only be 2 columns at index 0 and at 1\:You didn't correctly set col names\:Unrecognized mode.\:Unrecognized FilterDialog command\:Cannot process a Request while binding\:Principal is not a valid Name\:Cannot encode the KrbError object, the PDU size is\:Cannot encode the KrbSafeBody object, the PDU size is\:Cannot encode the KrbSafe object, the PDU size is\:Cannot encode the EncKrbPrivPart object, the PDU size is\:Cannot encode the KrbPriv object, the PDU size is\:Cannot encode the KrbCredInfo object, the PDU size is\:Cannot encode the EncKrbCredPart object, the PDU size is\:Cannot encode the KrbCred object, the PDU size is\:Cannot encode the EncTicketPart object, the PDU size is\:Cannot encode the TypedData object, the PDU size is\:The PDU length is null, this is not allowed\:is not a valid KerberosString\:Not a valid log file number\:Not a valid log file offset\:Invalid log file bufferSize/ max size is sepcified bufferSize\:Log Scanner is already closed\:Log content is invalid
#
#TODO: add other error messages from other LDAP implementations such as the following list (from http://en.wikipedia.org/wiki/List_of_LDAP_software)
# Note: removed references to the ones handled above
#
# Apple Open Directory
# FreeIPA
# IBM Tivoli Directory Server
# Mandriva Directory Server
# Novell eDirectory
# OpenDJ - A fork of the OpenDS project
# OpenDS
# Virtual Identity Server from Optimal IdM
# Oracle Internet Directory
# Radiant Logic VDS
# Sun Java System Directory Server
# UnboundID Directory Server[1]
# Univention Corporate Server (with OpenLDAP from Univention)
# DirX Directory from Atos (ex-Siemens)  

ascanbeta.noanticsrftokens.name=Absence de Jetons Anti-CSRF
ascanbeta.noanticsrftokens.desc=Aucun jetons Anti-CSRF n'ont \u00e9t\u00e9 trouv\u00e9s dans un formulaire HTML.
ascanbeta.noanticsrftokens.alert.attack=Aucun. Avertissement uniquement.
ascanbeta.noanticsrftokens.alert.extrainfo=Aucun jeton Anti-CSRF connu n'a \u00e9t\u00e9 trouv\u00e9 dans le code HTML suivant

ascanbeta.remotecodeexecution.cve-2012-1823.name=Ex\u00e9cution de code \u00e0 distance - CVE-2012-1823
ascanbeta.remotecodeexecution.cve-2012-1823.desc=Lorsqu'elles sont configur\u00e9es pour ex\u00e9cuter du code CGI, certaines versions de PHP ne traitent pas correctement les cha\u00eenes de requ\u00eate dans lesquelles manque un caract\u00e8re "\=" non \u00e9chapp\u00e9, ce qui permet l'ex\u00e9cution de code arbitraire. Dans ce cas, il est possible de faire ex\u00e9cuter une commande du syst\u00e8me d'exploitation sur le serveur internet, dont les r\u00e9sultats sont retourn\u00e9s au navigateur internet. 
ascanbeta.remotecodeexecution.cve-2012-1823.soln=Mettez \u00e0 jour \u00e0 la derni\u00e8re version stable de PHP, ou utilisez le serveur internet Apache et son module mod_rewrite pour filtrer les requ\u00eates malicieuses utilisant les directives "RewriteCond" et "RewriteRule".

ascanbeta.sessionfixation.name=Fixation de session
ascanbeta.sessionfixation.desc=Une attaque par fixation de session serait possible. Si ce probl\u00e8me apparait dans le cas d'une URL de connexion (o\u00f9 l'utilisateur s'authentifie aupr\u00e8s de l'application), alors l'URL pourrait \u00eatre fournie \u00e0 la victime  avec un identificateur de session fixe par un aggresseur, de mani\u00e8re \u00e0 ce que ce dernier puisse usurper l'identit\u00e9 de la victime avec l'identificateur de session donn\u00e9. Si ce probl\u00e8me apparait avec une autre page internet, l'URL et son identificateur de seesion fixe ne peuvent qu'\u00eatre utilis\u00e9s pour tracer les actions d'un utilisateur non authentifi\u00e9. Si la vuln\u00e9rabilit\u00e9 se produit sur un champ de cookie ou de formulaire (param\u00e8tre POST) plut\u00f4t que sur une URL (GET), alors une autre faille peut aussi \u00eatre n\u00e9cessaire pour renseigner le champ du cookie, afin que la vuln\u00e9rabilit\u00e9 soit exploitable.
ascanbeta.sessionfixation.soln=1) Emp\u00eacher l'agresseur de s'approprier un identificateur de session en for\u00e7ant des identificateurs de session stricts , et en n'allouant ces identificateurs qu'apr\u00e8s une authentification r\u00e9ussie \u00e4 l'application.\n2) Le serveur devrait toujours cr\u00e9er un nouvel identificateur de session lors d'une authentification, m\u00eame si une session est d\u00e9j\u00e0 en cours.\n3) Lier l'identificateur de session \u00e0 une combinaison identifiable d'attributs sp\u00e9cifiques au client, comme l'adresse IP ou le certificat client.\n4) Lors de leur destruction, les sessions doivent \u00eatre d\u00e9truites sur le serveur comme sur le client.\n5) Impl\u00e9menter un m\u00e9canisme de d\u00e9connexion qui d\u00e9truira toutes les sessions pr\u00e9c\u00e9dentes d'un client.\n6) Impl\u00e9menter des timeouts de session absolus\n7) Changer un identificateur de session bas\u00e9 sur l'URL vers un identificateur bas\u00e9 sur les cookies ou les formulaires, ces derniers n\u00e9cessitant d'autres failles pour \u00eatre exploitables pas un agresseur.\n
ascanbeta.sessionfixation.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Session_fixation\nhttp\://www.acros.si/papers/session_fixation.pdf\nhttp\://www.technicalinfo.net/papers/WebBasedSessionManagement.html\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionfixation.alert.cookie.extrainfo=Cookie d\u00e9fini dans la r\u00e9ponse lorsque le champ de cookie [{0}] est renseign\u00e9 \u00e0 NULL\: [{1}] \nCookie d\u00e9fini dans la r\u00e9ponse avec la valeur (valide) du cookie emprunt\u00e9e \u00e0 la requ\u00eate [{1}]\: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage=L'URL \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionfixation.alert.url.extrainfo=Une valeur de session probable est apparue dans les URL dans la sortie HTML lorsque le param\u00e8tre URL ou du param\u00e8tre pseudo URL [{0}] est d\u00e9fini \u00e0 NULL\: [{1}]\nLorsque cette session "emprunt\u00e9e" [{1}] est utilis\u00e9e dans une requ\u00eate ult\u00e9rieure de cette URL, une nouvelle session n'est pas cr\u00e9\u00e9e.
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage=L'URL \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionfixation.alert.attack=Champ {0}\: [{1}]
ascanbeta.sessionfixation.alert.logmessage=Une vuln\u00e9rabilit\u00e9 probable de Fixation de Session a \u00e9t\u00e9 trouv\u00e9e avec [{0}] URL [{1}] sur le champ {2}\: [{3}]
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name=Identificateur de session expos\u00e9
ascanbeta.sessionidexposedinurl.desc=Un identificateur de session est expos\u00e9 dans l'URL. En partageant cette URL contenant l'id de session, un utilisateur na\u00eff pourrait accorder l'acc\u00e8s \u00e0 ces donn\u00e9es par inadvertance, compromettant ainsi leur confidentialit\u00e9, int\u00e9grit\u00e9 et disponibilit\u00e9. Des URLs contenant l'identificateur de session apparaissent aussi dans les signets du navigateur internet, dans les fichiers de journalisation des serveurs internet et des serveurs proxy. 
ascanbeta.sessionidexposedinurl.soln=Utilisez une impl\u00e9mentation de gestion de session plus s\u00fbre, telle que celle utilisant des cookies de session, qui ne sont pas aussi facilement partag\u00e9es par inadvertance, et qui n'apparaissent g\u00e9n\u00e9ralement pas dans les fichiers de journalisation des serveur ou dans les signets des navigateurs internet.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management
ascanbeta.sessionidexposedinurl.alert.extrainfo=Le champ {0} [{1}] contient un identificateur de session expos\u00e9 [{2}]
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage=L'URL \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionidexposedinurl.alert.attack=Champ {0}\: [{1}]
ascanbeta.sessionidexposedinurl.alert.logmessage=Un identificateur de session expos\u00e9 a \u00e9t\u00e9 trouv\u00e9 \u00e0 l'URL [{0}] [{1}] sur le champ {2}\: [{3}]
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name=Identificateur de session transmis de fa\u00e7on non s\u00e9curis\u00e9e
ascanbeta.sessionidsentinsecurely.desc=Un identificateur de session pourrait \u00eatre envoy\u00e9 par un m\u00e9canisme non s\u00e9curis\u00e9. Dans le cas d'un cookie envoy\u00e9 dans la requ\u00eate, cela se produit lorsque HTTP est utilis\u00e9 plut\u00f4t que HTTPS.  Dans le cas d'un cookie envoy\u00e9 dans une r\u00e9ponse par le serveur (lorsque l'URL est modifi\u00e9e en fixant \u00e0 NULL le champ de param\u00e8tre nomm\u00e9), l'indicateur "secure" n'est pas renseign\u00e9, ce qui permet de renvoyer le cookie plus tard par HTTP plut\u00f4t que par HTTPS. Cela peut permettre \u00e0 une personne malveillante de s'ins\u00e9rer passivement dans l'\u00e9change de donn\u00e9es dans le r\u00e9seau pour obtenir un acc\u00e8s complet \u00e0 la session de la victime.  
ascanbeta.sessionidsentinsecurely.soln=1) Utilisez la version la plus r\u00e9cente de SSL/TLS (pour HTTPS) sur toutes les pages o\u00f9 un identificateur de session est communiqu\u00e9 entre le navigateur et le serveur internet.\n2) Ne permettez pas que la communication puisse \u00eatre contrainte \u00e0 revenir au protocole non crypt\u00e9 HTTP.\n3) Utilisez la balise 'secure' lorsque vous renseignez un cookie contenant un identificateur de session, vous \u00e9viterez ainsi sa transmission ult\u00e9rieure par un m\u00e9canisme non s\u00e9curis\u00e9.\n4) Dirigez les requ\u00eates  pour des pages HTTP non s\u00e9curis\u00e9es vers leur \u00e9quivalent s\u00e9curis\u00e9 HTTPS.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionidsentinsecurely.alert.extrainfo=L'identificateur de session {0} champ [{1}], valeur [{2}] peut \u00eatre envoy\u00e9 par l'interm\u00e9diaire d'un m\u00e9canisme non s\u00e9curis\u00e9.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset=L'indicateur 'secure' n'\u00e9tait pas d\u00e9fini dans le cookie de session fourni par le serveur.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage=L'URL \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionidsentinsecurely.alert.attack=Champ {0}\: [{1}]
ascanbeta.sessionidsentinsecurely.alert.logmessage=Un identificateur de session dans le champ {2}\: [{3}] peut \u00eatre envoy\u00e9 par un m\u00e9canisme non s\u00e9curit\u00e9 \u00e0 [{0}] URL [{1}]
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name=Cookie d'identificateur de session accessible par JavaScript
ascanbeta.sessionidaccessiblebyjavascript.desc=Un cookie avec un identificateur de session envoy\u00e9 par le serveur (lorsque l'URL est modifi\u00e9e en d\u00e9finissant \u00e0 NULL le champ de param\u00e8tre) peut \u00eatre acc\u00e9d\u00e9 par JavaScript sur le client. Conjointement avec une autre vuln\u00e9rabilit\u00e9, cela peut permettre de d\u00e9tourner la session.  
ascanbeta.sessionidaccessiblebyjavascript.soln=1) Utilisez l'indicateur 'httponly' lorsque vous renseignez un cookie contenant un identificateur de session, pour emp\u00eacher que celui-ci soit accessible par JavaScript dans le navigateur internet.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.refs=\ 
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo=Le champ [{1}] d'identificateur de session {0}, valeur [{2}] peut \u00eatre consult\u00e9 par JavaScript dans le navigateur internet
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage=L'URL \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionidaccessiblebyjavascript.alert.attack=Champ {0}\: [{1}]
ascanbeta.sessionidaccessiblebyjavascript.alert.logmessage=Un identificateur de session dans le champ {2} de l'URL [{1}] [{0}]\: [{3}] peut \u00eatre accessible par JavaScript  
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name=Le temps d'expiration ou l'\u00e2ge maximal de l'identificateur de session est excessif
ascanbeta.sessionidexpiry.desc=Un cookie avec identificateur de session envoy\u00e9 par le serveur (quand l'URL est modifi\u00e9e en d\u00e9finissant \u00e0 NULL le champ de param\u00e8tre) reste valide pour une dur\u00e9e trop longue. Ceci peut \u00eatre exploit\u00e9 par un attaquant si l'utilisateur oublie de se d\u00e9connecter, si la fonctionnalit\u00e9 de d\u00e9connexion ne d\u00e9truit pas correctement la session, ou si l'identificateur de session est compromis d'une autre mani\u00e8re.
ascanbeta.sessionidexpiry.soln=1) Utilisez les directives de cookie 'Expire' ou 'Max-Age' lorsque vous d\u00e9finissez un cookie contenant un identificateur de session, pour \u00e9viter que celui-ci soit disponible pour une dur\u00e9e prolong\u00e9e.\n2) Assurez-vous de la pr\u00e9sence d'une fonction de d\u00e9cennexio, et que la session est d\u00e9truite correctement.\n3) Utilisez d'autres mesures pr\u00e9ventives pour \u00e9viter que l'identificateur de session ne soit exploitable au cas o\u00f9 celui-ci soit divulgu\u00e9.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.refs=\ 
ascanbeta.sessionidexpiry.alert.extrainfo=champ [{1}] d'identificateur de session {0}, de valeur [{2}] est accessible jusqu'\u00e0 [{3}] (\u00e9tant donn\u00e9 que le cookie a \u00e9t\u00e9 re\u00e7u \u00e0 {4}), sauf si la session est d\u00e9truite.
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage=L'url \u00e0 laquelle le probl\u00e8me a \u00e9t\u00e9 d\u00e9couvert a \u00e9t\u00e9 signal\u00e9e comme une page de connexion.
ascanbeta.sessionidexpiry.alert.attack=champ {0}\: [{1}]
ascanbeta.sessionidexpiry.alert.logmessage=Un identificateur de session dans le champ {2}\: [{3}] de [{0}] URL [{1}] peut \u00eatre acc\u00e9d\u00e9 jusqu'\u00e0 [{4}], sauf si la session est d\u00e9truite.
ascanbeta.sessionidexpiry.browserclose=fermeture du navigateur
ascanbeta.sessionidexpiry.timemorethanoneweek=Plus d'une semaine
ascanbeta.sessionidexpiry.timemorethanoneday=Plus d'un jour
ascanbeta.sessionidexpiry.timemorethanonehour=Plus d'une heure
ascanbeta.sessionidexpiry.timelessthanonehour=Moins d'une heure
ascanbeta.sessionidexpiry.timeexpired=Expir\u00e9

ascanbeta.shellshock.name=Ex\u00e9cution de code \u00e0 distance - Shell Shock
ascanbeta.shellshock.desc=Le serveur ex\u00e9cute une version de l'interpr\u00e9teur Bash permettant \u00e0 des attaquants distants d'ex\u00e9cuter du code arbitraire 
ascanbeta.shellshock.extrainfo=De CVE-2014-6271\: le GNU Bash jusqu'\u00e0 4.3 traite l'arri\u00e8re des cha\u00eenes d'apr\u00e8s les d\u00e9finitions de fonction donn\u00e9es par les valeurs des variables d'environnement, ce qui permet aux agresseurs distants d'ex\u00e9cuter du code arbitraire via un certain environnement, comme en t\u00e9moignent les vecteurs impliquant la fonction ForceCommand de OpenSSH sshd, les modules mod_cgi et mod_cgid du serveur HTTP Apache, les scripts ex\u00e9cut\u00e9s par des clients DHCP non pr\u00e9cis\u00e9s et d'autres situations dans lesquelles l'initialisation de l'environnement se fait par l'ex\u00e9cution de Bash \u00e0 travers une limite de privil\u00e8ge, alias "ShellShock". A NOTER\: le correctif original de ce probl\u00e8me \u00e9tait incorrect; CVE-2014-7169 a \u00e9t\u00e9 d\u00e9sign\u00e9 pour couvrir la vuln\u00e9rabilit\u00e9 qui est toujours pr\u00e9sente apr\u00e8s le fix incorrect.
ascanbeta.shellshock.soln=Mettez \u00e0 jour Bash sur le serveur avec la version la plus r\u00e9cente
ascanbeta.shellshock.ref=http\://web.nvd.nist.gov/view/vuln/detail?vulnId\=CVE-2014-6271\nhttp\://www.troyhunt.com/2014/09/everything-you-need-to-know-about.html
ascanbeta.shellshock.timingbased.evidence=\u00c0 l'aide de l'attaque, un d\u00e9lai de millisecondes [{0}] a \u00e9t\u00e9 induit et d\u00e9tect\u00e9

ascanbeta.sqlinjection.mysql.name=Injection SQL - MySQL
ascanbeta.sqlinjection.hypersonic.name=Injection SQL - Hypersonic SQL
ascanbeta.sqlinjection.oracle.name=Injection SQL - Oracle
ascanbeta.sqlinjection.postgres.name=Injection SQL - PostgreSQL
ascanbeta.sqlinjection.desc=Une injection SQL peut \u00eatre possible
ascanbeta.sqlinjection.soln=Ne faites pas confiance aux entr\u00e9es du c\u00f4t\u00e9 client, m\u00eame si des m\u00e9canismes de validation sont en place c\u00f4t\u00e9 client.\nEn g\u00e9n\u00e9ral, contr\u00f4lez du c\u00f4t\u00e9 serveur le type de chaque donn\u00e9e.\nSi l'application utilise JDBC, utilisez les PreparedStatement ou CallableStatement, avec les param\u00e8tres pass\u00e9s par '?'\nSi l'application utilise ASP, utilisez les Command Objects ADO avec un typage fort et des requ\u00eates param\u00e9tr\u00e9es.\nSi l'utilisation de proc\u00e9dures stock\u00e9es est possible, utilisez-les. \nNe concat\u00e9nez *pas* les cha\u00eenes de caract\u00e8res dans les requ\u00eates \u00e0 destination de proc\u00e9dures stock\u00e9es, ou utilisez des fonctions 'exec', 'exec immediate' ou d'autre fonctions \u00e9quivalentes\!\nNe cr\u00e9ez pas des requ\u00eates SQL dynamiques par simple concat\u00e9nation de cha\u00eenes de caract\u00e8res.\n\u00c9chappez toutes les donn\u00e9es re\u00e7ues du client.\nAppliquez une 'liste blanche' de caract\u00e8res autoris\u00e9s, ou une 'liste noir' de caract\u00e8res interdits dans les entr\u00e9es de l'utilisateur.\nAppliquez le principe de moindre privil\u00e8ge en utilisant le privil\u00e8ge utilisateur le plus faible sur la base de donn\u00e9e.\nEn particulier, \u00e9vitez l'utilisation des utilisateurs 'sa' ou 'db-owner'. Ceci n'\u00e9limine pas les injections SQL, mais minimise leur impact.\nAccordez \u00e0 l'application le minimum n\u00e9cessaire de droits d'acc\u00e8s aux bases de donn\u00e9es .
ascanbeta.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
#ascanbeta.sqlinjection.alert.errorbased.attack={1}
ascanbeta.sqlinjection.alert.errorbased.differentiation.attack=Valeur d'Origine\: [{0}]. Valeur Modifi\u00e9e\: [{1}]. Valeur de Contr\u00f4le\: [{2}]
ascanbeta.sqlinjection.alert.booleanbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanbeta.sqlinjection.alert.unionbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanbeta.sqlinjection.alert.errorbased.extrainfo=SGBDR [{0}] probable, compte tenu du fragment de message d'erreur [{1}] trouv\u00e9 dans les r\u00e9sultats HTML
ascanbeta.sqlinjection.alert.unionbased.extrainfo=SGBDR [{0}] probable, compte tenu du fragment de message sp\u00e9cifique \u00e0 l'UNION [{1}] trouv\u00e9 dans les r\u00e9sultats HTML
ascanbeta.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], le message modifi\u00e9 donne le statut HTTP [{1}]
ascanbeta.sqlinjection.alert.errorbased.differentiation.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], un corps d'une longueur [{1}], le message modifi\u00e9 donne le statut HTTP [{2}], un corps d'une longueur [{3}]. Un tiers (une injection non-SQL induisant une valeur) donne un statut HTTP [{4}], un corps d'une longueur [{5}]
ascanbeta.sqlinjection.alert.booleanbased.extrainfo=Les r\u00e9sultats de la page ont \u00e9t\u00e9 manipul\u00e9s avec succ\u00e8s en utilisant les conditions bool\u00e9ennes [{0}] et [{1}]
ascanbeta.sqlinjection.alert.timebased.extrainfo=Le temps de la requ\u00eate est contr\u00f4lable \u00e0 l'aide de la valeur du param\u00e8tre [{0}], qui lui fait ainsi prendre [{1}] millisecondes, alors que la requ\u00eate d'origine, non modifi\u00e9e avec la valeur [{2}] prend, quant \u00e0 elle, [{3}] millisecondes 

ascanbeta.sourcecodedisclosure.desc=Le code source de la page actuelle a \u00e9t\u00e9 d\u00e9voil\u00e9 par le serveur internet

ascanbeta.sourcecodedisclosurecve-2012-1823.name=Source Code Disclosure - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.desc=Certaines versions PHP, lorsqu'il est configur\u00e9 pour ex\u00e9cuter \u00e0 l'aide de CGI, ne manipulez pas correctement les cha\u00eenes de requ\u00eate qui n'ont pas un caract\u00e8re de \u00ab \= \u00bb sans s\u00e9quence d'\u00e9chappement, ce qui permet la divulgation de code source PHP et l'ex\u00e9cution de code arbitraire. Dans ce cas, le contenu du fichier PHP a \u00e9t\u00e9 fourni directement au navigateur internet. Cette sortie contiendra g\u00e9n\u00e9ralement du code PHP, mais il peut \u00e9galement contenir du pur HTML.
ascanbeta.sourcecodedisclosurecve-2012-1823.soln=Mettez \u00e0 jour \u00e0 la derni\u00e8re version stable de PHP, ou utilisez le serveur internet Apache et son module mod_rewrite pour filtrer les requ\u00eates malicieuses utilisant les directives "RewriteCond" et "RewriteRule".

ascanbeta.sourcecodedisclosure.svnbased.name=Divulgation de Code Source - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln=Assurez-vous que les fichiers de m\u00e9tadonn\u00e9es SVN ne sont pas d\u00e9ploy\u00e9s vers le serveur internetou le serveur applicatif
ascanbeta.sourcecodedisclosure.svnbased.extrainfo=Le code source de [{0}] a \u00e9t\u00e9 trouv\u00e9 \u00e0 [{1}]

ascanbeta.sourcecodedisclosurewebinf.name=Divulgation de Code Source - Dossier /WEB-INF
ascanbeta.sourcecodedisclosurewebinf.desc=Du code source Java a \u00e9t\u00e9 d\u00e9voil\u00e9 par le serveur internet au travers des fichiers de classe Java du dossier WEB-INF. Les fichiers de classe peuvent \u00eatre d\u00e9compil\u00e9s pour produire un code source qui correspond tr\u00e8s \u00e9troitement au code source original.  
ascanbeta.sourcecodedisclosurewebinf.soln=Le serveur internet devrait \u00eatre configur\u00e9 pour ne pas fournir le dossier /WEB-INF ou son contenu aux navigateurs internet, car il contient des informations sensibles telles que des fichiers de code Java compil\u00e9s et des fichiers de propri\u00e9t\u00e9s qui peuvent contenir des informations d'identification. Les classes Java d\u00e9ploy\u00e9es avec l'application devraient \u00eatre obscurcies, en guise de couche de d\u00e9fense suppl\u00e9mentaire dans une optique de "d\u00e9fense en profondeur".

ascanbeta.sourcecodedisclosurewebinf.propertiesfile.name=Divulgation de fichier de propri\u00e9t\u00e9s - Dossier /WEB-INF
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.desc=Une classe Java du dossier /WEB-INF a d\u00e9voil\u00e9 la pr\u00e9sence du fichier de propri\u00e9t\u00e9s. Les fichiers de propri\u00e9t\u00e9s ne sont pas sens\u00e9s \u00eatre accessibles au public, car ils contiennent g\u00e9n\u00e9ralement des informations de configuration, des informations d'identification ou des cl\u00e9s cryptographiques.   
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.soln=Le serveur internet devrait \u00eatre configur\u00e9 pour ne pas servir le dossier /WEB-INF ou son contenu aux navigateurs internet.  Il serait \u00e9galement possible de supprimer le dossier /WEB-INF.  
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.extrainfo=La r\u00e9f\u00e9rence vers le fichier de propri\u00e9t\u00e9s a \u00e9t\u00e9 trouv\u00e9e dans le code source Java d\u00e9s-assembl\u00e9 de la classe Java [{0}].

ascanbeta.usernameenumeration.name=\u00c9num\u00e9ration de noms d'utilisateur possible
ascanbeta.usernameenumeration.desc=Il peut \u00eatre possible d'\u00e9num\u00e9rer les noms d'utilisateur, en se basant sur des r\u00e9ponses HTTP diff\u00e9rentes selon les noms d'utilisateur valides et non valides fournis. Cela augmenterait consid\u00e9rablement les chances de succ\u00e8s d'une attaque par force brute sur les mots de passe d'un syst\u00e8me. Notez que les faux positifs peuvent parfois \u00eatre minimis\u00e9s en augmentant l'option 'Force d'attaque' dans ZAP.  V\u00e9rifiez s'il vous pla\u00eet manuellement le champ 'Autres infos' pour confirmer qu'il y a effectivement un probl\u00e8me. 
ascanbeta.usernameenumeration.soln=Ne d\u00e9voilez pas de d\u00e9tail selon que le nom d'utilisateur est valide ou non. En particulier, pour les tentatives de connexion infructueuses, ne distinguez pas entre un nom d'utilisateur non valide et un mot de passe non valide, que ce soit dans le message d'erreur, la page titre, le contenu de page, les en-t\u00eates HTTP ou la logique de redirection.
ascanbeta.usernameenumeration.refs=https\://www.owasp.org/index.php/Testing_for_user_enumeration_%28OWASP-AT-002%29\nhttp\://sebastian-schinzel.de/_download/ifip-sec2011.pdf
ascanbeta.usernameenumeration.alert.extrainfo=La valeur [{1}] du param\u00e8tre [{0}] divulgue de l'information sur la question de savoir si un utilisateur existe. Les diff\u00e9rences [{5}] de sortie, pour le nom d'utilisateur original valide [{2}], et pour le nom d'utilisateur invalide [{3}] sont\:\n[{4}]
ascanbeta.usernameenumeration.alert.attack=Manipuler le champ [{0}]\: [{1}] et surveiller la sortie 

ascanbeta.paddingoracle.name=Bourrage Oracle g\u00e9n\u00e9rique
ascanbeta.paddingoracle.desc=En manipulant le bourrage (padding) sur une cha\u00eene crypt\u00e9e, un attaquant peut g\u00e9n\u00e9rer un message d'erreur indiquant une probable vuln\u00e9rabilit\u00e9 'padding oracle'. Une telle vuln\u00e9rabilit\u00e9 peut affecter n'importe quel application ou framework qui utilise le chiffrement de mani\u00e8re incorrecte, tels que certaines versions d'ASP.net, Java Server Faces et Mono. Un agresseur pourrait exploiter ce probl\u00e8me pour d\u00e9chiffrer des donn\u00e9es et r\u00e9cup\u00e9rer des cl\u00e9s de chiffrement,  et de potentiellement afficher et modifier des donn\u00e9es confidentielles. Ce plugin devrait d\u00e9tecter la vuln\u00e9rabilit\u00e9 de padding oracle MS10-070 dans ASP.net si CustomErrors est activ\u00e9 dans ce but.
ascanbeta.paddingoracle.soln=Mettez \u00e0 jour le logiciel de serveur affect\u00e9, ou modifiez les scripts afin qu'ils valident correctement les donn\u00e9es chiffr\u00e9es avant toute tentative de d\u00e9chiffrement.
ascanbeta.paddingoracle.refs=http\://netifera.com/research/\nhttp\://www.microsoft.com/technet/security/bulletin/ms10-070.mspx\nhttp\://www.mono-project.com/Vulnerabilities\#ASP.NET_Padding_Oracle\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799

ascanbeta.elinjection.name=Injection d'Expression Language
ascanbeta.elinjection.desc=Le logiciel construit tout ou partie d'une instruction expression language (EL) dans une page Java Server Page (JSP) \u00e0 l'aide d'une entr\u00e9e manipul\u00e9e re\u00e7ue d'un composant en amont, mais il ne neutralise pas ou neutralise incorrectement des \u00e9l\u00e9ments sp\u00e9ciaux qui pourraient modifier l'instruction EL avant son ex\u00e9cution. Dans certaines versions ant\u00e9rieures \u00e0 Spring 3.0.5, il y avait une vuln\u00e9rabilit\u00e9 (CVE-2011-2730) dans laquelle des balises d'Expression Language seraient \u00e9valu\u00e9es deux fois, ce qui exposait effectivement n'importe quelle application \u00e0 l'injection de EL. Cependant, cette faiblesse est toujours possible pour certaines configurations, m\u00eame pour les versions ult\u00e9rieures.
ascanbeta.elinjection.soln=Effectuez une validation de donn\u00e9es sur toute entr\u00e9e non fiable et assurez-vous qu'un codage de sortie est appliqu\u00e9 lorsque les donn\u00e9es arrivent sur la couche EL, afin qu'aucun m\u00e9tacaract\u00e8re ne soit trouv\u00e9  dans le contenu de l'utilisateur avant l'\u00e9valuation par l'interpr\u00e9teur. Les patterns les plus \u00e9vidents \u00e0 d\u00e9tecter comprennent ${ et \#{, mais il peut \u00eatre possible d'encoder ou de fragmenter ces donn\u00e9es.
ascanbeta.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection\nhttp\://cwe.mitre.org/data/definitions/917.html

