#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanbeta.desc=Aktif Tarama Kurallar\u0131 - beta

ascanbeta.backupfiledisclosure.name=Yedekleme Dosya Bilgilendirme
ascanbeta.backupfiledisclosure.desc=Dosyan\u0131n bir yedek web sunucusu taraf\u0131ndan if\u015fa edildi
ascanbeta.backupfiledisclosure.soln=In-situ web sunucusundaki dosyalar\u0131 d\u00fczenlemek ve (gizli dosyalar dahil) o un-gerekli dosyalar\u0131 web sunucusundan kald\u0131r\u0131l\u0131r sa\u011flamak etmeyin.
ascanbeta.backupfiledisclosure.evidence=Bir yedekleme [ {0} ] mevcuttur [ {1} ]

ascanbeta.crossdomain.name=Etki Alanlar\u0131 Aras\u0131 yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131
#the refs cannot be customised for each sub-category (Adobe, Silverlight, etc)
ascanbeta.crossdomain.refs=http\://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html http\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf http\://msdn.microsoft.com/ tr-TR / kitapl\u0131k / cc197955 % 28 v \= vs.95 % 29 .aspx http\://msdn.microsoft.com/en-us/library/cc838250 % 28 v \= vs.95 % 29 .aspx
ascanbeta.crossdomain.adobe.read.name=\u00c7apraz-Domain yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131 - Adobe - Oku
ascanbeta.crossdomain.adobe.send.name=\u00c7apraz-Domain yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131 - Adobe - G\u00f6nder
ascanbeta.crossdomain.adobe.desc=Fla\u015f / Silverlight tabanl\u0131 \u00e7apraz site istek sahtecili\u011fi nedeniyle web sunucusunda bir yanl\u0131\u015f yap\u0131land\u0131rma, m\u00fcmk\u00fcn olabilir. 
ascanbeta.crossdomain.adobe.read.soln=Kullanarak, bu web sunucusuna etki alanlar\u0131 aras\u0131 okuma isteklerini yapmak i\u00e7in izin alanlar\u0131n listesini s\u0131n\u0131rlamak i\u00e7in crossdomain.xml dosyas\u0131 yap\u0131land\u0131rma <allow-access-from \= "example.com" etki> . Sadece "*" Bu hizmet herhangi bir eri\u015fim kontroll\u00fc, ki\u015fiselle\u015ftirilmi\u015f veya \u00f6zel verilerinizi ev sahipli\u011fi etmedi\u011fini eminseniz (t\u00fcm alanlar) eri\u015fim izni gerekir.
ascanbeta.crossdomain.adobe.read.extrainfo=web sunucusu k\u00f6t\u00fc niyetli etki alanlar\u0131 aras\u0131 veri Fla\u015f / Silverlight bile\u015fenlerinden kaynaklanan istekleri bu etki, herhangi bir \u00fc\u00e7\u00fcnc\u00fc taraf etki alan\u0131ndan sunulan okuma izni verir. Kurban kullan\u0131c\u0131 bu hizmete oturum a\u00e7t\u0131ysa, k\u00f6t\u00fc niyetli okuma istekleri ma\u011fdurun ayr\u0131cal\u0131klar\u0131n\u0131 kullan\u0131larak i\u015flenir ve kurban\u0131n web taray\u0131c\u0131s\u0131 \u00fczerinden, yetkisiz bir \u00fc\u00e7\u00fcnc\u00fc taraf web sitesi taraf\u0131ndan ele ge\u00e7irilmesini, bu hizmetten verilere neden olabilir. Bu \u00c7erez tabanl\u0131 oturum uygulama kullan\u0131mda ise bir sorun olabilir \u00f6zellikle muhtemeldir. 
ascanbeta.crossdomain.adobe.send.soln=Etki alanlar\u0131 aras\u0131 g\u00f6nderme yapmak i\u00e7in izin (ama ille okuyun) kullanarak, bu web sunucusuna istekleri olan alanlar\u0131n listesini s\u0131n\u0131rlamak i\u00e7in crossdomain.xml dosyas\u0131 yap\u0131land\u0131rma etki \= "example.com dan izin-http-istek-ba\u015fl\u0131klar\u0131n\u0131-< "ba\u015fl\u0131klar\u0131 \=" Yetkilendirme, X-Blahh "> . Yaln\u0131zca belirli iseniz "*" (t\u00fcm etki) eri\u015fim izni gerekti\u011fini bu hizmet Cross Site Request Forgery (CSRF) sald\u0131r\u0131lara kar\u015f\u0131 savunmas\u0131z de\u011fildir, bu hizmet.
ascanbeta.crossdomain.adobe.send.extrainfo=web sunucusu (ama mutlaka okuyam\u0131yor) k\u00f6t\u00fc niyetli etki alanlar\u0131 aras\u0131 veri g\u00f6nderme izin / Silverlight bile\u015fenler bu etki, herhangi bir \u00fc\u00e7\u00fcnc\u00fc taraf etki alan\u0131ndan hizmet Flash'tan men\u015feli ister. Kurban kullan\u0131c\u0131 bu hizmete oturum a\u00e7t\u0131ysa, k\u00f6t\u00fc niyetli g\u00f6nderme istekleri ma\u011fdurun ayr\u0131cal\u0131klar\u0131n\u0131 kullan\u0131larak i\u015flenir ve kurban\u0131n web taray\u0131c\u0131s\u0131 \u00fczerinden, sald\u0131r\u0131lar\u0131 yaz\u0131n Cross Site Request Forgery (CSRF) neden olabilir. Bu \u00c7erez tabanl\u0131 oturum uygulama kullan\u0131mda ise bir sorun olabilir \u00f6zellikle muhtemeldir.
ascanbeta.crossdomain.silverlight.name=\u00c7apraz-Domain yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131 - Silverlight
ascanbeta.crossdomain.silverlight.desc=Silverlight tabanl\u0131 \u00e7apraz site istek sahtecili\u011fi nedeniyle web sunucusunda bir yanl\u0131\u015f yap\u0131land\u0131rma, m\u00fcmk\u00fcn olabilir.
ascanbeta.crossdomain.silverlight.soln=Kullanarak, bu web sunucusuna etki alanlar\u0131 aras\u0131 isteklerini yapmak i\u00e7in izin alanlar\u0131n listesini s\u0131n\u0131rlamak i\u00e7in clientaccesspolicy.xml dosyas\u0131n\u0131 yap\u0131land\u0131r\u0131n <domain uri \= "https\://example.com" /> . Sadece "*" Bu hizmet herhangi bir eri\u015fim kontroll\u00fc, ki\u015fiselle\u015ftirilmi\u015f veya \u00f6zel verilerinizi ev sahipli\u011fi etmedi\u011fini eminseniz (t\u00fcm alanlar) eri\u015fim izni gerekir.
ascanbeta.crossdomain.silverlight.extrainfo=web sunucusu Silverlight bile\u015fenlerden kaynaklanan zararl\u0131 etki alanlar\u0131 aras\u0131 istekleri bu etki, herhangi bir \u00fc\u00e7\u00fcnc\u00fc taraf etki alan\u0131ndan hizmet verir. Kurban kullan\u0131c\u0131 bu hizmete oturum a\u00e7t\u0131ysa, k\u00f6t\u00fc niyetli istekler ma\u011fdurun ayr\u0131cal\u0131klar\u0131n\u0131 kullan\u0131larak i\u015flenir ve kurban\u0131n web taray\u0131c\u0131lar\u0131 arac\u0131l\u0131\u011f\u0131yla, yetkisiz bir \u00fc\u00e7\u00fcnc\u00fc taraf web sitesi taraf\u0131ndan ele ge\u00e7irilmesini, bu hizmetten verilere neden olabilir. Ayr\u0131ca sald\u0131r\u0131lar\u0131 tip Cross Site Request Forgery (CSRF) neden olabilir. Bu \u00c7erez tabanl\u0131 oturum uygulama kullan\u0131mda ise bir sorun olabilir \u00f6zellikle muhtemeldir.

ascanbeta.formatstring.name=Format String Error
ascanbeta.formatstring.desc=A Format String error occurs when the submitted data of an input string is evaluated as a command by the application. 
ascanbeta.formatstring.soln=Rewrite the background program using proper deletion of bad character strings.  This will require a recompile of the background executable.
ascanbeta.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanbeta.formatstring.error1=Potential Format String Error.  The script closed the connection on a /%s
ascanbeta.formatstring.error2=Potential Format String Error.  The script closed the connection on a /%s and /%x
ascanbeta.formatstring.error3=Potential Format String Error.  The script closed the connection on a microsoft format string error

ascanbeta.heartbleed.name=Heartbleed OpenSSL G\u00fcvenlik A\u00e7\u0131\u011f\u0131
ascanbeta.heartbleed.desc=1.0.1g d\u00fczg\u00fcn uzak sald\u0131rganlar\u0131n hassas bilgileri if\u015fa, okuma a\u015f\u0131r\u0131 bir tampon tetikleyen haz\u0131rlanm\u0131\u015f paketler yoluyla i\u015flem bellekten hassas bilgileri elde etmesini sa\u011flar Heartbeat Uzatma paketleri, i\u015flemez \u00f6nce OpenSSL TLS uygulamas\u0131 1.0.1.
ascanbeta.heartbleed.soln=Daha sonra OpenSSL 1.0.1g veya g\u00fcncelleyin. Yeniden sorunu HTTPS sertifikalar\u0131. Bu tehlikeye olabilir \u00e7\u00fcnk\u00fc sunucu g\u00fcnl\u00fck dosyalar\u0131ndaki uzla\u015fma hi\u00e7bir kan\u0131t ile, asimetrik \u00f6zel anahtarlar\u0131 ve payla\u015f\u0131lan gizli anahtarlar\u0131 de\u011fi\u015ftirin.
ascanbeta.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
ascanbeta.heartbleed.extrainfo=Bu sorun kullanarak sunucudan veri exfiltrating taraf\u0131ndan do\u011fruland\u0131 {0} . Bu, yanl\u0131\u015f pozitif olmas\u0131 pek m\u00fcmk\u00fcn de\u011fildir.

ascanbeta.HTTPParamPoll.name=HTTP Parameter Pollution scanner
ascanbeta.HTTPParamPoll.desc=HTTP Parametre Kirlili\u011fi (HES) sald\u0131r\u0131lar\u0131 mevcut di\u011fer parametrelere kodlanm\u0131\u015f sorgu dizesi s\u0131n\u0131rlay\u0131c\u0131 enjekte olu\u015fmaktad\u0131r. Bir web uygulama d\u00fczg\u00fcn kullan\u0131c\u0131 giri\u015fi sanitize etmezse, k\u00f6t\u00fc niyetli bir kullan\u0131c\u0131n\u0131n istemci taraf\u0131 veya sunucu taraf\u0131 ya sald\u0131r\u0131lar\u0131 ger\u00e7ekle\u015ftirmek i\u00e7in uygulama mant\u0131\u011f\u0131 bozabilir. HES sald\u0131r\u0131lar\u0131n bir sonucu potansiyel mevcut sabit kodlanm\u0131\u015f HTTP parametreleri ge\u00e7ersiz k\u0131labilirsiniz sald\u0131rgan\u0131n bir uygulama, bypass giri\u015f do\u011frulama kontrol noktalar\u0131 ve eri\u015fim davran\u0131\u015f\u0131n\u0131 de\u011fi\u015ftirmek ve muhtemelen do\u011frudan ula\u015famayaca\u011f\u0131 olabilir de\u011fi\u015fkenleri yararlanmaya olmas\u0131d\u0131r.
ascanbeta.HTTPParamPoll.sol=D\u00fczg\u00fcn parametre s\u0131n\u0131rlay\u0131c\u0131 i\u00e7in kullan\u0131c\u0131 giri\u015fi sterilize
ascanbeta.HTTPParamPoll.alert.attack=HTTP Parametre Kirlili\u011fi
ascanbeta.HTTPParamPoll.extrainfo=http\://www.google.com/search?q\=http+parameter+pollution

ascanbeta.insecurehttpmethod.name=G\u00fcvensiz HTTP Y\u00f6ntemi
ascanbeta.insecurehttpmethod.detailed.name=G\u00fcvensiz HTTP Y\u00f6ntemi - {0}
ascanbeta.insecurehttpmethod.desc=g\u00fcvensiz HTTP y\u00f6ntemi [ {0} ] Bu kaynak i\u00e7in web sunucusunda etkindir. Web sunucusu yap\u0131land\u0131rmas\u0131na ba\u011fl\u0131 olarak ve kaynak hizmet sorumlu temel uygulama, bu ya da s\u00f6m\u00fcr\u00fclebilir olabilir de olmayabilir de. TRACK ve TRACE y\u00f6ntemleri oturum \u00e7erezi ''HttpOnly'' bayra\u011f\u0131n\u0131 kullanarak korunmaktad\u0131r bile, bir uygulama kullan\u0131c\u0131 yetkilendirme belirteci / oturum \u00e7erezi eri\u015fmek i\u00e7in, bir sald\u0131rgan taraf\u0131ndan kullan\u0131l\u0131yor olabilir. Sald\u0131r\u0131n\u0131n ba\u015far\u0131l\u0131 olmas\u0131 i\u00e7in, uygulama kullan\u0131c\u0131 genellikle eski web taray\u0131c\u0131s\u0131 veya bir Same Origin Policy (SOP) bypass a\u00e7\u0131\u011f\u0131 olan bir web taray\u0131c\u0131s\u0131 kullan\u0131yor olmal\u0131s\u0131n\u0131z. ''BA\u011eLANTISI'' y\u00f6ntemi \u00fc\u00e7\u00fcnc\u00fc taraf web sitelerine veya hizmetlerin bir HTTP t\u00fcneli olu\u015fturmak i\u00e7in bir web istemcisi taraf\u0131ndan kullan\u0131labilir.
ascanbeta.insecurehttpmethod.trace.exploitable.desc=g\u00fcvensiz HTTP y\u00f6ntemi [ {0} ] Bu kaynak i\u00e7in etkin ve exploit oldu\u011funu. TRACK ve TRACE y\u00f6ntemleri oturum \u00e7erezi ''HttpOnly'' bayra\u011f\u0131n\u0131 kullanarak korunmaktad\u0131r bile, bir uygulama kullan\u0131c\u0131 yetkilendirme belirteci / oturum \u00e7erezi eri\u015fmek i\u00e7in, bir sald\u0131rgan taraf\u0131ndan kullan\u0131l\u0131yor olabilir. Sald\u0131r\u0131n\u0131n ba\u015far\u0131l\u0131 olmas\u0131 i\u00e7in, uygulama kullan\u0131c\u0131 genellikle eski web taray\u0131c\u0131s\u0131 veya bir Same Origin Policy (SOP) bypass a\u00e7\u0131\u011f\u0131 olan bir web taray\u0131c\u0131s\u0131 kullan\u0131yor olmal\u0131s\u0131n\u0131z.
ascanbeta.insecurehttpmethod.connect.exploitable.desc=g\u00fcvensiz HTTP y\u00f6ntemi [ {0} ] Bu kaynak i\u00e7in etkin ve exploit oldu\u011funu. Bu HTTP y\u00f6ntemini kullanarak, bir \u00fc\u00e7\u00fcnc\u00fc taraf hizmetine t\u00fcnelli soket ba\u011flant\u0131s\u0131 kurmak m\u00fcmk\u00fcn oldu\u011fu bulunmu\u015ftur. Bu hizmet anonim Spam r\u00f6lesi olarak kullan\u0131lmas\u0131na izin veya web proxy olarak, a\u011f k\u0131s\u0131tlamalar\u0131 atlayarak olacakt\u0131r. Ayr\u0131ca, etkin bir \u015fekilde g\u00fcvenilir olmayan bile\u015fenleri i\u00e7in a\u011f \u00e7evre uzanan bir t\u00fcnel VPN kurmak i\u00e7in kullan\u0131lmas\u0131na olanak verir. 
ascanbeta.insecurehttpmethod.extrainfo=OPTIONS y\u00f6ntem bu kaynak i\u00e7in a\u015fa\u011f\u0131daki etkin HTTP y\u00f6ntemleri if\u015fa\: [ {0} ]
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo=Bir \u0130ZLE iste\u011fi \u00f6zel bir \u00e7erez de\u011feri ile, bu istek i\u00e7in g\u00f6nderildi [ {0} ]. Bu \u00e7erez de\u011feri a\u00e7\u0131\u011f\u0131 teyit HTTP yan\u0131t\u0131 a\u00e7\u0131klanm\u0131\u015ft\u0131r.
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo=CONNECT y\u00f6ntemi [bir soket ba\u011flant\u0131s\u0131 kurmak i\u00e7in kullan\u0131lan {0} ], \u00fczerinden web sunucusuna.
ascanbeta.insecurehttpmethod.soln=B\u00f6yle TRACK, TRACE gibi g\u00fcvensiz y\u00f6ntemleri devre d\u0131\u015f\u0131 b\u0131rak\u0131n ve web sunucusu \u00fczerinde CONNECT ve altta yatan servis uygulamas\u0131 g\u00fcvensiz y\u00f6ntemleri desteklemedi\u011fi emin olun.

ascanbeta.ldapinjection.name=LDAP Enjeksiyonu
ascanbeta.ldapinjection.desc=LDAP enjeksiyonu m\u00fcmk\u00fcn olabilir. Bir sald\u0131rgan\u0131n kimlik kontrollerini a\u015fmak i\u00e7in, ve LDAP dizininde keyfi veri g\u00f6r\u00fcnt\u00fclemek ve de\u011fi\u015ftirmek i\u00e7in bu m\u00fcmk\u00fcn olabilir. 
ascanbeta.ldapinjection.soln=Do\u011frulamak ve / veya bir LDAP sorgusu olu\u015fturmak i\u00e7in kullanmadan \u00f6nce t\u00fcm kullan\u0131c\u0131 giri\u015fi ka\u00e7\u0131\u015f. \u00d6zellikle, a\u015fa\u011f\u0131daki karakterler (veya bunlar\u0131n kombinasyonlar\u0131) kara listeye edilmelidir\: & |\! <> \= ~ \=> \= <\= * () + - "'; \\ / NUL karakteri\n 
ascanbeta.ldapinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A9 http\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection https\://www.owasp.org/ index.php / LDAP_injection
#ascanbeta.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.extrainfo=Parametre [ {0} ] \u00fczerine [ {1} ] [ {2} ] LDAP meta-karakterleri [ile bir sald\u0131r\u0131 kullanarak LDAP enjeksiyonu kar\u015f\u0131 savunmas\u0131z olabilir {3} ], bilinen [verimli {4} ] hata mesaj\u0131 [ {5} ], orijinal tepki mevcut de\u011fildi.
ascanbeta.ldapinjection.alert.evidence={0}
ascanbeta.ldapinjection.booleanbased.alert.extrainfo=Parametre [ {0} ] [on {1} ] [ {2} ] mant\u0131ksal e\u015fde\u011fer ifadesini kullanarak, LDAP enjeksiyonu kar\u015f\u0131 savunmas\u0131z olabilir [ {3} ], ve ''YANLI\u015e'' ifadesi [ {4} ].
#ascanbeta.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanbeta.ldapinjection.alert.attack=Parametre [ {0} ] ayarland\u0131\u011f\u0131nda [ {1} ]
ascanbeta.ldapinjection.booleanbased.alert.attack=E\u015fde\u011fer LDAP ifadesi\: [ {0} ]. Rastgele parametre\: [ {1} ].
#ascanbeta.ldapinjection.alert.logmessage=A likely LDAP injection vulnerability has been found with [{0}] URL [{1}] on [{2}] field [{3}], using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.logmessage=Bir olas\u0131l\u0131kla LDAP enjeksiyon a\u00e7\u0131\u011f\u0131 [ile tespit edilmi\u015ftir {0} ] URL [ {1} ] parametresi [ {2} ], LDAP meta-karakterleri ile bir sald\u0131r\u0131 kullanarak [ {3} ], verimli bilinen [ {4} ] hata Mesaj [ {5} ], orijinal tepki mevcut de\u011fildi.
ascanbeta.ldapinjection.booleanbased.alert.logmessage=Bir olas\u0131l\u0131kla LDAP enjeksiyon a\u00e7\u0131\u011f\u0131 [ile tespit edilmi\u015ftir {0} ] URL [ {1} ] parametresi [ {2} ] kullan\u0131larak [ {3} ] bir mant\u0131ksal e\u015fde\u011fer durumunu sim\u00fcle etmek ve kullanma [ {4} ] sim\u00fcle etmek Bir YANLI\u015e durum. 
# a colon delimited list of the known LDAP implementations (used to reference "ldapinjection.<implementation>.errormessages" here)  
ascanbeta.ldapinjection.knownimplementations=ActiveDirectory\: OpenLDAP\: 389directoryserver\: apachedirectoryservices
# OpenLDAP Error messages
# error messages may be localised, so in this case, pull them from the local version of OpenLDAP source, using the following command
# grep -Eo "\"[^\"]+\"" openldap-2.4.31/libraries/libldap/error.c
# the list will then need to be manually filtered slightly (remove common strings, and ensure that the messages contain no colons, which would mess up the colon delimiting used here)
ascanbeta.ldapinjection.openldap.errormessages=Operasyon hatas\u0131\: Protokol hatas\u0131\: Zaman s\u0131n\u0131r\u0131 a\u015f\u0131ld\u0131\: Boyut s\u0131n\u0131r\u0131 a\u015f\u0131ld\u0131\: Yanl\u0131\u015f kar\u015f\u0131la\u015ft\u0131r\u0131n desteklenmiyor Kimlik Do\u011frulama y\u00f6ntemini\: Do\u011fru kar\u015f\u0131la\u015ft\u0131r\u0131n G\u00fc\u00e7l\u00fc (er) kimlik do\u011frulamas\u0131 gerekiyor\: \u0130dari s\u0131n\u0131r\u0131 a\u015f\u0131ld\u0131\: Kritik uzant\u0131s\u0131 kullan\u0131lamaz\: Gizlilik Gerekli\: SASL ba\u011flan\u0131yor\: Hay\u0131r B\u00f6yle nitelik\: Undefined \u00f6znitelik t\u00fcr\u00fc\: Uygunsuz e\u015fleme\: K\u0131s\u0131tlama ihlali\: T\u00fcr veya de\u011fer var\: Ge\u00e7ersiz s\u00f6zdizimi\: Hay\u0131r b\u00f6yle bir nesne\: Alias \u200b\u200bsorun\: Ge\u00e7ersiz DN s\u00f6zdizimi\: Alias \u200b\u200bkald\u0131rma sorunu\: Uygunsuz kimlik\: Ge\u00e7ersiz kimlik bilgileri\: Yetersiz eri\u015fim\: Sunucu me\u015fgul\: Sunucu kullan\u0131lam\u0131yor\: Sunucu ger\u00e7ekle\u015ftirmek istemedi\u011fi\: D\u00f6ng\u00fc alg\u0131land\u0131\: Object s\u0131n\u0131f\u0131 ihlali\: ihlal Adland\u0131rma Operasyonu olmayan yaprak izin verilmiyor\: Operation RDN'de izin verilmez\: Zaten var\: nesne s\u0131n\u0131f\u0131 de\u011fi\u015ftirilemiyor\: Sanal Liste G\u00f6r\u00fcn\u00fcm\u00fc hatas\u0131\: \u00c7al\u0131\u015fma birden DSAs etkiler \: Di\u011fer (\u00f6rne\u011fin, uygulama \u00f6zg\u00fc) hatas\u0131\: Giri\u015f, bir yaprak\: Sonu\u00e7lar \u00e7ok b\u00fcy\u00fck\: Hay\u0131r Operasyon \u0130ptal\: Too Late \u0130ptal\: \u0130ptal Can not\: K\u0131smi sonu\u00e7lar ve sevk al\u0131nan onaylama i\u015flemi ba\u015far\u0131s\u0131z\: Onaylama i\u015flemi (X) Ba\u015far\u0131s\u0131z\: proxy Yetkilendirme Reddedildi \: Vekil Yetkilendirme Hatas\u0131 (X)\: \u0130\u00e7erik E\u015fitleme Yenile Gerekli\: \u0130\u00e7erik Sync Yenile Gerekli (X)\: Hay\u0131r Operasyonu (X)\: LCUP Kaynaklar\u0131 t\u00fckenmi\u015f\: LCUP G\u00fcvenlik \u0130hlali\: LCUP Ge\u00e7ersiz Veri\: LCUP Desteksiz Program\u0131\: LCUP Sayfaya Gerekli\: TXN tamam belirtin \: TXN kimli\u011fi ge\u00e7ersiz\: LDAP sunucusuyla ba\u011flant\u0131 Can not\: Yerel hata\: Kodlama hatas\u0131\: \u00c7\u00f6zme hatas\u0131\: Zaman a\u015f\u0131m\u0131na u\u011frad\u0131\: Bilinmeyen kimlik do\u011frulama y\u00f6ntemi\: K\u00f6t\u00fc arama filtresi\: Kullan\u0131c\u0131 iptal i\u015flemi\: Bir LDAP rutin K\u00f6t\u00fc parametre\: Bellek yetersiz\: Hatay\u0131 ba\u011flay\u0131n \: Desteklemiyor\: Denetim bulunamad\u0131\: sonu\u00e7 d\u00f6nd\u00fcrd\u00fc\: daha fazla sonu\u00e7lar d\u00f6nd\u00fcrmek i\u00e7in\: \u0130\u015fveren d\u00f6ng\u00fc\: a\u015f\u0131ld\u0131 Sevk Limiti\: Bilinmeyen API hatas\u0131\: Bilinmeyen (uzatma) hatas\u0131\: Bilinmeyen (\u00f6zel uzatma) hatas\u0131\: Bilinmeyen hata
# Active Directory error messages, from http://support.microsoft.com/kb/232282 
ascanbeta.ldapinjection.activedirectory.errormessages=K\u00f6t\u00fc parametre rutin ge\u00e7ildi\: Sunucu \u00fczerinde y\u00f6netim s\u0131n\u0131r\u0131 a\u015ft\u0131\: Ge\u00e7ersiz bir ADSI yol ad\u0131 ge\u00e7ti\: Bilinmeyen bir ADSI bilgisayar nesnesi istendi\: Bilinmeyen bir ADSI etki alan\u0131 nesnesi istendi\: Bilinmeyen bir ADSI nesne istendi\: Bilinmeyen bir ADSI kullan\u0131c\u0131 nesnesi istendi\: Kimlik uygunsuz\: LDAP sunucusuyla ba\u011flant\u0131 Can not\: di\u011fer ad inceleyebilirsiniz Can not\: ba\u011flant\u0131 kurmak Can not\: nesne s\u0131n\u0131f\u0131 de\u011fi\u015ftirilemiyor\: M\u00fc\u015fteri d\u00f6ng\u00fc alg\u0131land\u0131\: YANLI\u015e vermi\u015ftir kar\u015f\u0131la\u015ft\u0131r\: DO\u011eRU vermi\u015ftir kar\u015f\u0131la\u015ft\u0131r\: Gizlilik gereklidir\: Kritik bir uzant\u0131s\u0131d\u0131r kullan\u0131lam\u0131yor\: \u00c7\u00f6zme hatas\u0131 hata hata olu\u015ftu\: d\u00f6ng\u00fc alg\u0131land\u0131\: \u00c7oklu dizin servis ajanlar\u0131 etkilenir\: Nesne yok\: Bir veya daha fazla hata olu\u015ftu\: Bir veya daha fazla girdi parametreleri ge\u00e7ersiz\: Operation olmayan bir yaprak nesne \u00fczerinde izin verilmez fazla sonu\u00e7lar iade edilmelidir\: d\u00f6nd\u00fcr\u00fclen sonu\u00e7lar \u00e7ok b\u00fcy\u00fck\: Operasyon hatas\u0131 olu\u015ftu\: K\u0131smi sonu\u00e7lar ve tavsiyeleri al\u0131nd\u0131\: \u0130stenen \u00f6znitelik yok\: Protokol hatas\u0131 olu\u015ftu Sonu\u00e7lar\u0131 iade edilmez S_ADS_ERRORSOCCURRED\: S_ADS_NOMORE_COLUMNS\: S_ADS_NOMORE_ROWS\: Operation RDN'de izin verilmez Boyut s\u0131n\u0131r\u0131 a\u015ft\u0131\: G\u00fc\u00e7l\u00fc Kimlik do\u011frulama gereklidir\: ADSI veri t\u00fcr\u00fc bir yerel DS veri t\u00fcr\u00fc / 'd\u00f6n\u00fc\u015ft\u00fcr\u00fclebilir olamaz\: ADSI nesnesi var\: alias ge\u00e7ersiz\: ADSI \u00f6zellik \u00f6nbelle\u011finde bulunam\u0131yor te\u015febb\u00fcs eylem dizin hizmeti \u015fema kurallar\u0131n\u0131 ihlal\: nitelik var veya de\u011fer atanm\u0131\u015ft\u0131r\: kimlik do\u011frulama y\u00f6ntemi desteklenmiyor\: Kontrol bulunamad\u0131\: ay\u0131rt edici ad ge\u00e7ersiz s\u00f6zdizimi vard\u0131r\: \u00f6zellik desteklenmiyor\: Nesne zaten var\: Nesne bir yaprak\: Referans Limit a\u015ft\u0131\: Arama filtresini k\u00f6t\u00fc\: Arama i\u015flemi ge\u00e7erli sat\u0131r i\u00e7in son s\u00fctunu ula\u015ft\u0131\: Arama i\u015flemi son sat\u0131r\u0131 ula\u015fm\u0131\u015ft\u0131r\: Arama zaman a\u015f\u0131m\u0131na edildi\: Sunucu me\u015fgul\: Sunucu kullan\u0131lam\u0131yor\: Sunucu ger\u00e7ekle\u015ftirmek isteksiz\: Belirtilen ADSI nesnesi de\u011fi\u015ftirildi\: Belirtilen ADSI nesnesi de\u011fi\u015ftirilmedi\: Belirtilen ADSI nesnesi uzak bir kayna\u011fa ba\u011fl\u0131 de\u011fildir\: Belirtilen ADSI \u00f6zelli\u011fi ge\u00e7ersiz\: Belirtilen ADSI \u00f6zelli\u011fi desteklenmiyor\: Belirtilen ADSI \u00f6zelli\u011fi ayarlanmam\u0131\u015f\: ADSI belirtilen s\u00fctun set de\u011fildi\: belirtilen arama filtresi ge\u00e7ersiz\: Verilen kimlik ge\u00e7ersiz\: s\u00f6zdizimi ge\u00e7ersiz\: sistem belle\u011fi d\u0131\u015f\u0131nda\: Kullan\u0131c\u0131 i\u015flemi iptal etti\: Kullan\u0131c\u0131 yetersiz eri\u015fim hakk\u0131na sahiptir\: Bir constrain ihlali vard\u0131\: bir adland\u0131rma ihlali vard\u0131\: uygunsuz e\u015fle\u015ftirme vard\u0131\: bir nesne s\u0131n\u0131f\u0131 ihlali vard\u0131\: Zaman s\u0131n\u0131r\u0131 a\u015ft\u0131\: T\u00fcr tan\u0131ml\u0131 de\u011fil\: Bilinmeyen kimlik do\u011frulama hatas\u0131 olu\u015ftu\: Bilinmeyen bir hata olu\u015ftu
# 389 Directory Server error messages, using command: grep -Eo "\"[^\"]+\"" ./lib/ldaputil/errors.c 
ascanbeta.ldapinjection.389directoryserver.errormessages=ldap arama, bir LDAP giri\u015fi bulamad\u0131k\: Cert haritalama i\u015flevi ba\u015far\u0131s\u0131z oldu\: Cert arama fonksiyonu ba\u015far\u0131s\u0131z oldu\: certmap InitFn i\u015flevi ba\u015far\u0131s\u0131z oldu\: ge\u00e7ersiz yerel ldap veritaban\u0131 url \u00f6neki\: Baz dn ldapdb url eksik\: bellek yetersiz\: Cert i\u015flevi ba\u015far\u0131s\u0131z oldu do\u011frulamak Couldn 't ldap dizin sunucusuna ba\u011flant\u0131y\u0131 ba\u015flatmak\: Yerel ldap dizinine ba\u011flant\u0131 ba\u015flat\u0131lamad\u0131\: ldap_set_option yerel ldap veritaban\u0131 i\u00e7in ba\u015far\u0131s\u0131z oldu\: SSL \u00fczerinden LDAP kullanarak varsay\u0131lan sertifika veritaban\u0131 ba\u015flat\u0131lmad\u0131\: Dairesel gruplar grup \u00fcyeli\u011fi kontrol\u00fc s\u0131ras\u0131nda tespit edilmi\u015ftir\: Ge\u00e7ersiz dize \: Ge\u00e7ersiz dize endeksi\: arama sonucu eksik \u00f6znitelik de\u011feri\: config dosyas\u0131n\u0131 a\u00e7am\u0131yor\: Veritaban\u0131 ad\u0131 eksik\: Veritaban\u0131 \u00f6zelli\u011fi eksik\: config dosyas\u0131nda yasad\u0131\u015f\u0131 y\u00f6nergesi\: i\u00e7 hata - LDAPU_ERR_NOT_PROPVAL\: CERT gelen ihra\u00e7\u00e7\u0131 DN ay\u0131klamak olamaz\: d\u00fczenleyicinizle DN varsay\u0131lan olmayan certmap eksik\: entry haritalama bilgilerini LDAP CERT eksik Bulundu hatal\u0131 bi\u00e7imlendirilmi\u015f konu DN sertifikas\u0131nda\: eklenti k\u00fct\u00fcphanesi certmap y\u00fcklenemiyor\: Sertifika bir LDAP giri\u015fine e\u015flenen olamazd\u0131 InitFn sa\u011flanmal\u0131d\u0131r certmap kullan\u0131rken eklenti k\u00fct\u00fcphanesi\: certmap eklenti k\u00fct\u00fcphanesinde InitFn bulamad\u0131\: Herhangi bir sertifika yok Kullan\u0131c\u0131n\u0131n LDAP giri\u015fi kar\u015f\u0131la\u015ft\u0131rmak i\u00e7in\: K\u00fct\u00fcphane ad\u0131 yap\u0131land\u0131rma dosyas\u0131nda eksik\: Kullan\u0131c\u0131 LDAP girdisinde belgesi e\u015fle\u015fen olamazd\u0131 Init i\u015flev ad\u0131 eksik yap\u0131land\u0131rma dosyas\u0131\: Yanl\u0131\u015f arg\u00fcmanla denilen API i\u015flevi ldaputil\: Dosyan\u0131n yeniden adland\u0131rma ba\u015far\u0131s\u0131z oldu\: Cert ihra\u00e7\u00e7\u0131 ad\u0131 eksik\: \u00f6zellik ad\u0131 eksik\: bilinmiyor sertifika niteli\u011fini\: ldap arama bo\u015f bir sonu\u00e7 d\u00f6nd\u00fcrd\u00fc\: ldap arama birden d\u00f6nd\u00fc VerifyCert \u00f6zellik de\u011feri a\u00e7\u0131k veya kapal\u0131 olmas\u0131 gerekir biri beklendi\u011fi zaman kar\u015f\u0131la\u015fmalar\: ldap arama sonucu giri\u015fi a\u00e7\u0131lamad\u0131\: certmap API i\u015flevi ge\u00e7irilen ge\u00e7ersiz arg\u00fcman\: ge\u00e7ersiz LDAP dizin eki\: LDAP giri\u015fi 'uid' \u00f6znitelik de\u011feri eksik sertifikadan konu DN a\u00e7\u0131lamad\u0131 \: sertifikadan ihra\u00e7\u00e7\u0131 DN a\u00e7\u0131lamad\u0131\: hen\u00fcz uygulamaya i\u015flevi de\u011fil\: Orijinal DER sertifika kodlama a\u00e7\u0131lamad\u0131 i\u00e7 hata ldaputil\: i\u00e7 hata - Bilinmeyen hata kodu
# Apache Directory Service (starting point: cat ./i18n/src/main/resources/org/apache/directory/server/i18n/errors.properties | sed -re '/^#/ d; /^$/d;' | cut -d"=" -f2)
ascanbeta.ldapinjection.apachedirectoryservices.errormessages=\u00d6znitelik bir sistem endeksi\: \u00f6znitelik Bir kullan\u0131c\u0131 endeksi\: hay\u0131r E\u015e\u0130TL\u0130K MatchingRule tan\u0131mlanm\u0131\u015f\: do\u011frulanmam\u0131\u015f arayan taraf\u0131ndan\: oid tan\u0131mlamak i\u00e7in ba\u015far\u0131s\u0131z oldu. Do\u011frulama hatas\u0131\: algoritmas\u0131 i\u00e7in bir sindirilmi\u015f parola olu\u015fturmak Can not\: rootDSE, silinmi\u015f ta\u015f\u0131nm\u0131\u015f veya yeniden adland\u0131r\u0131lm\u0131\u015f olamaz \!\: ta\u015f\u0131mak veya y\u00f6netici hesab\u0131 yeniden adland\u0131rmak i\u00e7in izni yok. Bile y\u00f6netici del, ta\u015f\u0131mak veya yeniden adland\u0131rabilirsiniz Kimse\: entryACI ayr\u0131\u015ft\u0131rmak ba\u015far\u0131s\u0131z oldu\: subentryACI ayr\u0131\u015ft\u0131rmak ba\u015far\u0131s\u0131z oldu\: rootDSE silinemez\: Y\u00f6neticiler grubunun silinemez\: y\u00f6netici hesab\u0131n\u0131 silmek i\u00e7in izni yok. \:\! RootDSE de\u011fi\u015ftirilemez\: grup girdisini silmek i\u00e7in izni yok\: kullan\u0131c\u0131 hesab\u0131n\u0131 silmek i\u00e7in izni yok. Admin kullan\u0131c\u0131 hesab\u0131n\u0131 de\u011fi\u015ftirmek i\u00e7in izni yok\: hesap de\u011fi\u015ftirme izni yok Kullan\u0131c\u0131n\u0131n\: grup girdisini de\u011fi\u015ftirmek i\u00e7in izni yok\: Y\u00f6neticiler grubunun ta\u015f\u0131nm\u0131\u015f veya yeniden adland\u0131r\u0131lm\u0131\u015f olamaz\: ta\u015f\u0131mak veya y\u00f6netici hesab\u0131 yeniden adland\u0131rmak i\u00e7in izni yok. Bile y\u00f6netici ta\u015f\u0131mak veya yeniden adland\u0131rabilirsiniz Hi\u00e7 kimse\: izin verilmez y\u00f6netici hesab\u0131na eri\u015fim\: Eri\u015fim kullan\u0131c\u0131 hesab\u0131na\: Eri\u015fim grubuna ta\u015f\u0131mak veya grup girdisini yeniden adland\u0131rma iznine sahip de\u011fil\: ta\u015f\u0131mak veya kullan\u0131c\u0131 hesab\u0131n\u0131 yeniden adland\u0131rmak i\u00e7in izni yok Kullan\u0131c\u0131 i\u00e7in\: s\u00f6zdizimi hatas\u0131 nedeniyle. TupleCache i\u00e7in ACITuples eklenemiyor\: CHANGELOG ma\u011faza ayarlanamaz biri zaten aktif oldu\u011funda\: Operasyonel niteli\u011fi bir kullan\u0131c\u0131 taraf\u0131ndan de\u011fi\u015ftirilemez\: ModifyTimestamp operasyonel nitelik kullan\u0131c\u0131 taraf\u0131ndan de\u011fi\u015ftirilemez\: ModifiersName operasyonel nitelik kullan\u0131c\u0131 taraf\u0131ndan de\u011fi\u015ftirilemez ba\u015far\u0131s\u0131z LOG s\u00fcr\u00fcm \u00f6zellikleri\: soneki ile hi\u00e7bir b\u00f6l\u00fcm\u00fc\: NamingContexts bulunabilir\: Bir LDAPURL filtreleri i\u00e7eren olmamal\u0131\: herhangi bir a\u00e7\u0131klama \u00f6zellik listesini i\u00e7eren gerekti\u011fi bir LDAPURL\: Bir LDAPURL herhangi uzant\u0131s\u0131 i\u00e7eren olmamal\u0131\: Bir LDAPURL bir kapsam i\u00e7eriyor olmamal\u0131d\u0131r bir LDAPURL herhangi bir kritik uzant\u0131s\u0131 i\u00e7eren olmamal\u0131d\u0131r\: Bir LDAPURL gereken bir bo\u015f olmayan DN i\u00e7erir\: Bir 'sevk' ObjectClass zorunluluk ile bir giri\u015f, bir 'ref' \u00d6zellik i\u00e7erir\: herhangi bir OID yoktur. Bu yanl\u0131\u015f bir AttributeType olmal\u0131d\u0131r. Bir dize bir byte d\u00f6n\u00fc\u015ft\u00fcr\u00fclebilir olmas\u0131 gerekti\u011fi gibi olmayan bir Okunabilir \u00f6zniteli\u011fi depolan\u0131r de\u011fer\: Bir byte olarak Okunabilir \u00f6zniteli\u011fi depolanan de\u011feri\: Yanl\u0131\u015f AttributeType, ili\u015fkili OID sahip olmayan bir Filtre bo\u015f olmamal\u0131\: Bir Alt dize filtresi sadece insan okunabilir \u00fczerinde kullan\u0131lmas\u0131 gerekti\u011fini \u00f6znitelikleri\: Bir Geni\u015fletilebilir filtre yaln\u0131zca insan okunabilir \u00fczerinde kullan\u0131lmas\u0131 gerekti\u011fini \u00f6znitelikleri\: \u00f6znitelik de\u011fi\u015ftirilemiyor\: Yeni \u00d6zellik veya de\u011ferinin birini yanl\u0131\u015ft\u0131r\: Bir de\u011fer eklemek Can not hangi zaten mevcut\: Bir var olmayan \u00f6zniteli\u011fini kald\u0131rmak i\u00e7in \u00e7al\u0131\u015f\u0131l\u0131yor\: bir yard\u0131mc\u0131 ObjectClass \u00d6ZET veya YARDIMCI olmayan bir objectClass devralan olamaz\: Bir \u00d6ZET ObjectClass \u00d6ZET olmayan bir objectClass devralan olamaz\: \u00f6zniteli\u011fi bir eksik de\u011feri kald\u0131r\u0131lam\u0131yor\: Bir YAPISAL ObjectClass i\u00e7ermiyor\: yok ki \u00fcst\u00fcn olamaz RDN bir par\u00e7as\u0131 olan attributeType,\: tek YAPISAL objectClass fazla i\u00e7eren bir not Okunabilir \u00f6zniteli\u011fi depolanan de\u011feri bir String bir byte d\u00f6n\u00fc\u015ft\u00fcr\u00fclebilir olmas\u0131 gerekti\u011fi gibi \: de\u011feri ge\u00e7erli de\u011fil. Bir dize veya bir byte olmal\u0131d\u0131r\: DIT eri\u015fim sertifikas\u0131 ba\u015far\u0131s\u0131z. Ad belirlemek i\u00e7in sertifika bayt kar\u015f\u0131la\u015ft\u0131rmak i\u00e7in giri\u015fimde ba\u015far\u0131s\u0131z. Anahtar\u0131n\u0131 \u00e7\u0131karmak i\u00e7in giri\u015fimde ba\u015far\u0131s\u0131z. \u0130stisna s\u0131n\u0131f\u0131 i\u00e7in DIT ararken\: dizin ararken Kar\u015f\u0131la\u015f\u0131lan ar\u0131za SynchWorker dizini senkronize ba\u015far\u0131s\u0131z\: on TriggerSpecification ayr\u0131\u015ft\u0131r\u0131c\u0131 hatas\u0131\: s\u0131n\u0131f\u0131 i\u00e7in\: entryTrigger ayr\u0131\u015ft\u0131rmak ba\u015far\u0131s\u0131z oldu\: yeni subtreeSpecification ayr\u0131\u015ft\u0131rmak i\u00e7in ba\u015far\u0131s\u0131z oldu. changetype bilinmiyor\: de\u011fi\u015fim \u00c7e\u015fidi Reverts\: Bir \u00f6nceki revizyon d\u00f6nmek isterken bir hata kar\u015f\u0131la\u015f\u0131ld\u0131\: Bir in\u015fa edilemiyor giri\u015f\: a\u015fa\u011f\u0131daki girdiyi enjekte Can not\: Replica\u0131d olmal\u0131d\u0131r objectClass organizationalUnit \u015fema varl\u0131k kaplar uzunlu\u011fu 3 isim bile\u015fenleri olmal\u0131d\u0131r. A\u015fa\u011f\u0131daki isimlerden biriyle organizationalUnit bekliyor\: on de\u011fi\u015ftirmek ger\u00e7ekle\u015ftirmek istemeyen\: bir girdi eklemek Can not \: Unwilling bir y\u00fcklenmemi\u015f \u015fema etkinle\u015ftirmek i\u00e7in\: DitContentRule y\u00fckleme Nyi\: DitStructureRule y\u00fckleme Nyi\: MatchingRuleUse y\u00fckleme Nyi\: NameForm y\u00fckleme Nyi\: Ba\u015far\u0131s\u0131z sar\u0131lm\u0131\u015f b\u00f6l\u00fcm\u00fc ba\u015flatmak i\u00e7in\:. Denemesi sar\u0131lm\u0131\u015f b\u00f6l\u00fcm ba\u015far\u0131s\u0131z yok etmek. dizin olu\u015fturulamad\u0131\: Dosya silinemedi veya Dizin\: \u00e7al\u0131\u015fma dizinini silmek i\u00e7in ba\u015far\u0131s\u0131z\: bilinmeyen bir nedenden dolay\u0131 bir DirectoryService \u00f6rne\u011fi olu\u015fturulam\u0131yor. LDIF bulunan Desteklenmeyen changetype\: silinemedi hata teslim bildirimleri yaparken kar\u015f\u0131la\u015ft\u0131\:. Kar\u015f\u0131la\u015f\u0131lan durum olay i\u015fleme s\u0131ras\u0131nda\:. jetty http yap\u0131land\u0131rmak i\u00e7in ba\u015far\u0131s\u0131z oldu Sunucu\: Hata kodlama EncryptionKey\: web uygulamas\u0131 (ler) yap\u0131land\u0131rmak i\u00e7in ba\u015far\u0131s\u0131z oldu. bir dizin kapatmak i\u00e7in ba\u015far\u0131s\u0131z. ustas\u0131 kapatmak i\u00e7in ba\u015far\u0131s\u0131z oldu\: i\u00e7in kapal\u0131 ana tablo. oid tan\u0131mlamak i\u00e7in ba\u015far\u0131s\u0131z oldu\: Kay\u0131t y\u00f6neticisi kapatmak i\u00e7in ba\u015far\u0131s\u0131z oldu Hata giri\u015f serisini Can not\: \u0130stisna \u00e7\u0131kar\u0131rken\: eklerken hata\: eklerken bir bilet olu\u015fturulam\u0131yor\: bir bilet olu\u015fturulam\u0131yor Bilet nesnesi kodlamak olamaz, PDU boyutu\: PDU arabellek boyutu \u00e7ok k\u00fc\u00e7\u00fck\: kodlamak Can not AuthorizationData nesne, PDU boyutu\: Kontrol nesnesi kodlamak olamaz, PDU boyutu\: EncryptedData nesnesi kodlamak olamaz, PDU boyutu\: EncryptionKey nesnesi kodlamak olamaz, PDU boyutu\: HostAddress nesnesi kodlamak olamaz, PDU boyutu\: hostaddresses nesneyi kodlamak olamaz, PDU boyutu\: PreAuthenticationData nesnesi kodlamak olamaz, PDU boyutu\: principalName nesnesi kodlamak olamaz, PDU boyutu\: TransitedEncoding nesnesi kodlamak olamaz, PDU boyutu\: Bir koyamazs\u0131n\u0131z null tamponda PDU\: Kerberos as\u0131l ad\u0131 bulundu birden fazla sunucu girdi\: ge\u00e7erli eki olmadan bir b\u00f6l\u00fcm ba\u015flat\u0131lam\u0131yor\: olu\u015fturulamaz\: Beklenmeyen istisna\: Hata iste\u011fi monit\u00f6r\: Hata ba\u011flam monit\u00f6r\: cevap monit\u00f6r hata \: katalog i\u00e7eri\u011fi al\u0131namad\u0131\: \u0130lk ba\u011flam\u0131 al\u0131namad\u0131\: LDAP hizmeti yeniden ba\u011flaman\u0131z ba\u015far\u0131s\u0131z\: mekanizmas\u0131n\u0131 desteklenmiyor\: istemci GracefulShutdownResponse yaz\u0131lamad\u0131. Server.xml yap\u0131land\u0131rma dosyas\u0131 (supportedMechanisms alan\u0131) kontrol edin\: Handler kullan\u0131lamaz i\u00e7in\: Yaln\u0131zca LDAP v3 desteklenir. Yaln\u0131zca LDAP v3 desteklenir. Referans g\u00f6z ard\u0131 edilecektir\: D\u00fczg\u00fcn bu inat\u00e7\u0131 aramay\u0131 terk etmek ba\u015far\u0131s\u0131z oldu. Aramay\u0131 kapatmak i\u00e7in ba\u015far\u0131s\u0131z oldu mesaj\u0131n i\u00e7in imleci\: \u0130mle\u00e7 daha d\u00fczg\u00fcn \u00e7al\u0131\u015fm\u0131yor demektir RootDSE arama i\u00e7in bir giri\u015f daha d\u00f6nd\u00fcm\: list.close ba\u015far\u0131s\u0131z ()\: oturumu unbind ba\u015far\u0131s\u0131z d\u00fczg\u00fcn\: ba\u011flama ba\u015far\u0131s\u0131z\: RefreshAndPersist modu ile arama iste\u011fi g\u00f6nderilemedi LDAP hizmeti\: imlecin \u00fczerinde ba\u015far\u0131s\u0131z yak\u0131n\: LDIF dosyas\u0131 yok. arka depoya LDIF al\u0131namad\u0131. PSearchListener Hata kapan\u0131\u015f NamingEnumeration\: PSearchListener Hata kapan\u0131\u015f ba\u011flant\u0131s\u0131\: PSearchListener kar\u015f\u0131la\u015ft\u0131 hatas\u0131\: ak\u0131\u015f\u0131 kapatmak i\u00e7in ba\u015far\u0131s\u0131z kanonik alamad\u0131m yol\: \u00f6znitelik indeksi tararken hata\: kullan\u0131m\u0131 i\u00e7in yard\u0131m\:. y\u00f6ntemini \u00e7al\u0131\u015ft\u0131rmak i\u00e7in ba\u015far\u0131s\u0131z oldu\: s\u0131n\u0131f \u00e7al\u0131\u015ft\u0131r\u0131lamad\u0131\: Bilinmeyen komut\: ldif dosyas\u0131 y\u00fcklenemiyor zorla yap\u0131land\u0131rma y\u00fck\u00fc (c) -i se\u00e7ene\u011fi gerektirir\: Komut sat\u0131r\u0131 bilinmiyor komuta\: ayr\u0131\u015ft\u0131rma ba\u015far\u0131s\u0131z liman de\u011feri\: Minimum port numaras\u0131 k\u00fc\u00e7\u00fckse\: B\u00f6l\u00fcm dizini\: max port numaras\u0131 daha b\u00fcy\u00fck gecikme de\u011feri\: of timeOffline de\u011feri\: gecikme de\u011feri\: max gecikme (saniye) izin daha b\u00fcy\u00fck \: s\u0131f\u0131rdan daha azd\u0131r ve hi\u00e7bir mant\u0131kl\u0131\: max timeOffline (dakika) izin daha b\u00fcy\u00fck sunucu taraf\u0131ndan sa\u011flanan a\u015fa\u011f\u0131daki nedenlerden dolay\u0131 ba\u015far\u0131s\u0131z oldu\: \u0130thalat ba\u015far\u0131s\u0131z ...\: ldif dosya ad\u0131 sa\u011flanmal\u0131d\u0131r\: Hay\u0131r Normalizer hediye niteli\u011fi type\: bellekte endeks diskte veri depolamak olamaz\: Bellek endeksinde a\u00e7\u0131k \u00f6nbelle\u011fe desteklemiyor\: ebeveyn i\u00e7in Id\: Bir ClonedServerEntry saklamay\u0131n olabilir miyim normalize isim\: hay\u0131r objectClass \u00f6zniteli\u011fi i\u00e7eren hi\u00e7bir entryCsn \u00f6znitelik i\u00e7eren\: hay\u0131r entryUuid \u00f6zniteli\u011fi i\u00e7erir\: Tan\u0131mlanamayan modifikasyon i\u015flemi\: ma\u011faza y\u00f6ntemini \u00e7a\u011f\u0131r\u0131n Can not\: aliasDereferencingProblem - kendine takma olu\u015fturmak i\u00e7in giri\u015fimi\:. takma noktalar\u0131 d\u0131\u015f\u0131nda bir girdiye\: - - aliasDereferencingProblem\: aliasProblem - isim olmaz indirgenmedikleri takma aliasDereferencingProblem g\u00f6reli d\u00f6ng\u00fc ile di\u011fer ad olu\u015fturmak i\u00e7in giri\u015fimi Bilinen bir nesne aliasedObjectName ge\u00e7erli mevcut giri\u015f ayarlanmas\u0131 gerekir\: aliasDereferencingProblem - alias noktalar\u0131n\u0131 ba\u015fka ad i\u00e7in.. Alias \u200b\u200bzincirleme bu backend taraf\u0131ndan desteklenmiyor. Anonim izin DE\u011e\u0130L ba\u011flanabilen\: kullan\u0131c\u0131 i\u00e7in do\u011fru de\u011fil Parola\: kullan\u0131c\u0131 kimlik do\u011frulamas\u0131 Can not beklenmeyen protectedItem\: Beklenmeyen Kullan\u0131c\u0131S\u0131n\u0131f\u0131\: kimlik do\u011frulamas\u0131 i\u00e7in kullan\u0131c\u0131 arama ba\u015far\u0131s\u0131z rootDSE ta\u015f\u0131nm\u0131\u015f veya yeniden adland\u0131r\u0131lm\u0131\u015f olamaz\: Tan\u0131ms\u0131z de\u011fi\u015ftirmek operasyon de\u011feri\: ChangeLog etkin olmam\u0131\u015ft\u0131r. yatan changelog ma\u011faza 's g\u00fcnl\u00fckleri \u00fczerinden arama desteklemiyor\: Bu etiketleri var yoluyla yatan changelog ma\u011faza ar\u0131yor desteklemiyor\: revizyon 0 e\u015fit veya daha b\u00fcy\u00fck olmal\u0131d\u0131r\: revizyon az olmal\u0131d\u0131r veya daha g\u00fcncel revizyon e\u015fit\: Tan\u0131nmayan \u015fube d\u00fc\u011f\u00fcm\u00fc operat\u00f6r\u00fc\: Tan\u0131nmayan yaprak d\u00fc\u011f\u00fcm t\u00fcr\u00fc\: Bilinmeyen ma\u00e7\u0131 tipi\: Tan\u0131nmayan arama kapsam\u0131 Olumsuzluk yok \u00e7ocuk babas\u0131d\u0131r\: Toplu nitelikler olmayan collectiveAttributeSubentries saklanabilir olamaz\: non-collectiveAttributeSubentries toplu nitelikler \u00fczerinde i\u015flem Can not \!\: yanl\u0131\u015f s\u00f6zdizimi vard\u0131\: varsay\u0131lan olarak mevcut bu yana k\u00fcresel \u015fema alt giri\u015fi eklenemez. zaten var\: Mevcut de\u011fer katmak i\u00e7in \u00e7al\u0131\u015f\u0131yor\: subschemaSubentry silinmesine izin Can not\: girdisini eklemek giri\u015fimi yeniden adland\u0131rma izin Can not subschemaSubentry\: Bir CollectiveAttribute alt giri\u015f en az bir toplu \u00d6zellik olmal\u0131d\u0131r\: Bilinmeyen onaylama t\u00fcr\u00fc\: d\u00fc\u011f\u00fcm\u00fc geni\u015fletmek i\u00e7in ba\u015far\u0131s\u0131z oldu\: var olmayan kay\u0131t alt\u0131nda arama giri\u015fimi\: Sistem b\u00f6l\u00fcm\u00fc yanl\u0131\u015f isme sahip\: Yinelenen b\u00f6l\u00fcm eki subschemaSubentry hareketini izin Can not \: id b\u00f6l\u00fcm nexus i\u00e7in ayarlanamaz. K\u00f6k nexus senkronize bir\u00e7ok istisnalar Gruplama ()\: attributeType kay\u0131t i\u00e7inde bulunamad\u0131\: Ge\u00e7erli b\u00f6l\u00fcm herhangi soneki yok\: org in () UserRoot\: bir b\u00f6l\u00fcm bulunam\u0131yor. apache.directory.server.prefs.ServerPreferencesFactory uygulanmad\u0131\: d\u00fc\u011f\u00fcm kurmak i\u00e7in ba\u015far\u0131s\u0131z oldu. SPI al\u0131namad\u0131. operasyonu d\u00fczenle giri\u015f yap\u0131sal objectClass b\u0131rak\u0131r\: RDN \u00f6zniteli\u011fi silmek giri\u015fiminde i\u015flemi de\u011fi\u015ftirin\: operasyon RDN \u00f6zniteli\u011fi silmeye \u00e7al\u0131\u015f\u0131r de\u011fi\u015ftirin i\u00e7in kullan\u0131lan de\u011ferler\: nitelik kay\u0131t defterinde bulunamad\u0131\: En az iki isim bile\u015fenleri dn i\u00e7in beklenmektedir\: giri\u015f objectClass'lar\u0131 beyan edilmemi\u015f\: Bir de\u011fer tek de\u011ferli \u00f6zniteli\u011fi i\u00e7in sa\u011flanm\u0131\u015ft\u0131r fazla\: Gerekli nitelikleri\: s\u00f6zdizimsel yanl\u0131\u015f \: de\u011feri ge\u00e7erli bir dize de\u011fil\: Bir \u0130nsan Okunabilir \u00f6zniteli\u011fi depolanan de\u011feri bir String de\u011fildir\: izin verilmez \u015fema alt giri\u015flerden i\u015flemleri DE\u011e\u0130\u015eT\u0130R\u0130N de\u011fi\u015ftirin\: Tan\u0131ms\u0131z de\u011fi\u015ftirmek operasyon\: Bilinmeyen indeksi i\u015fleyici diziye\: algoritmas\u0131 i\u00e7in BC Sertifika fabrika al\u0131namad\u0131 \: K\u00f6t\u00fc sertifika format\u0131\:. K\u00f6t\u00fc \u00f6zel anahtar format\u0131\: algoritmas\u0131 i\u00e7in anahtar fabrika al\u0131namad\u0131. K\u00f6t\u00fc kamu anahtar\u0131 bi\u00e7imi\:. TLS i\u00e7in anahtar \u00e7ifti olu\u015fturmak Can not\: Kendi kendine imzalanan sertifika olu\u015fturmak a\u00e7\u0131lam\u0131yor. DIT bulunamad\u0131. desteklenmez. \: d\u00fc\u011f\u00fcm null olamaz\: objectClass'lar\u0131 null olamaz\: \u00d6zellik objectClass'lar\u0131 kimli\u011fi olmal\u0131d\u0131r 'objectClass'\: ar\u0131tma d\u00fc\u011f\u00fcm\u00fcn Tan\u0131nmayan onaylama t\u00fcr\u00fc\: Ar\u0131tma yaprak d\u00fc\u011f\u00fcm nitelik vard\u0131\: objectClass'lar\u0131 arg\u00fcman\u0131 null olamaz\: objectClass'lar\u0131 Kimli\u011fi 'objectClass' i\u00e7in olmal\u0131d\u0131r nitelik\: Bir alt giri\u015fi bir objectClass \u00f6zniteli\u011fi olmal\u0131d\u0131r\: Bir administrativeRole \u00f6zniteli\u011fi i\u00e7ermiyor\! Idari a\u00e7\u0131dan bir administrativeRole niteli\u011fi ba\u011f\u0131ml\u0131 alt giri\u015fi eklemek i\u00e7in gereklidir. \u0130dari torunlar\u0131 ile giri\u015flerindeki yeniden adland\u0131rma i\u015flemi izin Will not\: i\u00e7in subtreeSpecification ayr\u0131\u015ft\u0131rma s\u0131ras\u0131nda ba\u015far\u0131s\u0131z oldu. OID Bad de\u011feri\: de\u011fi\u015fim g\u00fcnl\u00fc\u011f\u00fc \u00f6nceki d\u00f6nmek i\u00e7in etkin olmal\u0131d\u0131r revizyonlar log\:. En son etikete d\u00f6nmek i\u00e7in en az bir etiket bulunmal\u0131d\u0131r. Ad\u0131 \u00fczerinde ge\u00e7ersiz i\u015flem\: RootDSE adland\u0131rmak edemez revizyon mevcut revizyon az olmal\u0131d\u0131r\: a sevk alt\u0131nda bir giri\u015f olu\u015fturun edemiyor Ba\u011flam .REFERRAL 'g\u00f6rmezden' olarak ayarlan\u0131r\: Dizin hizmeti ba\u015flat\u0131lmad\u0131. \u015eema y\u00fck\u00fc ba\u015far\u0131s\u0131z oldu\: Dolayl\u0131 arama y\u00fcr\u00fctmek olamaz sonraki i\u015flem de\u011filse\:. throwReferral y\u00f6ntemi Bind i\u015flemi i\u00e7in uygulanmad\u0131\: isReferralThrown y\u00f6ntemi uygulanmad\u0131 Bir ba\u011flama i\u015flemi i\u00e7in\: ignoreReferral y\u00f6ntemi Bind i\u015flemi i\u00e7in uygulanmad\u0131\: isReferralIgnored y\u00f6ntem Bind i\u015flemi i\u00e7in uygulanmad\u0131\: EmptyDN d\u0131\u015f\u0131nda bir bo\u015f \u00e7al\u0131\u015fma ba\u011flam\u0131 ayarlanamaz\: NewSuperior bo\u015f olmamal\u0131d\u0131r\: Yeni \u00fcst\u00fcn olamaz bir hamle temsil eder ve yeniden adland\u0131rma i\u015flemi\: null olacak. newrdn bir yeniden adland\u0131rma null olmamal\u0131\: \u00f6nleme zinciri ba\u015flat\u0131lamad\u0131. Interceptor bulunamad\u0131\: Bilinmeyen \u00f6nleme ad\u0131\: Beklenmeyen istisna\: Di\u011fer \u00f6nleme ad\u0131n\u0131 kullan\u0131yor. Yeni \u015fema varl\u0131k i\u00e7in benzersiz de\u011fil. Yeni \u015fema varl\u0131k mevcut de\u011fil. Bir attributeType \u00fcst dn uzunlu\u011funda en fazla 3 isim bile\u015fenleri olmal\u0131d\u0131r. Bir organizationalUnit olmal\u0131d\u0131r. ou g\u00f6receli isme sahip olmal\u0131d\u0131r\: Bu \u015fema zaten i\u00e7erdi\u011fi Bu \u015fema y\u00fckl\u00fc de\u011fil gibi\: Bu \u015fema, bu \u00f6\u011fesi i\u00e7ermiyor olarak\: Bu eleman kay\u0131tlar\u0131n\u0131n i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: kay\u0131tlar\u0131ndan, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: Daha sonra soyundan 'AttributeTypes oldu\u011fu gibi\: Can not Bir y\u00fcklenmemi\u015f \u015femas\u0131ndan bir schemaObject ta\u015f\u0131mak\: Bir y\u00fcklenmemi\u015f \u015femaya bir schemaObject hareket edebilir\: kay i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: herhangi bir \u015femada yok gibidir\: kay i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: o kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 kullanan t\u00fcm matchingRules silinene kadar OID de\u011fi\u015fti olamaz. O kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 kullanarak t\u00fcm matchingRules silinene kadar ba\u015fka bir \u015femaya ta\u015f\u0131namaz. Yeni \u015fema kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 i\u00e7in benzersiz de\u011fil. Bir kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 \u00fcst dn olmal\u0131d\u0131r uzunlu\u011funda en fazla 3 isim bile\u015fenlerine\:. kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 \u00fcst giri\u015fin organizationalUnit'i olmal\u0131d\u0131r\: a. kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 \u00fcst giri\u015f yap\u0131n nispi isme sahip olmal\u0131d\u0131r\: kay\u0131tlar\u0131n\u0131n i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: ana dn Bir matchingRule uzunlu\u011funda en fazla 3 isim bile\u015fenleri olmal\u0131d\u0131r\: a. matchingRule \u00fcst giri\u015fin organizationalUnit olmal\u0131d\u0131r\: a. s\u00f6zdizimi ana giri\u015f yap\u0131n nispi isme sahip olmal\u0131d\u0131r\: kay\u0131tlar\u0131n\u0131n i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: sicil i\u00e7ine, baz\u0131 hatalar var\: Baz\u0131 ba\u011f\u0131ml\u0131 SchemaObjects olarak orada\: o normalleyici kullanan t\u00fcm matchingRules silinene kadar OID de\u011fi\u015fti olamaz. O normalleyici kullanan t\u00fcm matchingRules silinene kadar ba\u015fka bir \u015femaya ta\u015f\u0131namaz .\: yeni \u015fema normalle\u015ftirici i\u00e7in benzersiz de\u011fil. Bir normalle\u015ftirici \u00fcst dn uzunlu\u011funda en fazla 3 isim bile\u015fenleri olmal\u0131d\u0131r\: a. normalle\u015ftirici \u00fcst giri\u015fin organizationalUnit olmal\u0131d\u0131r\: a. normalle\u015ftirici ana giri\u015fi nispi ad\u0131 olmal\u0131 ou\: sicil i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: kay\u0131tlar\u0131ndan, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: Daha sonra soyundan 'objectClass'lar\u0131 oldu\u011fu gibi\: Bir objectClass ana giri\u015fin organizationalUnit olmal\u0131d\u0131r\: a. attributeType ana giri\u015fi uzunlu\u011funda 3 isim bile\u015fenleri ile objectClass organizationalUnit Sadece \u015fema varl\u0131k konteynerler silinebilir\: ou g\u00f6receli ad\u0131 olmal\u0131d\u0131r. olmas\u0131 gereken bir \u015fema dn ebeveyn\: Sadece \u015fu isimlerden biriyle varl\u0131k kaplar\u0131 organizationalUnit silebilir silinemiyor bakmakla y\u00fck\u00fcml\u00fc oldu\u011fu \u015fema\: \u015femalar dola\u015fma izin verilmez\: rdnAttribute ayarlanm\u0131\u015f ile yeniden adland\u0131rmak izin edemez. Bilinmeyen de\u011fi\u015ftirmek operasyon t\u00fcr\u00fc\: kay i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olurdu\: \u00f6yle gibi eksik ba\u011f\u0131ml\u0131l\u0131klar\u0131 ile \u015fema \u00fczerinde i\u015flemi ger\u00e7ekle\u015ftirmek i\u00e7in isteksiz Herhangi bir \u015femada yok\: yeni \u015fema syntaxChecker benzersiz de\u011fil i\u00e7in\:.\:. Bu OID syntaxChecker silinmi\u015f oldu\u011funu kullanan t\u00fcm s\u00f6zdizimi kadar de\u011fi\u015fti olamaz o OID syntaxChecker silinmi\u015f oldu\u011funu kullanan t\u00fcm s\u00f6zdizimi kadar de\u011fi\u015fti olamaz. ta\u015f\u0131namaz syntaxChecker silinmi\u015f oldu\u011funu kullanan t\u00fcm s\u00f6zdizimi kadar ba\u015fka \u015femaya\: a. syntaxChecker \u00fcst dn uzunlu\u011fu en fazla 3 isim bile\u015fenleri olmal\u0131d\u0131r\: a. syntaxChecker \u00fcst giri\u015fin organizationalUnit olmal\u0131d\u0131r. kay i\u00e7ine sonu\u00e7lanan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: kay i\u00e7ine, ortaya \u00e7\u0131kan kay\u0131tlar\u0131 tutars\u0131z olacakt\u0131r\: Bu s\u00f6zdizimini kullanan t\u00fcm ki\u015filer hakk\u0131nda da silinene kadar silinemez. A\u015fa\u011f\u0131daki dependees var\: Bir s\u00f6zdizimi ana dn uzunlu\u011funda en fazla 3 isim bile\u015fenleri olmal\u0131d\u0131r\: a. s\u00f6zdizimi ana giri\u015fin organizationalUnit olmal\u0131d\u0131r. A\u015fa\u011f\u0131daki syntaxCheckerDescription s\u00f6zdizimine uymuyor\: uymuyor a\u015fa\u011f\u0131daki normalizerDescription s\u00f6zdizimi\: A\u015fa\u011f\u0131daki comparatorDescription s\u00f6zdizimi uymuyor\: attributeTypeDescription s\u00f6zdizimi uymuyor a\u015fa\u011f\u0131daki gibidir\: ge\u00e7ersiz s\u00fcper tip bir attributeType eklenmesini izin Can not\: ge\u00e7ersiz s\u00f6zdizimi ile bir attributeType eklenmesini izin Can not\: Can not Ge\u00e7ersiz E\u015e\u0130TL\u0130K matchingRule ile attributeType eklenmesini izin\: ge\u00e7ersiz S\u0130PAR\u0130\u015e matchingRule bir attributeType eklenmesini izin Can not\: ge\u00e7ersiz alt dizeleri matchingRule bir attributeType eklenmesini izin Can not\: Bir hay\u0131r E\u015e\u0130TL\u0130K matchingRule ile attributeType eklenmesini izin Can not \: s\u00fcper tip bir E\u015e\u0130TL\u0130K matchingRule \u00e7\u00f6zemezse hangi bir attributeType eklenmesini izin Can not\:. Hi\u00e7bir s\u00f6zdizimi ile bir attributeType eklenmesini izin Can not\: objectClassDescription s\u00f6zdizimi uymuyor a\u015fa\u011f\u0131daki\: bir objectClass eklenmesini izin Can not Ge\u00e7ersiz bir \u00fcst\u00fcn objectClass\: mayList ge\u00e7ersiz attributeType bir objectClass eklenmesini izin Can not\: mustList ge\u00e7ersiz attributeType bir objectClass eklenmesini izin Can not\: A\u015fa\u011f\u0131daki matchingRuleUseDescription s\u00f6zdizimine uymuyor\: uymuyor a\u015fa\u011f\u0131daki ldapSyntax a\u00e7\u0131klama s\u00f6zdizimi\: Bir \u00f6nceki yarat\u0131l\u0131\u015f olmadan s\u00f6zdizimi eklenmesini izin Can not\: matchingRuleDescription s\u00f6zdizimi uymuyor a\u015fa\u011f\u0131daki gibidir\: var olmayan s\u00f6zdizimi ba\u011fl\u0131 bir matchingRule olu\u015fturulam\u0131yor\: A\u015fa\u011f\u0131daki ditStructureRuleDescription uymuyor s\u00f6zdizimi\: A\u015fa\u011f\u0131daki ditContentRuleDescription s\u00f6zdizimi uymuyor\: nameFormDescription s\u00f6zdizimi uymuyor a\u015fa\u011f\u0131daki gibidir\:. sonra ba\u015flatma wrappedPartition ayarlamak i\u00e7in izin verilmez\: oid i\u00e7in var birden fazla attributeType\: oid i\u00e7in birden fazla matchingRule Got\: dn ikinci rdn Nitelik\: oid i\u00e7in var birden fazla syntaxChecker\: oid i\u00e7in birden fazla s\u00f6zdizimi Got varl\u0131k ad\u0131 i\u00e7in birden fazla sonu\u00e7 var\: m\u00fcd\u00fcrleri i\u00e7in kullan\u0131lan Adlar\u0131 normalize edilmelidir\: Bilinmeyen JNDI Context.REFERRAL de\u011feri \: Otopark Bad seri, a\u011fac\u0131n\: Bo\u015f veya bo\u015f veri dizisi ge\u00e7ersiz. Yanl\u0131\u015f dizi tefrika veri bi\u00e7imi\: K\u00f6t\u00fc a\u011fa\u00e7\: Yanl\u0131\u015f AvlTree seri hale veri format\u0131\: Bu tekil AvlTree tan\u0131ms\u0131z bir singleton \u00fczerinde de\u011fi\u015fiklikler davran\u0131\u015flar\u0131 beri de\u011fi\u015fiklikleri desteklemez .\: s\u0131n\u0131f bulunamad\u0131\: Bu imle\u00e7 kilitler tu\u015funu bas\u0131l\u0131 \u00f6ylesine keywise geli\u015fmeler izin verilmez. tekiz bo\u015f olmamal\u0131d\u0131r\: orderedSet bo\u015f olmamal\u0131d\u0131r\: zaman s\u0131ral\u0131 k\u00fcme modunda singleton istenemez. \u00e7oklu de\u011ferleri kullanarak a tek ayarlanamaz\: Zaten tekiz modunda\:. tekiz modunda set sipari\u015f alamad\u0131m Can\:. Zaten set modunu sipari\u015f\: tekil modda bir orderedSet ayarlanamaz. Bir ServerAttribute standart seri kullanamazs\u0131n\u0131z\: Bir ServerEntry standart seri kullanamazs\u0131n\u0131z\: tan\u0131ms\u0131z de\u011fi\u015fiklik t\u00fcr\u00fc \: Farkl\u0131 kimlikleri ile niteliklerin birli\u011fi alamaz\:\! Her iki args null ise nitelik kimli\u011fi anlamaya Can not yatan numaraland\u0131rma \u00fczerinde Kar\u015f\u0131la\u015f\u0131lan NamingException\: \u015fema mevcut de\u011fil. Ge\u00e7erli bir de\u011fer\: beklenen byte\: normalle\u015ftirmek i\u00e7in beklenen dize olabilir 't k\u00f6k DSE ta\u015f\u0131y\u0131n\: Tan\u0131mlanamayan de\u011fi\u015fim t\u00fcr\u00fc de\u011feri\: ortam\u0131nda dizin hizmeti bulam\u0131yor\: convert Can not\: nesne seri kald\u0131rma ak\u0131\u015f\u0131 yak\u0131n () ba\u015far\u0131s\u0131zl\u0131\u011f\u0131\: De-serialization nesne seri ak\u0131\u015f\u0131 yak\u0131n () ba\u015far\u0131s\u0131zl\u0131\u011f\u0131\: Serialization Don' t yorumlamak i\u00e7in biliyorum\: ama env bulamad\u0131m\: ama env null kurulmu\u015ftur\: null olamaz. besleyen kimlik bilgileri ile basit kimlik do\u011frulamas\u0131 belirleyemezsiniz\: JavaContainer objectClass i\u00e7in zorunlu 'cn' \u00f6znitelik i\u00e7eren de\u011fil \!\: RootDSE silemezsiniz\: Referenceables saklamak Hen\u00fcz nas\u0131l bilmiyorum\: Ba\u015fvurular saklamak hen\u00fcz nas\u0131l bilmiyorum\: Ba\u011flam en ortam\u0131nda nesne fabrikalar\u0131 kullanarak\:. ba\u011flamak i\u00e7in bir yol bulam\u0131yor bir de\u011fil Bu girdinin atas\u0131\: obj Hem ve attrs args null. Bu parametrelerden biri en az\u0131ndan bo\u015f olmamal\u0131d\u0131r. Kar\u015f\u0131la\u015f\u0131lan ayr\u0131\u015ft\u0131rma istisna filtresi ayr\u0131\u015ft\u0131r\u0131l\u0131rken\: filtreyi ayr\u0131\u015ft\u0131r\u0131lamad\u0131\: Yap\u0131land\u0131rma b\u00f6l\u00fcm\u00fc bo\u015f olamaz\: config b\u00f6l\u00fcm\u00fc ba\u015flat\u0131lmad\u0131\: sistem b\u00f6l\u00fcm\u00fc yok\: Hen\u00fcz uygulamak\: de Ge\u00e7ersiz \u00f6nleme emri\: \u00fczerine de\u011fil misin, yap\u0131land\u0131rma \u00e7\u0131kt\u0131 dizini zaten var\: var olmayan bir kaynak dosya kopyalama Can not\: config / config desen olmadan k\u00f6k isabet olmamal\u0131. ebeveyn null olamaz\: Yetersizlik s\u0131ras\u0131nda hata\: Kullan\u0131c\u0131 kimlik do\u011frulanamad\u0131 Anahtar bulunamad\u0131\: BPage sipari\u015f\: Ge\u00e7ersiz \u00e7ocuk alt anahtar\: De\u011fi\u015fken 'Recman' null\: De\u011fi\u015fken 'kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131' null\: De\u011fi\u015fken 'kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131' seri olmal\u0131d\u0131r\: De\u011fi\u015fken 'PAGESIZE' bile olmal\u0131d\u0131r\: Arg\u00fcman 'anahtar' null\: Arg\u00fcman 'de\u011fer' null\: De\u011fi\u015fken 'obj1' null\: De\u011fi\u015fken 'obj2' null\: Platform UTF8 kodlamay\u0131 desteklemiyor\: MRU \u00f6nbellek en az bir giri\u015f i\u00e7ermelidir\: bo\u015f dinleyici eklenemiyor. \u0130\u00e7 \u00f6nbellek null olamaz. Anahtar olamaz Bo\u015f\:. de\u011feri null olamaz. derinlik> MAX_DEPTH + 1 kova olu\u015fturulam\u0131yor. Derinlik\: derin dizin olu\u015fturulam\u0131yor. Derinlik\: De\u011fi\u015fken 'cache' null\: i\u015flem say\u0131s\u0131 blo\u011fu\: i\u015flem blo\u011fu tahsis BlockId\: Ad\u0131 dizini bulunmal\u0131d\u0131r\: RecordManager kapat\u0131ld\u0131\: sahte blok id Arg\u00fcman 'recid' ge\u00e7ersiz DataPage.setFirst\: dosya ba\u015fl\u0131\u011f\u0131 b\u00fcy\u00fc tamam de\u011fil \u00fccretsiz \u00e7eviri alamam\u0131\u015ft\u0131r\: sayfa ba\u015fl\u0131\u011f\u0131 b\u00fcy\u00fc blo\u011fu i\u00e7in\: sayfa ba\u015fl\u0131\u011f\u0131 b\u00fcy\u00fc de\u011fil OK\: \u00fccretsiz sayfa tahsis\:? \u00fccretsiz \u00fccretsiz sayfa\:? \u00fccretsiz ba\u015fl\u0131k sayfas\u0131\:? Yumu\u015fak referans \u00f6nbellek uygulanmad\u0131\: Zay\u0131f referans \u00f6nbellek uygulanmad\u0131\: Ge\u00e7ersiz \u00f6nbellek T\u00fcr\u00fc\: blokta \u00e7ift olsun\: K\u00f6t\u00fc blockid\: kullan\u0131m listesinde bo\u015f zaman i\u015flemedi\u011fi\: kullan\u0131m listesinde bo\u015f de\u011fil geri alma anda\: txn listesindeki geri alma anda bo\u015f de\u011fil\: i\u015flemde bo\u015f de\u011fil\: yak\u0131n zamanda Kirli bloklar\: InUse bloklar yak\u0131n zamanda\: kay\u0131t ba\u015fl\u0131\u011f\u0131 i\u00e7in \u00e7ok b\u00fcy\u00fck Offset\: De\u011fi\u015fken 'maxTxns' 0'dan b\u00fcy\u00fck olmal\u0131d\u0131r\: g\u00fcnl\u00fck dosyas\u0131 Bad b\u00fcy\u00fc\: i\u015flemler g\u00fcnl\u00fc\u011f\u00fcne bekleyen ise ayar\u0131n\u0131 de\u011fi\u015ftirilemiyor Unexcepted istisna\: Ge\u00e7ersiz kay\u0131t y\u00f6neticisi sa\u011flay\u0131c\u0131\: De\u011fil tefrika BTreeRedirect nesne\: Bu imle\u00e7 yaln\u0131zca etkin yinelenen tu\u015flar\u0131 var tablolarla kullan\u0131labilir\:. De\u011fer esasl\u0131 ilerlemeler desteklenmiyor. Hay\u0131r E\u015fitlik MatchingRule mevcut bu btreeRedirect konteyner de\u011fildir\: serile\u015ftirilmi\u015f BTreeRedirect nesnesi de\u011fil\: Bu bir arrayTree konteyner de\u011fil nitelik\:. m\u00fclkiyet bir dizin i\u00e7in ba\u015flat\u0131ld\u0131ktan sonra ayarlanamaz\: jdbm ma\u011faza \u00f6zelli\u011fini ayarlay\u0131n olamaz\: yok kar\u015f\u0131la\u015f\u0131lan hatalar ()\: Bilinen bir nesneyi isim olmaz indirgenmedikleri zaman. yumu\u015fat\u0131lm\u0131\u015f ObjectName\: Anahtar kar\u015f\u0131la\u015ft\u0131rma null olamaz. De\u011fer kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 yinelenen tu\u015flar\u0131 ile tablolar i\u00e7in bo\u015f olmamal\u0131d\u0131r. Maalesef bir de\u011fer, sipari\u015f soruyu cevaplamak i\u00e7in gereken kar\u015f\u0131la\u015ft\u0131r\u0131c\u0131 i\u00e7ermiyor etkin yineleme olmadan bu Tablo\:. Anahtar null veya de\u011feri ge\u00e7erli de\u011fil\: Bu \u0130mle\u00e7 yinelenen anahtarlar desteklemez. ile \u015fifreli AS-\u0130STE\u011e\u0130 PA-ENC-TIMESTAMP PADATA zaman damgas\u0131 bulundu\: dekoderi ba\u015flatmas\u0131n\u0131 Hata\: i\u00e7in dekoder eri\u015fen Hata\: kullan\u0131lamaz Decoder\: kodlay\u0131c\u0131 ba\u015flatmas\u0131n\u0131 Hata\: Encoder kullan\u0131lam\u0131yor istemci anahtar\: AS-REP b\u00f6l\u00fcm\u00fcn\u00fc \u015fifreli (TGS oturum anahtar\u0131 veya uygulama oturum anahtar\u0131 i\u00e7erir), m\u00fc\u015fteri ile \u015fifrelenmi\u015f\: AS-REP Bilet ve TGS-REP Bilet Servisi anahtar ile \u015fifrelenmi\u015f, (TGS oturum anahtar\u0131 veya uygulama oturum anahtar\u0131 i\u00e7erir) TGS-REQ KDC-REQ-V\u00dcCUT AuthorizationData, TGS kimlik do\u011frulay\u0131c\u0131s\u0131 alt anahtar\u0131n\u0131n \u015fifreli\: TGS-REQ PA-TGS-REQ PADATA AP-REQ Kimlik cksum tu\u015fu\: TGS oturum anahtar\u0131 ile \u015fifrelenmi\u015f TGS-REQ KDC-REQ-V\u00dcCUT AuthorizationData, TGS oturum anahtar\u0131 ile anahtarl\u0131\: TGS oturum anahtar\u0131 ile \u015fifrelenmi\u015f TGS-REQ PA-TGS-REQ PADATA AP-REQ Kimlik Kan\u0131tlay\u0131c\u0131 (TGS do\u011frulay\u0131c\u0131s\u0131 alt anahtar\u0131n\u0131 i\u00e7erir)\: TGS-REP b\u00f6l\u00fcm\u00fcn\u00fc \u015fifreli \u015fifreli, (ba\u015fvuru oturum anahtar\u0131 i\u00e7erir) TGS oturum anahtar\u0131\: ile \u015fifreli AP-REQ Kimlik Kan\u0131tlay\u0131c\u0131 (i\u00e7eren uygulama do\u011frulay\u0131c\u0131s\u0131 alt anahtar\u0131), AP-REQ \u015eifrematik cksum, uygulama oturum anahtar\u0131 ile anahtarl\u0131\: TGS-REP b\u00f6l\u00fcm\u00fcn\u00fc \u015fifreli TGS kimlik do\u011frulay\u0131c\u0131s\u0131 alt anahtar\u0131n\u0131n ile \u015fifrelenmi\u015f, (ba\u015fvuru oturum anahtar\u0131 i\u00e7erir) Uygulama oturum anahtar\u0131\: AP-REP b\u00f6l\u00fcm\u00fcn\u00fc \u015fifreli uygulama oturum anahtar\u0131yla \u015fifrelenmi\u015f (uygulama oturumu alt anahtar\u0131n\u0131 i\u00e7erir)\: KRB-PRIV uygulama taraf\u0131ndan se\u00e7ilen bir anahtarla \u015fifrelenir, bir k\u0131sm\u0131n\u0131 \u015fifreli\: desteklenen \u015fifreleme t\u00fcr\u00fc de\u011fil. Geri arama desteklenmiyor\: Dosya \u00e7ok b\u00fcy\u00fck\: Tamamen dosyas\u0131 okunamad\u0131\: AuthorizationDataEntry nesnesini kodlamak olamaz, PDU boyutu\: Hesap Kerberos anahtar \u00f6zniteli\u011fi\: katalog i\u00e7eri\u011fi al\u0131namad\u0131\: \u0130lk ba\u011flam\u0131 al\u0131namad\u0131\: Kerberos anahtar\u0131 bir dize olmamal\u0131d\u0131r. Can ' t oturumu olsun\: Bo\u015f bir isim bir Kerberos ad\u0131 ge\u00e7erli de\u011fil\: A '/' Kerberos Ad\u0131 sonunda ge\u00e7erli de\u011fil. sunucuya ba\u011flanamad\u0131\: belirtilen yap\u0131land\u0131rma dir\: beklenen ba\u011flam giri\u015fi yok mevcut\: entry zaten var\: maxObjectSize\: Hay\u0131r ASCII kodlama\: ayarlanamaz se\u00e7enek de\u011feri\: dizge g\u00f6sterimini ayr\u0131\u015ft\u0131rmak Can not\: Yasad\u0131\u015f\u0131 adresi\: DhcpOption soyundan de\u011fildir\: se\u00e7enek alan s\u0131n\u0131flar\u0131 ba\u015flat\u0131lam\u0131yor\: Max veri uzunlu\u011fu\: ASCII kullan\u0131lam\u0131yor kodlama\:. objectClass haritalama Kay\u0131t t\u00fcr\u00fc hen\u00fcz belirlenmedi\: ResourceRecord YAPISAL objectClass gerektirir\: Ge\u00e7ersiz arama taban\u0131\: Ge\u00e7ersiz enum de\u011feri\: En ba\u011flam\u0131 al\u0131nam\u0131yor SamSubsystem anahtar b\u00fct\u00fcnl\u00fck denetleyicisi ile etkin de\u011fil\: Entry bo\u015f SAM t\u00fcr\u00fc vard\u0131r\: Could not \u00f6zelli\u011fi bulmak\: do\u011frulay\u0131c\u0131 s\u0131n\u0131f bulunamad\u0131\: SAM t\u00fcr\u00fc ile bekleniyor giri\u015fleri s\u0131n\u0131f\u0131 Hi\u00e7bir kamu varsay\u0131lan kurucuyu\: Arama taban\u0131 DN de bulunamad\u0131\: bir s\u00fctun dizini max\: class i\u00e7in varsay\u0131lan kurucu \u00e7a\u011f\u0131rma Ba\u015far\u0131s\u0131z Tipi g\u00f6ndermeden \u00f6nce NTLM mesaj\u0131 al\u0131nam\u0131yor 2 zorluk\:. NTLM mesaj al\u0131nam\u0131yor Tip 3 al\u0131nd\u0131ktan sonra\:. SASL meydan yan\u0131t\u0131 tamamlanm\u0131\u015f. Tip 1 yan\u0131t \u00f6nce Tip 2 meydan g\u00f6nderilemiyor. Tip 2 g\u00f6nderilemiyor zaten g\u00f6nderildikten sonra\:. tepkisi null idi\: ile yan\u0131t\u0131 s\u0131f\u0131r bayt\: NTLM Tip ta\u015f\u0131ma 3 ileti s\u0131ras\u0131nda bir hata olu\u015ftu\:. ta\u015f\u0131ma NTLM Tip 1 iletinin s\u0131ras\u0131nda bir hata olu\u015ftu. Do\u011frulama te\u015febb\u00fcs ancak kimlik bilgileri ge\u00e7ersiz ..\: hay\u0131r auhcid veya \u015fifre ile cevap\: '0' karakter vard\u0131r de\u011fil authcid izin veya \u015fifre yok\: Verilen InitialReponse yanl\u0131\u015ft\u0131r\: kullan\u0131c\u0131 kimlik do\u011frulamas\u0131 Can not\: ge\u00e7ersiz authcid DN kimli\u011fini Can not geri arama i\u015fleyicisi Ba\u015far\u0131s\u0131z yetkilendirme.\:. KeyManagerFactory olu\u015fturulamad\u0131\: Ger\u00e7ekten hi\u00e7bir zaman olmamal\u0131d\u0131r deposu y\u00fck\u00fc Ba\u015far\u0131s\u0131z Ba\u015far\u0131s\u0131z KeyManagerFactory ba\u015flatmak i\u00e7in\: SSLContext olu\u015fturulamad\u0131\: SSLContext ba\u015flat\u0131lamad\u0131. SSL ba\u011flam\u0131 olu\u015fturulamad\u0131\: ExtendedRequests SingleReplyRequests olmas\u0131na ra\u011fmen bu taban s\u0131n\u0131f\u0131n\u0131 kullanarak ele de\u011filiz. Tan\u0131mlanamayan tek cevap istek / yan\u0131t tipi\: Beklenmeyen taban kapsam\u0131\: Onlar SingleReplyRequests geri kalan\u0131 aksine hi\u00e7bir hedef girdisi var. TIMEUNIT desteklenmiyor\: Desteklenmeyen protokol t\u00fcr\u00fcn\u00fc\: ile SASL mekanizmas\u0131n\u0131 eklenemedi\: \u00c7e\u015fidi geni\u015fletilmi\u015f operasyon eklenemedi Ad\u0131\: NTLM sa\u011flay\u0131c\u0131 eklenemedi\: Bo\u015f ID\: Ge\u00e7ersiz yineleme kimli\u011fi\: Kurulum d\u00fczeni a\u015fa\u011f\u0131daki \u015fema dizini bulunamad\u0131\: Bilinmeyen SchemaObject t\u00fcr\u00fc\: entry silinemiyor\: En giri\u015fi bulamad\u0131 de\u011fil de\u011fer aral\u0131\u011f\u0131 i\u00e7inde\: Bind istekleri sadece T\u00fcnel a\u015fa\u011f\u0131 b\u00f6l\u00fcmlere mekanizmas\u0131n\u0131 ele hi\u00e7bir Do\u011frulay\u0131c\u0131 varsa\: Bu imle\u00e7 bo\u015ftur ve \u00f6\u011feleri iade edemez\: verimli \u00f6zniteli\u011fi bir dizin w / o DIB arama Can not\: \u0130lk \u00f6nce yerle\u015ftirilmi\u015f ise eleman eri\u015filemiyor. e\u011fer eleman eri\u015filemiyor Son sonras\u0131nda konumland\u0131r\u0131lm\u0131\u015f. AndCursors sipari\u015f ve eleman taraf\u0131ndan konumland\u0131rma deste\u011fi yok. \u0130mle\u00e7 hen\u00fcz konumland\u0131r\u0131lm\u0131\u015f olmam\u0131\u015ft\u0131r. EqualityNode de\u011ferlendirme i\u00e7in kullanmak matchingRule bulamad\u0131\: Tan\u0131nmayan yaprak d\u00fc\u011f\u00fcm\: Tan\u0131nmayan \u015fube d\u00fc\u011f\u00fcm t\u00fcr\u00fc\: i\u00e7in Tan\u0131nmayan arama kapsam\u0131 de\u011feri kapsam d\u00fc\u011f\u00fcm\u00fc filtre\: Bir kullan\u0131c\u0131 endeksi iddia \u00f6znitelik var oldu\u011funda EqualityCursors sadece eleman taraf\u0131ndan konumland\u0131rma deste\u011fi\:. Bir kullan\u0131c\u0131 endeksi iddia \u00f6znitelik var oldu\u011funda LessEqCursors sadece eleman taraf\u0131ndan konumland\u0131rma desteklemektedir\:. GreaterEqNode de\u011ferlendirme i\u00e7in kullanmak matchingRule bulamad\u0131 chingRule i\u00e7in LessEqNode de\u011ferlendirme i\u00e7in kullan\u0131n\: NotCursors sipari\u015f ve taraf\u0131ndan eleman konumland\u0131rma deste\u011fi yok. Kapsam imle\u00e7ler sipari\u015f ve eleman taraf\u0131ndan konumland\u0131rma deste\u011fi yok. ScopeNode onelevel kapsam\u0131n de\u011fildir. Bu ServerEntry \u00fczerine getId () olmadan \u00e7ok verimsiz \: OrCursors sipari\u015f ve eleman taraf\u0131ndan konumland\u0131rma deste\u011fi yok. Bir disjunction i\u00e7in 2 veya daha fazla alt-ifade Cursors olmal\u0131d\u0131r\: PresenceCursors varl\u0131\u011f\u0131 \u00f6zniteli\u011fi bir kullan\u0131c\u0131 endeksi olmadan eleman\u0131 taraf\u0131ndan konumland\u0131rma deste\u011fi yok. SubstringCursors sipari\u015f edilemez olabilir ve eleman taraf\u0131ndan konumland\u0131rma deste\u011fi yok. Dosya silinemiyor\: ScopeNode alt a\u011fac\u0131 kapsam\u0131 de\u011fildir. Sadece 2 0 dizininde s\u00fctun ve 1 olabilir\: Do\u011fru col isimleri set vermedi\: Tan\u0131nmayan modu\:. Tan\u0131nmayan FilterDialog Komut\: ba\u011flama s\u0131ras\u0131nda bir iste\u011fi i\u015flemek Can not\: As\u0131l ge\u00e7erli \u0130sim de\u011fil\: KrbError nesnesi kodlamak olamaz, PDU boyutu\: KrbSafeBody nesnesi kodlamak olamaz, PDU boyutu\: KrbSafe nesnesi kodlamak olamaz, PDU boyutu\: Can not EncKrbPrivPart nesnesini kodlamak, PDU boyutu\: KrbPriv nesnesi kodlamak olamaz, PDU boyutu\: KrbCredInfo nesnesi kodlamak olamaz, PDU boyutu\: EncKrbCredPart nesnesi kodlamak olamaz, PDU boyutu\: KrbCred nesnesi kodlamak olamaz, PDU boyutu\: EncTicketPart nesnesi kodlamak olamaz, PDU boyutu\: TypedData nesnesi kodlamak olamaz, PDU boyutu\: PDU uzunlu\u011fu null, bu izin verilmez\: de\u011fil ge\u00e7erli bir KerberosString\: Ge\u00e7erli bir g\u00fcnl\u00fck dosyas\u0131 say\u0131s\u0131\: Log Taray\u0131c\u0131 zaten kapal\u0131d\u0131r\: Ge\u00e7ersiz g\u00fcnl\u00fck dosyas\u0131 BufferSize / maksimum boyut BufferSize sepcified edilir\: offset Ge\u00e7erli bir g\u00fcnl\u00fck dosyas\u0131 Log i\u00e7erik ge\u00e7ersiz
#
#TODO: add other error messages from other LDAP implementations such as the following list (from http://en.wikipedia.org/wiki/List_of_LDAP_software)
# Note: removed references to the ones handled above
#
# Apple Open Directory
# FreeIPA
# IBM Tivoli Directory Server
# Mandriva Directory Server
# Novell eDirectory
# OpenDJ - A fork of the OpenDS project
# OpenDS
# Virtual Identity Server from Optimal IdM
# Oracle Internet Directory
# Radiant Logic VDS
# Sun Java System Directory Server
# UnboundID Directory Server[1]
# Univention Corporate Server (with OpenLDAP from Univention)
# DirX Directory from Atos (ex-Siemens)  

ascanbeta.noanticsrftokens.name=Anti-CSRF belirte\u00e7leri olmamas\u0131
ascanbeta.noanticsrftokens.desc=Hay\u0131r Anti-CSRF belirte\u00e7leri HTML g\u00f6nderme formunda bulundu.
ascanbeta.noanticsrftokens.alert.attack=Hi\u00e7biri. Sadece Uyar\u0131.
ascanbeta.noanticsrftokens.alert.extrainfo=Bilinen Anti-CSRF belirte\u00e7leri A\u015fa\u011f\u0131daki HTML bulundu

ascanbeta.remotecodeexecution.cve-2012-1823.name=Uzaktan Kod Y\u00fcr\u00fctme - CVE-2012-1823
ascanbeta.remotecodeexecution.cve-2012-1823.desc=CGI kullanarak \u00e7al\u0131\u015fmak \u00fczere yap\u0131land\u0131r\u0131lm\u0131\u015f Baz\u0131 PHP s\u00fcr\u00fcmleri, do\u011fru rasgele kod y\u00fcr\u00fct\u00fclmesine olanak bir \u00e7\u0131kmam\u0131\u015f "\=" karakterini eksikli\u011fi sorgu dizeleri dokunmay\u0131n. Bu durumda, bir i\u015fletim sistemi komut web sunucusunda y\u00fcr\u00fct\u00fclecek neden ve sonu\u00e7lar web taray\u0131c\u0131s\u0131 iade edildi. 
ascanbeta.remotecodeexecution.cve-2012-1823.soln=PHP'nin en son kararl\u0131 s\u00fcr\u00fcme y\u00fckseltin veya "RewriteCond" ve "RewriteRule" direktiflerini kullanarak k\u00f6t\u00fc niyetli istekleri s\u00fczmek i\u00e7in Apache web sunucusu ve mod_rewrite mod\u00fcl\u00fcn\u00fc kullanabilirsiniz.

ascanbeta.sessionfixation.name=Oturum Fixation
ascanbeta.sessionfixation.desc=Oturum Fixation m\u00fcmk\u00fcn olabilir. Bu sorun (kullan\u0131c\u0131 uygulamas\u0131 kendilerini do\u011frular oldu\u011fu) bir giri\u015f URL olu\u015fursa, o zaman URL sonra ma\u011fdurun kimli\u011fini varsaymak i\u00e7in bir kurban, sabit bir oturum kimli\u011fi ile birlikte, bir sald\u0131rgan taraf\u0131ndan verilebilir Verilen oturum kimli\u011fi kullanarak. Sorun olmayan bir oturum a\u00e7ma sayfas\u0131 ile olu\u015fursa, URL ve sabit oturum kimli\u011fi sadece do\u011frulanmam\u0131\u015f kullan\u0131c\u0131n\u0131n eylemlerini izlemek i\u00e7in bir sald\u0131rgan taraf\u0131ndan kullan\u0131l\u0131yor olabilir. G\u00fcvenlik a\u00e7\u0131\u011f\u0131 yerine URL (GET) parametresine bir \u00e7erez alan\u0131 veya bir form alan\u0131n\u0131n (POST parametresi) olu\u015fursa, o zaman ba\u015fka bir g\u00fcvenlik a\u00e7\u0131\u011f\u0131 da a\u00e7\u0131\u011f\u0131 izin, kurban\u0131n taray\u0131c\u0131s\u0131nda \u00e7erez alan\u0131n\u0131 ayarlamak i\u00e7in gerekli olabilir istismar edilecek.
ascanbeta.sessionfixation.soln=1) s\u0131k\u0131 oturum kimlikleri uygulayarak bir oturum kimli\u011fi kazan\u0131yor sald\u0131rgan\u0131n \u00f6nlemek ve sadece uygulama ba\u015far\u0131l\u0131 kimlik \u00fczerine oturum kimliklerini ay\u0131rarak. 2) Sunucu ba\u011f\u0131ms\u0131z olarak her zaman bir oturum zaten yerinde olup olmad\u0131\u011f\u0131, kimlik \u00fczerine yeni bir oturum kimli\u011fi olu\u015fturman\u0131z gerekir. 3) IP adresi, SSL istemci sertifikas\u0131 gibi baz\u0131 identificable m\u00fc\u015fteri nitelik kombinasyonu, oturum id ba\u011flay\u0131n. 4) Sessions, tahrip oldu\u011funda, yan\u0131 s\u0131ra istemci \u00fczerindeki, sunucu \u00fczerinde imha edilmelidir. 5) m\u00fc\u015fteri i\u00e7in \u00f6nceki t\u00fcm oturumlar\u0131 yok edecek bir \u00e7\u0131k\u0131\u015f mekanizmas\u0131 uygular. 6) mutlak oturum zaman a\u015f\u0131m\u0131 uygular. \u0130kincisi, genellikle ek g\u00fcvenlik a\u00e7\u0131klar\u0131n\u0131 gerektiren s\u0131rayla, bir \u00e7erez ya da form tabanl\u0131 oturum kimli\u011fi uygulanmas\u0131na dayal\u0131 bir URL'den 7) Switch bir sald\u0131rgan taraf\u0131ndan s\u00f6m\u00fcr\u00fclebilir olmak\n
ascanbeta.sessionfixation.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Session_fixation\nhttp\://www.acros.si/papers/session_fixation.pdf\nhttp\://www.technicalinfo.net/papers/WebBasedSessionManagement.html\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionfixation.alert.cookie.extrainfo=\u00c7erez alan [zaman \u00c7erez yan\u0131t set {0} ] NULL olarak ayarlan\u0131r\: [ {1} istekte \u00f6d\u00fcn\u00e7 (ge\u00e7erli) \u00e7erez de\u011feri ile yan\u0131t] Cookie seti [ {1} ]\: [ {2} ]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionfixation.alert.url.extrainfo=URL parametresi / sahte URL parametresi [BIR olas\u0131 bir oturum de\u011feri HTML \u00e7\u0131kt\u0131s\u0131nda URL''ler ortaya \u00e7\u0131km\u0131\u015ft\u0131r {0} ] NULL olarak ayarlan\u0131r\: [ {1} ] Bu ''\u00f6d\u00fcn\u00e7'' oturum [Zaman {1} ] bir sonraki kullan\u0131l\u0131r Bu URL i\u00e7in iste\u011fi, yeni bir oturum olu\u015fturulur.
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionfixation.alert.attack={0} alan\u0131\: [ {1} ]
ascanbeta.sessionfixation.alert.logmessage=Bir olas\u0131l\u0131kla Oturum Fixation A\u00e7\u0131\u011f\u0131 ile tespit edilmi\u015ftir [ {0} ] URL [ {1} ] \u00fczerine {2} \: alan\u0131na [ {3} ]
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name=Exposed Session ID
ascanbeta.sessionidexposedinurl.desc=Bir oturum kimli\u011fi URL maruz kalmaktad\u0131r. B\u00f6yle bir web sitesi URL (session id i\u00e7eren) payla\u015farak, bir naiive kullan\u0131c\u0131 yanl\u0131\u015fl\u0131kla kendi gizlilik, b\u00fct\u00fcnl\u00fck ve kullan\u0131labilirlik \u00f6d\u00fcn, kendi verilerine eri\u015fim izni olabilir. Oturum tan\u0131mlay\u0131c\u0131s\u0131 i\u00e7eren URL'ler de web taray\u0131c\u0131 yer imlerine, web sunucusu log dosyalar\u0131 ve proxy sunucusu log dosyalar\u0131 g\u00f6r\u00fcn\u00fcr. 
ascanbeta.sessionidexposedinurl.soln=, Daha g\u00fcvenli bir oturum y\u00f6netimi uygulamas\u0131 kullan\u0131n gibi kolayca tipik sunucu g\u00fcnl\u00fck dosyalar\u0131 veya web taray\u0131c\u0131 yer imlerine g\u00f6r\u00fcnm\u00fcyor yanl\u0131\u015fl\u0131kla payla\u015f\u0131lan ve olmayan oturum \u00e7erezleri kullan\u0131r biri olarak.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management
ascanbeta.sessionidexposedinurl.alert.extrainfo={0} alan\u0131 [ {1} ] bir a\u00e7\u0131k oturum tan\u0131mlay\u0131c\u0131s\u0131 i\u00e7erir [ {2} ]
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionidexposedinurl.alert.attack={0} alan\u0131\: [ {1} ]
ascanbeta.sessionidexposedinurl.alert.logmessage=Bir a\u00e7\u0131k oturum tan\u0131mlay\u0131c\u0131s\u0131 [at bulundu {0} ] URL [ {1} ] \u00fczerine {2} \: alan\u0131na [ {3} ]
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name=Oturum Kimli\u011fi G\u00fcvensiz Bula\u015fan
ascanbeta.sessionidsentinsecurely.desc=Bir oturum kimli\u011fi g\u00fcvensiz mekanizma yoluyla g\u00f6nderilebilir. HTTP HTTPS yerine kullan\u0131ld\u0131\u011f\u0131 zaman, istekte bir tan\u0131mlama durumunda, bu meydana gelir. (URL NULL adl\u0131 parametre alan ayarlayarak de\u011fi\u015ftirilmi\u015f) yan\u0131t olarak sunucu taraf\u0131ndan g\u00f6nderilen bir cookie, bayra\u011f\u0131 ayarl\u0131 de\u011fil 'g\u00fcvenli' \u00e7erez izin durumunda HTTP \u00fczerinden yerine HTTPS \u00fczerinden daha sonra g\u00f6nderilmek \u00fczere . Bu a\u011f, yolda pasif kulak misafiri kurban\u0131n oturumuna tam eri\u015fim sa\u011flamas\u0131na olanak verebilir.  
ascanbeta.sessionidsentinsecurely.soln=1) bir oturum kimli\u011fi taray\u0131c\u0131s\u0131 ve web sunucusu aras\u0131nda iletilen t\u00fcm sayfalar i\u00e7in () HTTPS i\u00e7in SSL / TLS son kullan\u0131labilir s\u00fcr\u00fcm\u00fcn\u00fc kullan\u0131n. 2) haberle\u015fme \u015fifresiz HTTP protokol\u00fc a\u015fa\u011f\u0131 zorla izin vermeyin. Bir oturum kimli\u011fi i\u00e7eren bir \u00e7erez ayarlarken 3) g\u00fcvensiz mekanizma ile onun sonraki ge\u00e7i\u015fini \u00f6nlemek i\u00e7in, 'g\u00fcvenli' bayra\u011f\u0131n\u0131 kullan\u0131n. 4) g\u00fcvenli HTTPS e\u015fde\u011fer sayfaya \u0130leri g\u00fcvenli olmayan HTTP sayfas\u0131 istekleri.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management https\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionidsentinsecurely.alert.extrainfo=oturum tan\u0131mlay\u0131c\u0131s\u0131 {0} alan\u0131 [ {1} ], de\u011fer [ {2} ] g\u00fcvensiz mekanizma yoluyla g\u00f6nderilebilir.  
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset='G\u00fcvenli' bayrak sunucusu taraf\u0131ndan sa\u011flanan oturum \u00e7erezi ayarlan\u0131r de\u011fildi.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionidsentinsecurely.alert.attack={0} alan\u0131\: [ {1} ]
ascanbeta.sessionidsentinsecurely.alert.logmessage=Bir oturum tan\u0131mlay\u0131c\u0131s\u0131 {2} \: alan\u0131na [ {3} ] [bir g\u00fcvensiz bir mekanizma yoluyla g\u00f6nderilen olabilir {0} ] URL''ye [ {1} ]
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name=JavaScript i\u00e7in Eri\u015filebilir Session ID \u00c7erez
ascanbeta.sessionidaccessiblebyjavascript.desc=(URL NULL adl\u0131 parametre alan ayarlayarak de\u011fi\u015ftirilmi\u015f) sunucu taraf\u0131ndan g\u00f6nderilen bir oturum kimli\u011fi tan\u0131mlama istemci \u00fczerinde JavaScript ile ula\u015f\u0131labilir. Ba\u015fka bir g\u00fcvenlik a\u00e7\u0131\u011f\u0131 ile birlikte, bu oturumun ka\u00e7\u0131r\u0131ld\u0131 izin verebilir.  
ascanbeta.sessionidaccessiblebyjavascript.soln=Web taray\u0131c\u0131s\u0131nda JavaScript taraf\u0131ndan eri\u015filen engellemek i\u00e7in, bir oturum kimli\u011fi i\u00e7eren bir \u00e7erez ayarlarken 1) 'sadece_http' bayra\u011f\u0131n\u0131 kullan\u0131n.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.refs=
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo=oturum tan\u0131mlay\u0131c\u0131s\u0131 {0} alan\u0131 [ {1} ], de\u011fer [ {2} ] taray\u0131c\u0131n\u0131zda JavaScript kullan\u0131larak ula\u015f\u0131labilir
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionidaccessiblebyjavascript.alert.attack={0} alan\u0131\: [ {1} ]
ascanbeta.sessionidaccessiblebyjavascript.alert.logmessage=[Bir oturum tan\u0131mlay\u0131c\u0131s\u0131 {0} ] URL [ {1} ] {2} alan\u0131\: [ {3} ] JavaScript i\u00e7in eri\u015filebilir olabilir  
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name=Session ID Vade S\u00fcresi / Max-Ya\u015f A\u015f\u0131r\u0131 oldu\u011fu
ascanbeta.sessionidexpiry.desc=(URL NULL adl\u0131 parametre alan ayarlayarak de\u011fi\u015ftirilmi\u015f) sunucu taraf\u0131ndan g\u00f6nderilen bir oturum kimli\u011fi \u00e7erez zaman a\u015f\u0131r\u0131 bir s\u00fcre i\u00e7in ge\u00e7erli olacak \u015fekilde ayarlan\u0131r. Bu kullan\u0131c\u0131 unutuyor oturumu e\u011fer \u00e7\u0131k\u0131\u015f i\u015flevselli\u011fi do\u011fru oturumu yok etmez ise, bir sald\u0131rgan taraf\u0131ndan s\u00f6m\u00fcr\u00fclebilir olabilir veya oturum kimli\u011fi ba\u015fka yollarla tehlikeye e\u011fer.     
ascanbeta.sessionidexpiry.soln=1) kullan\u0131n\u0131z uzun s\u00fcre kullan\u0131labilir olmaktan \u00f6nlemek i\u00e7in, bir oturum kimli\u011fi i\u00e7eren bir \u00e7erez ayarlarken ya da 'Max-Ya\u015f' \u00e7erez direktifleri 'Ge\u00e7erlilik'. 2) Bu \u00e7\u0131k\u0131\u015f i\u015flevselli\u011fi var emin olun ve do\u011fru oturumu yok etti\u011fini. 3) Bir oturum kimli\u011fi tehlikeye ise, bu istismar olmayabilir sa\u011flamak i\u00e7in di\u011fer \u00f6nlemleri kullan\u0131n.
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.refs=
ascanbeta.sessionidexpiry.alert.extrainfo=oturum tan\u0131mlay\u0131c\u0131s\u0131 {0} alan\u0131 [ {1} ], de\u011fer [ {2} ] kadar ula\u015f\u0131labilir [ {3} ] (cookie al\u0131nan beri {4} ), oturum tahrip edilmi\u015ftir.
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage=Sorun ke\u015ffedildi hangi url bir oturum a\u00e7ma sayfas\u0131 olarak i\u015faretlendi.
ascanbeta.sessionidexpiry.alert.attack={0} alan\u0131\: [ {1} ]
ascanbeta.sessionidexpiry.alert.logmessage=[Bir oturum tan\u0131mlay\u0131c\u0131s\u0131 {0} ] URL [ {1} ] {2} alan\u0131\: [ {3} ] [kadar eri\u015filebilir {4} ], oturum tahrip edilmi\u015ftir.
ascanbeta.sessionidexpiry.browserclose=taray\u0131c\u0131 yak\u0131n
ascanbeta.sessionidexpiry.timemorethanoneweek=Birden fazla hafta
ascanbeta.sessionidexpiry.timemorethanoneday=Birden fazla g\u00fcn
ascanbeta.sessionidexpiry.timemorethanonehour=Birden fazla saatlik
ascanbeta.sessionidexpiry.timelessthanonehour=Az bir saat
ascanbeta.sessionidexpiry.timeexpired=S\u00fcresi Doldu

ascanbeta.shellshock.name=Uzaktan Kod Y\u00fcr\u00fctme - Shell Shock
ascanbeta.shellshock.desc=Sunucu uzak sald\u0131rganlar\u0131n rasgele kod y\u00fcr\u00fctmesine olanak Bash kabu\u011funun bir s\u00fcr\u00fcm\u00fcn\u00fc \u00e7al\u0131\u015ft\u0131ran 
ascanbeta.shellshock.extrainfo=CVE-2014-6271 Nereden\: OpenSSH sshd de ForceCommand \u00f6zelli\u011fini i\u00e7eren vekt\u00f6rler taraf\u0131ndan g\u00f6sterildi\u011fi gibi uzak sald\u0131rganlar\u0131n, bir haz\u0131rlanm\u0131\u015f bir ortamda yoluyla iste\u011fe ba\u011fl\u0131 kod \u00e7al\u0131\u015ft\u0131rmas\u0131na olanak ortam de\u011fi\u015fkenlerinin de\u011ferlerine fonksiyon tan\u0131mlar\u0131 sonra dizeleri firar GNU Bash ile 4.3 s\u00fcre\u00e7leri, \u00e7evreyi ayar\u0131 Bash y\u00fcr\u00fctme, aka bir ayr\u0131cal\u0131k s\u0131n\u0131r\u0131 boyunca meydana geldi\u011fi mod_cgi ve Apache HTTP Server mod_cgid mod\u00fcl\u00fc mod\u00fclleri, tan\u0131mlanmam\u0131\u015f DHCP istemcileri taraf\u0131ndan y\u00fcr\u00fct\u00fclen komut dosyalar\u0131 ve di\u011fer durumlarda "ShellShock." NOT\: Bu sorunla ilgili d\u00fczeltme, \u00f6zg\u00fcn yanl\u0131\u015f; CVE-2014-7169 hala yanl\u0131\u015f d\u00fczeltme sonras\u0131nda mevcut g\u00fcvenlik a\u00e7\u0131\u011f\u0131n\u0131 kar\u015f\u0131lamak i\u00e7in atanm\u0131\u015ft\u0131r.
ascanbeta.shellshock.soln=En son s\u00fcr\u00fcm\u00fcne sunucuda Bash g\u00fcncelleyin
ascanbeta.shellshock.ref=http\://web.nvd.nist.gov/view/vuln/detail?vulnId\=CVE-2014-6271 http\://www.troyhunt.com/2014/09/everything-you-need-to-know-about .html
ascanbeta.shellshock.timingbased.evidence=Sald\u0131r\u0131, [bir gecikme kullanarak {0} ] milisaniye uyar\u0131lm\u0131\u015f ve tespit edildi

ascanbeta.sqlinjection.mysql.name=SQL Injection - MySQL
ascanbeta.sqlinjection.hypersonic.name=SQL Injection - Hypersonic SQL
ascanbeta.sqlinjection.oracle.name=SQL Injection - Hipersonik SQL
ascanbeta.sqlinjection.postgres.name=SQL Injection - PostgreSQL
ascanbeta.sqlinjection.desc=SQL injection m\u00fcmk\u00fcn olabilir
ascanbeta.sqlinjection.soln=Yerinde istemci taraf\u0131nda do\u011frulama olsa bile, istemci taraf\u0131nda giri\u015fi g\u00fcvenmeyin.  \nGenel olarak, tip onay sunucu taraf\u0131nda t\u00fcm veriler. Uygulama JDBC kullan\u0131yorsa, ge\u00e7ti parametreleri ile PreparedStatement veya CallableStatement kullanmak '?' Uygulama ASP kullan\u0131yorsa, ADO Command g\u00fc\u00e7l\u00fc tip kontrol ve parametreli sorgu ile Objects kullan\u0131n. Veritaban\u0131 Stored Procedures kullan\u0131labilir, bunlar\u0131 kullan\u0131n. Do * de\u011fil * birle\u015ftirdi\u011finiz sakl\u0131 yordam sorgular\u0131 i\u00e7ine dizeleri veya 'exec' exec hemen 'veya e\u015fde\u011fer i\u015flevini kullanmak\! Basit dize birle\u015ftirme kullanarak dinamik SQL sorgular\u0131 olu\u015fturmak etmeyin. Istemciden al\u0131nan t\u00fcm verileri ka\u00e7\u0131\u015f. Izin verilen karakter bir 'beyaz liste' ya da kullan\u0131c\u0131 giri\u015fi izin verilmeyen bir karakter 'kara liste' Uygula. M\u00fcmk\u00fcn olan en az ayr\u0131cal\u0131kl\u0131 veritaban\u0131 kullan\u0131c\u0131 kullanarak en az ayr\u0131cal\u0131k ayr\u0131cal\u0131k uygulay\u0131n. \u00d6zellikle, 'sa' veya 'db sahibi' veritaban\u0131 kullan\u0131c\u0131lar\u0131 kullanmaktan ka\u00e7\u0131n\u0131n. Bu SQL enjeksiyon ortadan kald\u0131rmak, ancak etkisini en aza indirir de\u011fildir. Uygulama i\u00e7in gerekli olan asgari veritaban\u0131 eri\u015fimi verin.
ascanbeta.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
#ascanbeta.sqlinjection.alert.errorbased.attack={1}
ascanbeta.sqlinjection.alert.errorbased.differentiation.attack=Original Value\: [{0}]. Modified Value\: [{1}]. Control Value\: [{2}]
ascanbeta.sqlinjection.alert.booleanbased.attack=Alan\: [ {0} ], de\u011fer [ {1} ]
ascanbeta.sqlinjection.alert.unionbased.attack=[ {0} ] alan\: [ {1} ], de\u011fer [ {2} ]
ascanbeta.sqlinjection.alert.errorbased.extrainfo=RDBMS [ {0} ] olas\u0131l\u0131kla, verilen hata mesaj\u0131 fragman\u0131 [ {1} ] HTML sonu\u00e7lar\u0131nda
ascanbeta.sqlinjection.alert.unionbased.extrainfo=RDBMS [ {0} ] olas\u0131l\u0131kla, verilen B\u0130RL\u0130\u011e\u0130 \u00f6zel mesaj fragman\u0131 [ {1} HTML sonu\u00e7lar\u0131nda]
ascanbeta.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=De\u011fi\u015ftirilmemi\u015f mesaj [HTTP stat\u00fcs\u00fc verdi {0} ], modifiye mesaj verdi HTTP durum [ {1} ]
ascanbeta.sqlinjection.alert.errorbased.differentiation.extrainfo=De\u011fi\u015ftirilmemi\u015f mesaj [HTTP stat\u00fcs\u00fc verdi {0} ], uzunlu\u011fu v\u00fccut [ {1} ], modifiye mesaj HTTP stat\u00fcs\u00fc verdi [ {2} ], uzunluk v\u00fccut [ {3} ]. \u00dc\u00e7\u00fcnc\u00fc (non-SQL enjeksiyonu uyaran de\u011feri) HTTP stat\u00fcs\u00fc verdi [ {4} ], uzunlu\u011fu v\u00fccut [ {5} ]
ascanbeta.sqlinjection.alert.booleanbased.extrainfo=sayfa sonu\u00e7lar\u0131 ba\u015far\u0131yla boolean ko\u015fullar kullan\u0131larak manip\u00fcle edildi [ {0} ] ve [ {1} ]
ascanbeta.sqlinjection.alert.timebased.extrainfo=Sorgu s\u00fcresi parametre de\u011ferini kullanarak kontrol edilebilir [ {0} ], istek [almaya neden olan {1} de\u011feri ile orijinal de\u011fi\u015ftirilmemi\u015f sorgusu [zaman] milisaniye, {2} ] [s\u00fcrd\u00fc {3} ] milisaniye 

ascanbeta.sourcecodedisclosure.desc=Ge\u00e7erli sayfan\u0131n kaynak kodu web sunucusu taraf\u0131ndan if\u015fa edildi

ascanbeta.sourcecodedisclosurecve-2012-1823.name=Kaynak Kodu Bilgilendirme - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.desc=CGI kullanarak \u00e7al\u0131\u015fmak \u00fczere yap\u0131land\u0131r\u0131lm\u0131\u015f Baz\u0131 PHP s\u00fcr\u00fcmleri, do\u011fru PHP kaynak kodu a\u00e7\u0131klama ve keyfi kod y\u00fcr\u00fct\u00fclmesine olanak bir \u00e7\u0131kmam\u0131\u015f "\=" karakteri yoksun sorgu dizeleri dokunmay\u0131n. Bu durumda, PHP dosyas\u0131n\u0131n i\u00e7eri\u011fi web taray\u0131c\u0131s\u0131 do\u011frudan ikram edildi. O da d\u00fcz HTML i\u00e7erebilir ancak bu \u00e7\u0131k\u0131\u015f, genellikle, PHP i\u00e7erecektir.
ascanbeta.sourcecodedisclosurecve-2012-1823.soln=PHP'nin en son kararl\u0131 s\u00fcr\u00fcme y\u00fckseltin veya "RewriteCond" ve "RewriteRule" direktiflerini kullanarak k\u00f6t\u00fc niyetli istekleri s\u00fczmek i\u00e7in Apache web sunucusu ve mod_rewrite mod\u00fcl\u00fcn\u00fc kullanabilirsiniz.

ascanbeta.sourcecodedisclosure.svnbased.name=Kaynak Kod A\u00e7\u0131klama - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln=SVN meta dosyalar\u0131 web sunucusu veya uygulama sunucusu da\u011f\u0131t\u0131lm\u0131\u015f oldu\u011fundan emin olun
ascanbeta.sourcecodedisclosure.svnbased.extrainfo=kaynak kodu [ {0} ] bulunmu\u015ftur [ {1} ]

ascanbeta.sourcecodedisclosurewebinf.name=Kaynak Kod A\u00e7\u0131klama - / WEB-INF klas\u00f6r\u00fc
ascanbeta.sourcecodedisclosurewebinf.desc=Java kaynak kodu WEB-INF klas\u00f6r\u00fcndeki Java s\u0131n\u0131f dosyalar\u0131 web sunucusu taraf\u0131ndan if\u015fa edildi. s\u0131n\u0131f dosyalar\u0131 olabilir \u00e7ok yak\u0131ndan orijinal kaynak kodu ile e\u015fle\u015fen kaynak kodu \u00fcretmek i\u00e7in dis-topland\u0131.  
ascanbeta.sourcecodedisclosurewebinf.soln=web sunucusu bu t\u00fcr kimlik i\u00e7erebilir derlenmi\u015f Java kaynak kodu ve \u00f6zellikleri dosyalar\u0131 gibi hassas bilgiler i\u00e7erdi\u011finden, / WEB-INF klas\u00f6r\u00fcn\u00fc veya web taray\u0131c\u0131lar\u0131 i\u00e7eri\u011fini de\u011fil hizmet i\u00e7in yap\u0131land\u0131r\u0131lmal\u0131d\u0131r. Uygulama ile da\u011f\u0131t\u0131lan Java s\u0131n\u0131flar\u0131 bir "savunma derinlemesine" yakla\u015f\u0131m\u0131 i\u00e7inde ek bir savunma katman\u0131 olarak, Karart\u0131lm\u0131\u015f edilmelidir.

ascanbeta.sourcecodedisclosurewebinf.propertiesfile.name=\u00d6zellikler A\u00e7\u0131klanmas\u0131 Dosya - / WEB-INF klas\u00f6r\u00fc
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.desc=/ WEB-INF klas\u00f6r\u00fcndeki bir Java s\u0131n\u0131f\u0131 \u00f6zellikleri dosyan\u0131n varl\u0131\u011f\u0131n\u0131 a\u00e7\u0131klad\u0131. \u00d6zellikler dosyas\u0131 kamuya a\u00e7\u0131k olmas\u0131 ve genellikle yap\u0131land\u0131rma bilgilerini, uygulama kimlik bilgilerini veya \u015fifreleme anahtarlar\u0131 i\u00e7ermesi i\u00e7in de\u011fildir.   
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.soln=web sunucusu / WEB-INF klas\u00f6r\u00fcn\u00fc veya web taray\u0131c\u0131lar\u0131 i\u00e7eri\u011fini de\u011fil hizmet i\u00e7in yap\u0131land\u0131r\u0131lmal\u0131d\u0131r. Ayr\u0131ca / WEB-INF klas\u00f6r\u00fc kald\u0131rmak m\u00fcmk\u00fcn olabilir.  
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.extrainfo=\u00f6zellikler dosyaya ba\u015fvuru Java s\u0131n\u0131f\u0131 i\u00e7in dis monte Java kaynak kodu bulunmu\u015ftur [ {0} ].

ascanbeta.usernameenumeration.name=Olas\u0131 Ad\u0131 numaraland\u0131rma
ascanbeta.usernameenumeration.desc=Bu ge\u00e7erli ve ge\u00e7ersiz adlar\u0131 verilmektedir HTTP yan\u0131tlar\u0131 farkl\u0131 dayal\u0131 adlar\u0131n\u0131 saymak m\u00fcmk\u00fcn olabilir. Bu b\u00fcy\u00fck \u00f6l\u00e7\u00fcde sisteme kar\u015f\u0131 \u015fifre zorlamas\u0131 sald\u0131r\u0131lar\u0131n ba\u015far\u0131 olas\u0131l\u0131\u011f\u0131n\u0131 art\u0131racakt\u0131r. Yanl\u0131\u015f pozitif bazen ZAP 'Sald\u0131r\u0131 G\u00fcc\u00fc' Se\u00e7ene\u011fi art\u0131rarak minimize edilebilir unutmay\u0131n. El bu asl\u0131nda bir sorun olup olmad\u0131\u011f\u0131n\u0131 teyit etmek i\u00e7in 'Di\u011fer Bilgiler' alan\u0131n\u0131 kontrol edin. 
ascanbeta.usernameenumeration.soln=Bir kullan\u0131c\u0131 ad\u0131 ge\u00e7erli veya ge\u00e7ersiz olup olmad\u0131\u011f\u0131 ayr\u0131nt\u0131lar\u0131n\u0131 if\u015fa etmeyin. \u00d6zellikle, ba\u015far\u0131s\u0131z oturum a\u00e7ma giri\u015fimleri i\u00e7in, ge\u00e7ersiz bir kullan\u0131c\u0131 ve hata iletisinde ge\u00e7ersiz \u015fifre, sayfa ba\u015fl\u0131\u011f\u0131, sayfa i\u00e7eri\u011fi, HTTP ba\u015fl\u0131klar\u0131 veya y\u00f6nlendirme mant\u0131\u011f\u0131 aras\u0131nda ayr\u0131m yoktur.
ascanbeta.usernameenumeration.refs=https\://www.owasp.org/index.php/Testing_for_user_enumeration_ %28O WASP-AT-002 %29 \nhttp\://sebastian-schinzel.de/_download/ifip-sec2011.pdf
ascanbeta.usernameenumeration.alert.extrainfo=[ {0} ] parametresi [ {1} ], bir kullan\u0131c\u0131 olup olmad\u0131\u011f\u0131n\u0131 hakk\u0131nda bilgi s\u0131zd\u0131r\u0131yor. [ {5} ] ge\u00e7erli orijinal ad\u0131 de\u011feri \u00e7\u0131k\u0131\u015f\u0131 farkl\u0131l\u0131klar, [ {2} ], ve ge\u00e7ersiz kullan\u0131c\u0131 ad\u0131 de\u011feri [ {3} ] \u015funlard\u0131r\: [ {4} ]
ascanbeta.usernameenumeration.alert.attack=I\u015fleyin [ {0} ] alan\: [ {1} ] ve monit\u00f6r \u00e7\u0131k\u0131\u015f\u0131 

ascanbeta.paddingoracle.name=Genel Dolgu Oracle
ascanbeta.paddingoracle.desc=By manipulating the padding on an encrypted string, an attacker is able to generate an error message that indicates a likely 'padding oracle' vulnerability. Such a vulnerability can affect any application or framework that uses encryption improperly, such as some versions of ASP.net, Java Server Faces, and Mono. An attacker may exploit this issue to decrypt data and recover encryption keys, potentially viewing and modifying confidential data. This plugin should detect the MS10-070 padding oracle vulnerability in ASP.net if CustomErrors are enabled for that.
ascanbeta.paddingoracle.soln=Update the affected server software, or modify the scripts so that they properly validate encrypted data before attempting decryption.
ascanbeta.paddingoracle.refs=http\://netifera.com/research/\nhttp\://www.microsoft.com/technet/security/bulletin/ms10-070.mspx\nhttp\://www.mono-project.com/Vulnerabilities\#ASP.NET_Padding_Oracle\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799

ascanbeta.elinjection.name=\u0130fade Dil Enjeksiyon
ascanbeta.elinjection.desc=Yaz\u0131l\u0131m, bir \u00fcst bile\u015fenden d\u0131\u015far\u0131dan etkilenmi\u015f giri\u015fini kullanarak Java Server Page (JSP) bir ifade dili (EL) deyimi tamam\u0131n\u0131 veya bir k\u0131sm\u0131n\u0131 olu\u015fturur, ancak n\u00f6tralize veya yanl\u0131\u015f \u00f6nce ama\u00e7lanan EL deyimi de\u011fi\u015ftirebilir \u00f6zel unsurlar\u0131 n\u00f6tralize de\u011fil Bu y\u00fcr\u00fct\u00fcl\u00fcr. Bahar 3.0.5 belirli s\u00fcr\u00fcmlerinde ve \u00f6nceki etkin EL enjeksiyona herhangi bir uygulama maruz \u0130fade Dil etiketleri iki kez de\u011ferlendirilecek hangi bir g\u00fcvenlik a\u00e7\u0131\u011f\u0131 (CVE-2011-2730) vard\u0131. Ancak, hatta daha sonraki s\u00fcr\u00fcmleri i\u00e7in, bu zay\u0131fl\u0131k konfig\u00fcrasyonuna ba\u011fl\u0131 hala m\u00fcmk\u00fcnd\u00fcr.
ascanbeta.elinjection.soln=G\u00fcvenilmeyen girdi kar\u015f\u0131 veri do\u011frulama en iyi uygulamalar\u0131 ger\u00e7ekle\u015ftirmek ve hi\u00e7bir meta de\u011ferlendirilmesinden \u00f6nce kullan\u0131c\u0131 i\u00e7eri\u011finde terc\u00fcman taraf\u0131ndan bulunan, b\u00f6ylece veriler, EL katmanda geldi\u011finde o \u00e7\u0131k\u0131\u015f kodlama uygulan\u0131r sa\u011flamak. alg\u0131lamak i\u00e7in en belirgin desenler $ {ve \# {i\u00e7erir, ancak kodlamak veya bu verileri par\u00e7alara m\u00fcmk\u00fcn olabilir.
ascanbeta.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection http\://cwe.mitre.org/data/definitions/917.html

