#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanbeta.desc=\u0938\u0915\u094d\u0930\u093f\u092f \u0938\u094d\u0915\u0948\u0928 \u0928\u093f\u092f\u092e - \u092c\u0940\u091f\u093e

ascanbeta.backupfiledisclosure.name=\u092c\u0948\u0915\u0905\u092a \u092b\u093c\u093e\u0907\u0932 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923
ascanbeta.backupfiledisclosure.desc=\u092b\u093c\u093e\u0907\u0932 \u0915\u0940 \u090f\u0915 \u092c\u0948\u0915\u0905\u092a \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u092c\u0924\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e
ascanbeta.backupfiledisclosure.soln=\u0928\u0939\u0940\u0902 \u092b\u093c\u093e\u0907\u0932\u094b\u0902 \u092e\u0947\u0902-\u0938\u094d\u0935\u0938\u094d\u0925\u093e\u0928\u0940 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0938\u0902\u092a\u093e\u0926\u093f\u0924 \u0915\u0930\u0947\u0902, \u0914\u0930 \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u0938\u0902\u092f\u0941\u0915\u094d\u0924 \u0930\u093e\u0937\u094d\u091f\u094d\u0930 \u0915\u0947 \u0906\u0935\u0936\u094d\u092f\u0915 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 (\u091b\u0941\u092a\u0940 \u0939\u0941\u0908 \u092b\u093c\u093e\u0907\u0932\u094b\u0902 \u0938\u0939\u093f\u0924) \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0938\u0947 \u0928\u093f\u0915\u093e\u0932 \u0926\u093f\u090f \u091c\u093e\u0924\u0947 \u0939\u0948\u0902\u0964
ascanbeta.backupfiledisclosure.evidence=[{0}] \u0915\u093e \u092c\u0948\u0915\u0905\u092a [{1}] \u092a\u0930 \u0909\u092a\u0932\u092c\u094d\u0927 \u0939\u0948

ascanbeta.crossdomain.name=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 Misconfiguration
#the refs cannot be customised for each sub-category (Adobe, Silverlight, etc)
ascanbeta.crossdomain.refs=http\://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html http\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf http\://msdn.microsoft.com/en-US/library/cc197955%28v\=vs.95%29.aspx http\://msdn.microsoft.com/en-us/library/cc838250%28v\=vs.95%29.aspx
ascanbeta.crossdomain.adobe.read.name=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 Misconfiguration - \u090f\u0921\u094b\u092c - \u092a\u0922\u093c\u0947\u0902
ascanbeta.crossdomain.adobe.send.name=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 Misconfiguration - \u090f\u0921\u094b\u092c - \u092a\u0922\u093c\u0947\u0902
ascanbeta.crossdomain.adobe.desc=\u092b\u094d\u0932\u0948\u0936/Silverlight \u0906\u0927\u093e\u0930\u093f\u0924 \u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u0907\u091f \u0905\u0928\u0941\u0930\u094b\u0927 \u091c\u093e\u0932\u0938\u093e\u091c\u0940 \u0938\u0902\u092d\u0935, \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u090f\u0915 \u092e\u093f\u0938\u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930\u0947\u0936\u0928 \u0915\u0947 \u0915\u093e\u0930\u0923 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 
ascanbeta.crossdomain.adobe.read.soln=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u092a\u0920\u0928 \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930, \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0935\u0940\u0915\u0943\u0924 \u0921\u094b\u092e\u0947\u0928 \u0915\u0940 \u0938\u0942\u091a\u0940 \u0915\u094b \u0938\u0940\u092e\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f crossdomain.xml \u092b\u093c\u093e\u0907\u0932 \u0915\u094b \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u0930\u0947\u0902 < \u092f\u0939 domain\="example.com \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0902 \u092a\u0939\u0941\u0901\u091a-\u0938\u0947-" >\u0964 \u0906\u092a \u0915\u0947\u0935\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a \u0926\u0947\u0928\u093e \u091a\u093e\u0939\u093f\u090f "*" (\u0938\u092d\u0940 \u0921\u094b\u092e\u0947\u0928) \u092f\u0926\u093f \u0906\u092a \u0906\u0936\u094d\u0935\u0938\u094d\u0924 \u0939\u0948\u0902 \u0915\u093f \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u0947 \u0915\u093f\u0938\u0940 \u092d\u0940 \u092a\u0939\u0941\u0901\u091a-\u0928\u093f\u092f\u0902\u0924\u094d\u0930\u093f\u0924, \u0935\u094d\u092f\u0915\u094d\u0924\u093f\u0917\u0924 \u092f\u093e \u0928\u093f\u091c\u0940 \u0921\u0947\u091f\u093e \u0939\u094b\u0938\u094d\u091f \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u093e \u0939\u0948\u0964
ascanbeta.crossdomain.adobe.read.extrainfo=\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u093f\u0938\u0940 \u092d\u0940 \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0921\u094b\u092e\u0947\u0928 \u0938\u0947 \u0907\u0938 \u0921\u094b\u092e\u0947\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u0935\u093e \u0915\u0940 \u092b\u094d\u0932\u0948\u0936/Silverlight \u0918\u091f\u0915\u094b\u0902 \u0938\u0947 \u0939\u094b\u0928\u0947 \u0935\u093e\u0932\u0947 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u092a\u0922\u093c\u0947\u0902 \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u0921\u0947\u091f\u093e \u092a\u0930\u092e\u093f\u091f\u0964 \u0905\u0917\u0930 \u0936\u093f\u0915\u093e\u0930 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0938 \u0938\u0947\u0935\u093e \u092e\u0947\u0902 \u0932\u0949\u0917 \u0907\u0928 \u0915\u093f\u092f\u093e \u0939\u0948, \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u092a\u0922\u093c\u0947\u0902 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u0936\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0938\u0902\u0938\u093e\u0927\u093f\u0924 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902, \u0914\u0930 \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u090f\u0915 \u0905\u0928\u0927\u093f\u0915\u0943\u0924 \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0935\u0947\u092c \u0938\u093e\u0907\u091f, \u092a\u0940\u0921\u093c\u093f\u0924 \u0915\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0938\u0947 \u0921\u0947\u091f\u093e \u092e\u0947\u0902 \u092a\u0930\u093f\u0923\u093e\u092e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964 \u092f\u0939 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947 \u0905\u0917\u0930 \u090f\u0915 \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 \u0906\u0927\u093e\u0930\u093f\u0924 \u0915\u094d\u0930\u093f\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0909\u092a\u092f\u094b\u0917 \u092e\u0947\u0902 \u0939\u0948 \u090f\u0915 \u092e\u0941\u0926\u094d\u0926\u093e \u0939\u094b \u091c\u093e\u0928\u0947 \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0939\u0948\u0964 
ascanbeta.crossdomain.adobe.send.soln=Crossdomain.xml \u0915\u094b \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0921\u094b\u092e\u0947\u0928 \u092c\u0928\u093e\u0928\u0947 \u0915\u0947 \u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u092d\u0947\u091c\u0947\u0902 (\u0932\u0947\u0915\u093f\u0928 \u091c\u0930\u0942\u0930\u0940 \u0928\u0939\u0940\u0902 \u0915\u093f \u092a\u0922\u093c\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f) \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0940 \u091c\u093e\u0924\u0940 \u0939\u0948 \u0915\u093f \u0915\u0940 \u0938\u0942\u091a\u0940 \u0915\u094b \u0938\u0940\u092e\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092b\u093c\u093e\u0907\u0932 \u0915\u093e \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930, < \u092f\u0939 domain\="example.com \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0902-http-\u0905\u0928\u0941\u0930\u094b\u0927-\u0939\u0947\u0921\u0930-\u0938\u0947" \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 "\u092a\u094d\u0930\u093e\u0927\u093f\u0915\u0930\u0923, \u090f\u0915\u094d\u0938-Blahh" \= >\u0964 \u0906\u092a \u0915\u0947\u0935\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a \u0926\u0947\u0928\u093e \u091a\u093e\u0939\u093f\u090f "*" (\u0938\u092d\u0940 \u0921\u094b\u092e\u0947\u0928) \u092f\u0926\u093f \u0906\u092a \u0906\u0936\u094d\u0935\u0938\u094d\u0924 \u0939\u0948\u0902 \u0915\u093f \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u094d\u0930\u0949\u0938 \u0938\u093e\u0907\u091f \u0905\u0928\u0941\u0930\u094b\u0927 \u091c\u093e\u0932\u0938\u093e\u091c\u0940 (CSRF \u0915\u094b) \u0915\u092e\u091c\u094b\u0930 \u0928\u0939\u0940\u0902 \u0939\u0948 \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u0947 \u0939\u092e\u0932\u094b\u0902\u0964
ascanbeta.crossdomain.adobe.send.extrainfo=\u092a\u0930\u092e\u093f\u091f \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u0921\u0947\u091f\u093e \u092d\u0947\u091c\u0947\u0902 (\u0932\u0947\u0915\u093f\u0928 \u091c\u0930\u0942\u0930\u0940 \u0928\u0939\u0940\u0902 \u0915\u093f \u092a\u0922\u093c\u0947\u0902) \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0930\u0924\u093e \u0939\u0948 \u092b\u094d\u0932\u0948\u0936/Silverlight \u0918\u091f\u0915\u094b\u0902 \u0938\u0947 \u0939\u094b\u0928\u0947 \u0935\u093e\u0932\u0947 \u0915\u093f\u0938\u0940 \u092d\u0940 \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0921\u094b\u092e\u0947\u0928 \u0938\u0947 \u0907\u0938 \u0921\u094b\u092e\u0947\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u0935\u093e \u0915\u0940\u0964 \u092f\u0926\u093f \u0936\u093f\u0915\u093e\u0930 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0938 \u0938\u0947\u0935\u093e \u092e\u0947\u0902 \u0932\u0949\u0917 \u0907\u0928 \u0915\u093f\u092f\u093e \u0939\u0948, \u0924\u094b \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u0936\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0938\u0902\u0938\u093e\u0927\u093f\u0924 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902, \u0914\u0930 \u0915\u094d\u0930\u0949\u0938 \u0938\u093e\u0907\u091f \u0905\u0928\u0941\u0930\u094b\u0927 \u091c\u093e\u0932\u0938\u093e\u091c\u0940 (CSRF) \u092a\u094d\u0930\u0915\u093e\u0930 \u0939\u092e\u0932\u094b\u0902, \u092a\u0940\u0921\u093c\u093f\u0924 \u0915\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u092a\u0930\u093f\u0923\u093e\u092e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902 \u092d\u0947\u091c\u0928\u0947 \u0915\u0947\u0964 \u092f\u0939 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947 \u0905\u0917\u0930 \u090f\u0915 \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 \u0906\u0927\u093e\u0930\u093f\u0924 \u0915\u094d\u0930\u093f\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0909\u092a\u092f\u094b\u0917 \u092e\u0947\u0902 \u0939\u0948 \u090f\u0915 \u092e\u0941\u0926\u094d\u0926\u093e \u0939\u094b \u091c\u093e\u0928\u0947 \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0939\u0948\u0964
ascanbeta.crossdomain.silverlight.name=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 Misconfiguration - Silverlight
ascanbeta.crossdomain.silverlight.desc=\u092b\u094d\u0932\u0948\u0936/Silverlight \u0906\u0927\u093e\u0930\u093f\u0924 \u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u0907\u091f \u0905\u0928\u0941\u0930\u094b\u0927 \u091c\u093e\u0932\u0938\u093e\u091c\u0940 \u0938\u0902\u092d\u0935, \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u090f\u0915 \u092e\u093f\u0938\u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930\u0947\u0936\u0928 \u0915\u0947 \u0915\u093e\u0930\u0923 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 
ascanbeta.crossdomain.silverlight.soln=\u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u092a\u0920\u0928 \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930, \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0935\u0940\u0915\u0943\u0924 \u0921\u094b\u092e\u0947\u0928 \u0915\u0940 \u0938\u0942\u091a\u0940 \u0915\u094b \u0938\u0940\u092e\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f crossdomain.xml \u092b\u093c\u093e\u0907\u0932 \u0915\u094b \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u0930\u0947\u0902 < \u092f\u0939 domain\="example.com \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0902 \u092a\u0939\u0941\u0901\u091a-\u0938\u0947-" >\u0964 \u0906\u092a \u0915\u0947\u0935\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a \u0926\u0947\u0928\u093e \u091a\u093e\u0939\u093f\u090f "*" (\u0938\u092d\u0940 \u0921\u094b\u092e\u0947\u0928) \u092f\u0926\u093f \u0906\u092a \u0906\u0936\u094d\u0935\u0938\u094d\u0924 \u0939\u0948\u0902 \u0915\u093f \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u0947 \u0915\u093f\u0938\u0940 \u092d\u0940 \u092a\u0939\u0941\u0901\u091a-\u0928\u093f\u092f\u0902\u0924\u094d\u0930\u093f\u0924, \u0935\u094d\u092f\u0915\u094d\u0924\u093f\u0917\u0924 \u092f\u093e \u0928\u093f\u091c\u0940 \u0921\u0947\u091f\u093e \u0939\u094b\u0938\u094d\u091f \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u093e \u0939\u0948\u0964
ascanbeta.crossdomain.silverlight.extrainfo=\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u093f\u0938\u0940 \u092d\u0940 \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0921\u094b\u092e\u0947\u0928 \u0938\u0947 \u0907\u0938 \u0921\u094b\u092e\u0947\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u0935\u093e \u0915\u0940 \u092b\u094d\u0932\u0948\u0936/Silverlight \u0918\u091f\u0915\u094b\u0902 \u0938\u0947 \u0939\u094b\u0928\u0947 \u0935\u093e\u0932\u0947 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u092a\u0922\u093c\u0947\u0902 \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0915\u094d\u0930\u0949\u0938-\u0921\u094b\u092e\u0947\u0928 \u0921\u0947\u091f\u093e \u092a\u0930\u092e\u093f\u091f\u0964 \u0905\u0917\u0930 \u0936\u093f\u0915\u093e\u0930 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0938 \u0938\u0947\u0935\u093e \u092e\u0947\u0902 \u0932\u0949\u0917 \u0907\u0928 \u0915\u093f\u092f\u093e \u0939\u0948, \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u092a\u0922\u093c\u0947\u0902 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u0936\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0938\u0902\u0938\u093e\u0927\u093f\u0924 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902, \u0914\u0930 \u0907\u0938 \u0938\u0947\u0935\u093e \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u090f\u0915 \u0905\u0928\u0927\u093f\u0915\u0943\u0924 \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0935\u0947\u092c \u0938\u093e\u0907\u091f, \u092a\u0940\u0921\u093c\u093f\u0924 \u0915\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0938\u0947 \u0921\u0947\u091f\u093e \u092e\u0947\u0902 \u092a\u0930\u093f\u0923\u093e\u092e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964 \u092f\u0939 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947 \u0905\u0917\u0930 \u090f\u0915 \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 \u0906\u0927\u093e\u0930\u093f\u0924 \u0915\u094d\u0930\u093f\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0909\u092a\u092f\u094b\u0917 \u092e\u0947\u0902 \u0939\u0948 \u090f\u0915 \u092e\u0941\u0926\u094d\u0926\u093e \u0939\u094b \u091c\u093e\u0928\u0947 \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0939\u0948\u0964 

ascanbeta.heartbleed.name=Heartbleed \u0913\u092a\u0928\u090f\u0938\u090f\u0938\u090f\u0932 \u092d\u0947\u0926\u094d\u092f\u0924\u093e
ascanbeta.heartbleed.desc=TLS \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u092e\u0947\u0902 \u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0938\u0902\u0935\u0947\u0926\u0928\u0936\u0940\u0932 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u092c\u0924\u093e\u0928\u0947 \u091c\u094b \u0926\u0942\u0930\u0938\u094d\u0925 \u092a\u094d\u0930\u0915\u094d\u0930\u093f\u092f\u093e \u0938\u094d\u092e\u0943\u0924\u093f \u0917\u0922\u093c\u0940 \u0917\u0908 \u092a\u0948\u0915\u0947\u091f \u090f\u0915 \u092c\u092b\u0930 \u0905\u0924\u093f \u092a\u0922\u093c\u0928\u0947 \u0915\u094b \u091f\u094d\u0930\u093f\u0917\u0930 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u0902\u0935\u0947\u0926\u0928\u0936\u0940\u0932 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0915\u094b \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0939\u092e\u0932\u093e\u0935\u0930\u094b\u0902 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948, \u0913\u092a\u0928\u090f\u0938\u090f\u0938\u090f\u0932 1.0.1 \u0915\u0947 \u092a\u0939\u0932\u0947 1.0.1g \u0926\u093f\u0932 \u0915\u0940 \u0927\u0921\u093c\u0915\u0928 \u090f\u0915\u094d\u0938\u091f\u0947\u0902\u0936\u0928 \u0915\u0947 \u092a\u0948\u0915\u0947\u091f, \u0920\u0940\u0915 \u0924\u0930\u0939 \u0938\u0947 \u0939\u0948\u0902\u0921\u0932 \u0928\u0939\u0940\u0902\u0964
ascanbeta.heartbleed.soln=\u0913\u092a\u0928\u090f\u0938\u090f\u0938\u090f\u0932 1.0.1g \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0926\u094d\u092f\u0924\u0928 \u092f\u093e \u092c\u093e\u0926 \u092e\u0947\u0902\u0964 HTTPS \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930 \u092a\u0941\u0928\u0903 \u091c\u093e\u0930\u0940\u0964 \u092a\u0930\u093f\u0935\u0930\u094d\u0924\u0928 \u0905\u0938\u092e\u092e\u093f\u0924 \u0928\u093f\u091c\u0940 \u0915\u0941\u0902\u091c\u093f\u092f\u094b\u0902 \u0914\u0930 \u0938\u093e\u091d\u093e \u0917\u0941\u092a\u094d\u0924 \u0915\u0941\u0902\u091c\u0940, \u0915\u0947 \u092c\u093e\u0926 \u0938\u0947 \u092f\u0947, \u0938\u0930\u094d\u0935\u0930 \u0932\u0949\u0917 \u092b\u093e\u0907\u0932 \u092e\u0947\u0902 \u0938\u092e\u091d\u094c\u0924\u0947 \u0915\u0940 \u0915\u094b\u0908 \u0938\u092c\u0942\u0924 \u0915\u0947 \u0938\u093e\u0925 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
ascanbeta.heartbleed.extrainfo=\u0907\u0938 \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0947 {0} \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0938\u0930\u094d\u0935\u0930, \u0938\u0947 exfiltrating \u0921\u0947\u091f\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u0915\u0940 \u092a\u0941\u0937\u094d\u091f\u093f \u0915\u0940 \u0925\u0940\u0964 \u092f\u0939 \u090f\u0915 \u091d\u0942\u0920\u0940 \u0938\u0915\u093e\u0930\u093e\u0924\u094d\u092e\u0915 \u0939\u094b\u0928\u0947 \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0928\u0939\u0940\u0902 \u0939\u0948\u0964

ascanbeta.HTTPParamPoll.name=HTTP \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u094d\u0930\u0926\u0942\u0937\u0923 \u0938\u094d\u0915\u0948\u0928\u0930
ascanbeta.HTTPParamPoll.desc=HTTP \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u094d\u0930\u0926\u0942\u0937\u0923 (HPP) \u0939\u092e\u0932\u094b\u0902 \u0938\u0947 \u092e\u093f\u0932\u0915\u0930 \u0905\u0928\u094d\u092f \u092e\u094c\u091c\u0942\u0926\u093e \u092e\u093e\u0928\u0915\u094b\u0902 \u092e\u0947\u0902 \u090f\u0928\u094d\u0915\u094b\u0921\u0947\u0921 \u0915\u094d\u0935\u0947\u0930\u0940 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0938\u0940\u092e\u093e\u0902\u0915\u0915 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0932\u0917\u093e\u0928\u0947 \u0915\u093e\u0964 \u0905\u0917\u0930 \u090f\u0915 \u0935\u0947\u092c \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0920\u0940\u0915 \u0938\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0915\u0947 \u0907\u0928\u092a\u0941\u091f sanitize \u0928\u0939\u0940\u0902, \u090f\u0915 \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0915\u0947 \u0924\u0930\u094d\u0915 \u092f\u093e \u0924\u094b \u0938\u0930\u094d\u0935\u0930-\u0938\u093e\u0907\u0921 \u092f\u093e \u0915\u094d\u0932\u093e\u0907\u0902\u091f-\u0938\u093e\u0907\u0921 \u0939\u092e\u0932\u094b\u0902 \u0915\u094b \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964 HPP \u0939\u092e\u0932\u094b\u0902 \u0915\u093e \u090f\u0915 \u0928\u0924\u0940\u091c\u093e \u092f\u0939 \u0939\u0948 \u0915\u093f \u0939\u092e\u0932\u093e\u0935\u0930 \u0938\u0902\u092d\u0935\u0924\u0903 \u092e\u094c\u091c\u0942\u0926\u093e \u0939\u093e\u0930\u094d\u0921 \u0915\u094b\u0921\u093f\u0924 HTTP \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093f\u0938\u0940 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0935\u094d\u092f\u0935\u0939\u093e\u0930 \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924, \u0907\u0928\u092a\u0941\u091f \u0938\u0924\u094d\u092f\u093e\u092a\u0928 \u091a\u094c\u0915\u093f\u092f\u094b\u0902, \u092c\u093e\u0908\u092a\u093e\u0938 \u0914\u0930 \u0924\u0915 \u092a\u0939\u0941\u0901\u091a\u0928\u0947 \u0914\u0930 \u0938\u0902\u092d\u0935\u0924\u0903 \u091a\u0930 \u0915\u093f \u092a\u094d\u0930\u0924\u094d\u092f\u0915\u094d\u0937 \u092a\u0939\u0941\u0901\u091a \u0938\u0947 \u092c\u093e\u0939\u0930 \u0939\u094b \u0938\u0915\u0924\u0947 \u0939\u0948\u0902 \u092b\u093e\u092f\u0926\u093e \u0909\u0920\u093e\u0928\u0947 \u0915\u094b \u0913\u0935\u0930\u0930\u093e\u0907\u0921 \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964
ascanbeta.HTTPParamPoll.sol=\u0920\u0940\u0915 \u0938\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u0915\u0947 \u0932\u093f\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0938\u0940\u092e\u093e\u0902\u0915\u0915 sanitize
ascanbeta.HTTPParamPoll.alert.attack=HTTP \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u094d\u0930\u0926\u0942\u0937\u0923
ascanbeta.HTTPParamPoll.extrainfo=http\://www.google.com/search?q\=http+parameter+pollution

ascanbeta.insecurehttpmethod.name=\u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 HTTP \u0935\u093f\u0927\u093f
ascanbeta.insecurehttpmethod.detailed.name=\u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 HTTP \u0935\u093f\u0927\u093f - {0}
ascanbeta.insecurehttpmethod.desc=\u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 HTTP \u0935\u093f\u0927\u093f [{0}] \u0907\u0938 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0947 \u0932\u093f\u090f \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930\u0947\u0936\u0928, \u0914\u0930 \u0905\u0902\u0924\u0930\u094d\u0928\u093f\u0939\u093f\u0924 \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0940 \u0938\u0947\u0935\u093e \u0915\u0947 \u0932\u093f\u090f \u091c\u093f\u092e\u094d\u092e\u0947\u0926\u093e\u0930, \u0915\u0947 \u0906\u0927\u093e\u0930 \u092a\u0930 \u092f\u0939 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 \u092f\u093e \u0926\u094b\u0939\u0928 \u0928\u0939\u0940\u0902 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0939\u0948\u0964 \u091f\u094d\u0930\u0948\u0915 \u0914\u0930 \u091f\u094d\u0930\u0947\u0938 \u0935\u093f\u0927\u093f\u092f\u093e\u0901 \u0906\u0915\u094d\u0930\u092e\u0923\u0915\u0930\u094d\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e, \u092d\u0932\u0947 \u0939\u0940 \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 ''HttpOnly'' \u0927\u094d\u0935\u091c \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0939\u0948 \u092a\u094d\u0930\u093e\u0927\u093f\u0915\u093e\u0930 \u091f\u094b\u0915\u0928/\u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 \u090f\u0915 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e, \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e\u0964 \u0907\u0938 \u0939\u092e\u0932\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u092b\u0932 \u0939\u094b\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0906\u092e \u0924\u094c\u0930 \u092a\u0930 \u090f\u0915 \u092c\u0921\u093c\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930, \u092f\u093e \u090f\u0915 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0939\u0948 \u091c\u094b \u0939\u0948 \u090f\u0915 \u090f\u0915 \u0939\u0940 \u092e\u0942\u0932 \u0928\u0940\u0924\u093f (\u092d\u0947\u0926\u094d\u092f\u0924\u093e \u092c\u093e\u092f\u092a\u093e\u0938 \u0936\u0930\u093e\u092c\u0940) \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964 ''\u0915\u0928\u0947\u0915\u094d\u091f'' \u0935\u093f\u0927\u093f \u090f\u0915 \u0935\u0947\u092c \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0926\u094d\u0935\u093e\u0930\u093e \u0924\u0943\u0924\u0940\u092f \u092a\u0915\u094d\u0937 \u0915\u0940 \u0935\u0947\u092c\u0938\u093e\u0907\u091f\u094b\u0902 \u092f\u093e \u0938\u0947\u0935\u093e\u0913\u0902 \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 HTTP \u0938\u0941\u0930\u0902\u0917 \u092c\u0928\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e\u0964
ascanbeta.insecurehttpmethod.trace.exploitable.desc=\u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 HTTP \u0935\u093f\u0927\u093f [{0}] \u0907\u0938 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948, \u0914\u0930 \u0926\u094b\u0939\u0928 \u0939\u0948\u0964 \u091f\u094d\u0930\u0948\u0915 \u0914\u0930 \u091f\u094d\u0930\u0947\u0938 \u0935\u093f\u0927\u093f\u092f\u093e\u0901 \u0906\u0915\u094d\u0930\u092e\u0923\u0915\u0930\u094d\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e, \u092d\u0932\u0947 \u0939\u0940 \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 ''HttpOnly'' \u0927\u094d\u0935\u091c \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0939\u0948 \u092a\u094d\u0930\u093e\u0927\u093f\u0915\u093e\u0930 \u091f\u094b\u0915\u0928/\u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940 \u090f\u0915 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e, \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e\u0964 \u0907\u0938 \u0939\u092e\u0932\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u092b\u0932 \u0939\u094b\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0906\u092e \u0924\u094c\u0930 \u092a\u0930 \u090f\u0915 \u092c\u0921\u093c\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930, \u092f\u093e \u090f\u0915 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0939\u0948 \u091c\u094b \u0939\u0948 \u090f\u0915 \u090f\u0915 \u0939\u0940 \u092e\u0942\u0932 \u0928\u0940\u0924\u093f (\u092d\u0947\u0926\u094d\u092f\u0924\u093e \u092c\u093e\u092f\u092a\u093e\u0938 \u0936\u0930\u093e\u092c\u0940) \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964
ascanbeta.insecurehttpmethod.connect.exploitable.desc=\u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 HTTP \u0935\u093f\u0927\u093f [{0}] \u0907\u0938 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948, \u0914\u0930 \u0926\u094b\u0939\u0928 \u0939\u0948\u0964 \u092f\u0939 \u0938\u0947\u0935\u093e \u0907\u0938 HTTP \u092a\u0926\u094d\u0927\u0924\u093f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947, \u090f\u0915 \u0924\u0940\u0938\u0930\u0940 \u092a\u093e\u0930\u094d\u091f\u0940 \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 tunneled \u0938\u0949\u0915\u0947\u091f \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u0938\u094d\u0925\u093e\u092a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u092a\u093e\u092f\u093e \u0925\u093e\u0964  \u092f\u0939 \u0938\u0947\u0935\u093e \u090f\u0915 \u0905\u0928\u093e\u092e \u0938\u094d\u092a\u0948\u092e \u0930\u093f\u0932\u0947 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902, \u092f\u093e \u090f\u0915 \u0935\u0947\u092c \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0928\u0947\u091f\u0935\u0930\u094d\u0915 \u092a\u094d\u0930\u0924\u093f\u092c\u0902\u0927\u094b\u0902 \u0915\u094b \u0926\u0930\u0915\u093f\u0928\u093e\u0930, \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0939\u094b\u0917\u0940\u0964 \u092f\u0939 \u092d\u0940 \u0907\u0938\u0947 \u090f\u0915 tunneled \u0935\u0940\u092a\u0940\u090f\u0928, \u092a\u094d\u0930\u092d\u093e\u0935\u0940 \u0922\u0902\u0917 \u0938\u0947 \u0905\u0935\u093f\u0936\u094d\u0935\u0938\u094d\u0924 \u0918\u091f\u0915\u094b\u0902 \u0915\u094b \u0936\u093e\u092e\u093f\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0928\u0947\u091f\u0935\u0930\u094d\u0915 \u092a\u0930\u093f\u0927\u093f \u0915\u093e \u0935\u093f\u0938\u094d\u0924\u093e\u0930 \u0938\u094d\u0925\u093e\u092a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948\u0964 
ascanbeta.insecurehttpmethod.extrainfo=\u0928\u093f\u092e\u094d\u0928 HTTP \u0924\u0930\u0940\u0915\u094b\u0902 \u0907\u0938 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0947 \u0932\u093f\u090f \u0938\u0915\u094d\u0937\u092e \u0935\u093f\u0915\u0932\u094d\u092a \u0935\u093f\u0927\u093f \u0916\u0941\u0932\u093e\u0938\u093e \u0915\u093f\u092f\u093e\: [{0}]
ascanbeta.insecurehttpmethod.trace.exploitable.extrainfo=\u090f\u0915 \u091f\u094d\u0930\u0947\u0938 \u0905\u0928\u0941\u0930\u094b\u0927 \u090f\u0915 \u0915\u0938\u094d\u091f\u092e \u0915\u0941\u0915\u0940 \u092e\u093e\u0928 [{0}] \u0915\u0947 \u0938\u093e\u0925 \u0907\u0938 \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0947 \u0932\u093f\u090f \u092d\u0947\u091c\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u092f\u0939 \u0915\u0941\u0915\u0940 \u092e\u093e\u0928 HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u092e\u0947\u0902, \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0905\u0928\u0941\u0930\u0941\u092a \u0916\u0941\u0932\u093e\u0938\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.insecurehttpmethod.connect.exploitable.extrainfo=\u0915\u0928\u0947\u0915\u094d\u091f \u0935\u093f\u0927\u093f [{0}], \u090f\u0915 \u0938\u0949\u0915\u0947\u091f \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u0926\u094d\u0935\u093e\u0930\u093e \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0938\u094d\u0925\u093e\u092a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.insecurehttpmethod.soln=\u0910\u0938\u0947 \u091f\u094d\u0930\u0948\u0915, \u091f\u094d\u0930\u0947\u0938, \u0914\u0930 \u0915\u0928\u0947\u0915\u094d\u091f \u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0924\u0930\u0940\u0915\u0947 \u0915\u094b \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0905\u0915\u094d\u0937\u092e \u0915\u0930\u0947\u0902, \u0914\u0930 \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u0905\u0902\u0924\u0930\u094d\u0928\u093f\u0939\u093f\u0924 \u0938\u0947\u0935\u093e \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0924\u0930\u0940\u0915\u0947 \u0915\u093e \u0938\u092e\u0930\u094d\u0925\u0928 \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u093e\u0964

ascanbeta.ldapinjection.name=LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanbeta.ldapinjection.desc=LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 \u092f\u0939 \u090f\u0915 \u0939\u092e\u0932\u093e\u0935\u0930 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0928\u093f\u092f\u0902\u0924\u094d\u0930\u0923\u094b\u0902 \u0915\u094b \u092c\u093e\u092f\u092a\u093e\u0938 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0914\u0930 \u0926\u0947\u0916\u0928\u0947 \u0914\u0930 LDAP \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u092e\u0947\u0902 \u092e\u0928\u092e\u093e\u0928\u0947 \u0922\u0902\u0917 \u0938\u0947 \u0921\u0947\u091f\u093e \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 
ascanbeta.ldapinjection.soln=\u092e\u093e\u0928\u094d\u092f \u0915\u0930\u0947\u0902 \u0914\u0930/\u092f\u093e \u0907\u0938\u0947 \u0915\u093f\u0938\u0940 LDAP \u0915\u094d\u0935\u0947\u0930\u0940 \u092c\u0928\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0928\u0947 \u0938\u0947 \u092a\u0939\u0932\u0947 \u0938\u092d\u0940 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u0938\u0947 \u092c\u091a\u0964  \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947, \u0928\u093f\u092e\u094d\u0928 \u0935\u0930\u094d\u0923\u094b\u0902 (\u092f\u093e \u0938\u0902\u092f\u094b\u091c\u0928\u094b\u0902) \u0915\u093e\u0932\u0940 \u0938\u0942\u091a\u0940 \u092e\u0947\u0902 \u0921\u093e\u0932\u093e \u091c\u093e\u0928\u093e \u091a\u093e\u0939\u093f\u090f\: & |\! < > \= ~\= >\= <\= * ( ) , + - " ' ; \\ / NUL \u091a\u0930\u093f\u0924\u094d\u0930 
ascanbeta.ldapinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A9 http\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection https\://www.owasp.org/index.php/LDAP_injection
#ascanbeta.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.extrainfo=\u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 [{0}] [{1}] [{2}] \u092a\u0930 LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928, \u090f\u0915 \u0939\u092e\u0932\u0947 LDAP \u092e\u0947\u091f\u093e-\u0909\u092a\u091c \u0915\u0947 \u0935\u0930\u094d\u0923\u094b\u0902 \u0915\u0947 \u0938\u093e\u0925 [{3}], [{4}] \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 [{5}], \u091c\u094b \u092e\u0942\u0932 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0909\u092a\u0938\u094d\u0925\u093f\u0924 \u0928\u0939\u0940\u0902 \u0925\u093e \u091c\u093e\u0928\u093e \u091c\u093e\u0924\u093e \u0939\u0948 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.ldapinjection.alert.evidence={0}
ascanbeta.ldapinjection.booleanbased.alert.extrainfo=\u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 [{0}] [{1}] [{2}] \u092a\u0930 \u0924\u093e\u0930\u094d\u0915\u093f\u0915 \u0930\u0942\u092a \u0938\u0947 \u092c\u0930\u093e\u092c\u0930 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f [{3}], \u0914\u0930 ''\u091d\u0942\u0920\u0947'' \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f [{4}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u0915\u092e\u091c\u094b\u0930 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
#ascanbeta.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanbeta.ldapinjection.alert.attack=\u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0938\u0947\u091f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f [{1}] [{0}]
ascanbeta.ldapinjection.booleanbased.alert.attack=\u0938\u092e\u0924\u0941\u0932\u094d\u092f LDAP \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f\: [{0}]\u0964 \u092f\u093e\u0926\u0943\u091a\u094d\u091b\u093f\u0915 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930\: [{1}]\u0964
#ascanbeta.ldapinjection.alert.logmessage=A likely LDAP injection vulnerability has been found with [{0}] URL [{1}] on [{2}] field [{3}], using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanbeta.ldapinjection.alert.logmessage=\u090f\u0915 \u0938\u0902\u092d\u093e\u0935\u0928\u093e LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u092d\u0947\u0926\u094d\u092f\u0924\u093e [{0}] [{2}], \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u0930 \u092f\u0942\u0906\u0930\u090f\u0932 [{1}] \u0915\u0947 \u0938\u093e\u0925 \u090f\u0915 \u0939\u092e\u0932\u0947 LDAP \u092e\u0947\u091f\u093e-\u0909\u092a\u091c \u0915\u0947 \u0935\u0930\u094d\u0923\u094b\u0902 \u0915\u0947 \u0938\u093e\u0925 [{3}], [{4}] \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 [{5}], \u091c\u094b \u092e\u0942\u0932 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0909\u092a\u0938\u094d\u0925\u093f\u0924 \u0928\u0939\u0940\u0902 \u0925\u093e \u091c\u093e\u0928\u093e \u091c\u093e\u0924\u093e \u0939\u0948 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964
ascanbeta.ldapinjection.booleanbased.alert.logmessage=\u090f\u0915 \u0938\u0902\u092d\u093e\u0935\u0928\u093e LDAP \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0938\u093f\u092e\u0941\u0932\u0947\u091f \u090f\u0915 \u0924\u093e\u0930\u094d\u0915\u093f\u0915 \u0930\u0942\u092a \u0938\u0947 \u092c\u0930\u093e\u092c\u0930 \u0936\u0930\u094d\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f [{3}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930, \u0914\u0930 \u090f\u0915 \u091d\u0942\u0920\u0940 \u0939\u093e\u0932\u0924 \u0905\u0928\u0941\u0915\u0930\u0923 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f [{4}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 [{0}] \u0915\u0947 \u0938\u093e\u0925 [{1}] \u092a\u0930 URL \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 [{2}], \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964 
# a colon delimited list of the known LDAP implementations (used to reference "ldapinjection.<implementation>.errormessages" here)  
ascanbeta.ldapinjection.knownimplementations=activedirectory\:openldap\:389directoryserver\:apachedirectoryservices
# OpenLDAP Error messages
# error messages may be localised, so in this case, pull them from the local version of OpenLDAP source, using the following command
# grep -Eo "\"[^\"]+\"" openldap-2.4.31/libraries/libldap/error.c
# the list will then need to be manually filtered slightly (remove common strings, and ensure that the messages contain no colons, which would mess up the colon delimiting used here)
ascanbeta.ldapinjection.openldap.errormessages=\u0938\u0902\u091a\u093e\u0932\u0928 \u0924\u094d\u0930\u0941\u091f\u093f\: \u092a\u094d\u0930\u094b\u091f\u094b\u0915\u0949\u0932 \u0924\u094d\u0930\u0941\u091f\u093f\: \u0938\u092e\u092f \u0938\u0940\u092e\u093e \u0938\u0947 \u092c\u093e\u0939\u0930\: \u0906\u0915\u093e\u0930 \u0938\u0940\u092e\u093e \u0915\u094b \u092a\u093e\u0930 \u0915\u0930\: \u0915\u0940 \u0924\u0941\u0932\u0928\u093e False\: \u0924\u0941\u0932\u0928\u093e \u0915\u0930\u0947\u0902 True\: \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0935\u093f\u0927\u093f \u0928\u0939\u0940\u0902 supported\:Strong(er) \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0906\u0935\u0936\u094d\u092f\u0915\: \u0935\u094d\u092f\u0935\u0938\u094d\u0925\u093e\u092a\u0915\u0940\u092f \u0938\u0940\u092e\u093e \u0938\u0947 \u092c\u093e\u0939\u0930\: \u092e\u0939\u0924\u094d\u0935\u092a\u0942\u0930\u094d\u0923 \u090f\u0915\u094d\u0938\u091f\u0947\u0902\u0936\u0928 \u0905\u0928\u0941\u092a\u0932\u092c\u094d\u0927 \u0939\u0948\: \u0917\u094b\u092a\u0928\u0940\u092f\u0924\u093e \u0906\u0935\u0936\u094d\u092f\u0915\: SASL \u092c\u093e\u0901\u0927 \u092e\u0947\u0902 \u092a\u094d\u0930\u0917\u0924\u093f\: \u0915\u094b\u0908 \u0910\u0938\u0940 \u0935\u093f\u0936\u0947\u0937\u0924\u093e\: \u0905\u092a\u0930\u093f\u092d\u093e\u0937\u093f\u0924 \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u092a\u094d\u0930\u0915\u093e\u0930\: \u092e\u0947\u0932 \u0916\u093e\u0928\u093e \u0905\u0928\u0941\u092a\u092f\u0941\u0915\u094d\u0924\: \u092a\u094d\u0930\u0924\u093f\u092c\u0902\u0927 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u092a\u094d\u0930\u0915\u093e\u0930 \u092f\u093e \u092e\u093e\u0928 \u092e\u094c\u091c\u0942\u0926 \u0939\u0948\: \u0905\u092e\u093e\u0928\u094d\u092f \u0938\u093f\u0902\u091f\u0948\u0915\u094d\u0938\: \u0915\u094b\u0908 \u0910\u0938\u0940 \u0935\u0938\u094d\u0924\u0941\: \u0909\u0930\u094d\u092b \u0938\u092e\u0938\u094d\u092f\u093e\: \u0905\u092e\u093e\u0928\u094d\u092f DN \u0938\u093f\u0902\u091f\u0948\u0915\u094d\u0938\: \u0938\u092e\u0938\u094d\u092f\u093e \u0905\u0938\u0902\u0926\u0930\u094d\u092d\u0924\u093e \u0909\u0930\u094d\u092b\: \u0905\u0928\u0941\u092a\u092f\u0941\u0915\u094d\u0924 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923\: \u0905\u092e\u093e\u0928\u094d\u092f \u0915\u094d\u0930\u0947\u0921\u0947\u0902\u0936\u093f\u092f\u0932\u094d\u0938\: \u0905\u092a\u0930\u094d\u092f\u093e\u092a\u094d\u0924 \u092a\u094d\u0930\u0935\u0947\u0936\: \u0938\u0930\u094d\u0935\u0930 \u0935\u094d\u092f\u0938\u094d\u0924 \u0939\u0948\: \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u092a\u0932\u092c\u094d\u0927 \u0939\u0948\: \u0938\u0930\u094d\u0935\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0924\u0948\u092f\u093e\u0930 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0932\u0942\u092a \u092a\u093e\u092f\u093e \u0917\u092f\u093e\: \u0928\u093e\u092e\u0915\u0930\u0923 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0935\u0930\u094d\u0917 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u0915\u093e\u0930\u094d\u0930\u0935\u093e\u0908 \u0928\u0939\u0940\u0902 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0940 \u092a\u0930 \u0917\u0948\u0930-\u092a\u0924\u094d\u0924\u093e\: \u0911\u092a\u0930\u0947\u0936\u0928 rdn \u092a\u0930 \u092a\u094d\u0930\u0915\u094d\u0930\u093f\u092f\u093e \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0939\u0948\: \u092a\u0939\u0932\u0947 \u0938\u0947 \u092e\u094c\u091c\u0942\u0926 \u0939\u0948\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0935\u0930\u094d\u0917\: \u0911\u092a\u0930\u0947\u0936\u0928 \u0915\u094b \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924 \u0915\u0930\u0924\u093e \u0939\u0948 \u0915\u0908 DSAs \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u0947\: \u0906\u092d\u093e\u0938\u0940 \u0938\u0942\u091a\u0940 \u0926\u0947\u0916\u0947\u0902 \u0924\u094d\u0930\u0941\u091f\u093f\: \u0924\u094d\u0930\u0941\u091f\u093f\: \u0906\u0902\u0936\u093f\u0915 \u092a\u0930\u093f\u0923\u093e\u092e \u0905\u0928\u094d\u092f (\u0909\u0926\u093e\u0939\u0930\u0923 \u0915\u0947 \u0932\u093f\u090f, \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928 \u0935\u093f\u0936\u093f\u0937\u094d\u091f) \u0914\u0930 \u0930\u0947\u092b\u093c\u0930\u0932 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0939\u0941\u0906\: \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u0939\u0948 \u090f\u0915 \u092a\u0924\u094d\u0924\u093e\: \u092a\u0930\u093f\u0923\u093e\u092e \u092c\u0939\u0941\u0924 \u092c\u0921\u093c\u0940\: \u0938\u0902 \u0911\u092a\u0930\u0947\u0936\u0928 \u0930\u0926\u094d\u0926 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f\: \u092c\u0939\u0941\u0924 \u0926\u0947\u0930 \u0939\u094b \u091a\u0941\u0915\u0940 \u0930\u0926\u094d\u0926 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f\: \u0938\u0915\u0924\u093e \u0930\u0926\u094d\u0926\: \u0905\u092d\u093f\u0915\u0925\u0928 \u0935\u093f\u092b\u0932\: \u092a\u0941\u0937\u094d\u091f\u093f \u0935\u093f\u092b\u0932 \u0930\u0939\u093e (\u090f\u0915\u094d\u0938)\: \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940\u0915\u0943\u0924 \u092a\u094d\u0930\u093e\u0927\u093f\u0915\u0930\u0923 \u0905\u0938\u094d\u0935\u0940\u0915\u0943\u0924\: \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u092a\u094d\u0930\u093e\u0927\u093f\u0915\u0930\u0923 \u0935\u093f\u092b\u0932\u0924\u093e (\u090f\u0915\u094d\u0938)\: \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0938\u093f\u0902\u0915 \u0924\u093e\u091c\u093c\u093e \u0915\u0930\u0928\u0947 \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e\: \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0938\u093f\u0902\u0915 \u0924\u093e\u091c\u093c\u093e \u0915\u0930\u0928\u0947 \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e (\u090f\u0915\u094d\u0938)\: \u0938\u0902 \u0911\u092a\u0930\u0947\u0936\u0928 (\u090f\u0915\u094d\u0938)\: LCUP \u0938\u0902\u0938\u093e\u0927\u0928 Exhausted\: LCUP \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: LCUP \u0905\u092e\u093e\u0928\u094d\u092f \u0921\u0947\u091f\u093e\: LCUP \u0905\u0938\u092e\u0930\u094d\u0925\u093f\u0924 \u092f\u094b\u091c\u0928\u093e\: LCUP \u092a\u0941\u0928\u0903 \u0932\u094b\u0921 \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e\: TXN \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u0930\u0947\u0902 \u0920\u0940\u0915\: TXN ID \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: LDAP \u0938\u0930\u094d\u0935\u0930\: \u0938\u094d\u0925\u093e\u0928\u0940\u092f \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0947 \u0938\u0902\u092a\u0930\u094d\u0915 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e\: \u090f\u0928\u094d\u0915\u094b\u0921\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f\: \u0921\u0940\u0915\u094b\u0921\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f\: \u091f\u093e\u0907\u092e\u094d\u0921 \u0906\u0909\u091f\: \u0905\u091c\u094d\u091e\u093e\u0924 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0935\u093f\u0927\u093f\: Bad \u0916\u094b\u091c \u092b\u093c\u093f\u0932\u094d\u091f\u0930\: \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0930\u0926\u094d\u0926 \u0911\u092a\u0930\u0947\u0936\u0928\: Bad \u090f\u0915 ldap \u0926\u093f\u0928\u091a\u0930\u094d\u092f\u093e\: \u092c\u093e\u0939\u0930 \u0915\u0940 \u0938\u094d\u092e\u0943\u0924\u093f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930\: \u0915\u0928\u0947\u0915\u094d\u091f \u0924\u094d\u0930\u0941\u091f\u093f\: \u0928\u0939\u0940\u0902 \u0939\u0948 \u0938\u092e\u0930\u094d\u0925\u093f\u0924\: \u0928\u093f\u092f\u0902\u0924\u094d\u0930\u0923 \u0928\u0939\u0940\u0902 \u092a\u093e\u092f\u093e\: \u0915\u094b\u0908 \u092a\u0930\u093f\u0923\u093e\u092e \u0928\u0939\u0940\u0902 \u092e\u093f\u0932\u0947\: \u0935\u093e\u092a\u0938\u0940\: \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0932\u0942\u092a\: \u0930\u0947\u092b\u0930\u0932 \u0938\u0940\u092e\u093e Exceeded\: \u0905\u091c\u094d\u091e\u093e\u0924 API \u0924\u094d\u0930\u0941\u091f\u093f\: \u0905\u091c\u094d\u091e\u093e\u0924 (\u090f\u0915\u094d\u0938\u091f\u0947\u0902\u0936\u0928) \u0924\u094d\u0930\u0941\u091f\u093f\: \u0905\u091c\u094d\u091e\u093e\u0924 (\u0928\u093f\u091c\u0940 \u090f\u0915\u094d\u0938\u091f\u0947\u0902\u0936\u0928) \u0924\u094d\u0930\u0941\u091f\u093f\: \u0905\u091c\u094d\u091e\u093e\u0924 \u0924\u094d\u0930\u0941\u091f\u093f \u0915\u0947 \u0932\u093f\u090f \u0914\u0930 \u0905\u0927\u093f\u0915 \u092a\u0930\u093f\u0923\u093e\u092e
# Active Directory error messages, from http://support.microsoft.com/kb/232282 
ascanbeta.ldapinjection.activedirectory.errormessages=0x00005011L\:0x00005012L\:0x00005013L\:0x80005000L\:0x80005001L\:0x80005002L\:0x80005003L\:0x80005004L\:0x80005005L\:0x80005006L\:0x80005007L\:0x80005008L\:0x80005009L\:0x8000500AL\:0x8000500BL\:0x8000500CL\:0x8000500DL\:0x8000500EL\:0x8000500FL\:0x80005010L\:0x80005014L\:A \u0917\u0932\u0924 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u093e\u0930\u093f\u0924 \u0915\u0930 \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e \u090f\u0915 \u0926\u093f\u0928\u091a\u0930\u094d\u092f\u093e\: \u092a\u094d\u0930\u0936\u093e\u0938\u0928 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0938\u0940\u092e\u093e \u092a\u093e\u0930 \u0915\u0930 \u0917\u092f\u093e \u0939\u0948\: \u0905\u092e\u093e\u0928\u094d\u092f ADSI \u092a\u0925 \u0928\u093e\u092e \u092a\u093e\u0930\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u090f\u0915 \u0905\u091c\u094d\u091e\u093e\u0924 ADSI \u0915\u0902\u092a\u094d\u092f\u0942\u091f\u0930 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u090f\u0915 \u0905\u091c\u094d\u091e\u093e\u0924 ADSI \u0921\u094b\u092e\u0947\u0928 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u090f\u0915 \u0905\u091c\u094d\u091e\u093e\u0924 ADSI \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e \: ADSI \u090f\u0915 \u0905\u091c\u094d\u091e\u093e\u0924 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0905\u0928\u0941\u091a\u093f\u0924 \u0939\u0948\: LDAP \u0938\u0930\u094d\u0935\u0930 \u0938\u0947 \u0938\u0902\u092a\u0930\u094d\u0915 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e\: \u0909\u0930\u094d\u092b dereference \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e\: \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u0938\u094d\u0925\u093e\u092a\u093f\u0924 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0935\u0930\u094d\u0917\: \u0917\u094d\u0930\u093e\u0939\u0915 \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u0947 \u0932\u0942\u092a \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u0924\u0941\u0932\u0928\u093e FALSE\: \u0924\u0941\u0932\u0928\u093e TRUE\: \u0917\u094b\u092a\u0928\u0940\u092f\u0924\u093e \u091d\u0941\u0915\u0947\u0902\u0917\u0947 \u091d\u0941\u0915\u0947\u0902\u0917\u0947 \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e \u0939\u0948\: \u092e\u0939\u0924\u094d\u0935\u092a\u0942\u0930\u094d\u0923 \u090f\u0915\u094d\u0938\u091f\u0947\u0902\u0936\u0928 \u0905\u0928\u0941\u092a\u0932\u092c\u094d\u0927 \u0939\u0948\: \u0921\u0940\u0915\u094b\u0921\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: E_ADS_BAD_PARAMETER\:E_ADS_BAD_PATHNAME\:E_ADS_CANT_CONVERT_DATATYPE\:E_ADS_COLUMN_NOT_SET \: E_ADS_INVALID_COMPUTER_OBJECT\:E_ADS_INVALID_DOMAIN_OBJECT\:E_ADS_INVALID_FILTER\:E_ADS_INVALID_USER_OBJECT\:E_ADS_OBJECT_EXISTS\:E_ADS_OBJECT_UNBOUND\:E_ADS_PROPERTY_INVALID\:E_ADS_PROPERTY_MODIFIED\:E_ADS_PROPERTY_NOT_FOUND\:E_ADS_PROPERTY_NOT_MODIFIED\:E_ADS_PROPERTY_NOT_SET\:E_ADS_PROPERTY_NOT_SUPPO... \: \u090f\u0928\u094d\u0915\u094b\u0921\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: ERROR_ACCESS_DENIED\:ERROR_CANCELLED\:ERROR_CONNECTION_REFUSED\:ERROR_DS_ADMIN_LIMIT_EXCEEDED\:ERROR_DS_AFFECTS_MULTIPLE_DSAS\:ERROR_DS_ALIAS_DEREF_PROBLEM\:ERROR_DS_ALIAS_PROBLEM\:ERROR_DS_ATTRIBUTE_OR_VALUE_EXISTS\:ERROR_DS_ATTRIBUTE_TYPE_UNDEFINED\:ERROR_DS_AUTH_METHOD_NOT_SUPPORTED\:ERROR_DS_AUTH_U... \:ERROR_DS_CANT_ON_RDN\:ERROR_DS_CLIENT_LOOP\:ERROR_DS_COMPARE_FALSE\:ERROR_DS_COMPARE_TRUE\:ERROR_DS_CONFIDENTIALITY_REQUIRED\:ERROR_DS_CONSTRAINT_VIOLATION\:ERROR_DS_CONTROL_NOT_FOUND\:ERROR_DS_DECODING_ERROR\:ERROR_DS_ENCODING_ERROR\:ERROR_DS_FILTER_UNKNOWN\:ERROR_DS_INAPPROPRIATE_AUTH\:ERROR_DS_INAPPROPRIATE_MATCHING\:ERROR_DS_INVALID_ATTRIBUTE_SYNTAX\:ERROR_DS_INVALID_DN_SYNTAX\:ERROR_DS_IS_LEAF \: ERROR_DS_LOCAL_ERROR\:ERROR_DS_LOOP_DETECT\:ERROR_DS_NAMING_VIOLATION\:ERROR_DS_NO_ATTRIBUTE_OR_VALUE\:ERROR_DS_NO_RESULTS_RETURNED\:ERROR_DS_NO_SUCH_OBJECT\:ERROR_DS_NOT_SUPPORTED\:ERROR_DS_OBJ_CLASS_VIOLATION\:ERROR_DS_OBJECT_RESULTS_TOO_LARGE\:ERROR_DS_OPERATIONS_ERROR\:ERROR_DS_PARAM_ERROR... \:ERROR_DS_SERVER_DOWN\:ERROR_DS_SIZELIMIT_EXCEEDED\:ERROR_DS_STRONG_AUTH_REQUIRED\:ERROR_DS_TIMELIMIT_EXCEEDED\:ERROR_DS_UNAVAILABLE\:ERROR_DS_UNAVAILABLE_CRIT_EXTENSION\:ERROR_DS_UNWILLING_TO_PERFORM\:ERROR_GEN_FAILURE\:ERROR_LOGON_FAILURE\:ERROR_MORE_DATA\:ERROR_MORE_DATA\:ERROR_NOT_ENOUGH_MEMORY\:ERROR_OBJECT_ALREADY_EXISTS\:ERROR_TIMEOUT\:LDAP_ADMIN_LIMIT_EXCEEDED\:LDAP_AFFECTS_MULTIPLE_DSAS\:LDAP_ALIAS_DEREF_PROBLEM \:LDAP_ALIAS_PROBLEM\:LDAP_ALREADY_EXISTS\:LDAP_ATTRIBUTE_OR_VALUE_EXISTS\:LDAP_AUTH_METHOD_NOT_SUPPORTED\:LDAP_AUTH_UNKNOWN\:LDAP_BUSY\:LDAP_CLIENT_LOOP\:LDAP_COMPARE_FALSE\:LDAP_COMPARE_TRUE\:LDAP_CONFIDENTIALITY_REQUIRED\:LDAP_CONNECT_ERROR\:LDAP_CONSTRAINT_VIOLATION\:LDAP_CONTROL_NOT_FOUND\:LDAP_DECODING_ERROR\:LDAP_ENCODING_ERROR\:LDAP_FILTER_ERROR\:LDAP_INAPPROPRIATE_AUTH\:LDAP_INAPPROPRIATE_MATCHING\:LDAP_INSUFFICIENT_RIGHTS \:LDAP_INVALID_CREDENTIALS\:LDAP_INVALID_DN_SYNTAX\:LDAP_INVALID_SYNTAX\:LDAP_IS_LEAF\:LDAP_LOCAL_ERROR\:LDAP_LOOP_DETECT\:LDAP_MORE_RESULTS_TO_RETURN\:LDAP_NAMING_VIOLATION\:LDAP_NO_MEMORY\:LDAP_NO_OBJECT_CLASS_MODS\:LDAP_NO_RESULTS_RETURNED\:LDAP_NO_SUCH_ATTRIBUTE\:LDAP_NO_SUCH_OBJECT\:LDAP_NOT_ALLOWED_ON_NONLEAF\:LDAP_NOT_ALLOWED_ON_RDN\:LDAP_NOT_SUPPORTED\:LDAP_OBJECT_CLASS_VIOLATION \: LDAP_OPERATIONS_ERROR\:LDAP_OTHER\:LDAP_PARAM_ERROR\:LDAP_PARTIAL_RESULTS\:LDAP_PROTOCOL_ERROR\:LDAP_REFERRAL\: LDAP_REFERRAL_LIMIT_EXCEEDED\:LDAP_RESULTS_TOO_LARGE\:LDAP_SERVER_DOWN\:LDAP_SIZELIMIT_EXCEEDED\:LDAP_STRONG_AUTH_REQUIRED\:LDAP_TIMELIMIT_EXCEEDED\:LDAP_TIMEOUT\:LDAP_UNAVAILABLE\:LDAP_UNAVAILABLE_CRIT_EXTENSION\:LDAP_UNDEFINED_TYPE\:LDAP_UNWILLING_TO_PERFORM\:LDAP_USER_CANCELLED\:Local \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: \u092a\u093e\u0936 \u0915\u093e \u092a\u0924\u093e \u0932\u0917\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e \: \u0905\u0927\u093f\u0915 \u092a\u0930\u093f\u0923\u093e\u092e \u0932\u094c\u091f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902\: \u090f\u0915\u093e\u0927\u093f\u0915 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u0938\u0947\u0935\u093e \u090f\u091c\u0947\u0902\u091f \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u092e\u094c\u091c\u0942\u0926 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u090f\u0915 \u092f\u093e \u0905\u0927\u093f\u0915 \u0924\u094d\u0930\u0941\u091f\u093f\u092f\u093e\u0901 \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: \u090f\u0915 \u092f\u093e \u090f\u0915 \u0938\u0947 \u0905\u0927\u093f\u0915 \u0907\u0928\u092a\u0941\u091f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930\u094d\u0938 \u0939\u0948\u0902 \u0905\u0935\u0948\u0927\: \u0911\u092a\u0930\u0947\u0936\u0928 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0939\u0948 \u090f\u0915 \u0917\u0948\u0930 \u0915\u0947 \u092a\u0924\u094d\u0924\u0947 \u092a\u0930 \u092a\u0930 RDN\:Operations \u0924\u094d\u0930\u0941\u091f\u093f \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f\: \u0915\u093e\u0930\u094d\u0930\u0935\u093e\u0908 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0939\u0948 \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: \u0906\u0902\u0936\u093f\u0915 \u092a\u0930\u093f\u0923\u093e\u092e\u094b\u0902 \u0914\u0930 \u0930\u0947\u092b\u0930\u0932 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0939\u0941\u0906\: \u092a\u094d\u0930\u094b\u091f\u094b\u0915\u0949\u0932 \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: \u0905\u0928\u0941\u0930\u094b\u0927\u093f\u0924 \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u092e\u094c\u091c\u0942\u0926 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u092a\u0930\u093f\u0923\u093e\u092e \u0928\u0939\u0940\u0902 \u0932\u094c\u091f\u093e \u0930\u0939\u0947 \u0939\u0948\u0902 \: \u092c\u0939\u0941\u0924 \u092c\u0921\u093c\u0940 \u0939\u0948\u0902 \u092a\u0930\u093f\u0923\u093e\u092e \u0932\u094c\u091f\u0947\: S_ADS_ERRORSOCCURRED\:S_ADS_NOMORE_COLUMNS\:S_ADS_NOMORE_ROWS\:Size \u0938\u0940\u092e\u093e \u092a\u093e\u0930 \u0915\u0930 \u0917\u092f\u093e \u0939\u0948\: \u0938\u092c\u0932 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e \u0939\u0948\: ADSI \u0921\u0947\u091f\u093e \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u094b/\u0938\u0947 \u090f\u0915 \u0926\u0947\u0936\u0940 DS \u0921\u0947\u091f\u093e \u092a\u094d\u0930\u0915\u093e\u0930 \u092e\u0947\u0902 \u0915\u0928\u0935\u0930\u094d\u091f \u0939\u094b \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e\: ADSI \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u092e\u094c\u091c\u0942\u0926 \u0939\u0948\: ADSI \u0917\u0941\u0923 \u0915\u0948\u0936 \u092e\u0947\u0902 \u092a\u093e\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e\: \u0909\u0930\u094d\u092b \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: \u0915\u094d\u0930\u093f\u092f\u093e \u0915\u093e \u092a\u094d\u0930\u092f\u093e\u0938 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u0938\u0947\u0935\u093e \u0938\u094d\u0915\u0940\u092e\u093e \u0928\u093f\u092f\u092e\u094b\u0902 \u0915\u093e \u0909\u0932\u094d\u0932\u0902\u0918\u0928 \u0915\u0930\u0924\u0940 \u0939\u0948 \: \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u092e\u094c\u091c\u0942\u0926 \u0939\u0948 \u092f\u093e \u092e\u093e\u0928 \u0905\u0938\u093e\u0907\u0928 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\: \u092a\u094d\u0930\u092e\u093e\u0923\u0928 \u092a\u0926\u094d\u0927\u0924\u093f \u0938\u092e\u0930\u094d\u0925\u093f\u0924 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0928\u093f\u092f\u0902\u0924\u094d\u0930\u0923 \u0928\u0939\u0940\u0902 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: \u090f\u0915 \u0905\u092e\u093e\u0928\u094d\u092f \u0938\u093f\u0902\u091f\u0948\u0915\u094d\u0938 \u0905\u0927\u093f\u092e\u093e\u0928\u094d\u092f \u0928\u093e\u092e \u0939\u0948\: \u0938\u0941\u0935\u093f\u0927\u093e \u0938\u092e\u0930\u094d\u0925\u093f\u0924 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u092a\u0939\u0932\u0947 \u0938\u0947 \u092e\u094c\u091c\u0942\u0926 \u0939\u0948\: \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u094b\u0908 \u0932\u0940\u092b\u093c \u0939\u0948\: \u0930\u0947\u092b\u0930\u0932 \u0938\u0940\u092e\u093e \u092a\u093e\u0930 \u0915\u0930 \u0932\u0940 \u0939\u0948\: \u0916\u094b\u091c \u092b\u093c\u093f\u0932\u094d\u091f\u0930 \u092c\u0941\u0930\u093e \u0939\u0948\: \u0916\u094b\u091c \u0915\u093e\u0930\u094d\u0930\u0935\u093e\u0908 \u0935\u0930\u094d\u0924\u092e\u093e\u0928 \u092a\u0902\u0915\u094d\u0924\u093f \u0915\u0947 \u0932\u093f\u090f \u0905\u0902\u0924\u093f\u092e \u0938\u094d\u0924\u0902\u092d \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u0917\u092f\u093e \u0939\u0948 \: \u0916\u094b\u091c \u0915\u093e\u0930\u094d\u0930\u0935\u093e\u0908 \u0905\u0902\u0924\u093f\u092e \u092a\u0902\u0915\u094d\u0924\u093f \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u0917\u092f\u093e \u0939\u0948\: \u0916\u094b\u091c \u091f\u093e\u0907\u092e \u0906\u0909\u091f \u0939\u094b \u0917\u092f\u093e \u0925\u093e\: \u0938\u0930\u094d\u0935\u0930 \u0935\u094d\u092f\u0938\u094d\u0924 \u0939\u0948\: \u0938\u0930\u094d\u0935\u0930 \u0909\u092a\u0932\u092c\u094d\u0927 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0938\u0930\u094d\u0935\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0924\u0948\u092f\u093e\u0930 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0928\u0939\u0940\u0902 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093f\u0938\u0940 \u0926\u0942\u0930\u0938\u094d\u0925 \u0938\u0902\u0938\u093e\u0927\u0928 \u0915\u0947 \u0932\u093f\u090f \u092c\u093e\u0927\u094d\u092f \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0917\u0941\u0923 \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0917\u0941\u0923 \u0938\u092e\u0930\u094d\u0925\u093f\u0924 \u0928\u0939\u0940\u0902 \u0939\u0948 \: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f ADSI \u0917\u0941\u0923 \u0938\u0947\u091f \u0928\u0939\u0940\u0902 \u0925\u093e\: ADSI \u092e\u0947\u0902 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0938\u094d\u0924\u0902\u092d \u0938\u0947\u091f \u0928\u0939\u0940\u0902 \u0925\u093e\: \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0916\u094b\u091c \u092b\u093c\u093f\u0932\u094d\u091f\u0930 \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: \u092a\u094d\u0930\u0926\u093e\u0928 \u0915\u093f\u090f \u0917\u090f \u0915\u094d\u0930\u0948\u0921\u0947\u0902\u0936\u093f\u092f\u0932 \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: \u0938\u093f\u0902\u091f\u0948\u0915\u094d\u0938 \u0905\u092e\u093e\u0928\u094d\u092f \u0939\u0948\: \u0938\u093f\u0938\u094d\u091f\u092e \u0938\u094d\u092e\u0943\u0924\u093f \u0938\u0947 \u092c\u093e\u0939\u0930 \u0939\u0948\: \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0915\u093e\u0930\u094d\u0930\u0935\u093e\u0908 \u0930\u0926\u094d\u0926 \u0915\u0930 \u0926\u0940 \u0939\u0948\: \u0905\u092a\u0930\u094d\u092f\u093e\u092a\u094d\u0924 \u092a\u094d\u0930\u0935\u0947\u0936 \u0915\u093e \u0905\u0927\u093f\u0915\u093e\u0930\: \u0915\u094b\u0908 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0939\u0948 \u0935\u093f\u0935\u0936 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u0935\u0939\u093e\u0901 \u090f\u0915 \u0925\u093e \u090f\u0915 \u0928\u093e\u092e\u0915\u0930\u0923 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u0935\u0939\u093e\u0901 \u0925\u093e \u090f\u0915 \u092e\u0947\u0932 \u0916\u093e\u0928\u093e \u0905\u0928\u0941\u092a\u092f\u0941\u0915\u094d\u0924 \u0925\u093e \: \u0935\u0939\u093e\u0901 \u090f\u0915 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0935\u0930\u094d\u0917 \u0909\u0932\u094d\u0932\u0902\u0918\u0928\: \u0938\u092e\u092f \u0938\u0940\u092e\u093e \u092a\u093e\u0930 \u0915\u0930 \u0917\u092f\u093e \u0925\u093e\: \u092a\u094d\u0930\u0915\u093e\u0930 \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u093f\u0924 \u0928\u0939\u0940\u0902 \u0939\u0948\: \u0905\u091c\u094d\u091e\u093e\u0924 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908\: \u0905\u091c\u094d\u091e\u093e\u0924 \u0924\u094d\u0930\u0941\u091f\u093f \u0909\u0924\u094d\u092a\u0928\u094d\u0928 \u0939\u0941\u0908
# 389 Directory Server error messages, using command: grep -Eo "\"[^\"]+\"" ./lib/ldaputil/errors.c 
ascanbeta.ldapinjection.389directoryserver.errormessages=ldap \u0916\u094b\u091c \u0915\u093f\u0938\u0940 ldap \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f\: Cert \u092e\u093e\u0928\u091a\u093f\u0924\u094d\u0930\u0923 \u0938\u092e\u093e\u0930\u094b\u0939 \u092e\u0947\u0902 \u0935\u093f\u092b\u0932 \u092a\u093e\u0924\u0947 \u0928\u0939\u0940\u0902 \u0915\u093f\u092f\u093e\: Cert \u0916\u094b\u091c \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u0935\u093f\u092b\u0932 \u0939\u0941\u0906\: Cert \u0938\u0924\u094d\u092f\u093e\u092a\u093f\u0924 \u0915\u0930\u0947\u0902 \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u0935\u093f\u092b\u0932 \u0930\u0939\u093e\: Certmap InitFn \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u0935\u093f\u092b\u0932\: \u0905\u092e\u093e\u0928\u094d\u092f \u0938\u094d\u0925\u093e\u0928\u0940\u092f ldap \u0921\u0947\u091f\u093e\u092c\u0947\u0938 url \u0909\u092a\u0938\u0930\u094d\u0917\: \u0906\u0927\u093e\u0930 dn ldapdb \u092f\u0942\u0906\u0930\u090f\u0932\: \u092c\u093e\u0939\u0930 \u092e\u0947\u0902 \u0938\u094d\u092e\u0943\u0924\u093f \u0915\u0940 \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: ldap \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u0938\u0930\u094d\u0935\u0930 \u0938\u0947 \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092a\u094d\u0930\u093e\u0930\u0902\u092d \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: \u0938\u094d\u0925\u093e\u0928\u0940\u092f ldap \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e\: \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0925\u093e\u0928\u0940\u092f ldap \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0935\u093f\u092b\u0932 \u0930\u0939\u093e ldap_set_option \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092a\u094d\u0930\u093e\u0930\u0902\u092d \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: \u0921\u093f\u092b\u093c\u0949\u0932\u094d\u091f cert \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u091c\u092c LDAP SSL\:Circular \u0938\u092e\u0942\u0939\u094b\u0902 \u0938\u0947 \u0905\u0927\u093f\u0915 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u094d\u0930\u093e\u0930\u0902\u092d \u0928\u0939\u0940\u0902 \u0915\u093f\u092f\u093e \u0938\u092e\u0942\u0939 \u0938\u0926\u0938\u094d\u092f\u0924\u093e \u091a\u0947\u0915\: \u0905\u092e\u093e\u0928\u094d\u092f \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917\: \u0905\u092e\u093e\u0928\u094d\u092f \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0938\u0942\u091a\u0915\u093e\u0902\u0915 \u0915\u0947 \u0926\u094c\u0930\u093e\u0928 \u092a\u093e\u092f\u093e \u0917\u092f\u093e\: \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u092e\u093e\u0928 \u0916\u094b\u091c \u092a\u0930\u093f\u0923\u093e\u092e \u0938\u0947 \u0932\u093e\u092a\u0924\u093e\: config \u0916\u094b\u0932\u0928\u0947 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u0924\u093e file\:database \u0915\u093e \u0928\u093e\u092e \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0917\u0941\u0923 \u0905\u0928\u0941\u092a\u0932\u092c\u094d\u0927 \u0939\u0948\: config file\:internal \u0924\u094d\u0930\u0941\u091f\u093f - LDAPU_ERR_NOT_PROPVAL \u092e\u0947\u0902 \u0905\u0935\u0948\u0927\u093e\u0928\u093f\u0915 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\: \u091c\u093e\u0930\u0940\u0915\u0930\u094d\u0924\u093e DN cert \u0938\u0947 \u0928\u093f\u0915\u093e\u0932\u093e \u0928\u0939\u0940\u0902 \u091c\u093e \u0938\u0915\u0924\u093e\: DN \u091c\u093e\u0930\u0940\u0915\u0930\u094d\u0924\u093e \u0932\u093e\u092a\u0924\u093e \u0915\u0947 \u0932\u093f\u090f \u0917\u0948\u0930-\u0921\u093f\u092b\u093c\u0949\u0932\u094d\u091f ldap \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u092e\u0948\u092a\u093f\u0902\u0917 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0915\u094b certmap\:cert \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: \u0935\u093f\u0915\u0943\u0924 \u092a\u093e\u092f\u093e \u0935\u093f\u0937\u092f DN \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930\: \u092a\u094d\u0930\u092e\u093e\u0923 \u092a\u0924\u094d\u0930 \u092e\u0947\u0902 \u0915\u094b\u0908 ldap \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092e\u0948\u092a \u0915\u093f\u092f\u093e \u091c\u093e \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: certmap \u092a\u094d\u0932\u0917\u0907\u0928 \u0932\u094b\u0921 \u0915\u0930\u0928\u0947 \u092e\u0947\u0902 \u0905\u0938\u092e\u0930\u094d\u0925 \u092a\u0941\u0938\u094d\u0924\u0915\u093e\u0932\u092f\: InitFn certmap \u092a\u094d\u0932\u0917\u0907\u0928 \u0932\u093e\u092f\u092c\u094d\u0930\u0947\u0930\u0940 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u0947 \u0938\u092e\u092f \u092a\u094d\u0930\u0926\u093e\u0928 \u0915\u093f\u092f\u093e \u091c\u093e\u0928\u093e \u091a\u093e\u0939\u093f\u090f\: InitFn certmap \u092a\u094d\u0932\u0917\u0907\u0928 \u092a\u0941\u0938\u094d\u0924\u0915\u093e\u0932\u092f \u092e\u0947\u0902 \u0928\u0939\u0940\u0902 \u0922\u0942\u0901\u0922 \u0938\u0915\u093e\: \u0938\u0915\u093e \u0928\u0939\u0940\u0902 \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0915\u0947 LDAP \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u092e\u0947\u0902 \u092e\u093f\u0932\u093e\u0928\: \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e LDAP \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u0928\u0939\u0940\u0902 \u0939\u0948 \u0915\u093f\u0938\u0940 \u092d\u0940 \u092a\u094d\u0930\u092e\u093e\u0923 \u092a\u0924\u094d\u0930 \u0924\u0941\u0932\u0928\u093e \u0915\u0930\u0947\u0902\: \u0932\u093e\u092f\u092c\u094d\u0930\u0947\u0930\u0940 \u0915\u0947 \u0932\u093f\u090f \u0928\u093e\u092e \u0917\u0941\u092e \u0939\u0948 \u092e\u0947\u0902 config file\:Init \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u0928\u093e\u092e \u0917\u0932\u0924 \u0924\u0930\u094d\u0915\u094b\u0902 \u0915\u0947 \u0938\u093e\u0925 \u092c\u0941\u0932\u093e\u092f\u093e config-file\:ldaputil API \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u092e\u0947\u0902 \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: \u0935\u093f\u092b\u0932 \u092b\u093c\u093e\u0907\u0932 \u0915\u093e \u0928\u093e\u092e \u092c\u0926\u0932 \u0915\u0930\: VerifyCert \u0917\u0941\u0923 \u092e\u093e\u0928 \u091a\u093e\u0932\u0942 \u092f\u093e \u092c\u0902\u0926 \u0939\u094b\u0928\u093e \u091a\u093e\u0939\u093f\u090f\: Cert \u091c\u093e\u0930\u0940\u0915\u0930\u094d\u0924\u093e \u0928\u093e\u092e \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: \u0917\u0941\u0923 \u0915\u093e \u0928\u093e\u092e \u092f\u093e\u0926 \u0906 \u0930\u0939\u0940 \u0939\u0948\: \u0905\u091c\u094d\u091e\u093e\u0924 cert \u0935\u093f\u0936\u0947\u0937\u0924\u093e\: ldap \u0916\u094b\u091c \u0916\u093e\u0932\u0940 \u092a\u0930\u093f\u0923\u093e\u092e \u0932\u094c\u091f\u0947\: ldap \u0916\u094b\u091c \u0915\u0908 \u092e\u0948\u091a\u094b\u0902 \u092e\u0947\u0902 \u0932\u094c\u091f\u0947 \u091c\u092c \u0909\u092e\u094d\u092e\u0940\u0926 \u0939\u0948 \u090f\u0915\: \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u0928\u093f\u0915\u093e\u0932 \u0928\u0939\u0940\u0902 \u0938\u0915\u0924\u093e \u0939\u0948 ldap \u0916\u094b\u091c \u0938\u0947 \u092a\u0930\u093f\u0923\u093e\u092e\: ldap \u092a\u094d\u0930\u0935\u093f\u0937\u094d\u091f\u093f \u0915\u094b '\u092f\u0942\u0906\u0908\u0921\u0940' \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u092e\u093e\u0928\: \u0905\u092e\u093e\u0928\u094d\u092f \u0924\u0930\u094d\u0915 certmap API \u092b\u093c\u0902\u0915\u094d\u0936\u0928\: \u0905\u092e\u093e\u0928\u094d\u092f LDAP \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u092a\u094d\u0930\u0924\u094d\u092f\u092f \u0915\u094b \u092a\u093e\u0930\u093f\u0924 \u0915\u0930 \u0926\u093f\u092f\u093e \u0932\u093e\u092a\u0924\u093e \u0939\u0948\: \u0935\u093f\u0937\u092f DN \u0938\u0947 \u092a\u094d\u0930\u092e\u093e\u0923 \u092a\u0924\u094d\u0930 \u0928\u093f\u0915\u093e\u0932\u0947\u0902 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: DN \u091c\u093e\u0930\u0940\u0915\u0930\u094d\u0924\u093e \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930 \u0938\u0947 \u0928\u093f\u0915\u093e\u0932\u0928\u0947 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: \u092e\u0942\u0932 \u0921\u0947\u0930 \u0938\u0947 \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930 \u090f\u0928\u094d\u0915\u094b\u0921\u093f\u0902\u0917 \u0928\u093f\u0915\u093e\u0932\u0947\u0902 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0938\u0915\u093e\: \u0905\u092d\u0940 \u0924\u0915 \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u093f\u0924 \u0928\u0939\u0940\u0902 \u0938\u092e\u093e\u0930\u094b\u0939\: ldaputil \u0906\u0902\u0924\u0930\u093f\u0915 \u0924\u094d\u0930\u0941\u091f\u093f\: \u0906\u0902\u0924\u0930\u093f\u0915 \u0924\u094d\u0930\u0941\u091f\u093f - \u0905\u091c\u094d\u091e\u093e\u0924 \u0924\u094d\u0930\u0941\u091f\u093f \u0915\u094b\u0921
# Apache Directory Service (starting point: cat ./i18n/src/main/resources/org/apache/directory/server/i18n/errors.properties | sed -re '/^#/ d; /^$/d;' | cut -d"=" -f2)
ascanbeta.ldapinjection.apachedirectoryservices.errormessages=Failed to identify OID for\:A system index on attribute\:A user index on attribute\:no EQUALITY MatchingRule defined\:by unauthenticated caller.\:Authentication error\:Cannot create a digested password for algorithm\:The rootDSE cannot be deleted, moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can del, move or rename\:failed to parse entryACI\:failed to parse subentryACI\:The rootDSE cannot be deleted\!\:The Administrators group cannot be deleted\!\:does not have permission to delete the admin account. \:does not have permission to delete the user account\:does not have permission to delete the group entry\:The rootDSE cannot be modified\!\:does not have permission to modify the account of the admin user.\:does not have permission to modify the account of the user\:does not have permission to modify the group entry\:The Administrators group cannot be moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can move or rename\:does not have permission to move or rename the user account\:does not have permission to move or rename the group entry\:Access to user account\:Access to group\:Access to admin account not permitted for user\:due to syntax error. Cannot add ACITuples to TupleCache\:Cannot set a changeLog store when one is already active\:operational attribute cannot be modified by a user\:The ModifiersName operational attribute cannot be modified by a user\:The ModifyTimestamp operational attribute cannot be modified by a user\:failed to LOG version properties\:No partition with suffix\:can be found in the NamingContexts\:An LDAPURL should not contains a scope\:An LDAPURL should not contains filters\:An LDAPURL should not contains any description attribute list\:An LDAPURL should not contains any extension\:An LDAPURL should not contains any critical extension\:An LDAPURL should contains a non-empty DN\:An entry with a 'referral' ObjectClass must contains a 'ref' Attribute\:does not have any OID. It should be a wrong AttributeType.\:Wrong AttributeType, does not have an associated OID\:The value stored in an Human Readable attribute as a byte\:The value stored in a non Human Readable attribute as a String should be convertible to a byte\:A filter should not be null\:A Substring filter should be used only on Human Readable attributes\:A Extensible filter should be used only on Human Readable attributes\:Cannot modify the attribute\:The new Attribute or one of its value is incorrect\:Cannot add a value which is already present\:Trying to remove an non-existant attribute\:Cannot remove an absent value from attribute\:An ABSTRACT ObjectClass cannot inherit from an objectClass which is not ABSTRACT\:An AUXILiARY ObjectClass cannot inherit from an objectClass which is not ABSTRACT or AUXILIARY\:Cannot have a superior which does not exist\:does not contain a STRUCTURAL ObjectClass\:contains more than one STRUCTURAL ObjectClass\:attributeType, which is part of the RDN\:The value stored in a not Human Readable attribute as a String should be convertible to a byte\:The value is not valid. It should be a String or a byte\:Failed to access certificate in DIT.\:Failed on attempt to compare certificate bytes to determine alias.\:Failed on attempt to extract key.\:Exception while searching the DIT for class\:Encountered failure while searching directory for class\:failed to parse the new subtreeSpecification\:failed to parse entryTrigger\:TriggerSpecification parser failure on\:SynchWorker failed to synch directory.\:ChangeType unknown\:Reverts of change type\:Encountered a failure while trying to revert to a previous revision\:Cannot build an entry for\:The replicaId must be in\:Cannot inject the following entry\:Schema entity containers of objectClass organizationalUnit should be 3 name components in length.\:Expecting organizationalUnit with one of the following names\:Cannot add an entry on\:Unwilling to perform modify on\:Unwilling to enable a not loaded schema\:DitContentRule loading NYI\:DitStructureRule loading NYI\:MatchingRuleUse loading NYI\:NameForm loading NYI\:Failed to initialize wrapped partition.\:Attempt to destroy wrapped partition failed.\:Could not create directory\:Could not delete file or directory\:Unable to create a DirectoryService instance for unknow reason\:Failed to delete the working directory.\:Failed to delete\:Unsupported changetype found in LDIF\:Error encountered while delivering notifications.\:Encountered exception during event handling.\:Failed to configure the jetty http server\:Failed to configure the web application(s)\:Error encoding EncryptionKey.\:Failed to close an index.\:Closed master table for\:Failed to close the master.\:Failed to close the record manager\:Failed to identify OID for \:Error while adding\:Error while adding\:Exception while removing\:Cannot deserialize the entry\:Cannot create a ticket for the\:Cannot create a ticket\:Cannot encode the Ticket object, the PDU size is\:The PDU buffer size is too small \!\:Cannot encode the AuthorizationData object, the PDU size is\:Cannot encode the Checksum object, the PDU size is\:Cannot encode the EncryptedData object, the PDU size is\:Cannot encode the EncryptionKey object, the PDU size is\:Cannot encode the HostAddress object, the PDU size is\:Cannot encode the HostAddresses object, the PDU size is\:Cannot encode the PreAuthenticationData object, the PDU size is\:Cannot encode the principalName object, the PDU size is\:Cannot encode the TransitedEncoding object, the PDU size is\:Cannot put a PDU in a null buffer \!\:More than one server entry found for kerberos principal name\:Cannot initialize a partition without a valid suffix\:can't be created\:Unexpected exception\:Error in request monitor\:Error in context monitor\:Error in reply monitor\:Failed to get catalog context \:Failed to get initial context \:failed to rebind ldap service\:Failed to write GracefulShutdownResponse to client\:mechanism not supported. Please check the server.xml configuration file (supportedMechanisms field)\:Handler unavailable for\:Only LDAP v3 is supported.\:Only LDAP v3 is supported.\:failed to properly abandon this persistent search\:Reference will be ignored.\:Failed to close the search cursor for message\:Got back more than one entry for search on RootDSE which means Cursor is not functioning properly\!\:failed on list.close()\:failed to unbind session properly\:Failed to send a search request with RefreshAndPersist mode\:Failed to bind an LDAP service\:Failing on cursor close\:LDIF file does not exist.\:Failed to import LDIF into backing store.\:failed to close stream\:Error closing NamingEnumeration on PSearchListener\:Error closing connection on PSearchListener\:PSearchListener encountered error\:could not get canonical path\:Cannot load the ldif file\:Failed to run the class\:Failed to run the method\:Error while scanning index on attribute\:help for usage.\:Unknown command\:forced configuration load (-c) requires the -i option\:Command line parsing failed for\:unknown command\:port value of\:is larger than max port number\:is smaller than the minimum port number\:Partition directory\:delay value of\:is larger than max delay (seconds) allowed\:delay value of\:timeOffline value of\:is larger than max timeOffline (minutes) allowed\:is less than zero and makes no sense\:failed for the following reasons provided by the server\:Import failed...\:ldif file name must be provided\:No Normalizer present for attribute type\:in memory index cannot store the data on disk\:in memory index doesn't support explicit caching\:Cannot store a ClonedServerEntry\:Id for parent\:contains no objectClass attribute\:Not a normalized name\:contains no entryCsn attribute\:contains no entryUuid attribute\:Unidentified modification operation\:Cannot call store method\:aliasDereferencingProblem - attempt to create alias to itself.\:aliasDereferencingProblem - attempt to create alias with cycle to relative\:aliasDereferencingProblem - the alias points to an entry outside of the\:aliasProblem - the alias when dereferenced would not name a known object the aliasedObjectName must be set to a valid existing entry.\:aliasDereferencingProblem - the alias points to another alias.  Alias chaining is not supported by this backend.\:Anonymous bind NOT permitted\!\:Cannot authenticate user\:Password not correct for user\:Failed to lookup user for authentication\:Unexpected protectedItem\:Unexpected userClass\:The rootDSE cannot be moved or renamed\!\:Undefined modify operation value of\:The ChangeLog has not been enabled.\:The underlying changelog store does not support searching through it's logs\:The underlying changelog store does not support searching through it's tags\:revision must be greater than or equal to 0\:revision must be less than or equal to the current revision\:Collective attributes cannot be stored in non-collectiveAttributeSubentries\:Cannot operate on collective attributes in non-collectiveAttributeSubentries\:Negation has no child\:Unrecognized branch node operator\:Unrecognized leaf node type\:Unknown match type\:Unrecognized search scope\!\:had incorrect syntax\:The global schema subentry cannot be added since it exists by default.\:already exists\!\:Attempt to add entry\:Can not allow the deletion of the subschemaSubentry\:Trying to add existing value\:Can not allow the renaming of the subschemaSubentry\:A CollectiveAttribute Subentry must have at least one collective Attribute\:Can not allow the move of the subschemaSubentry\:Attempt to search under non-existant entry\:Unknown assertion type\:Failed to expand node\:System partition has wrong name\:Duplicate partition suffix\:The id cannot be set for the partition nexus.\:Grouping many exceptions on root nexus sync()\:not found within the attributeType registry\:The current partition does not have any suffix\:Cannot find a partition for\:userRoot() in org.apache.directory.server.prefs.ServerPreferencesFactory not implemented\!\:Failed to set up node.\:Failed to get SPI.\:Modify operation leaves no structural objectClass for entry\:Modify operation attempts to delete RDN attribute\:Modify operation attempts to delete RDN attribute values in use for\:not found in attribute registry\!\:At least two name components are expected for the dn\:not declared in objectClasses of entry\:More than one value has been provided for the single-valued attribute\:Required attributes\:is syntactically incorrect\:The value is not a valid String\:The value stored in an Human Readable attribute is not a String\:Modify REPLACE operations on schema subentries are not allowed\:Undefined modify operation\:Unknown index into handler array\:Failed to get BC Certificate factory for algorithm\:Bad certificate format.\:Failed to get key factory for algorithm\:Bad private key format.\:Bad public key format.\:Cannot generate key pair for TLS\:Cannot generate self signed certificate.\:not found in DIT.\:is not supported.\:node cannot be null\:objectClasses cannot be null\:Attribute objectClasses should be of id 'objectClass'\:Unrecognized assertion type for refinement node\:Refinement leaf node attribute was\:objectClasses argument cannot be null\:objectClasses attribute must be for ID 'objectClass'\:A subentry must have an objectClass attribute\:does not contain an administrativeRole attribute\! An administrativeRole attribute in the administrative point is required to add a subordinate subentry.\:Failed while parsing subtreeSpecification for\:Will not allow rename operation on entries with administrative descendants.\:Bad value for the OID\:The change log must be enabled to revert to previous log revisions.\:There must be at least one tag to revert to the latest tag.\:can't rename the rootDSE\:Invalid operation on Name\:revision must be less than the current revision\:cannot create an entry under a referral when the Context.REFERRAL is set to 'ignore'\:Directory service is not started.\:Schema load failed\:Cannot execute indirect lookup if it is not the next operation.\:The throwReferral method is not implemented for a Bind operation\:The isReferralThrown method is not implemented for a Bind operation\:The ignoreReferral method is not implemented for a Bind operation\:The isReferralIgnored method is not implemented for a Bind operation\:Cannot set the empty operation context to anything other than the EmptyDN\:NewSuperior must not be null\:The new superior cannot be null for\:represents a move and rename operation.\:newRdn must not be null for a rename\:Failed to initialize interceptor chain.\:Interceptor not found\:Unknown interceptor name\:Other interceptor is using name\:Unexpected exception.\:for new schema entity is not unique.\:for new schema entity does not exist.\:The parent dn of a attributeType should be at most 3 name components in length.\:should be an organizationalUnit.\:should have a relative name of ou\:as this schema already contains this element\:as this schema is not loaded\:as this schema does not contain this element\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' AttributeTypes\:Cannot move a schemaObject from a not loaded schema\:Cannot move a schemaObject to a not loaded schema\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:into the registries, the resulting registries would be inconsistent\:cannot have it's OID changed until all matchingRules using that comparator have been deleted.\:cannot be moved to another schema until all matchingRules using that comparator have been deleted.\:for new schema comparator is not unique.\:The parent dn of a comparator should be at most 3 name components in length.\:The parent entry of a comparator should be an organizationalUnit.\:The parent entry of a comparator should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:The parent dn of a matchingRule should be at most 3 name components in length.\:The parent entry of a matchingRule should be an organizationalUnit.\:The parent entry of a syntax should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:into the registries, we have got some errors\:as there are some dependant SchemaObjects\:cannot have it's OID changed until all matchingRules using that normalizer have been deleted.\:cannot be moved to another schema until all matchingRules using that normalizer have been deleted.\:for new schema normalizer is not unique.\:The parent dn of a normalizer should be at most 3 name components in length.\:The parent entry of a normalizer should be an organizationalUnit.\:The parent entry of a normalizer should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' ObjectClasses\:The parent entry of a objectClass should be an organizationalUnit.\:The parent entry of a attributeType should have a relative name of ou\:Only schema entity containers of objectClass organizationalUnit with 3 name components in length can be deleted.\:Can only delete organizationalUnit entity containers with one of the following names\:The parent dn of a schema should be\:Cannot delete schema that has dependents\:Cannot allow rename with rdnAttribute set to\:Moving around schemas is not allowed.\:Unknown modify operation type\:Unwilling to perform operation on schema with missing dependencies\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:for new schema syntaxChecker is not unique.\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:cannot be moved to another schema until all syntax using that syntaxChecker have been deleted.\:The parent dn of a syntaxChecker should be at most 3 name components in length.\:The parent entry of a syntaxChecker should be an organizationalUnit.\:into the registries, the resulting registries would be inconsistent\:into the registries, the resulting registries would be inconsistent\:cannot be deleted until all entities using this syntax have also been deleted. The following dependees exist\:The parent dn of a syntax should be at most 3 name components in length.\:The parent entry of a syntax should be an organizationalUnit.\:The following does not conform to the syntaxCheckerDescription syntax\:The following does not conform to the normalizerDescription syntax\:The following does not conform to the comparatorDescription syntax\:The following does not conform to the attributeTypeDescription syntax\:Cannot permit the addition of an attributeType with an invalid super type\:Cannot permit the addition of an attributeType with an invalid syntax\:Cannot permit the addition of an attributeType with an invalid EQUALITY matchingRule\:Cannot permit the addition of an attributeType with an invalid ORDERING matchingRule\:Cannot permit the addition of an attributeType with an invalid SUBSTRINGS matchingRule\:Cannot permit the addition of an attributeType with an no EQUALITY matchingRule\:Cannot permit the addition of an attributeType with which cannot resolve an EQUALITY matchingRule from it's super type.\:Cannot permit the addition of an attributeType with no syntax\:The following does not conform to the objectClassDescription syntax\:Cannot permit the addition of an objectClass with an invalid superior objectClass\:Cannot permit the addition of an objectClass with an invalid attributeType in the mayList\:Cannot permit the addition of an objectClass with an invalid attributeType in the mustList\:The following does not conform to the matchingRuleUseDescription syntax\:The following does not conform to the ldapSyntax description syntax\:Cannot permit the addition of a syntax without the prior creation of a\:The following does not conform to the matchingRuleDescription syntax\:Cannot create a matchingRule that depends on non-existant syntax\:The following does not conform to the ditStructureRuleDescription syntax\:The following does not conform to the ditContentRuleDescription syntax\:The following does not conform to the nameFormDescription syntax\:Not allowed to set the wrappedPartition after initialization.\:Got more than one matchingRule for oid of\:Got more than one attributeType for oid of\:Got more than one syntax for oid of\:Got more than one syntaxChecker for oid of\:Attribute of second rdn in dn\:Got more than one result for the entity name\:Names used for principals must be normalized\!\:Unknown JNDI Context.REFERRAL value of\:Bad serialization, tree\:Null or empty data array is invalid.\:wrong array serialized data format\:Bad tree\:wrong AvlTree serialized data format\:This singleton AvlTree does not support changes since the behavior of alterations on a singleton are undefined.\:Could not find class\:This cursor locks down the key so keywise advances are not allowed.\:singleton must not be null\:orderedSet must not be null\:Cannot request singleton when in ordered set mode.\:Cannot set a singleton when using multiple values\:Already in singleton mode.\:Cannot get ordered set in singleton mode.\:Cannot set a orderedSet when in singleton mode\:Already in ordered set mode.\:Cannot use standard serialization for a ServerAttribute\:Cannot use standard serialization for a ServerEntry\:undefined modification type\:Cannot figure out attribute ID if both args are null\:Cannot take union of attributes with different IDs\!\:does not exist in the schema\:Encountered NamingException on underlying enumeration.\:Not a valid value\:expected string to normalize\:expected byte\:can't move the root DSE\:Unidentified change type value\:Cannot find directory service in environment\:Can't convert\:De-serialization of\:object deserialization stream close() failure\:Serialization of\:object serialization stream close() failure\:Don't know how to interpret\:but could not find it in env\!\:but it was set to null in env\!\:cannot be null.\:cannot specify simple authentication with supplying credentials\:does not contains the mandatory 'cn' attribute for JavaContainer ObjectClass\!\:can't delete the rootDSE\:Do not know how to store Referenceables yet\!\:Do not know how to store References yet\!\:Can't find a way to bind\:using object factories within the context's environment.\:is not an ancestor of this entry\:Both obj and attrs args are null. At least one of these parameters must not be null.\:Encountered parse exception while parsing the filter\:could not parse filter\:Config partition cannot be null\:the config partition is not initialized\:system partition doesn't exist\:yet to implement\:Invalid interceptor order\:Cannot overwrite, config output directory already exists\:Cannot copy non-existant source file\:Should not be hitting root without config/config pattern.\:parent cannot be null\:Failed to authenticate user\:Error during underflow\:Key not found\:BPage not ordered\:Invalid child subordinate key\:Argument 'recman' is null\:Argument 'comparator' is null\:Argument 'comparator' must be serializable\:Argument 'pageSize' must be even\:Argument 'key' is null\:Argument 'value' is null\:Argument 'obj1' is null\:Argument 'obj2' is null\:Platform doesn't support UTF8 encoding\:MRU cache must contain at least one entry\:Cannot add null listener.\:Internal cache cannot be null.\:key cannot be null.\:value cannot be null.\:Cannot create bucket with depth > MAX_DEPTH+1. Depth\:Cannot create deeper directory. Depth\:Argument 'recid' is invalid\:Name directory must exist\:RecordManager has been closed\:bogus block id\:BlockId assigned for transaction block\:transaction count on block\:Argument 'cache' is null\:DataPage.setFirst\:file header magic not OK\:couldn't obtain free translation\:page header magic for block\:page header magic not OK\:allocate of free page?\:free free page?\:free header page?\:Soft reference cache not implemented\:Weak reference cache not implemented\:Invalid cache type\:double get for block\:bad blockid\:in use list not empty at commit time\:in use list not empty at rollback time\:in txn list not empty at rollback time\:In transaction not empty\:Dirty blocks at close time\:inUse blocks at close time\:Offset too large for record header\:Argument 'maxTxns' must be greater than 0.\:Cannot change setting while transactions are pending in the log\:Bad magic on log file\:Unexcepted exception\:Invalid record manager provider\:Not a serialized BTreeRedirect object\:Not a serialized BTreeRedirect object\:this is not an arrayTree container\:this is not a btreeRedirect container\:This cursor can only be used with tables that have duplicate keys enabled.\:Value based advances not supported.\:No Equality MatchingRule available for attribute\:property for an index cannot be set after it has been initialized.\:Cannot set jdbm store property\:Errors encountered on destroy()\:when dereferenced would not name a known object. The aliased ObjectName\:Key comparator cannot be null.\:Value comparator must not be null for tables with duplicate keys.\:Unfortunately this Table without duplicates enabled does not contain a value comparator which is needed to answer your ordering question.\:null for key or value is not valid\:This Cursor does not support duplicate keys.\:Encoder unavailable for\:Error instantiating encoder for\:Decoder unavailable for\:Error accessing decoder for\:Error instantiating decoder for\:AS-REQ PA-ENC-TIMESTAMP padata timestamp, encrypted with the client key\:AS-REP Ticket and TGS-REP Ticket (includes TGS session key or application session key), encrypted with the service key\:AS-REP encrypted part (includes TGS session key or application session key), encrypted with the client key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS session key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS authenticator subkey\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator cksum, keyed with the TGS session key\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator (includes TGS authenticator subkey), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS authenticator subkey\:AP-REQ Authenticator cksum, keyed with the application session key\:AP-REQ Authenticator (includes application authenticator subkey), encrypted with the application session key\:AP-REP encrypted part (includes application session subkey), encrypted with the application session key\:KRB-PRIV encrypted part, encrypted with a key chosen by the application\:is not a supported encryption type.\:Callback not supported\:File is too large\:Could not completely read file\:Cannot encode the AuthorizationDataEntry object, the PDU size is\:Account Kerberos key attribute\:Failed to get catalog context\:Failed to get initial context\:Kerberos key should not be a String.\:Can't get a session\:An empty name is not valid in a kerberos name\:A '/' at the end of a Kerberos Name is not valid.\:Failed to connect to the server\:The specified configuration dir\:The expected context entry does not exist\:The entry already exists\:maxObjectSize\:No ASCII encoding\:Can't set option value\:Can't parse string representation\:illegal address\:is not a descendant of DhcpOption\:Can't initialize option field classes\:Max data length\:ASCII encoding unavailable\:Record type to objectClass mapping has not been set.\:ResourceRecord requires STRUCTURAL objectClass\:Invalid search base\:Can't get context at\:Invalid enum value\:SamSubsystem not enabled with key integrity checker\:Entry has null SAM type\:Could not find property\:Expecting entries with SAM type of\:Could not find verifier class\:No public default constructor on class\:Failed on default constructor invocation for class\:column index max is\:not found at search base DN\:Cannot receive NTLM message before sending Type 2 challenge.\:Cannot receive NTLM message after Type 3 has been received.\:Sasl challenge response already completed.\:Cannot send Type 2 challenge before Type 1 response.\:Cannot send Type 2 after it's already sent.\:response was null\:response with zero bytes\:There was a failure during NTLM Type 1 message handling.\:There was a failure during NTLM Type 3 message handling.\:Authentication attempted but the credentials were invalid..\:response with no auhcid or no password\:'0' chars are not allowed in authcid or no password\:The given InitialReponse is incorrect\:Cannot authenticate an invalid authcid DN\:Cannot authenticate the user\:Failed authorization in callback handler.\:Failed on keystore load which should never really happen.\:Failed to create KeyManagerFactory\:Failed to initialize KeyManagerFactory\:Failed to create SSLContext\:Failed to initialize SSLContext\:Failed to create a SSL context.\:Although ExtendedRequests are SingleReplyRequests they're not handled using this base class. They have no target entry unlike the rest of the SingleReplyRequests\:Unidentified single reply request/response type\:Unexpected base scope.\:TimeUnit not supported\:Unsupported protocol type\:Failed to add the extended operation of type\:Failed to add the SASL mechanism with the name\:Failed to add NTLM provider\:Empty ID\:Invalid replica ID\:The following schema directory from the installation layout could not be found\:Unknown SchemaObject type\:Could not find entry at\:Cannot delete entry\:not in value range\:Bind requests only tunnel down into partitions if there are no authenticators to handle the mechanism\:This cursor is empty and cannot return elements\!\:Cannot efficiently search the DIB w/o an index on attribute\:Cannot access element if positioned before first.\:Cannot access element if positioned after last.\:AndCursors are not ordered and do not support positioning by element.\:Cursor has not been positioned yet.\:Could not find matchingRule to use for EqualityNode evaluation\:Unrecognized leaf node\:Unrecognized branch node type\:Unrecognized search scope value for filter scope node\:EqualityCursors only support positioning by element when a user index exists on the asserted attribute.\:Could not find matchingRule to use for GreaterEqNode evaluation\:LessEqCursors only support positioning by element when a user index exists on the asserted attribute.\:chingRule to use for LessEqNode evaluation\:NotCursors are not ordered and do not support positioning by element.\:Scope Cursors are not ordered and do not support positioning by element.\:ScopeNode is not of onelevel scope.\:This is too inefficient without getId() on ServerEntry\:OrCursors are not ordered and do not support positioning by element.\:Must have 2 or more sub-expression Cursors for a disjunction\:PresenceCursors do not support positioning by element without a user index on the presence attribute.\:SubstringCursors may not be ordered and do not support positioning by element.\:Can't delete file\:ScopeNode is not of subtree scope.\:There can only be 2 columns at index 0 and at 1\:You didn't correctly set col names\:Unrecognized mode.\:Unrecognized FilterDialog command\:Cannot process a Request while binding\:Principal is not a valid Name\:Cannot encode the KrbError object, the PDU size is\:Cannot encode the KrbSafeBody object, the PDU size is\:Cannot encode the KrbSafe object, the PDU size is\:Cannot encode the EncKrbPrivPart object, the PDU size is\:Cannot encode the KrbPriv object, the PDU size is\:Cannot encode the KrbCredInfo object, the PDU size is\:Cannot encode the EncKrbCredPart object, the PDU size is\:Cannot encode the KrbCred object, the PDU size is\:Cannot encode the EncTicketPart object, the PDU size is\:Cannot encode the TypedData object, the PDU size is\:The PDU length is null, this is not allowed\:is not a valid KerberosString\:Not a valid log file number\:Not a valid log file offset\:Invalid log file bufferSize/ max size is sepcified bufferSize\:Log Scanner is already closed\:Log content is invalid
#
#TODO: add other error messages from other LDAP implementations such as the following list (from http://en.wikipedia.org/wiki/List_of_LDAP_software)
# Note: removed references to the ones handled above
#
# Apple Open Directory
# FreeIPA
# IBM Tivoli Directory Server
# Mandriva Directory Server
# Novell eDirectory
# OpenDJ - A fork of the OpenDS project
# OpenDS
# Virtual Identity Server from Optimal IdM
# Oracle Internet Directory
# Radiant Logic VDS
# Sun Java System Directory Server
# UnboundID Directory Server[1]
# Univention Corporate Server (with OpenLDAP from Univention)
# DirX Directory from Atos (ex-Siemens)  

ascanbeta.noanticsrftokens.name=\u0935\u093f\u0930\u094b\u0927\u0940-CSRF \u091f\u094b\u0915\u0928 \u0915\u0940 \u0905\u0928\u0941\u092a\u0938\u094d\u0925\u093f\u0924\u093f
ascanbeta.noanticsrftokens.desc=\u0915\u094b\u0908 \u090f\u0902\u091f\u0940-CSRF \u091f\u094b\u0915\u0928 \u090f\u0915 HTML \u092a\u094d\u0930\u0938\u094d\u0924\u0941\u0924 \u092b\u093e\u0930\u094d\u092e \u092e\u0947\u0902 \u092a\u093e\u090f \u0917\u090f\u0964
ascanbeta.noanticsrftokens.alert.attack=\u0915\u094b\u0908 \u0928\u0939\u0940\u0902\u0964 \u0915\u0947\u0935\u0932 \u091a\u0947\u0924\u093e\u0935\u0928\u0940\u0964
ascanbeta.noanticsrftokens.alert.extrainfo=\u0915\u094b\u0908 \u091c\u094d\u091e\u093e\u0924 \u090f\u0902\u091f\u0940-CSRF \u091f\u094b\u0915\u0928 \u092e\u0947\u0902 \u0928\u093f\u092e\u094d\u0928 HTML \u0928\u0939\u0940\u0902 \u092e\u093f\u0932\u0947

ascanbeta.remotecodeexecution.cve-2012-1823.name=\u0930\u093f\u092e\u094b\u091f \u0915\u094b\u0921 \u0915\u093e \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 - CVE-2012-1823
ascanbeta.remotecodeexecution.cve-2012-1823.desc=\u0915\u0941\u091b PHP \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u0939\u0948, \u091c\u092c CGI, \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u091a\u0932\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0938\u0939\u0940 \u0922\u0902\u0917 \u0938\u0947 \u092e\u0928\u092e\u093e\u0928\u093e \u0915\u094b\u0921 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u0915\u094b \u0938\u0915\u094d\u0937\u092e \u0915\u0930\u0928\u0947 \u0915\u0947 \u090f\u0915 unescaped "\=" \u0935\u0930\u094d\u0923, \u0915\u092e\u0940 \u0915\u094d\u0935\u0947\u0930\u0940 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917\u094d\u0938 \u0939\u0948\u0902\u0921\u0932 \u0928\u0939\u0940\u0902\u0964 \u0907\u0938 \u092e\u093e\u092e\u0932\u0947 \u092e\u0947\u0902, \u090f\u0915 \u0911\u092a\u0930\u0947\u091f\u093f\u0902\u0917 \u0938\u093f\u0938\u094d\u091f\u092e \u0915\u092e\u093e\u0902\u0921 \u0915\u094b \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093e\u0930\u0923 \u0925\u093e, \u0914\u0930 \u092a\u0930\u093f\u0923\u093e\u092e \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u0932\u093f\u090f \u0932\u094c\u091f \u0906\u090f \u0925\u0947\u0964 
ascanbeta.remotecodeexecution.cve-2012-1823.soln=PHP \u0915\u093e \u0928\u0935\u0940\u0928\u0924\u092e \u0938\u094d\u0925\u093f\u0930 \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u0915\u0947 \u0932\u093f\u090f \u0928\u0935\u0940\u0928\u0940\u0915\u0930\u0923, \u092f\u093e \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u094b\u0902 \u0915\u0947 "RewriteCond" \u0914\u0930 "RewriteRule" \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092c\u093e\u0939\u0930 \u092b\u093c\u093f\u0932\u094d\u091f\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f Apache \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0914\u0930 mod_rewrite \u092e\u0949\u0921\u094d\u092f\u0942\u0932 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964

ascanbeta.sessionfixation.name=\u0938\u0924\u094d\u0930 \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u0923
ascanbeta.sessionfixation.desc=\u0938\u0924\u094d\u0930 \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u0923 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 \u092f\u0926\u093f \u090f\u0915 \u0932\u0949\u0917\u093f\u0928 (\u091c\u0939\u093e\u0901 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u094d\u0935\u092f\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 authenticates) URL \u0915\u0947 \u0938\u093e\u0925 \u092f\u0939 \u0938\u092e\u0938\u094d\u092f\u093e \u0939\u094b\u0924\u0940 \u0939\u0948, \u0924\u094b \u092f\u0942\u0906\u0930\u090f\u0932 \u090f\u0915 \u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0938\u0924\u094d\u0930 id, \u0915\u0947 \u0938\u093e\u0925 \u0938\u093e\u0925 \u090f\u0915 \u0939\u092e\u0932\u093e\u0935\u0930 \u0926\u094d\u0935\u093e\u0930\u093e \u0936\u093f\u0915\u093e\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u0906\u0926\u0947\u0936 \u092e\u0947\u0902 \u092c\u093e\u0926 \u092e\u0947\u0902 \u0926\u093f\u090f \u0917\u090f \u0938\u0924\u094d\u0930 id \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0936\u093f\u0915\u093e\u0930 \u0915\u0940 \u092a\u0939\u091a\u093e\u0928 \u092e\u093e\u0928 \u0915\u0947 \u0932\u093f\u090f \u0926\u0940 \u091c\u093e \u0938\u0915\u0924\u0940 \u0939\u0948\u0964 \u092f\u0926\u093f \u0915\u093f\u0938\u0940 \u0917\u0948\u0930-\u0932\u0949\u0917\u0907\u0928 \u092a\u0947\u091c \u0915\u0947 \u0938\u093e\u0925 \u0938\u092e\u0938\u094d\u092f\u093e \u0939\u094b\u0924\u0940 \u0939\u0948, \u092f\u0942\u0906\u0930\u090f\u0932 \u0914\u0930 \u092b\u093f\u0915\u094d\u0938\u094d\u0921 \u0938\u0924\u094d\u0930 id \u0915\u0947\u0935\u0932 \u090f\u0915 \u0939\u092e\u0932\u093e\u0935\u0930 \u0928\u0947 \u090f\u0915 \u091c\u093f\u0938\u092e\u0947\u0902 \u0905\u092a\u094d\u0930\u092e\u093e\u0923\u093f\u0915 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0915\u093e\u0930\u094d\u092f\u094b\u0902 \u0915\u094b \u091f\u094d\u0930\u0948\u0915 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e\u0964 \u092f\u0926\u093f \u091c\u094b\u0916\u093f\u092e \u092a\u0930 \u090f\u0915 \u0915\u0941\u0915\u0940 \u092b\u093c\u0940\u0932\u094d\u0921 \u092f\u093e \u0915\u093f\u0938\u0940 \u092a\u094d\u0930\u092a\u0924\u094d\u0930 \u092b\u093c\u0940\u0932\u094d\u0921 (\u092a\u094b\u0938\u094d\u091f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930) \u0915\u0947 \u092c\u091c\u093e\u092f \u090f\u0915 URL (\u091c\u093e\u0913) \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092a\u0930 \u0939\u094b\u0924\u0940 \u0939\u0948, \u0924\u092c \u0915\u0941\u091b \u0905\u0928\u094d\u092f \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u092d\u0940 \u0915\u0941\u0915\u0940 \u0915\u094d\u0937\u0947\u0924\u094d\u0930 \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0915\u093e \u0936\u094b\u0937\u0923 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0940\u0921\u093c\u093f\u0924 \u0915\u0947 \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092a\u0930, \u0938\u0947\u091f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0921\u093c \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.sessionfixation.soln=1) \u0939\u092e\u0932\u093e\u0935\u0930 \u0915\u094b \u0930\u094b\u0915\u0928\u0947 \u0938\u0916\u094d\u0924 \u0938\u0924\u094d\u0930 ids \u0915\u094b \u0932\u093e\u0917\u0942 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e, \u0914\u0930 \u0915\u0947\u0935\u0932 \u0938\u092b\u0932 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0906\u0935\u0947\u0926\u0928 \u0915\u0930\u0928\u0947 \u092a\u0930 \u0938\u0924\u094d\u0930 ids \u0915\u093e \u0906\u0935\u0902\u091f\u0928 \u0926\u094d\u0935\u093e\u0930\u093e \u090f\u0915 \u0938\u0924\u094d\u0930 id \u092a\u093e\u0928\u0947 \u0938\u0947\u0964 2) \u0938\u0930\u094d\u0935\u0930 \u0939\u092e\u0947\u0936\u093e \u090f\u0915 \u0928\u092f\u093e \u0938\u0924\u094d\u0930 id \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0915\u0940 \u092a\u0930\u0935\u093e\u0939 \u0915\u093f\u090f \u092c\u093f\u0928\u093e \u0915\u093f \u0915\u094d\u092f\u093e \u090f\u0915 \u0938\u0924\u094d\u0930 \u0915\u0947 \u092a\u0939\u0932\u0947 \u0938\u0947 \u0939\u0940 \u091c\u0917\u0939 \u092e\u0947\u0902 \u0939\u0948, \u092a\u0930 \u092c\u0928\u093e\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964 3) \u0915\u0941\u091b identificable \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u0938\u0902\u092f\u094b\u091c\u0928, \u091c\u0948\u0938\u0947 IP \u092a\u0924\u093e, SSL \u0915\u094d\u0932\u093e\u092f\u0902\u091f \u092a\u094d\u0930\u092e\u093e\u0923\u092a\u0924\u094d\u0930 \u0915\u0947 \u0932\u093f\u090f \u0938\u0924\u094d\u0930 \u0906\u0908\u0921\u0940 \u092c\u093e\u0901\u0927\u0964 4) \u0938\u0924\u094d\u0930, \u0938\u0930\u094d\u0935\u0930 \u092a\u0930, \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u092a\u0930 \u0914\u0930 \u0938\u093e\u0925 \u0939\u0940 \u091c\u092c \u0928\u0937\u094d\u091f \u0915\u0930 \u0926\u093f\u092f\u093e, \u0928\u0937\u094d\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0915\u0930\u0928\u093e \u0939\u094b\u0917\u093e\u0964 5) \u0915\u094b \u0932\u093e\u0917\u0942 \u0915\u0930\u0928\u0947 \u090f\u0915 \u0932\u0949\u0917\u0906\u0909\u091f \u0924\u0902\u0924\u094d\u0930 \u0939\u0948 \u091c\u094b \u0938\u092d\u0940 \u092a\u093f\u091b\u0932\u0947 \u0938\u0924\u094d\u0930 \u0915\u0947 \u0932\u093f\u090f \u0917\u094d\u0930\u093e\u0939\u0915 \u0915\u094b \u0928\u0937\u094d\u091f \u0915\u0930 \u0926\u0947\u0917\u093e\u0964 6) \u092a\u0942\u0930\u094d\u0923 \u0938\u0924\u094d\u0930 timeouts \u0915\u094b \u0932\u093e\u0917\u0942\u0964 \u092c\u093e\u0926 \u0906\u092e\u0924\u094c\u0930 \u092a\u0930 \u0905\u0924\u093f\u0930\u093f\u0915\u094d\u0924 \u0915\u092e\u091c\u094b\u0930\u093f\u092f\u094b\u0902, \u090f\u0915 \u0939\u092e\u0932\u093e\u0935\u0930 \u0926\u094d\u0935\u093e\u0930\u093e \u0926\u094b\u0939\u0928 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u090f\u0915 \u0915\u0941\u0915\u0940 \u092f\u093e \u092a\u094d\u0930\u092a\u0924\u094d\u0930 \u0915\u0947 \u0932\u093f\u090f \u0906\u0927\u093e\u0930 URL \u0938\u0947 7) \u0938\u094d\u0935\u093f\u091a \u0938\u0924\u094d\u0930 id \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928, \u0906\u0927\u093e\u0930\u093f\n
ascanbeta.sessionfixation.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management https\://www.owasp.org/index.php/Session_fixation http\://www.acros.si/papers/session_fixation.pdf http\://www.technicalinfo.net/papers/WebBasedSessionManagement.html https\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionfixation.alert.cookie.extrainfo=\u0915\u0941\u0915\u0940 \u0915\u0940 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0938\u0947\u091f \u091c\u092c \u0915\u0941\u0915\u0940 \u092b\u093c\u0940\u0932\u094d\u0921 [{0}] \u0928\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\: [{1}] \u0915\u0947 \u0938\u093e\u0925 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0938\u0947\u091f \u0915\u0941\u0915\u0940 \u0909\u0927\u093e\u0930 \u0932\u093f\u092f\u093e (\u092e\u093e\u0928\u094d\u092f) \u0915\u0941\u0915\u0940 \u092e\u093e\u0928 \u0905\u0928\u0941\u0930\u094b\u0927 [{1}] \u092e\u0947\u0902\: [{2}]
ascanbeta.sessionfixation.alert.cookie.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionfixation.alert.url.extrainfo=\u091c\u092c URL \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930/\u091b\u0926\u094d\u092e URL \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 [{0}] \u0928\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u091f \u0939\u0948 \u090f\u0915 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0938\u0924\u094d\u0930 \u092e\u093e\u0928 Url \u092e\u0947\u0902 HTML \u0906\u0909\u091f\u092a\u0941\u091f \u092e\u0947\u0902 \u092a\u094d\u0930\u0915\u091f \u0939\u0941\u0908 \u0939\u0948\: [{1}] \u091c\u092c \u092f\u0939 \u0909\u0927\u093e\u0930'' \u0938\u0924\u094d\u0930 [{1}]'' \u0907\u0938 URL \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 \u092c\u093e\u0926 \u0915\u0947 \u0905\u0928\u0941\u0930\u094b\u0927 \u092e\u0947\u0902 \u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093f\u092f\u093e \u091c\u093e\u0924\u093e \u0939\u0948, \u090f\u0915 \u0928\u092f\u093e \u0938\u0924\u094d\u0930 \u0928\u0939\u0940\u0902 \u092c\u0928\u093e\u0908 \u0917\u0908 \u0939\u0948\u0964
ascanbeta.sessionfixation.alert.url.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionfixation.alert.attack={0} \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}]
ascanbeta.sessionfixation.alert.logmessage=\u090f\u0915 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0938\u0924\u094d\u0930 \u0928\u093f\u092f\u0924\u0928 \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0915\u0947 \u0938\u093e\u0925 URL [{1}] [{0}] {2} \u092e\u0948\u0926\u093e\u0928 \u092a\u0930 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0939\u0948\: [{3}]
#Exposed Session Id messages
ascanbeta.sessionidexposedinurl.name=\u0909\u091c\u093e\u0917\u0930 \u0938\u0924\u094d\u0930 ID
ascanbeta.sessionidexposedinurl.desc=\u090f\u0915 \u0938\u0924\u094d\u0930 id URL \u092e\u0947\u0902 \u0905\u0935\u0917\u0924 \u0915\u0930\u093e\u092f\u093e \u0939\u0948\u0964 \u0910\u0938\u0940 \u090f\u0915 \u0935\u0947\u092c\u0938\u093e\u0907\u091f \u092f\u0942\u0906\u0930\u090f\u0932 (\u0938\u0924\u094d\u0930 id \u0938\u0947 \u092f\u0941\u0915\u094d\u0924) \u0938\u093e\u091d\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e, \u090f\u0915 naiive \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0905\u0928\u091c\u093e\u0928\u0947 \u0909\u0928\u0915\u0947 \u0921\u0947\u091f\u093e \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u0905\u092a\u0928\u0940 \u0917\u094b\u092a\u0928\u0940\u092f\u0924\u093e, \u0905\u0916\u0902\u0921\u0924\u093e \u0914\u0930 \u0909\u092a\u0932\u092c\u094d\u0927\u0924\u093e \u0938\u0947 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u090f \u0926\u0947\u0928\u0947 \u0939\u094b \u0938\u0915\u0924\u093e\u0964  \u092f\u0942\u0906\u0930\u090f\u0932 \u0938\u0924\u094d\u0930 \u092a\u0939\u091a\u093e\u0928\u0915\u0930\u094d\u0924\u093e \u092d\u0940 \u092f\u0941\u0915\u094d\u0924 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092c\u0941\u0915\u092e\u093e\u0930\u094d\u0915\u094d\u0938, \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0932\u0949\u0917 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0914\u0930 \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930 \u0932\u0949\u0917 \u092b\u093c\u093e\u0907\u0932\u094b\u0902 \u092e\u0947\u0902 \u092a\u094d\u0930\u0915\u091f \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964 
ascanbeta.sessionidexposedinurl.soln=\u090f\u0915 \u0905\u0927\u093f\u0915 \u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0938\u0924\u094d\u0930 \u092a\u094d\u0930\u092c\u0902\u0927\u0928 \u0915\u093e\u0930\u094d\u092f\u093e\u0928\u094d\u0935\u092f\u0928, \u091c\u0948\u0938\u0947 \u0915\u093f \u0938\u0924\u094d\u0930 \u0915\u0941\u0915\u0940\u091c\u093c \u091c\u094b \u0930\u0942\u092a \u092e\u0947\u0902 \u0906\u0938\u093e\u0928\u0940 \u0938\u0947 \u0905\u0928\u091c\u093e\u0928\u0947 \u0938\u093e\u091d\u093e \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902 \u0928\u0939\u0940\u0902 \u0939\u0948, \u0914\u0930 \u091c\u094b \u0938\u0930\u094d\u0935\u0930 \u0932\u0949\u0917 \u092b\u093e\u0907\u0932 \u092f\u093e \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092c\u0941\u0915\u092e\u093e\u0930\u094d\u0915\u094d\u0938 \u092e\u0947\u0902 \u0938\u093e\u092e\u093e\u0928\u094d\u092f\u0924\u092f\u093e \u092a\u094d\u0930\u0915\u091f \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0947 \u0939\u0948\u0902, \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948 \u090f\u0915 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexposedinurl.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management
ascanbeta.sessionidexposedinurl.alert.extrainfo={0} [{1}] \u092b\u093c\u0940\u0932\u094d\u0921 \u090f\u0915 \u0909\u091c\u093e\u0917\u0930 \u0938\u0924\u094d\u0930 \u092a\u0939\u091a\u093e\u0928\u0915\u0930\u094d\u0924\u093e [{2}] \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902
ascanbeta.sessionidexposedinurl.alert.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionidexposedinurl.alert.attack={0} \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}]
ascanbeta.sessionidexposedinurl.alert.logmessage=An exposed session identifier has been found at [{0}] URL [{1}] on {2} field\: [{3}]
#Session Id Cookie not sent securely
ascanbeta.sessionidsentinsecurely.name=Session ID Transmitted Insecurely
ascanbeta.sessionidsentinsecurely.desc=A session id may be sent via an insecure mechanism. In the case of a cookie sent in the request, this occurs when HTTP, rather than HTTPS, is used.  In the case of a cookie sent by the server in response (when the URL is modified by setting the named parameter field to NULL), the 'secure' flag is not set, allowing the cookie to be sent later via HTTP rather than via HTTPS. This may allow a passive eavesdropper on the network path to gain full access to the victim's session.  
ascanbeta.sessionidsentinsecurely.soln=1) Use the latest available version of SSL/TLS (for HTTPS) for all pages where a session id is communicated between the browser and the web server.\n2) Do not allow the communication to be forced down to the unencrypted HTTP protocol.\n3) Use the 'secure' flag when setting a cookie containing a session id, to prevent its subsequent transmission by an insecure mechanism.\n4) Forward non-secure HTTP page requests to the secure HTTPS equivalent page.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidsentinsecurely.refs=https\://www.owasp.org/index.php/Top_10_2010-A3-Broken_Authentication_and_Session_Management\nhttps\://www.owasp.org/index.php/Top_10_2010-A9
ascanbeta.sessionidsentinsecurely.alert.extrainfo=session identifier {0} field [{1}], value [{2}] may be sent via an insecure mechanism.  
ascanbeta.sessionidsentinsecurely.alert.extrainfo.secureflagnotset=The 'secure' flag was not set on the session cookie supplied by the server.
ascanbeta.sessionidsentinsecurely.alert.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionidsentinsecurely.alert.attack={0} \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}]
ascanbeta.sessionidsentinsecurely.alert.logmessage=A session identifier in {2} field\: [{3}] may be sent via an insecure mechanism at [{0}] URL [{1}]
#Session Id Cookie accessible by JavaScript
ascanbeta.sessionidaccessiblebyjavascript.name=Session ID Cookie Accessible to JavaScript
ascanbeta.sessionidaccessiblebyjavascript.desc=A Session Id cookie sent by the server (when the URL is modified by setting the named parameter field to NULL) may be accessed by JavaScript on the client. In conjunction with another vulnerability, this may allow the session to be hijacked.  
ascanbeta.sessionidaccessiblebyjavascript.soln=1) Use the 'httponly' flag when setting a cookie containing a session id, to prevent it from being accessed by JavaScript in the web browser.  
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidaccessiblebyjavascript.refs=
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo=session identifier {0} field [{1}], value [{2}] may be accessed using JavaScript in the web browser
ascanbeta.sessionidaccessiblebyjavascript.alert.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionidaccessiblebyjavascript.alert.attack={0} \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}]
ascanbeta.sessionidaccessiblebyjavascript.alert.logmessage=\u090f\u0915 \u0938\u0924\u094d\u0930 \u092a\u0939\u091a\u093e\u0928\u0915\u0930\u094d\u0924\u093e [{0}] [{1}] \u092f\u0942\u0906\u0930\u090f\u0932 {2} \u0915\u094d\u0937\u0947\u0924\u094d\u0930 \u092e\u0947\u0902\: [{3}] \u091c\u093e\u0935\u093e\u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u0915\u0947 \u0932\u093f\u090f \u0938\u0941\u0932\u092d \u0939\u094b \u0938\u0915\u0924\u0940  
#Session Id Cookie Expiry
ascanbeta.sessionidexpiry.name=\u0905\u0924\u094d\u092f\u0927\u093f\u0915 \u0938\u0924\u094d\u0930 ID \u0938\u092e\u093e\u092a\u094d\u0924\u093f \u0938\u092e\u092f/Max-\u0906\u092f\u0941 \u0939\u0948
ascanbeta.sessionidexpiry.desc=\u090f\u0915 \u0938\u0924\u094d\u0930 Id \u0915\u0941\u0915\u0940 \u091c\u092c (URL \u0928\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0928\u093e\u092e\u093e\u0902\u0915\u093f\u0924 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092b\u093c\u0940\u0932\u094d\u0921 \u0938\u0947\u091f\u093f\u0902\u0917 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948) \u0938\u0930\u094d\u0935\u0930 \u0926\u094d\u0935\u093e\u0930\u093e \u092d\u0947\u091c\u093e \u0917\u092f\u093e \u090f\u0915 \u0905\u0924\u094d\u092f\u0927\u093f\u0915 \u0938\u092e\u092f \u0905\u0935\u0927\u093f \u0915\u0947 \u0932\u093f\u090f \u092e\u093e\u0928\u094d\u092f \u0939\u094b\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u091f \u0939\u0948\u0964 \u092f\u0939 \u090f\u0915 \u0939\u092e\u0932\u093e\u0935\u0930 \u0926\u094d\u0935\u093e\u0930\u093e \u0926\u094b\u0939\u0928 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 \u0905\u0917\u0930 \u092c\u093e\u0939\u0930, \u0932\u0949\u0917 \u0911\u0928 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u092d\u0942\u0932\u0924\u093e \u092f\u0926\u093f \u0932\u0949\u0917\u0906\u0909\u091f \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0937\u092e\u0924\u093e \u0938\u0924\u094d\u0930 \u0938\u0939\u0940 \u0922\u0902\u0917 \u0938\u0947 \u0928\u0937\u094d\u091f \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u093e \u0939\u0948, \u092f\u093e \u092f\u0926\u093f \u0938\u0924\u094d\u0930 id \u0926\u094d\u0935\u093e\u0930\u093e \u0915\u0941\u091b \u0905\u0928\u094d\u092f \u0905\u0930\u094d\u0925 \u0939\u0948 \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u092f\u093e \u0939\u0948\u0964     
ascanbeta.sessionidexpiry.soln=1) '\u0928\u093f\u0936\u094d\u0935\u093e\u0938\u0928' \u092f\u093e '\u0905\u0927\u093f\u0915\u0924\u092e \u0906\u092f\u0941' \u0915\u0941\u0915\u0940 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u094b\u0902 \u091c\u092c \u092f\u0941\u0915\u094d\u0924 \u090f\u0915 \u0938\u0924\u094d\u0930 id \u0915\u0941\u0915\u0940 \u0938\u0947\u091f\u093f\u0902\u0917 \u092f\u0939 \u0938\u092e\u092f \u0915\u0940 \u0932\u0902\u092c\u0940 \u0905\u0935\u0927\u093f \u0915\u0947 \u0932\u093f\u090f \u0909\u092a\u0932\u092c\u094d\u0927 \u0939\u094b\u0928\u0947 \u0938\u0947 \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 2) \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u0932\u0949\u0917 \u0906\u0909\u091f \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0937\u092e\u0924\u093e \u092e\u094c\u091c\u0942\u0926 \u0939\u0948, \u0914\u0930 \u0915\u093f \u092f\u0939 \u0938\u0939\u0940 \u0922\u0902\u0917 \u0938\u0947 \u0938\u0924\u094d\u0930 \u0915\u094b \u0928\u0937\u094d\u091f \u0915\u0930 \u0926\u0947\u0924\u093e \u0939\u0948\u0964 3) \u0905\u0917\u0930 \u090f\u0915 \u0938\u0924\u094d\u0930 id \u0938\u092e\u091d\u094c\u0924\u093e \u0915\u093f\u092f\u093e \u0939\u0948, \u0907\u0938\u0947 \u0928\u0939\u0940\u0902 \u0915\u093e \u0936\u094b\u0937\u0923 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0915\u093f \u092f\u0939 \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u094d\u092f preventative \u0909\u092a\u093e\u092f\u094b\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964
#these refs cannot be referenced, but we leave it here in the hope that it can be in the future..
ascanbeta.sessionidexpiry.refs=
ascanbeta.sessionidexpiry.alert.extrainfo=\u091c\u092c \u0924\u0915 \u0915\u093f \u0938\u0924\u094d\u0930 \u0915\u094b \u0928\u0937\u094d\u091f \u0915\u0930 \u0926\u093f\u092f\u093e \u0939\u0948 \u0938\u0924\u094d\u0930 \u092a\u0939\u091a\u093e\u0928\u0915\u0930\u094d\u0924\u093e {0} \u092b\u093c\u0940\u0932\u094d\u0921 [{1}], [{2}] \u092e\u0942\u0932\u094d\u092f [(\u0915\u0941\u0915\u0940 {4} \u092a\u0930 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e \u0915\u0947 \u092c\u093e\u0926 \u0938\u0947){3} \u0924\u0915], \u092a\u0939\u0941\u0901\u091a\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.sessionidexpiry.alert.extrainfo.loginpage=Url \u092a\u0930 \u091c\u094b \u092e\u0941\u0926\u094d\u0926\u0947 \u0915\u0940 \u0916\u094b\u091c \u0915\u0940 \u0925\u0940 \u090f\u0915 \u0932\u0949\u0917\u0911\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u091d\u0902\u0921\u0940 \u0926\u093f\u0916\u093e\u0915\u0930 \u0930\u0935\u093e\u0928\u093e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanbeta.sessionidexpiry.alert.attack={0} \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}]
ascanbeta.sessionidexpiry.alert.logmessage=\u090f\u0915 \u0938\u0924\u094d\u0930 \u092a\u0939\u091a\u093e\u0928\u0915\u0930\u094d\u0924\u093e [{0}] [{1}] \u092f\u0942\u0906\u0930\u090f\u0932 {2} \u0915\u094d\u0937\u0947\u0924\u094d\u0930 \u092e\u0947\u0902\: [{3}] \u092e\u0908 \u0924\u0915 \u092a\u0939\u0941\u0901\u091a\u093e \u091c\u093e \u0924\u0915 [{4}], \u091c\u092c \u0924\u0915 \u0915\u093f \u0938\u0924\u094d\u0930 \u0915\u094b \u0928\u0937\u094d\u091f \u0915\u0930 \u0926\u093f\u092f\u093e \u0939\u0948\u0964
ascanbeta.sessionidexpiry.browserclose=\u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092c\u0902\u0926 \u0915\u0930\u0947\u0902
ascanbeta.sessionidexpiry.timemorethanoneweek=\u0905\u0927\u093f\u0915 \u0938\u0947 \u0905\u0927\u093f\u0915 \u090f\u0915 \u0938\u092a\u094d\u0924\u093e\u0939
ascanbeta.sessionidexpiry.timemorethanoneday=\u0905\u0927\u093f\u0915 \u0938\u0947 \u0905\u0927\u093f\u0915 \u090f\u0915 \u0926\u093f\u0928
ascanbeta.sessionidexpiry.timemorethanonehour=\u090f\u0915 \u0918\u0902\u091f\u0947 \u0938\u0947 \u0905\u0927\u093f\u0915
ascanbeta.sessionidexpiry.timelessthanonehour=\u0915\u092e \u0938\u0947 \u0915\u092e \u090f\u0915 \u0918\u0902\u091f\u093e
ascanbeta.sessionidexpiry.timeexpired=\u0915\u0940 \u0938\u092e\u092f \u0938\u0940\u092e\u093e \u0938\u092e\u093e\u092a\u094d\u0924

ascanbeta.shellshock.name=\u0930\u093f\u092e\u094b\u091f \u0915\u094b\u0921 \u0915\u093e \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 - \u0936\u0947\u0932 \u0936\u0949\u0915
ascanbeta.shellshock.desc=\u0938\u0930\u094d\u0935\u0930 \u0926\u0942\u0930\u0938\u094d\u0925 \u0939\u092e\u0932\u093e\u0935\u0930\u094b\u0902 \u092a\u0930 \u0938\u094d\u0935\u0948\u091a\u094d\u091b\u093f\u0915 \u0915\u094b\u0921 \u0915\u094b \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u092a\u093e\u0930\u094d\u091f\u0940 \u0915\u0940 \u092f\u094b\u091c\u0928\u093e \u092c\u0928\u093e\u0908 \u0916\u094b\u0932 \u0915\u0947 \u0915\u093f\u0938\u0940 \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u091a\u0932 \u0930\u0939\u093e \u0939\u0948 
ascanbeta.shellshock.extrainfo=CVE-2014-6271 \u0938\u0947\: \u0917\u094d\u0928\u0942 Bash 4.3 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0924\u093e\u0930 \u0915\u0947 \u092a\u0940\u091b\u0947 \u091a\u0932 \u0938\u092e\u093e\u0930\u094b\u0939 \u092a\u0930\u093f\u092d\u093e\u0937\u093e\u090f\u0901 \u092a\u0930\u093f\u0935\u0947\u0936 \u091a\u0930, \u0915\u0947 \u092c\u093e\u0926 \u092e\u0942\u0932\u094d\u092f\u094b\u0902 \u092e\u0947\u0902 \u091c\u094b \u0935\u0948\u0915\u094d\u091f\u0930 OpenSSH sshd, mod_cgi \u0914\u0930 mod_cgid \u092e\u0947\u0902 \u092e\u0949\u0921\u094d\u092f\u0942\u0932 \u0915\u094b Apache HTTP \u0938\u0930\u094d\u0935\u0930, \u0905\u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f DHCP \u0915\u094d\u0932\u093e\u0907\u0902\u091f, \u0914\u0930 \u0905\u0928\u094d\u092f \u0938\u094d\u0925\u093f\u0924\u093f\u092f\u094b\u0902 \u092e\u0947\u0902 \u091c\u094b \u0938\u0947\u091f\u093f\u0902\u0917 \u092a\u0930\u094d\u092f\u093e\u0935\u0930\u0923 Bash \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u0938\u0947 \u090f\u0915 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0938\u0940\u092e\u093e \u092a\u093e\u0930 \u0939\u094b\u0924\u0940 \u0939\u0948 \u0926\u094d\u0935\u093e\u0930\u093e \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0932\u093f\u092a\u093f\u092f\u094b\u0902 \u092e\u0947\u0902 ForceCommand \u0938\u0941\u0935\u093f\u0927\u093e \u0915\u094b \u0936\u093e\u092e\u093f\u0932 \u0915\u0930\u0915\u0947 \u092a\u094d\u0930\u0926\u0930\u094d\u0936\u0928 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0926\u0942\u0930\u0938\u094d\u0925 \u0939\u092e\u0932\u093e\u0935\u0930\u094b\u0902 \u090f\u0915 \u0917\u0922\u093c\u0940 \u0917\u0908 \u092a\u0930\u094d\u092f\u093e\u0935\u0930\u0923 \u0915\u0947 \u091c\u0930\u093f\u090f \u092e\u0928\u092e\u093e\u0928\u093e \u0915\u094b\u0921 \u0915\u094b \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u0938\u0902\u0938\u093e\u0927\u093f\u0924 \u0915\u0930\u0924\u093e \u0939\u0948, \u0909\u0930\u094d\u092b "ShellShock." \u0928\u094b\u091f\: \u0907\u0938 \u0938\u092e\u0938\u094d\u092f\u093e \u0915\u0947 \u092e\u0942\u0932 \u0928\u093f\u0926\u093e\u0928 \u0917\u0932\u0924 \u0925\u093e; CVE-2014-7169 \u0917\u093c\u0932\u0924 \u0924\u092f \u0915\u0930\u0928\u0947 \u0915\u0947 \u092c\u093e\u0926 \u0905\u092d\u0940 \u092d\u0940 \u092e\u094c\u091c\u0942\u0926 \u0939\u0948 \u0907\u0938 \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0915\u094b \u0915\u0935\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0938\u093e\u0907\u0928 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964
ascanbeta.shellshock.soln=\u092a\u093e\u0930\u094d\u091f\u0940 \u0915\u0940 \u092f\u094b\u091c\u0928\u093e \u092c\u0928\u093e\u0908 \u0915\u093e \u0928\u0935\u0940\u0928\u0924\u092e \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u0915\u094b \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0905\u0926\u094d\u092f\u0924\u0928
ascanbeta.shellshock.ref=' http\://www.troyhunt.com/2014/09/everything-you-need-to-know-about.html http\://web.nvd.nist.gov/view/vuln/detail?vulnId\=CVE-2014-6271
ascanbeta.shellshock.timingbased.evidence=\u0939\u092e\u0932\u0947 \u0915\u093e \u0909\u092a\u092f\u094b\u0917, [{0}] \u092e\u093f\u0932\u0940\u0938\u0947\u0915\u0947\u0902\u0921\u094b\u0902 \u0915\u0940 \u090f\u0915 \u0935\u093f\u0932\u0902\u092c \u092a\u094d\u0930\u0947\u0930\u093f\u0924 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0914\u0930 \u0925\u093e

ascanbeta.sqlinjection.mysql.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - MySQL
ascanbeta.sqlinjection.hypersonic.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - \u0939\u093e\u0907\u092a\u0930\u0938\u0949\u0928\u093f\u0915 SQL
ascanbeta.sqlinjection.oracle.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - Oracle
ascanbeta.sqlinjection.postgres.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - PostgreSQL
ascanbeta.sqlinjection.desc=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.sqlinjection.soln=\u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u0905\u0917\u0930 \u0935\u0939\u093e\u0901 \u0939\u0948 \u091c\u0917\u0939 \u092e\u0947\u0902 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0938\u0924\u094d\u092f\u093e\u092a\u0928 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f, \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0947\u0964 \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u092e\u0947\u0902, \u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092a\u0930 \u0938\u092d\u0940 \u0921\u0947\u091f\u093e \u0915\u0940 \u091c\u093e\u0901\u091a \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f JDBC \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, PreparedStatement \u092f\u093e CallableStatement, \u092a\u093e\u0930\u093f\u0924 \u0915\u0930 \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0938\u093e\u0925 \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902 '?' \u092f\u0926\u093f ASP \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, \u092e\u091c\u092c\u0942\u0924 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u091c\u093e\u0901\u091a \u0914\u0930 \u0905\u0928\u094d\u092f \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u0915\u0947 \u0938\u093e\u0925 ADO \u0906\u0926\u0947\u0936 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f\u092f\u093e\u0901 \u0909\u092a\u092f\u094b\u0917 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u0909\u0928\u094d\u0939\u0947\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u0915\u0930 * \u0928 * \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f \u092e\u0947\u0902 \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092e\u0947\u0902 \u0924\u093e\u0930 \u091c\u094b\u0921\u093c\u0928\u093e, \u092f\u093e 'exec', '\u0924\u0924\u094d\u0915\u093e\u0932 exec' \u092f\u093e \u0938\u092e\u0924\u0941\u0932\u094d\u092f \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0937\u092e\u0924\u093e \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\! \u0938\u0930\u0932 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0915\u0921\u093c\u0940 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0921\u093e\u092f\u0928\u0947\u092e\u093f\u0915 SQL \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092c\u0928\u093e\u0928\u093e \u0928\u0939\u0940\u0902\u0964 \u0938\u092d\u0940 \u0917\u094d\u0930\u093e\u0939\u0915 \u0938\u0947 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u093e\u091f\u093e \u0938\u0947 \u092c\u091a\u0964 \u090f\u0915 '\u0936\u094d\u0935\u0947\u0924 \u0938\u0942\u091a\u0940', \u092f\u093e \u090f\u0915 '\u092c\u094d\u0932\u0948\u0915\u0932\u093f\u0938\u094d\u091f' \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0935\u0930\u094d\u0923 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u092e\u0947\u0902 \u0938\u094d\u0935\u0940\u0915\u0943\u0924 \u0935\u0930\u094d\u0923\u094b\u0902 \u0915\u0947 \u0932\u093e\u0917\u0942 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0938\u0947 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u0902\u092d\u0935 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0932\u093e\u0917\u0942 \u0915\u0930\u0947\u0902\u0964 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947, '\u0938\u093e' \u092f\u093e 'db-\u0938\u094d\u0935\u093e\u092e\u0940' \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e\u0913\u0902 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917 \u0938\u0947 \u092c\u091a\u0947\u0902\u0964 \u0907\u0938 SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u094b \u0916\u0924\u094d\u092e \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0940 \u0939\u0948, \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0915\u0947 \u092a\u094d\u0930\u092d\u093e\u0935 \u0915\u094b \u0915\u092e \u0915\u0930\u0924\u093e \u0939\u0948\u0964 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0932\u093f\u090f \u091c\u0930\u0942\u0930\u0940 \u0939\u0948 \u0915\u093f \u0915\u092e \u0938\u0947 \u0915\u092e \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u092a\u094d\u0930\u0926\u093e\u0928 \u0915\u0930\u0924\u0947 \u0939\u0948\u0902\u0964
ascanbeta.sqlinjection.refs=' https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet https\://www.owasp.org/index.php/Top_10_2010-A1
#ascanbeta.sqlinjection.alert.errorbased.attack={1}
ascanbeta.sqlinjection.alert.errorbased.differentiation.attack=\u092e\u0942\u0932 \u092e\u0942\u0932\u094d\u092f\: [{0}]\u0964 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u092e\u093e\u0928\: [{1}]\u0964 \u0928\u093f\u092f\u0902\u0924\u094d\u0930\u0923 \u092e\u093e\u0928\: [{2}]
ascanbeta.sqlinjection.alert.booleanbased.attack=\u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{0}], \u092e\u0942\u0932\u094d\u092f [{1}]
ascanbeta.sqlinjection.alert.unionbased.attack=[{0}] \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}], \u092e\u0942\u0932\u094d\u092f [{2}]
ascanbeta.sqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e, \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 \u092e\u0947\u0902 HTML \u092a\u0930\u093f\u0923\u093e\u092e \u091f\u0941\u0915\u0921\u093c\u093e [{1}] \u0915\u094b \u0926\u0947\u0916\u0924\u0947 \u0939\u0941\u090f
ascanbeta.sqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e, \u0938\u0902\u0918-\u0935\u093f\u0936\u093f\u0937\u094d\u091f \u0938\u0902\u0926\u0947\u0936 HTML \u092a\u0930\u093f\u0923\u093e\u092e \u092e\u0947\u0902 \u091f\u0941\u0915\u0921\u093c\u093e [{1}] \u0915\u094b \u0926\u0947\u0916\u0924\u0947 \u0939\u0941\u090f
ascanbeta.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{0}] unmodified \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e, HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{1}] \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e
ascanbeta.sqlinjection.alert.errorbased.differentiation.extrainfo=HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{0}] unmodified \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e, HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{2}], \u0936\u0930\u0940\u0930 \u0915\u0940 \u0932\u0902\u092c\u093e\u0908 [{3}] \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0936\u0930\u0940\u0930 \u0932\u0902\u092c\u093e\u0908 [{1}], \u0915\u093e \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e\u0964 \u090f\u0915 \u0924\u093f\u0939\u093e\u0908 (\u0917\u0948\u0930-SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u092e\u093e\u0928 \u0909\u0924\u094d\u092a\u094d\u0930\u0947\u0930\u0923) HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{4}], \u0936\u0930\u0940\u0930 \u0915\u0940 \u0932\u0902\u092c\u093e\u0908 [{5}] \u0926\u093f\u092f\u093e \u0925\u093e
ascanbeta.sqlinjection.alert.booleanbased.extrainfo=\u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u092a\u0930\u093f\u0923\u093e\u092e \u092e\u0947\u0902 \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u092c\u0942\u0932\u093f\u092f\u0928 \u0936\u0930\u094d\u0924\u094b\u0902 [{0}] \u0914\u0930 [{1}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0939\u0947\u0930\u092b\u0947\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e
ascanbeta.sqlinjection.alert.timebased.extrainfo=\u0915\u094d\u0935\u0947\u0930\u0940 \u0938\u092e\u092f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 [{0}], \u091c\u093f\u0938\u0915\u0947 \u0915\u093e\u0930\u0923 \u091c\u092c \u092e\u0942\u0932\u094d\u092f [{2}] \u0915\u0947 \u0938\u093e\u0925 \u092e\u0942\u0932 unmodified \u0915\u094d\u0935\u0947\u0930\u0940 [{3}] \u092e\u093f\u0932\u0940\u0938\u0947\u0915\u0902\u0921 \u0932\u093f\u092f\u093e [{1}] \u092e\u093f\u0938\u0947, \u0932\u0947 \u0932\u094b \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u091a\u0932\u093e\u092f\u093e \u0939\u0941\u0906 \u0939\u0948 

ascanbeta.sourcecodedisclosure.desc=\u0935\u0930\u094d\u0924\u092e\u093e\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u092c\u0924\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e

ascanbeta.sourcecodedisclosurecve-2012-1823.name=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - CVE-2012-1823
ascanbeta.sourcecodedisclosurecve-2012-1823.desc=\u0915\u094d\u0935\u0947\u0930\u0940 \u0924\u093e\u0930 \u0915\u093f PHP \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923, \u0914\u0930 \u092e\u0928\u092e\u093e\u0928\u093e \u0915\u094b\u0921 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u0915\u094b \u0938\u0915\u094d\u0937\u092e \u0915\u0930\u0928\u0947 \u0915\u0947 \u090f\u0915 unescaped "\=" \u0935\u0930\u094d\u0923, \u0915\u092e\u0940 \u0915\u0941\u091b PHP \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u0939\u0948, \u091c\u092c CGI, \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u091a\u0932\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0938\u0939\u0940 \u0924\u0930\u0940\u0915\u0947 \u0938\u0947 \u0939\u0948\u0902\u0921\u0932 \u0928\u0939\u0940\u0902\u0964 \u0907\u0938 \u092e\u093e\u092e\u0932\u0947 \u092e\u0947\u0902, PHP \u092b\u093c\u093e\u0907\u0932 \u0915\u0940 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0938\u0940\u0927\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u0932\u093f\u090f \u0938\u0947\u0935\u093e \u0915\u0940 \u0925\u0947\u0964 \u0939\u093e\u0932\u093e\u0902\u0915\u093f \u092f\u0939 \u092d\u0940 \u0939\u094b \u0938\u0915\u0924\u0940 \u0939\u0948 \u0938\u0940\u0927\u0940 HTML \u0907\u0938 \u0906\u0909\u091f\u092a\u0941\u091f \u092e\u0947\u0902 \u0906\u092e\u0924\u094c\u0930 \u092a\u0930 PHP, \u0936\u093e\u092e\u093f\u0932 \u0939\u094b\u0902\u0917\u0947\u0964
ascanbeta.sourcecodedisclosurecve-2012-1823.soln=PHP \u0915\u093e \u0928\u0935\u0940\u0928\u0924\u092e \u0938\u094d\u0925\u093f\u0930 \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u0915\u0947 \u0932\u093f\u090f \u0928\u0935\u0940\u0928\u0940\u0915\u0930\u0923, \u092f\u093e \u0926\u0941\u0930\u094d\u092d\u093e\u0935\u0928\u093e\u092a\u0942\u0930\u094d\u0923 \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u094b\u0902 \u0915\u0947 "RewriteCond" \u0914\u0930 "RewriteRule" \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092c\u093e\u0939\u0930 \u092b\u093c\u093f\u0932\u094d\u091f\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f Apache \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0914\u0930 mod_rewrite \u092e\u0949\u0921\u094d\u092f\u0942\u0932 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964

ascanbeta.sourcecodedisclosure.svnbased.name=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - SVN
ascanbeta.sourcecodedisclosure.svnbased.soln=\u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f Git \u092e\u0947\u091f\u093e\u0921\u0947\u091f\u093e \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092f\u093e \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0932\u093f\u090f \u0924\u0948\u0928\u093e\u0924 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902
ascanbeta.sourcecodedisclosure.svnbased.extrainfo=[{0}] \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 [{1}] \u092a\u0930 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e

ascanbeta.sourcecodedisclosurewebinf.name=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - /WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930
ascanbeta.sourcecodedisclosurewebinf.desc=\u091c\u093e\u0935\u093e \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092e\u0947\u0902 \u091c\u093e\u0935\u093e \u0935\u0930\u094d\u0917 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0935\u0947\u092c-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930 \u092e\u0947\u0902 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0926\u094d\u0935\u093e\u0930\u093e \u092c\u0924\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u0915\u094d\u0932\u093e\u0938 \u092b\u093e\u0907\u0932 \u091c\u093f\u0932\u0947 \u0909\u0924\u094d\u092a\u093e\u0926\u0928 \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u0939\u0948 \u091c\u094b \u092c\u0939\u0941\u0924 \u0939\u0940 \u092c\u093e\u0930\u0940\u0915\u0940 \u0938\u0947 \u092e\u0942\u0932 \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u0938\u0947 \u092e\u0947\u0932 \u0916\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0915\u091f\u094d\u0920\u0947 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964  
ascanbeta.sourcecodedisclosurewebinf.soln=\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0947 /WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930 \u0915\u0940 \u0938\u0947\u0935\u093e \u0928\u0939\u0940\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u091c\u093e\u0928\u093e \u091a\u093e\u0939\u093f\u090f \u092f\u093e \u0907\u0938\u0915\u0940 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930\u094b\u0902, \u0915\u0947 \u092c\u093e\u0926 \u0938\u0947 \u092f\u0939 \u0907\u0938 \u0924\u0930\u0939 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0938\u0902\u0935\u0947\u0926\u0928\u0936\u0940\u0932 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0936\u093e\u092e\u093f\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u094d\u0930\u0947\u0921\u0947\u0902\u0936\u093f\u092f\u0932 \u0936\u093e\u092e\u093f\u0932 \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902 \u091c\u093e\u0935\u093e \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u0914\u0930 \u0917\u0941\u0923 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u091c\u094b \u0938\u0902\u0915\u0932\u093f\u0924\u0964 \u0906\u0935\u0947\u0926\u0928 \u0915\u0947 \u0938\u093e\u0925 \u0924\u0948\u0928\u093e\u0924 \u091c\u093e\u0935\u093e \u0935\u0930\u094d\u0917\u094b\u0902, \u090f\u0915 "\u0930\u0915\u094d\u0937\u093e \u092e\u0947\u0902 \u0917\u0939\u0930\u093e\u0908" \u0926\u0943\u0937\u094d\u091f\u093f\u0915\u094b\u0923 \u092e\u0947\u0902 \u0930\u0915\u094d\u0937\u093e \u0915\u0940 \u090f\u0915 \u0905\u0924\u093f\u0930\u093f\u0915\u094d\u0924 \u092a\u0930\u0924 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0938\u092e\u091d\u0928\u0947 \u092e\u0947\u0902 \u0915\u0920\u093f\u0928 \u0939\u094b\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964

ascanbeta.sourcecodedisclosurewebinf.propertiesfile.name=\u0917\u0941\u0923 \u092b\u093c\u093e\u0907\u0932 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - /WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.desc=\u090f\u0915 \u091c\u093e\u0935\u093e \u0935\u0930\u094d\u0917 \u0915\u094b /WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930 \u092e\u0947\u0902 \u0917\u0941\u0923 \u092b\u093c\u093e\u0907\u0932 \u0915\u0940 \u0909\u092a\u0938\u094d\u0925\u093f\u0924\u093f \u0915\u093e \u0916\u0941\u0932\u093e\u0938\u093e \u0915\u093f\u092f\u093e\u0964 \u0917\u0941\u0923 \u092b\u093c\u093e\u0907\u0932 \u0928\u0939\u0940\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u093e\u0930\u094d\u0935\u091c\u0928\u093f\u0915 \u0930\u0942\u092a \u0938\u0947 \u0938\u0941\u0932\u092d \u0939\u094b, \u0914\u0930 \u0906\u092e\u0924\u094c\u0930 \u092a\u0930 \u0935\u093f\u0928\u094d\u092f\u093e\u0938 \u0938\u0942\u091a\u0928\u093e, \u0906\u0935\u0947\u0926\u0928 \u0915\u094d\u0930\u0947\u0921\u0947\u0902\u0936\u093f\u092f\u0932\u094d\u0938 \u092f\u093e \u0915\u094d\u0930\u093f\u092a\u094d\u091f\u094b\u0917\u094d\u0930\u093e\u092b\u093c\u093f\u0915 \u0915\u0941\u0902\u091c\u093f\u092f\u093e\u0901 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902 \u0907\u0930\u093e\u0926\u093e \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902\u0964   
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.soln=/WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930 \u092f\u093e \u0907\u0938\u0915\u0940 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0915\u0947 \u0932\u093f\u090f \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0940 \u0938\u0947\u0935\u093e \u0928\u0939\u0940\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u094b\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964  \u092f\u0939 \u092d\u0940 /WEB-INF \u092b\u093c\u094b\u0932\u094d\u0921\u0930 \u0915\u094b \u0928\u093f\u0915\u093e\u0932\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964  
ascanbeta.sourcecodedisclosurewebinf.propertiesfile.extrainfo=\u0917\u0941\u0923 \u092b\u093c\u093e\u0907\u0932 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u0926\u0930\u094d\u092d \u091c\u093f\u0932\u0947 \u0907\u0915\u091f\u094d\u0920\u0947 \u091c\u093e\u0935\u093e \u091c\u093e\u0935\u093e \u0935\u0930\u094d\u0917 [{0}] \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092e\u0947\u0902 \u092a\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964

ascanbeta.usernameenumeration.name=Possible Username Enumeration
ascanbeta.usernameenumeration.desc=It may be possible to enumerate usernames, based on differing HTTP responses when valid and invalid usernames are provided. This would greatly increase the probability of success of password brute-forcing attacks against the system. Note that false positives may sometimes be minimised by increasing the 'Attack Strength' Option in ZAP.  Please manually check the 'Other Info' field to confirm if this is actually an issue. 
ascanbeta.usernameenumeration.soln=Do not divulge details of whether a username is valid or invalid. In particular, for unsuccessful login attempts, do not differentiate between an invalid user and an invalid password in the error message, page title, page contents, HTTP headers, or redirection logic.
ascanbeta.usernameenumeration.refs=https\://www.owasp.org/index.php/Testing_for_user_enumeration_%28OWASP-AT-002%29\nhttp\://sebastian-schinzel.de/_download/ifip-sec2011.pdf
ascanbeta.usernameenumeration.alert.extrainfo=[{0}] parameter [{1}] leaks information on whether a user exists. The [{5}] differences in output, for the valid original username value [{2}], and invalid username value [{3}] are\:\n[{4}]
ascanbeta.usernameenumeration.alert.attack=Manipulate [{0}] field\: [{1}] and monitor the output 

ascanbeta.paddingoracle.name=Generic Padding Oracle
ascanbeta.paddingoracle.desc=By manipulating the padding on an encrypted string, an attacker is able to generate an error message that indicates a likely 'padding oracle' vulnerability. Such a vulnerability can affect any application or framework that uses encryption improperly, such as some versions of ASP.net, Java Server Faces, and Mono. An attacker may exploit this issue to decrypt data and recover encryption keys, potentially viewing and modifying confidential data. This plugin should detect the MS10-070 padding oracle vulnerability in ASP.net if CustomErrors are enabled for that.
ascanbeta.paddingoracle.soln=Update the affected server software, or modify the scripts so that they properly validate encrypted data before attempting decryption.
ascanbeta.paddingoracle.refs=http\://netifera.com/research/\nhttp\://www.microsoft.com/technet/security/bulletin/ms10-070.mspx\nhttp\://www.mono-project.com/Vulnerabilities\#ASP.NET_Padding_Oracle\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799

ascanbeta.elinjection.name=\u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanbeta.elinjection.desc=\u0938\u0949\u092b\u094d\u091f\u0935\u0947\u092f\u0930 constructs \u0938\u092d\u0940 \u092f\u093e \u090f\u0915 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e (EL) \u0915\u0925\u0928 \u092e\u0947\u0902 \u090f\u0915 \u091c\u093e\u0935\u093e \u0938\u0930\u094d\u0935\u0930 \u092a\u0947\u091c (\u092c\u093e\u0939\u094d\u092f \u0930\u0942\u092a \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924 \u0907\u0928\u092a\u0941\u091f \u0938\u0947 \u090f\u0915 \u0905\u092a\u0938\u094d\u091f\u094d\u0930\u0940\u092e \u0918\u091f\u0915 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 JSP) \u0915\u093e \u0939\u093f\u0938\u094d\u0938\u093e \u0939\u0948, \u0932\u0947\u0915\u093f\u0928 \u092f\u0939 \u092c\u0947\u0905\u0938\u0930 \u0928\u0939\u0940\u0902 \u0939\u0948 \u092f\u093e \u0917\u093c\u0932\u0924 \u0922\u0902\u0917 \u0938\u0947 neutralizes \u0935\u093f\u0936\u0947\u0937 \u0924\u0924\u094d\u0935\u094b\u0902 \u0939\u0948 \u0915\u093f \u0905\u092d\u0940\u0937\u094d\u091f EL \u0915\u0925\u0928 \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0938\u0915\u0924\u093e \u0939\u0948 \u0907\u0938\u0938\u0947 \u092a\u0939\u0932\u0947 \u0915\u093f \u092f\u0939 \u092e\u093e\u0930 \u0921\u093e\u0932\u093e \u0939\u0948\u0964 \u0935\u0938\u0902\u0924 3.0.5 \u0915\u0947 \u0915\u0941\u091b \u0938\u0902\u0938\u094d\u0915\u0930\u0923\u094b\u0902 \u092e\u0947\u0902 \u0914\u0930 \u092a\u0939\u0932\u0947, \u091c\u094b \u092a\u094d\u0930\u092d\u093e\u0935\u0940 \u0930\u0942\u092a \u0938\u0947 \u090f\u0932 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093f\u0938\u0940 \u092d\u0940 \u0906\u0935\u0947\u0926\u0928 \u0915\u094b \u0909\u091c\u093e\u0917\u0930 \u091c\u094b \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e \u092e\u0947\u0902 \u091f\u0948\u0917 \u0939\u094b\u0924\u093e \u091c\u093e \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u093f\u0924 \u0915\u093f\u092f\u093e \u0926\u094b \u092c\u093e\u0930, \u090f\u0915 \u092d\u0947\u0926\u094d\u092f\u0924\u093e (CVE-2011-2730) \u0925\u0940\u0964 \u0939\u093e\u0932\u093e\u0902\u0915\u093f, \u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u092c\u093e\u0926 \u0915\u0947 \u0938\u0902\u0938\u094d\u0915\u0930\u0923\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f, \u0907\u0938 \u0915\u092e\u091c\u094b\u0930\u0940 \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930\u0947\u0936\u0928 \u0915\u0947 \u0906\u0927\u093e\u0930 \u092a\u0930 \u0905\u092d\u0940 \u092d\u0940 \u0938\u0902\u092d\u0935 \u0939\u0948\u0964
ascanbeta.elinjection.soln=\u092a\u094d\u0930\u0926\u0930\u094d\u0936\u0928 \u0921\u0947\u091f\u093e \u092e\u093e\u0928\u094d\u092f\u0924\u093e \u091c\u092c EL \u092a\u0930\u0924 \u092a\u0930, \u0921\u0947\u091f\u093e \u0906\u0924\u093e \u0939\u0948 \u0907\u0924\u0928\u093e \u0939\u0948 \u0915\u093f \u0915\u094b\u0908 metacharacter \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u0928 \u0938\u0947 \u092a\u0939\u0932\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0915\u0947 \u092d\u0940\u0924\u0930 \u0935\u094d\u092f\u093e\u0916\u094d\u092f\u093e\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u092a\u093e\u092f\u093e \u0939\u0948 \u0938\u092c\u0938\u0947 \u0905\u091a\u094d\u091b\u093e \u0905\u092d\u094d\u092f\u093e\u0938 \u0915\u0947 \u0916\u093f\u0932\u093e\u092b \u0905\u0935\u093f\u0936\u094d\u0935\u0938\u094d\u0924 \u0907\u0928\u092a\u0941\u091f \u0914\u0930 \u0906\u0909\u091f\u092a\u0941\u091f \u0909\u0938 \u090f\u0928\u094d\u0915\u094b\u0921\u093f\u0902\u0917 \u0915\u094b \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0932\u093e\u0917\u0942 \u0915\u093f\u092f\u093e \u091c\u093e\u0924\u093e \u0939\u0948\u0964 \u0938\u092c\u0938\u0947 \u0938\u094d\u092a\u0937\u094d\u091f \u092a\u0948\u091f\u0930\u094d\u0928 \u0915\u093e \u092a\u0924\u093e \u0932\u0917\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f $ \u092e\u0947\u0902 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902 {\u0914\u0930 \#{, \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0947 \u0938\u093e\u0902\u0915\u0947\u0924\u093f\u0915 \u0936\u092c\u094d\u0926\u094b\u0902 \u092e\u0947\u0902 \u092c\u0926\u0932\u0928\u093e \u092f\u093e \u0907\u0938 \u0921\u0947\u091f\u093e \u091f\u0941\u0915\u0921\u093c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanbeta.elinjection.refs=' http\://cwe.mitre.org/data/definitions/917.html https\://www.owasp.org/index.php/Expression_Language_Injection

