#X-Generator: crowdin.com

sqliplugin.ext.name=Injection SQL avanc\u00e9
sqliplugin.ext.desc=Extension d\u2019aide pour le scanner avanc\u00e9 d'injection SQL.

sqliplugin.scanner.name=Injection SQL avanc\u00e9
sqliplugin.scanner.alert.name=Advanced SQL Injection - {0}
sqliplugin.scanner.alert.desc=Une injection SQL est possible \u00e0 l\u2019aide de la charge utile attach\u00e9e
sqliplugin.scanner.alert.soln=Ne pas faire confiance \u00e0 c\u00f4t\u00e9 client \u00e0 l'entr\u00e9e, m\u00eame si il y a la validation c\u00f4t\u00e9 client.\n\nEn g\u00e9n\u00e9ral, le type de v\u00e9rifier toutes les donn\u00e9es sur le c\u00f4t\u00e9 serveur.\n\nSi l'application utilise JDBC, utilisez PreparedStatement ou CallableStatement, avec les param\u00e8tres pass\u00e9s par '?'\n\nSi l'application utilise ASP, utiliser des Objets de Commande ADO avec une forte v\u00e9rification du type et des requ\u00eates param\u00e9tr\u00e9es.\n\nSi la base de donn\u00e9es des Proc\u00e9dures Stock\u00e9es peuvent \u00eatre utilis\u00e9es, \u00e0 les utiliser.\n\nNe *pas* concat\u00e9ner des cha\u00eenes de caract\u00e8res dans des requ\u00eates dans la proc\u00e9dure stock\u00e9e, ou utiliser 'exec', 'exec imm\u00e9diat', ou des fonctionnalit\u00e9s \u00e9quivalentes\!\n\nNe pas cr\u00e9er des requ\u00eates SQL \u00e0 l'aide de simple concat\u00e9nation de cha\u00eene.\n\u00c9chapper \u00e0 toutes les donn\u00e9es re\u00e7ues du client.\n\nUne 'liste blanche' de caract\u00e8res autoris\u00e9s, ou d'une "liste noire" des caract\u00e8res interdits dans la saisie de l'utilisateur. \n\nAppliquer le privil\u00e8ge de privil\u00e8ge minimum en utilisant le moins de privil\u00e8ges utilisateur de base de donn\u00e9es possible.\n\nEn particulier, \u00e9vitez d'utiliser le 'sa'ou' db propri\u00e9taire de la base de donn\u00e9es des utilisateurs. Ce qui n'exclut pas l'injection SQL, mais minimise son impact.\n\nAccorder le minimum d'acc\u00e8s \u00e0 la base de ce qui est n\u00e9cessaire pour l'application.
sqliplugin.scanner.alert.info.unionbased=RDBMS [{0}] probable, en raison de l''UNION de message d''erreur sp\u00e9cifique au fragment de [{1}] les colonnes\n\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e par la manipulation de ce param\u00e8tre SQL ''UNION'' clause de causer une base de donn\u00e9es un message d''erreur sera retourn\u00e9 et reconnu.
sqliplugin.scanner.alert.info.booleanbased=La page de r\u00e9sultats ont \u00e9t\u00e9 manipul\u00e9s \u00e0 l''aide de la fonction bool\u00e9enne conditions [{0}] et [{1}]\n\nil a valeur de param\u00e8tre en cours de modification a \u00e9t\u00e9 d\u00e9pouill\u00e9 de la sortie HTML pour les fins de la comparaison.\n\nDe donn\u00e9es a \u00e9t\u00e9 retourn\u00e9e pour le param\u00e8tre d''origine.\n\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e par r\u00e9ussir \u00e0 limiter les donn\u00e9es \u00e0 l''origine retourn\u00e9 en manipulant le param\u00e8tre.
sqliplugin.scanner.alert.info.errorbased=RDBMS [{0}] probable, compte tenu de message d''erreur fragment [{1}] en HTML r\u00e9sultats.\n\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre \u00e0 cause d''une base de donn\u00e9es un message d''erreur sera retourn\u00e9 et reconnu.
sqliplugin.scanner.alert.info.timebased=Le temps de la requ\u00eate est contr\u00f4lable \u00e0 l''aide de la valeur du param\u00e8tre [{0}], qui lui fait ainsi prendre [{1}] millisecondes, alors que la requ\u00eate d''origine, non modifi\u00e9e avec la valeur [{2}] prend, quant \u00e0 elle en moyenne, [{3}] millisecondes.
sqliplugin.scanner.alert.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
