sqliplugin.alert.desc = \u6dfb\u4ed8\u3055\u308c\u305f\u30da\u30a4\u30ed\u30fc\u30c9\u3067SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u53ef\u80fd\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
sqliplugin.alert.info.booleanbased = \u30da\u30fc\u30b8\u306e\u7d50\u679c\u306f\u3001\u30d6\u30fc\u30eb\u6761\u4ef6 [{0}] \u304a\u3088\u3073 [{1}] \u3092\u4f7f\u7528\u3057\u3066\u3001\u6b63\u5e38\u306b\u64cd\u4f5c\u3055\u308c\u307e\u3057\u305f\u3002\n\u6bd4\u8f03\u306e\u305f\u3081\u3001\u5909\u66f4\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u306fHTML\u51fa\u529b\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002\n\u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u3005\u8fd4\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3092\u6b63\u5e38\u306b\u5236\u9650\u3057\u3001\u8106\u5f31\u6027\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
sqliplugin.alert.info.errorbased = HTML\u306e\u7d50\u679c\u306b\u542b\u307e\u308c\u308b\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u65ad\u7247 [{1}] \u306b\u57fa\u3065\u304d\u3001RDBMS\u306f [{0}] \u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3057\u3066\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8fd4\u3055\u305b\u3001\u305d\u308c\u3092\u8a8d\u8b58\u3059\u308b\u3053\u3068\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
sqliplugin.alert.info.timebased = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 [{0}] \u306b\u3088\u3063\u3066\u30af\u30a8\u30ea\u306e\u51e6\u7406\u6642\u9593\u3092\u5236\u5fa1\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u5024\u3092\u4f7f\u7528\u3057\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u306f [{1}] \u30df\u30ea\u79d2\u8981\u3057\u3001\u5143\u306e\u5024 [{2}] \u3067\u306e\u5e73\u5747\u51e6\u7406\u6642\u9593 [{3}] \u30df\u30ea\u79d2\u3068\u6bd4\u8f03\u3057\u3066\u6709\u610f\u306a\u5dee\u304c\u898b\u3089\u308c\u307e\u3059\u3002
sqliplugin.alert.info.unionbased = [{1}] \u5217\u306b\u5bfe\u3059\u308b UNION \u7279\u6709\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u65ad\u7247\u306b\u57fa\u3065\u304d\u3001RDBMS\u306f [{0}] \u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001SQL \u306e ''UNION'' \u53e5\u3092\u7528\u3044\u3066\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3057\u3066\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8fd4\u3055\u305b\u3001\u305d\u308c\u3092\u8a8d\u8b58\u3059\u308b\u3053\u3068\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
sqliplugin.alert.name = \u9ad8\u5ea6\u306aSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - {0}
sqliplugin.alert.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
sqliplugin.alert.soln = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u653b\u6483\u306e\u9632\u6b62\u5bfe\u7b56\n\u57fa\u672c\u539f\u5247\uff1a\n* \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u5165\u529b\u3092\u6c7a\u3057\u3066\u4fe1\u983c\u305b\u305a\u3001\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u5168\u30c7\u30fc\u30bf\u3092\u691c\u8a3c\n\n\u6700\u91cd\u8981\u5bfe\u7b56 (\u5fc5\u9808)\uff1a\n* \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5316\u30af\u30a8\u30ea\u306e\u4f7f\u7528\uff1a\n  * JDBC\: PreparedStatement/CallableStatement \u3067 '?' \u30d7\u30ec\u30fc\u30b9\u30db\u30eb\u30c0\u30fc\n  * ASP.NET\: \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5316 SqlCommand\n  * \u305d\u306e\u4ed6\: \u5404\u8a00\u8a9e\u30fb\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u306e\u63a8\u5968\u65b9\u6cd5\n* \u6587\u5b57\u5217\u9023\u7d50\u306b\u3088\u308bSQL\u69cb\u7bc9\u306e\u7981\u6b62\n\n\u88dc\u5b8c\u5bfe\u7b56\uff1a\n* \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u306e\u53b3\u683c\u306a\u30c7\u30fc\u30bf\u578b\u691c\u8a3c\n* \u5165\u529b\u5024\u306e\u30a8\u30b9\u30b1\u30fc\u30d7\u51e6\u7406\n* \u5165\u529b\u5024\u306e\u8a31\u53ef\u30ea\u30b9\u30c8/\u62d2\u5426\u30ea\u30b9\u30c8\u306b\u3088\u308b\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\n\n\u6a29\u9650\u7ba1\u7406\uff1a\n* \u6700\u5c0f\u7279\u6a29\u306e\u539f\u5247\: \u5fc5\u8981\u6700\u5c0f\u9650\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u6a29\u9650\u306e\u307f\u4ed8\u4e0e\n* \u7ba1\u7406\u8005\u6a29\u9650 (sa\u3001db-owner\u7b49) \u306e\u4f7f\u7528\u7981\u6b62\n* \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5c02\u7528\u306e\u5236\u9650\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u306e\u4f7f\u7528\n\n\u30b9\u30c8\u30a2\u30c9\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u4f7f\u7528\u6642\u306e\u6ce8\u610f\uff1a\n* \u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u5185\u3067\u3082\u52d5\u7684SQL\u4f5c\u6210\u3084\u6587\u5b57\u5217\u9023\u7d50\u306f\u7981\u6b62

sqliplugin.ext.desc = \u9ad8\u5ea6\u306aSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u30a2\u30c9\u30aa\u30f3\u306e\u305f\u3081\u306e\u30d8\u30eb\u30d1\u30fc\u62e1\u5f35\u6a5f\u80fd\u3002
sqliplugin.ext.name = \u9ad8\u5ea6\u306aSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3

sqliplugin.name = \u9ad8\u5ea6\u306aSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
