
sqliplugin.ext.name = Advanced SQL Injection
sqliplugin.ext.desc = \u0414\u043e\u043f\u043e\u043c\u0456\u0436\u043d\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f Advanced SQL Injection.

sqliplugin.name = Advanced SQL Injection
sqliplugin.alert.name = Advanced SQL Injection - {0}
sqliplugin.alert.desc = SQL-\u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u0434\u0456\u0439\u0441\u043d\u0435\u043d\u043e \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043f\u0440\u0438\u043a\u0440\u0456\u043f\u043b\u0435\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u043d\u043e\u0433\u043e \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f
sqliplugin.alert.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044e \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u043a\u043b\u0456\u0454\u043d\u0442 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0438\u0439 .\n\
\n\
\u0417\u0430\u0433\u0430\u043b\u043e\u043c, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0442\u0438\u043f \u0443\u0441\u0456\u0445 \u0434\u0430\u043d\u0438\u0445 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.\n\
\n\
\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 JDBC, \u0441\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0439\u0442\u0435\u0441\u044f PreparedStatement \u0430\u0431\u043e CallableStatement \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c\u0438, \u0449\u043e \u043f\u0435\u0440\u0435\u0434\u0430\u044e\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 '?'\n\
\n\
\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 ASP, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043a\u043e\u043c\u0430\u043d\u0434\u043d\u0456 \u043e\u0431'\u0454\u043a\u0442\u0438 ADO \u0437 \u0441\u0438\u043b\u044c\u043d\u043e\u044e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0442\u0438\u043f\u0456\u0432 \u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0437\u0430\u043f\u0438\u0442\u0430\u043c\u0438.\n\
\n\
\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0438 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0457\u0445.\n\
\n\
\u041d\u0435 \u043e\u0431'\u0454\u0434\u043d\u0443\u0439\u0442\u0435 \u0440\u044f\u0434\u043a\u0438 \u0443 \u0437\u0430\u043f\u0438\u0442\u0438 \u0443 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456\u0439 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0456, \u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 "exec", "execute immediate", \u0430\u0431\u043e \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u0443 \u0444\u0443\u043d\u043a\u0446\u0456\u043e\u043d\u0430\u043b\u044c\u043d\u0456\u0441\u0442\u044c\!\n\
\n\
\u041d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0439\u0442\u0435 \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u0456 SQL-\u0437\u0430\u043f\u0438\u0442\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043f\u0440\u043e\u0441\u0442\u0435 \u043e\u0431'\u0454\u0434\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0440\u044f\u0434\u043a\u0456\u0432.\n\
\n\
\u0412\u0438\u043b\u0443\u0447\u0456\u0442\u044c \u0432\u0441\u0456 \u0434\u0430\u043d\u0456, \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u0456 \u0432\u0456\u0434 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\
\n\
\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 "\u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0445" \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0430\u0431\u043e "\u0441\u043f\u0438\u0441\u043e\u043a \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0438\u0445" \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0437\u0430 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0434\u0430\u043d\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c.\n\
\n\
\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0439 \u043d\u0430\u0439\u043c\u0435\u043d\u0448\u043e\u0433\u043e \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u044e, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043d\u0430\u0439\u043c\u0435\u043d\u0448 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0439\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445.\n\
\n\
\u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u0443\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445 'sa' \u0430\u0431\u043e 'db-owner'. \u0426\u0435 \u043d\u0435 \u0443\u0441\u0443\u0432\u0430\u0454 SQL-\u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f, \u0430\u043b\u0435 \u043c\u0456\u043d\u0456\u043c\u0456\u0437\u0443\u0454 \u0439\u043e\u0433\u043e \u0432\u043f\u043b\u0438\u0432.\n\
\n\
\u041d\u0430\u0434\u0430\u0439\u0442\u0435 \u043c\u0456\u043d\u0456\u043c\u0430\u043b\u044c\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u043d\u0435\u043e\u0431\u0445\u0456\u0434\u043d\u0438\u0439 \u0434\u043b\u044f \u0440\u043e\u0431\u043e\u0442\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438.
sqliplugin.alert.info.unionbased = RDBMS [{0}] \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u0432\u0440\u0430\u0445\u043e\u0432\u0443\u044e\u0447\u0438 UNION-\u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u0438\u0439 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0434\u043b\u044f \u0441\u0442\u043e\u0432\u043f\u0446\u0456\u0432 [{1}]\n\
\n\
\u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044f\u0446\u0456\u0457 \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c, \u044f\u043a\u0438\u0439 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 SQL ''UNION'', \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043d\u044f \u0442\u0430 \u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445.
sqliplugin.alert.info.booleanbased = \u0420\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u043e \u0443\u0441\u043f\u0456\u0448\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u0435\u043d\u043e \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043b\u043e\u0433\u0456\u0447\u043d\u0438\u0445 \u0443\u043c\u043e\u0432 [{0}] \u0456 [{1}]\n\
\n\
\u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430, \u0449\u043e \u0437\u043c\u0456\u043d\u044e\u0454\u0442\u044c\u0441\u044f, \u0431\u0443\u043b\u043e \u0432\u0438\u043b\u0443\u0447\u0435\u043d\u043e \u0437 HTML-\u0432\u0438\u0432\u043e\u0434\u0443 \u0434\u043b\u044f \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u044f.\n\
\n\
\u0414\u0430\u043d\u0456 \u0431\u0443\u043b\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043e \u0434\u043b\u044f \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443.\n\
\n\
\u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u0430 \u0437\u0430\u0432\u0434\u044f\u043a\u0438 \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u043c\u0443 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u043d\u044e \u0434\u0430\u043d\u0438\u0445, \u0449\u043e \u0431\u0443\u043b\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043e, \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044f\u0446\u0456\u0457 \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c.
sqliplugin.alert.info.errorbased = \u0419\u043c\u043e\u0432\u0456\u0440\u043d\u043e, RDBMS [{0}], \u0432\u0440\u0430\u0445\u043e\u0432\u0443\u044e\u0447\u0438 \u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 [{1}] \u0432 HTML \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0430\u0445.\n\
\n\
\u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u0430 \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044f\u0446\u0456\u0457 \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c, \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043d\u044f \u0442\u0430 \u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445.
sqliplugin.alert.info.timebased = \u0427\u0430\u0441 \u0437\u0430\u043f\u0438\u0442\u0443 \u043c\u043e\u0436\u043d\u0430 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{0}], \u044f\u043a\u0438\u0439 \u043f\u0440\u0438\u0437\u0432\u0456\u0432 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0437\u0430\u0439\u043c\u0430\u0454 [{1}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434, \u043a\u043e\u043b\u0438 \u043f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u043d\u0435\u043c\u043e\u0434\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{2}] \u0437\u0430\u0439\u043c\u0430\u0432 \u0432 \u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e\u043c\u0443 [{3}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434\u0438.
sqliplugin.alert.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html