#X-Generator: crowdin.com

sqliplugin.ext.name=Geli\u015fmi\u015f SQL enjeksiyonu
sqliplugin.ext.desc=Geli\u015fmi\u015f SQL Enjeksiyon taray\u0131c\u0131s\u0131 i\u00e7in yard\u0131mc\u0131 ekleme.

sqliplugin.scanner.name=Geli\u015fmi\u015f SQL enjeksiyonu
sqliplugin.scanner.alert.name=Geli\u015fmi\u015f SQL Enjeksiyonu - {0}
sqliplugin.scanner.alert.desc=Bir SQL enjeksiyonu ba\u011fl\u0131 y\u00fck\u00fc kullanarak m\u00fcmk\u00fcn olabilir
sqliplugin.scanner.alert.soln=Istemci taraf\u0131nda do\u011frulama olsa bile, istemci taraf\u0131ndaki girdiye g\u00fcvenmeyin.\n\nGenellikle sunucu taraf\u0131ndaki t\u00fcm verileri girin.\n\nUygulama JDBC kullan\u0131yorsa, PreparedStatement veya CallableStatement parametrelerini '?'\n\nUygulama ASP kullan\u0131yorsa, ADO i\u015f nesnelerini g\u00fc\u00e7l\u00fc t\u00fcr denetimi ve parametrele\u015ftirilmi\u015f sorgularla kullan\u0131n.\n\nKay\u0131tl\u0131 veritaban\u0131 s\u00fcre\u00e7leri kullan\u0131labilirse, bunlar\u0131 kullan\u0131n\n\nStringleri kay\u0131tl\u0131 s\u00fcre\u00e7lerde ki sorgulara biti\u015ftirmeyin * 'exec', 'exec immediate' veya benzer bir i\u015flevsellik kullanmay\u0131n\!\n\nBasit string ba\u011flant\u0131s\u0131 kullanarak dinamik SQL sorgular\u0131 olu\u015fturmay\u0131n.\n\nM\u00fc\u015fteriden gelen t\u00fcm verileri d\u00f6n\u00fc\u015f yap\u0131n.\n\nKullan\u0131c\u0131 girdisine izin verilen karakterlerin 'beyaz listesi' veya yetkisiz karakterlerin 'kara listelesi' ni uygulay\u0131n.\n\nEn az ayr\u0131cal\u0131kl\u0131 veritaban\u0131 kullan\u0131c\u0131s\u0131n\u0131 kullanarak en d\u00fc\u015f\u00fck ayr\u0131cal\u0131\u011f\u0131 uygulay\u0131n.\n\n\u00d6zellikle, 'sa' veya 'db-owner' veritaban\u0131n\u0131n kullan\u0131c\u0131lar\u0131n\u0131 kullanmaktan ka\u00e7\u0131n\u0131n. Bu, SQL enjeksiyonunu ortadan kald\u0131rmaz, ancak etkisini en aza indirir.\n\nUygulama i\u00e7in gereken asgari veritaban\u0131 eri\u015fimini sa\u011flay\u0131n.
sqliplugin.scanner.alert.info.unionbased=RDBMS taraf\u0131ndan [{0}] b\u00fcy\u00fck olas\u0131l\u0131kla, [{1}] s\u00fctunlar\u0131 i\u00e7in UNION \u00f6zel hata mesaj\u0131 b\u00f6l\u00fcm\u00fc verildi\n\nG\u00fcvenlik a\u00e7\u0131\u011f\u0131, bir veritaban\u0131 hata iletisinin d\u00f6nd\u00fcr\u00fclmesine ve tan\u0131nmas\u0131na neden olmak i\u00e7in de\u011fi\u015fkeni bir SQL ''UNION'' yan parametresini kullanarak tespit edildi.
sqliplugin.scanner.alert.info.booleanbased=Sayfa sonu\u00e7lar\u0131 boolean ko\u015fullar\u0131 kullan\u0131larak ba\u015far\u0131yla de\u011fi\u015ftirildi [{0}] ve [{1}] \n\nDe\u011fi\u015ftirilmekte olan parametre de\u011feri, kar\u015f\u0131la\u015ft\u0131rma amac\u0131yla HTML \u00e7\u0131kt\u0131s\u0131ndan al\u0131nd\u0131.\n\nOrijinal parametre i\u00e7in veri iade edildi.\n\nG\u00fcvenlik a\u00e7\u0131\u011f\u0131, parametrenin de\u011fi\u015ftirilmesi ile orijinal olarak iade edilen verileri ba\u015far\u0131yla k\u0131s\u0131tlamak suretiyle tespit edildi.
sqliplugin.scanner.alert.info.errorbased=RDBMS [{0}] b\u00fcy\u00fck olas\u0131l\u0131kla HTML sonu\u00e7lar\u0131nda hata mesaj\u0131 par\u00e7as\u0131 [{1}] belirlendi.\n\nG\u00fcvenlik a\u00e7\u0131\u011f\u0131, bir veritaban\u0131 hata mesaj\u0131n\u0131n alg\u0131lanmas\u0131 ve tan\u0131nmas\u0131na neden olmak i\u00e7in parametreyi de\u011fi\u015ftirerek tespit edildi.
sqliplugin.scanner.alert.info.timebased=Sorgu zaman\u0131, parametre de\u011feri [{0}] kullan\u0131larak kontrol edilebilir, bu iste\u011fin [{1}] mili saniyeye al\u0131nmas\u0131na neden oldu, [{2}] de\u011feri ile orijinal de\u011fi\u015ftirilmemi\u015f ortalama [{3}] mili saniye kullan\u0131ld\u0131.
sqliplugin.scanner.alert.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
