#X-Generator: crowdin.net
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.authenticationcredentialscaptured.name=Informations d'authentification captur\u00e9es
pscanbeta.authenticationcredentialscaptured.desc=Un m\u00e9canisme d'authentification non-s\u00e9curis\u00e9 est utilis\u00e9. Ceci permet \u00e0 un attaquant sur le r\u00e9seau d'acc\u00e9der au nom d'utilisateur ainsi qu'au mot de passe d'un utilisateur authentifi\u00e9. Avec de l'authentification de type Basic, l'attaquant doit simplement surveiller le trafique r\u00e9seau jusqu'\u00e0 ce qu'une requ\u00eate d'authentification basique soit re\u00e7ue, puis d\u00e9cod\u00e9 le nom d'utilisateur et le mot de passe encod\u00e9 en base64. Avec de l'authentification de type Digest, l'attaquant a acc\u00e8s au nom d'utilisateur, et probablement au mot de passe, si le hash (incluant la valeur \u00e0 usage unique) peut \u00eatre craqu\u00e9 avec succ\u00e8s, ou si une attaque de type Man-in-the-middle a \u00e9t\u00e9 mise en place.
pscanbeta.authenticationcredentialscaptured.soln=Utilisez HTTPS, et utilisez un m\u00e9canisme d'authentification s\u00e9curis\u00e9 qui ne transmette pas le nom d'utilisateur ou le mot de passe de mani\u00e8re non-encrypt\u00e9e. En particulier, \u00e9vitez l'utilisation de m\u00e9canisme basique d'authentification, \u00e9tant donn\u00e9 que ce m\u00e9canisme d'obfuscation trivial est facilement cassable.
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] utilise un m\u00e9canisme d'authentification vuln\u00e9rable [{2}], r\u00e9v\u00e9lant le nom d'utilisateur [{3}] et le mot de passe [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] utilise un m\u00e9canisme d'authentification vuln\u00e9rable [{2}], r\u00e9v\u00e9lant le nom d'utilisateur [{3}] et des informations suppl\u00e9mentaires [{4}].
pscanbeta.authenticationcredentialscaptured.alert.attack=L'attaquant \u00e9coute le r\u00e9seau jusqu'\u00e0 la d\u00e9couverte d'une authentification r\u00e9ussie.

pscanbeta.insecureauthentication.name=M\u00e9thode d'Authentification Faible
pscanbeta.insecureauthentication.desc=Du HTTP basique ou de l'authentification simple a \u00e9t\u00e9 utilis\u00e9 sur une connexion non-s\u00e9curis\u00e9e. Les informations de s\u00e9curit\u00e9 ont pu \u00eatre lue et r\u00e9utilis\u00e9e par une personne ayant acc\u00e8s au r\u00e9seau.
pscanbeta.insecureauthentication.soln=Prot\u00e9gez la connexion en utilisant HTTPS ou utilisez un m\u00e9canisme d'authenfication plus fort
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=JSF ViewState non-s\u00e9curis\u00e9
pscanbeta.insecurejsfviewstate.desc=La r\u00e9ponse \u00e0 l'URL suivante contient une valeur ViewState qui n'a aucune protection cryptographique.
pscanbeta.insecurejsfviewstate.soln=S\u00e9curisez VIEWSTATE avec un MAC sp\u00e9cifique \u00e0 votre environnement
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=Le JSF ViewState [{0}] n'est pas s\u00e9curis\u00e9

pscanbeta.noanticsrftokens.name=Absence de Jetons Anti-CSRF
pscanbeta.noanticsrftokens.desc=Aucun jetons Anti-CSRF n'ont \u00e9t\u00e9 trouv\u00e9s dans un formulaire HTML.
pscanbeta.noanticsrftokens.alert.attack=Aucun. Avertissement uniquement.
pscanbeta.noanticsrftokens.alert.extrainfo=Aucun jetons Anti-CSRF connus {0} n'a \u00e9t\u00e9 trouv\u00e9 dans le formulaire HTML suivant\: {1}.  
