
spiderajax.active.action = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u30b9\u30ad\u30e3\u30f3

spiderajax.api.action.addAllowedResource = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
spiderajax.api.action.addAllowedResource.param.enabled = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u3092\u6709\u52b9\u306b\u3059\u308b\u304b\u7121\u52b9\u306b\u3059\u308b\u304b\u3002
spiderajax.api.action.addAllowedResource.param.regex = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u306e\u6b63\u898f\u8868\u73fe
spiderajax.api.action.addExcludedElement = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u9664\u5916\u8981\u7d20\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
spiderajax.api.action.addExcludedElement.param.attributeName = \u8981\u7d20\u306e\u5c5e\u6027\u540d
spiderajax.api.action.addExcludedElement.param.attributeValue = \u8981\u7d20\u306e\u5c5e\u6027\u5024
spiderajax.api.action.addExcludedElement.param.contextName = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d
spiderajax.api.action.addExcludedElement.param.description = \u9664\u5916\u3055\u308c\u305f\u8981\u7d20\u306e\u8aac\u660e
spiderajax.api.action.addExcludedElement.param.element = \u9664\u5916\u3059\u308b\u8981\u7d20
spiderajax.api.action.addExcludedElement.param.enabled = \u6709\u52b9\u72b6\u614b\u3001true \u307e\u305f\u306f false
spiderajax.api.action.addExcludedElement.param.text = \u8981\u7d20\u306e\u30c6\u30ad\u30b9\u30c8
spiderajax.api.action.addExcludedElement.param.xpath = \u8981\u7d20\u306eXPath
spiderajax.api.action.modifyExcludedElement = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u9664\u5916\u8981\u7d20\u3092\u5909\u66f4\u3057\u307e\u3059\u3002
spiderajax.api.action.modifyExcludedElement.param.attributeName = \u8981\u7d20\u306e\u5c5e\u6027\u540d
spiderajax.api.action.modifyExcludedElement.param.attributeValue = \u8981\u7d20\u306e\u5c5e\u6027\u5024
spiderajax.api.action.modifyExcludedElement.param.contextName = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d
spiderajax.api.action.modifyExcludedElement.param.description = \u9664\u5916\u3055\u308c\u305f\u8981\u7d20\u306e\u8aac\u660e
spiderajax.api.action.modifyExcludedElement.param.descriptionNew = \u65b0\u3057\u3044\u8aac\u660e
spiderajax.api.action.modifyExcludedElement.param.element = \u9664\u5916\u3059\u308b\u8981\u7d20
spiderajax.api.action.modifyExcludedElement.param.enabled = \u6709\u52b9\u72b6\u614b\u3001true \u307e\u305f\u306f false
spiderajax.api.action.modifyExcludedElement.param.text = \u8981\u7d20\u306e\u30c6\u30ad\u30b9\u30c8
spiderajax.api.action.modifyExcludedElement.param.xpath = \u8981\u7d20\u306eXPath
spiderajax.api.action.removeAllowedResource = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u3092\u524a\u9664\u3057\u307e\u3059\u3002
spiderajax.api.action.removeAllowedResource.param.regex = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u306e\u6b63\u898f\u8868\u73fe
spiderajax.api.action.removeExcludedElement = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304b\u3089\u9664\u5916\u8981\u7d20\u3092\u524a\u9664\u3057\u307e\u3059\u3002
spiderajax.api.action.removeExcludedElement.param.contextName = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d
spiderajax.api.action.removeExcludedElement.param.description = \u9664\u5916\u3055\u308c\u305f\u8981\u7d20\u306e\u8aac\u660e
spiderajax.api.action.scan = \u6307\u5b9a\u3055\u308c\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u306b\u5bfe\u3057\u3066AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3092\u5b9f\u884c\u3057\u307e\u3059\u3002
spiderajax.api.action.scan.param.contextName = \u5b9a\u7fa9\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d\u3002\u3053\u306e\u5024\u304c\u5b9a\u7fa9\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u3001\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3059\u3002
spiderajax.api.action.scan.param.inScope = \u30b9\u30ad\u30e3\u30f3\u3092\u300c\u30b9\u30b3\u30fc\u30d7\u5185\u300d\u306e\u30ea\u30bd\u30fc\u30b9\u306e\u307f\u306b\u5236\u9650\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u793a\u3059\u30d6\u30fc\u30eb\u5024 (true/false) (\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f false)\u3002
spiderajax.api.action.scan.param.subtreeOnly = \u30af\u30ed\u30fc\u30eb\u3092\u7279\u5b9a\u306e\u30d1\u30b9\u306b\u5236\u9650\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u793a\u3059\u30d6\u30fc\u30eb\u5024 (true/false)\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f false \u3067\u3059\u3002\n
spiderajax.api.action.scan.param.url = \u958b\u59cbURL ('\u30b9\u30ad\u30fc\u30de'\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059)
spiderajax.api.action.scanAsUser = Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u8996\u70b9\u304b\u3089AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3092\u5b9f\u884c\u3057\u307e\u3059\u3002
spiderajax.api.action.scanAsUser.param.contextName = \u5b9a\u7fa9\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d\u3002\u3053\u306e\u5024\u304c\u5b9a\u7fa9\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u3001\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3059\u3002
spiderajax.api.action.scanAsUser.param.subtreeOnly = \u30af\u30ed\u30fc\u30eb\u3092\u7279\u5b9a\u306e\u30d1\u30b9\u306b\u5236\u9650\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u793a\u3059\u30d6\u30fc\u30eb\u5024 (true/false)\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f false \u3067\u3059\u3002\n
spiderajax.api.action.scanAsUser.param.url = \u958b\u59cbURL ('\u30b9\u30ad\u30fc\u30de'\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059)
spiderajax.api.action.scanAsUser.param.userName = \u30af\u30ed\u30fc\u30eb\u6642\u306b\u4f7f\u7528\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u3002"userName" \u306f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u8a2d\u5b9a\u3067\u4e8b\u524d\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
spiderajax.api.action.setEnabledAllowedResource = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u304c\u6709\u52b9\u304b\u3069\u3046\u304b\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setEnabledAllowedResource.param.enabled = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u3092\u6709\u52b9\u306b\u3059\u308b\u304b\u7121\u52b9\u306b\u3059\u308b\u304b\u3002
spiderajax.api.action.setEnabledAllowedResource.param.regex = \u8a31\u53ef\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u306e\u6b63\u898f\u8868\u73fe
spiderajax.api.action.setOptionBrowserId = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30d6\u30e9\u30a6\u30b6\u30fc\u306e1\u3064\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionBrowserId.param.String = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u4f7f\u7528\u3059\u308b\u30d6\u30e9\u30a6\u30b6\u30fc\u540d\u3002(\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u30ea\u30b9\u30c8\u306b\u3064\u3044\u3066\u306f\u3001Selenium\u30a2\u30c9\u30aa\u30f3\u306e\u30d8\u30eb\u30d7\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
spiderajax.api.action.setOptionClickDefaultElems = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u30c7\u30d5\u30a9\u30eb\u30c8\u306eHTML\u8981\u7d20\u306e\u307f\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionClickDefaultElems.param.Boolean = 'a'\u3001'button'\u3001'input' \u306a\u3069\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u8981\u7d20\u306e\u307f\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u304b\u3069\u3046\u304b\u306e\u8a2d\u5b9a (true/false) (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f true)\u3002
spiderajax.api.action.setOptionClickElemsOnce = \u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30af\u30ed\u30fc\u30e9\u30fc\u306f\u5404\u8981\u7d20\u3068\u306e\u76f8\u4e92\u4f5c\u7528 (\u30af\u30ea\u30c3\u30af\u306a\u3069) \u30921\u56de\u3060\u3051\u8a66\u884c\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionClickElemsOnce.param.Boolean = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u8981\u7d20\u30921\u56de\u3060\u3051\u30af\u30ea\u30c3\u30af\u3059\u308b\u304b\u3069\u3046\u304b\u306e\u8a2d\u5b9a (true/false)\u3002false \u306b\u8a2d\u5b9a\u3059\u308b\u3068\u3001\u30af\u30ed\u30fc\u30e9\u30fc\u306f\u8907\u6570\u56de\u30af\u30ea\u30c3\u30af\u3092\u8a66\u884c\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u3088\u308a\u53b3\u5bc6\u3067\u3059\u304c\u3001\u6642\u9593\u304c\u304b\u306a\u308a\u9577\u304f\u304b\u304b\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f true)\u3002
spiderajax.api.action.setOptionEventWait = \u30a4\u30d9\u30f3\u30c8\u5f8c\u306e\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2) \u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u4f8b\: \u30ab\u30fc\u30bd\u30eb\u304c\u8981\u7d20\u306e\u4e0a\u306b\u30db\u30d0\u30fc\u3057\u305f\u5f8c\u3001\u30e1\u30cb\u30e5\u30fc\u304c\u8868\u793a\u3055\u308c\u308b\u307e\u3067\u306e\u5f85\u6a5f\u9045\u5ef6\u306a\u3069\u3002
spiderajax.api.action.setOptionEventWait.param.Integer = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u5404\u30a4\u30d9\u30f3\u30c8\u306b\u5bfe\u3057\u3066\u5f85\u6a5f\u3059\u308b\u6642\u9593 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f1000\u30df\u30ea\u79d2)\u3002
spiderajax.api.action.setOptionLogoutAvoidance = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u30ed\u30b0\u30a2\u30a6\u30c8\u8981\u7d20\u306e\u30af\u30ea\u30c3\u30af\u3092\u56de\u907f\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionLogoutAvoidance.param.Boolean = \u30ed\u30b0\u30a2\u30a6\u30c8\u8981\u7d20\u3092\u56de\u907f\u3059\u308b\u304b\u3069\u3046\u304b\u306e\u8a2d\u5b9a (true/false) (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false)\u3002
spiderajax.api.action.setOptionMaxCrawlDepth = \u30af\u30ed\u30fc\u30e9\u30fc\u304c\u5230\u9054\u3067\u304d\u308b\u6700\u5927\u968e\u5c64\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionMaxCrawlDepth.param.Integer = \u30af\u30ed\u30fc\u30e9\u30fc\u304c\u63a2\u7d22\u3059\u3079\u304d\u6700\u5927\u968e\u5c64 (0\u306f\u7121\u5236\u9650\u306e\u968e\u5c64\u3092\u610f\u5473\u3057\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306f10)\u3002
spiderajax.api.action.setOptionMaxCrawlStates = \u30af\u30ed\u30fc\u30e9\u30fc\u304c\u30af\u30ed\u30fc\u30eb\u3059\u3079\u304d\u72b6\u614b\u306e\u6700\u5927\u6570\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionMaxCrawlStates.param.Integer = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u63a2\u7d22\u3059\u3079\u304d\u72b6\u614b\u306e\u6700\u5927\u6570 (0\u306f\u7121\u5236\u9650\u306e\u30af\u30ed\u30fc\u30eb\u72b6\u614b\u3092\u610f\u5473\u3057\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306f0)
spiderajax.api.action.setOptionMaxDuration = \u30af\u30ed\u30fc\u30e9\u30fc\u306e\u5b9f\u884c\u304c\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u6642\u9593\u3002
spiderajax.api.action.setOptionMaxDuration.param.Integer = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u5b9f\u884c\u304c\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u6642\u9593 (0\u306f\u7121\u5236\u9650\u306e\u5b9f\u884c\u6642\u9593\u3092\u610f\u5473\u3057\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306f60\u5206)\u3002
spiderajax.api.action.setOptionNumberOfBrowsers = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u4f7f\u7528\u3059\u308b\u30a6\u30a3\u30f3\u30c9\u30a6\u6570\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionNumberOfBrowsers.param.Integer = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u4f7f\u7528\u3067\u304d\u308b\u30a6\u30a3\u30f3\u30c9\u30a6\u6570\u3002\u30a6\u30a3\u30f3\u30c9\u30a6\u304c\u591a\u3044\u307b\u3069\u3001\u30d7\u30ed\u30bb\u30b9\u306f\u9ad8\u901f\u306b\u306a\u308a\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u30a6\u30a3\u30f3\u30c9\u30a6\u304c\u591a\u3044\u3068\u3044\u3046\u3053\u3068\u306f\u3001\u3088\u308a\u591a\u304f\u306e\u30ea\u30bd\u30fc\u30b9\u4f7f\u7528 (CPU\u3001\u30e1\u30e2\u30ea\u306a\u3069) \u3092\u610f\u5473\u3057\u3001\u63a2\u7d22\u3055\u308c\u308b\u30a2\u30d7\u30ea\u306b\u3088\u3063\u3066\u306f\u4e26\u884c\u6027\u306e\u554f\u984c\u3092\u5f15\u304d\u8d77\u3053\u3059\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f1)\u3002
spiderajax.api.action.setOptionRandomInputs = \u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30d5\u30a9\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30e9\u30f3\u30c0\u30e0\u306a\u5024\u3092\u633f\u5165\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionRandomInputs.param.Boolean = \u30d5\u30a9\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u30e9\u30f3\u30c0\u30e0\u306a\u5024\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u306e\u8a2d\u5b9a (true/false)\u3002\u305d\u3046\u3067\u306a\u3051\u308c\u3070\u3001\u7a7a\u306e\u5024\u304c\u9001\u4fe1\u3055\u308c\u307e\u3059 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f true)\u3002
spiderajax.api.action.setOptionReloadWait = \u30da\u30fc\u30b8\u304c\u8aad\u307f\u8fbc\u307e\u308c\u3066\u304b\u3089\u76f8\u4e92\u4f5c\u7528\u3059\u308b\u307e\u3067\u306e\u5f85\u6a5f\u6642\u9593\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionReloadWait.param.Integer = \u30da\u30fc\u30b8\u304c\u8aad\u307f\u8fbc\u307e\u308c\u305f\u5f8c\u306bAJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u5f85\u6a5f\u3059\u308b\u30df\u30ea\u79d2\u6570 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f1000)\u3002
spiderajax.api.action.setOptionScopeCheck = \u30b9\u30b3\u30fc\u30d7\u30c1\u30a7\u30c3\u30af\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
spiderajax.api.action.setOptionScopeCheck.param.String = \u30b9\u30b3\u30fc\u30d7\u30c1\u30a7\u30c3\u30af\u3001Strict \u307e\u305f\u306f Flexible\u3002\u305d\u306e\u4ed6\u306e\u5024\u306f\u30c7\u30d5\u30a9\u30eb\u30c8 (Strict) \u306e\u8a2d\u5b9a\u306b\u306a\u308a\u307e\u3059\u3002
spiderajax.api.action.stop = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3092\u505c\u6b62\u3057\u307e\u3059\u3002
spiderajax.api.desc = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u8a2d\u5b9a\u3068\u5b9f\u884c\u3092\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002
spiderajax.api.view.allowedResources = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u306f\u3001\u30b9\u30b3\u30fc\u30d7\u5916\u3067\u3042\u3063\u3066\u3082\u5e38\u306b\u53d6\u5f97\u3055\u308c\u3001\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u304b\u3089\u306e\u5fc5\u8981\u306a\u30ea\u30bd\u30fc\u30b9 (\u30b9\u30af\u30ea\u30d7\u30c8\u306a\u3069) \u3092\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
spiderajax.api.view.excludedElements = \u9664\u5916\u8981\u7d20\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u9664\u5916\u8981\u7d20\u306f\u3001\u30af\u30ed\u30fc\u30eb\u4e2d\u306b\u30af\u30ea\u30c3\u30af\u3055\u308c\u307e\u305b\u3093\u3002\u4f8b\u3048\u3070\u3001\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u9632\u3050\u305f\u3081\u3067\u3059\u3002
spiderajax.api.view.excludedElements.param.contextName = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u540d\u524d
spiderajax.api.view.fullResults = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u306b\u3088\u3063\u3066\u691c\u51fa\u3055\u308c\u305f\u5b8c\u5168\u306a\u30af\u30ed\u30fc\u30eb\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u6700\u5f8c/\u73fe\u5728\u306e\u5b9f\u884c\u4e2d\u306b\u906d\u9047\u3057\u305f 'inScope' URL\u3001'outOfScope' URL\u3001\u304a\u3088\u3073 'errors' \u306b\u57fa\u3065\u304f\u5024\u306e\u30bb\u30c3\u30c8\u3092\u8fd4\u3057\u307e\u3059\u3002
spiderajax.api.view.numberOfResults = \u898b\u3064\u304b\u3063\u305f\u30ea\u30bd\u30fc\u30b9\u6570\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionBrowserId = \u30af\u30ed\u30fc\u30eb\u306b\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30d6\u30e9\u30a6\u30b6\u30fc\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionClickDefaultElems = \u300c\u30c7\u30d5\u30a9\u30eb\u30c8\u8981\u7d20\u306e\u307f\u30af\u30ea\u30c3\u30af\u300d\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5024\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002'a', 'button', 'input' \u306a\u3069\u306eHTML\u8981\u7d20\u3067\u3001\u30da\u30fc\u30b8\u4e0a\u306e\u4f55\u3089\u304b\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3084\u30ea\u30f3\u30af\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u3082\u306e\u3002
spiderajax.api.view.optionClickElemsOnce = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u8981\u7d20\u30921\u56de\u3060\u3051\u30af\u30ea\u30c3\u30af\u3059\u308b\u3079\u304d\u304b\u3069\u3046\u304b\u3092\u77e5\u308b\u305f\u3081\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5024\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionEventWait = \u30a4\u30d9\u30f3\u30c8\u5f8c\u306e\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2) \u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u4f8b\: \u30ab\u30fc\u30bd\u30eb\u304c\u8981\u7d20\u306e\u4e0a\u306b\u30db\u30d0\u30fc\u3057\u305f\u5f8c\u3001\u30e1\u30cb\u30e5\u30fc\u304c\u8868\u793a\u3055\u308c\u308b\u307e\u3067\u306e\u5f85\u6a5f\u9045\u5ef6\u306a\u3069\u3002
spiderajax.api.view.optionLogoutAvoidance = \u30ed\u30b0\u30a2\u30a6\u30c8\u56de\u907f\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u5024\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionMaxCrawlDepth = \u6700\u5927\u30af\u30ed\u30fc\u30eb\u968e\u5c64\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5024\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionMaxCrawlStates = \u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u30af\u30ed\u30fc\u30eb\u72b6\u614b\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5024\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionMaxDuration = \u30af\u30ed\u30fc\u30eb\u306e\u8a2d\u5b9a\u3055\u308c\u305f\u6700\u5927\u7d99\u7d9a\u6642\u9593\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u5024\u306f\u5206\u5358\u4f4d\u3067\u3059\u3002
spiderajax.api.view.optionNumberOfBrowsers = \u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30d6\u30e9\u30a6\u30b6\u30fc\u6570\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.optionRandomInputs = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u30af\u30ed\u30fc\u30eb\u6642\u306b\u30d5\u30a9\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u30e9\u30f3\u30c0\u30e0\u306a\u5024\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002true \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3002
spiderajax.api.view.optionReloadWait = \u30da\u30fc\u30b8\u306e\u518d\u8aad\u307f\u8fbc\u307f\u5f8c\u306b\u5f85\u6a5f\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u6642\u9593\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u3053\u306e\u5024\u306f\u30df\u30ea\u79d2\u5358\u4f4d\u3067\u3059\u3002
spiderajax.api.view.optionScopeCheck = \u8a2d\u5b9a\u3055\u308c\u305f\u30b9\u30b3\u30fc\u30d7\u30c1\u30a7\u30c3\u30af\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.results = \u30af\u30ed\u30fc\u30e9\u30fc\u306e\u73fe\u5728\u306e\u7d50\u679c\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
spiderajax.api.view.results.param.count = \u8fd4\u3055\u308c\u308b\u7d50\u679c\u306e\u6570
spiderajax.api.view.results.param.start = \u7d50\u679c\u5185\u306e\u3001\u8fd4\u3055\u308c\u308b\u60c5\u5831\u306e\u958b\u59cb\u4f4d\u7f6e\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u4f4d\u7f6e (\u307e\u305f\u306f\u30aa\u30d5\u30bb\u30c3\u30c8)\u3002
spiderajax.api.view.status = \u30af\u30ed\u30fc\u30e9\u30fc\u306e\u73fe\u5728\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u5b9f\u969b\u306e\u5024\u306f\u300c\u505c\u6b62\u300d\u3068\u300c\u5b9f\u884c\u4e2d\u300d\u3067\u3059\u3002

spiderajax.automation.default = \u65e2\u5b9a
spiderajax.automation.desc = Ajax \u30b9\u30d1\u30a4\u30c0\u30fc\u81ea\u52d5\u5316\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u7d71\u5408
spiderajax.automation.dialog.ajaxspider.advanced = \u8a73\u7d30\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8868\u793a\:
spiderajax.automation.dialog.ajaxspider.browserid = \u30d6\u30e9\u30a6\u30b6ID\:
spiderajax.automation.dialog.ajaxspider.clickdefaultelems = \u30c7\u30d5\u30a9\u30eb\u30c8\u8981\u7d20\u3092\u30af\u30ea\u30c3\u30af\:
spiderajax.automation.dialog.ajaxspider.clickelems = \u63a2\u7d22\u4e2d\u306b\u30af\u30ea\u30c3\u30af\u3059\u308b\u8981\u7d20\u3092\u9078\u629e(\u6a19\u6e96\u306e\u8981\u7d20\u3060\u3051\u30af\u30ea\u30c3\u30af\u3059\u308b\u8a2d\u5b9a\u3067\u306f\u306a\u3044\u5834\u5408\u306b\u6709\u52b9)\:
spiderajax.automation.dialog.ajaxspider.clickelemsonce = \u8981\u7d20\u30921\u56de\u30af\u30ea\u30c3\u30af\:
spiderajax.automation.dialog.ajaxspider.context = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\:
spiderajax.automation.dialog.ajaxspider.enableexts = \u30d6\u30e9\u30a6\u30b6\u62e1\u5f35\u6a5f\u80fd\u3092\u6709\u52b9\u5316\:
spiderajax.automation.dialog.ajaxspider.eventwait = \u30a4\u30d9\u30f3\u30c8\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2)\:
spiderajax.automation.dialog.ajaxspider.inScopeOnly = \u30b9\u30b3\u30fc\u30d7\u5185\u306e\u307f\:
spiderajax.automation.dialog.ajaxspider.maxcrawldepth = \u6700\u5927\u30af\u30ed\u30fc\u30eb\u968e\u5c64\:
spiderajax.automation.dialog.ajaxspider.maxcrawlstates = \u6700\u5927\u30af\u30ed\u30fc\u30eb\u72b6\u614b\u6570\:
spiderajax.automation.dialog.ajaxspider.maxduration = \u6700\u5927\u7d99\u7d9a\u6642\u9593 (\u5206)\:
spiderajax.automation.dialog.ajaxspider.name = \u30b8\u30e7\u30d6\u540d
spiderajax.automation.dialog.ajaxspider.numbrowsers = \u30d6\u30e9\u30a6\u30b6\u6570\:
spiderajax.automation.dialog.ajaxspider.randominputs = \u30e9\u30f3\u30c0\u30e0\u5165\u529b\u3092\u4f7f\u7528\:
spiderajax.automation.dialog.ajaxspider.reloadwait = \u518d\u8aad\u307f\u8fbc\u307f\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2)\:
spiderajax.automation.dialog.ajaxspider.runOnlyIfModern = \u30e2\u30c0\u30f3\u30a2\u30d7\u30ea\u306e\u5834\u5408\u306e\u307f\u5b9f\u884c\:
spiderajax.automation.dialog.ajaxspider.tab.adv = \u8a73\u7d30\u30aa\u30d7\u30b7\u30e7\u30f3
spiderajax.automation.dialog.ajaxspider.title = Ajax \u30b9\u30d1\u30a4\u30c0\u30fc\u30b8\u30e7\u30d6
spiderajax.automation.dialog.ajaxspider.url = URL\:
spiderajax.automation.dialog.summary = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\: {0}, URL \: {1}
spiderajax.automation.dialog.tab.elems = \u8981\u7d20
spiderajax.automation.dialog.tab.params = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc
spiderajax.automation.error.badresultdata = PassiveScan resultData \u306e\u4e88\u671f\u3057\u306a\u3044\u30af\u30e9\u30b9\: {0}
spiderajax.automation.error.excludedelements.attribute = \u30b8\u30e7\u30d6 {0}\u3001\u9664\u5916\u8981\u7d20 {1} \u306b name \u307e\u305f\u306f value \u5c5e\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
spiderajax.automation.error.excludedelements.data = \u30b8\u30e7\u30d6 {0}\u3001\u9664\u5916\u8981\u7d20 {1} \u306b\u4ed6\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
spiderajax.automation.error.excludedelements.description = \u30b8\u30e7\u30d6 {0} \u306b\u8aac\u660e\u306e\u306a\u3044\u9664\u5916\u8981\u7d20\u304c\u3042\u308a\u307e\u3059\u3002
spiderajax.automation.error.excludedelements.duplicated = \u30b8\u30e7\u30d6 {0} \u306b\u91cd\u8907\u3057\u305f\u9664\u5916\u8981\u7d20\u304c\u3042\u308a\u307e\u3059\: {1}
spiderajax.automation.error.excludedelements.element = \u30b8\u30e7\u30d6 {0}\u3001\u9664\u5916\u8981\u7d20 {1} \u306b\u8981\u7d20\u304c\u3042\u308a\u307e\u305b\u3093\u3002
spiderajax.automation.error.excludedelements.format = \u30b8\u30e7\u30d6 {0} \u9664\u5916\u8981\u7d20\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u5f62\u5f0f\: {1}
spiderajax.automation.error.nofile = \u30d5\u30a1\u30a4\u30eb "{0}" \u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093
spiderajax.automation.error.nomodernrule = \u30e2\u30c0\u30f3\u30a2\u30d7\u30ea\u304b\u3069\u3046\u304b\u5224\u65ad\u3067\u304d\u307e\u305b\u3093 - \u300c\u30e2\u30c0\u30f3Web\u30a2\u30d7\u30ea\u300d\u30eb\u30fc\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044/\u6709\u52b9\u3067\u306a\u3044
spiderajax.automation.error.nopscanresults = \u30e2\u30c0\u30f3\u30a2\u30d7\u30ea\u304b\u3069\u3046\u304b\u5224\u65ad\u3067\u304d\u307e\u305b\u3093 - passiveScan-wait \u30b8\u30e7\u30d6\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u305b\u3093
spiderajax.automation.info.modern = \u30bf\u30fc\u30b2\u30c3\u30c8\u306f\u30e2\u30c0\u30f3\u3067\u3059\u3001AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3092\u5b9f\u884c\u3057\u307e\u3059
spiderajax.automation.info.notmodern = \u30bf\u30fc\u30b2\u30c3\u30c8\u306f\u30e2\u30c0\u30f3\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3001AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u307e\u3059
spiderajax.automation.name = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u81ea\u52d5\u5316
spiderajax.automation.tests.stats.defaultname = {0}\u500b\u4ee5\u4e0a\u306eURL\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f

spiderajax.context.panel.name = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc

spiderajax.desc = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u3001Crawljax\u3092\u4f7f\u7528
spiderajax.excludedelements.ui.add.button = \u8ffd\u52a0
spiderajax.excludedelements.ui.add.title = \u9664\u5916\u8981\u7d20\u306e\u8ffd\u52a0
spiderajax.excludedelements.ui.field.attributeName = \u5c5e\u6027\u540d\:
spiderajax.excludedelements.ui.field.attributeValue = \u5c5e\u6027\u5024\:
spiderajax.excludedelements.ui.field.description = \u8aac\u660e\:
spiderajax.excludedelements.ui.field.element = \u8981\u7d20\:
spiderajax.excludedelements.ui.field.enabled = \u6709\u52b9\:
spiderajax.excludedelements.ui.field.text = \u30c6\u30ad\u30b9\u30c8\:
spiderajax.excludedelements.ui.field.xpath = XPath\:
spiderajax.excludedelements.ui.modify.button = \u5909\u66f4
spiderajax.excludedelements.ui.modify.title = \u9664\u5916\u8981\u7d20\u306e\u5909\u66f4
spiderajax.excludedelements.ui.panel.label = \u9664\u5916\u3055\u308c\u305f\u8981\u7d20\:
spiderajax.excludedelements.ui.remove.button.cancel = \u30ad\u30e3\u30f3\u30bb\u30eb
spiderajax.excludedelements.ui.remove.button.confirm = \u524a\u9664
spiderajax.excludedelements.ui.remove.checkbox.label = \u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044
spiderajax.excludedelements.ui.remove.text = \u9078\u629e\u3057\u305f\u9664\u5916\u3055\u308c\u305f\u8981\u7d20\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b?
spiderajax.excludedelements.ui.remove.title = \u9664\u5916\u8981\u7d20\u306e\u524a\u9664
spiderajax.excludedelements.ui.table.header.description = \u8aac\u660e
spiderajax.excludedelements.ui.table.header.enabled = \u6709\u52b9
spiderajax.excludedelements.ui.warn.duplicated.text = \u6307\u5b9a\u3055\u308c\u305f\u8aac\u660e\u3092\u6301\u3064\u8981\u7d20\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
spiderajax.excludedelements.ui.warn.duplicated.title = \u91cd\u8907\u3057\u305f\u9664\u5916\u8981\u7d20
spiderajax.excludedelements.ui.warn.invalid.description = \u8aac\u660e\u306f\u7a7a\u3067\u3042\u3063\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002
spiderajax.excludedelements.ui.warn.invalid.element = \u8981\u7d20\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
spiderajax.excludedelements.ui.warn.invalid.incompleteattribute = \u5c5e\u6027\u306e\u540d\u524d\u3068\u5024\u306e\u4e21\u65b9\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
spiderajax.excludedelements.ui.warn.invalid.missingdata = \u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u4ed6\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
spiderajax.excludedelements.ui.warn.invalid.title = \u7121\u52b9\u306a\u9664\u5916\u8981\u7d20

spiderajax.menu.tools.label = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc...
spiderajax.menu.tools.label.mnemonic = X

spiderajax.name = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc

spiderajax.options.dialog.allowedResources.add.button.confirm = \u8ffd\u52a0
spiderajax.options.dialog.allowedResources.add.title = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u3092\u8ffd\u52a0
spiderajax.options.dialog.allowedResources.field.label.enabled = \u6709\u52b9
spiderajax.options.dialog.allowedResources.field.label.regex = \u6b63\u898f\u8868\u73fe
spiderajax.options.dialog.allowedResources.label = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\:
spiderajax.options.dialog.allowedResources.modify.button.confirm = \u5909\u66f4
spiderajax.options.dialog.allowedResources.modify.title = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u306e\u5909\u66f4
spiderajax.options.dialog.allowedResources.remove.button.cancel = \u30ad\u30e3\u30f3\u30bb\u30eb
spiderajax.options.dialog.allowedResources.remove.button.confirm = \u524a\u9664
spiderajax.options.dialog.allowedResources.remove.checkbox.label = \u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044
spiderajax.options.dialog.allowedResources.remove.text = \u9078\u629e\u3057\u305f\u8a31\u53ef\u3055\u308c\u305f\u8981\u7d20\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b?
spiderajax.options.dialog.allowedResources.remove.title = \u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u306e\u524a\u9664
spiderajax.options.dialog.allowedResources.table.header.enabled = \u6709\u52b9
spiderajax.options.dialog.allowedResources.table.header.regex = \u6b63\u898f\u8868\u73fe
spiderajax.options.dialog.allowedResources.warning.invalid.regex.text = \u5165\u529b\u3055\u308c\u305f\u6b63\u898f\u8868\u73fe\u306f\u7121\u52b9\u3067\u3059\uff1a\n{0}
spiderajax.options.dialog.allowedResources.warning.invalid.regex.title = \u7121\u52b9\u306a\u6b63\u898f\u8868\u73fe
spiderajax.options.dialog.allowedResources.warning.name.repeated.text = \u6307\u5b9a\u3055\u308c\u305f\u6b63\u898f\u8868\u73fe\u3092\u6301\u3064\u8a31\u53ef\u30ea\u30bd\u30fc\u30b9\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
spiderajax.options.dialog.allowedResources.warning.name.repeated.title = \u91cd\u8907\u3057\u305f\u8a31\u53ef\u30ea\u30bd\u30fc\u30b9
spiderajax.options.dialog.elem.add.button.confirm = \u8ffd\u52a0
spiderajax.options.dialog.elem.add.title = \u8981\u7d20\u8ffd\u52a0
spiderajax.options.dialog.elem.field.label.enabled = \u6709\u52b9
spiderajax.options.dialog.elem.field.label.name = \u8981\u7d20
spiderajax.options.dialog.elem.modify.button.confirm = \u5909\u66f4
spiderajax.options.dialog.elem.modify.title = \u8981\u7d20\u3092\u4fee\u6b63
spiderajax.options.dialog.elem.remove.button.cancel = \u30ad\u30e3\u30f3\u30bb\u30eb
spiderajax.options.dialog.elem.remove.button.confirm = \u524a\u9664
spiderajax.options.dialog.elem.remove.checkbox.label = \u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044
spiderajax.options.dialog.elem.remove.text = \u9078\u629e\u3057\u305f\u8981\u7d20\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b?
spiderajax.options.dialog.elem.remove.title = \u8981\u7d20\u3092\u524a\u9664
spiderajax.options.dialog.elem.warning.name.repeated.text = \u6307\u5b9a\u3057\u305f\u540d\u524d\u3092\u6301\u3064\u8981\u7d20\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
spiderajax.options.dialog.elem.warning.name.repeated.title = \u91cd\u8907\u3057\u3066\u3044\u308b\u8981\u7d20
spiderajax.options.label.browsers = \u958b\u304f\u30d6\u30e9\u30a6\u30b6\u30a6\u30a3\u30f3\u30c9\u30a6\u306e\u6570\:
spiderajax.options.label.clickelems = \u63a2\u7d22\u4e2d\u306b\u30af\u30ea\u30c3\u30af\u3059\u308b\u8981\u7d20\u3092\u9078\u629e(\u6a19\u6e96\u306e\u8981\u7d20\u3060\u3051\u30af\u30ea\u30c3\u30af\u3059\u308b\u8a2d\u5b9a\u3067\u306f\u306a\u3044\u5834\u5408\u306b\u6709\u52b9)\:
spiderajax.options.label.clickonce = \u8981\u7d20\u30921\u56de\u3060\u3051\u30af\u30ea\u30c3\u30af\u3059\u308b
spiderajax.options.label.crawlstates = \u6700\u5927\u30af\u30ed\u30fc\u30eb\u72b6\u614b\u6570 (0\u306f\u7121\u5236\u9650)\:
spiderajax.options.label.depth = \u6700\u5927\u30af\u30ed\u30fc\u30eb\u6df1\u5ea6 (0\u306f\u7121\u5236\u9650)\:
spiderajax.options.label.enableexts = \u30d6\u30e9\u30a6\u30b6\u30fc\u62e1\u5f35\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3059\u308b
spiderajax.options.label.eventwait = \u30a4\u30d9\u30f3\u30c8\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2)\:
spiderajax.options.label.logoutavoidance = \u30ed\u30b0\u30a2\u30a6\u30c8\u56de\u907f
spiderajax.options.label.maxduration = \u6700\u5927\u7d99\u7d9a\u6642\u9593 (\u5206, 0 \u3067\u7121\u5236\u9650)\:
spiderajax.options.label.randominputs = \u30d5\u30a9\u30fc\u30e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u30e9\u30f3\u30c0\u30e0\u5024\u3092\u4f7f\u7528\u3059\u308b
spiderajax.options.label.reloadwait = \u518d\u8aad\u307f\u8fbc\u307f\u5f85\u6a5f\u6642\u9593 (\u30df\u30ea\u79d2)\:
spiderajax.options.label.scope = \u30b9\u30b3\u30fc\u30d7\u30c1\u30a7\u30c3\u30af
spiderajax.options.label.scope.flexible = \u67d4\u8edf
spiderajax.options.label.scope.strict = \u53b3\u683c
spiderajax.options.table.header.element = \u8981\u7d20
spiderajax.options.table.header.enabled = \u6709\u52b9
spiderajax.options.title = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc

spiderajax.outofscope.response = (403 Forbidden) Ajax \u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u7bc4\u56f2\u5916

spiderajax.panel.mnemonic = j
spiderajax.panel.subtitle = \u30af\u30ed\u30fc\u30eb\u6e08\u307fURL\:
spiderajax.panel.table.cell.excluded = \u9664\u5916
spiderajax.panel.table.cell.ioerror = I/O\u30a8\u30e9\u30fc
spiderajax.panel.table.cell.outofcontext = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u5916
spiderajax.panel.table.cell.outofscope = \u30b9\u30b3\u30fc\u30d7\u5916
spiderajax.panel.table.cell.processed = \u51e6\u7406\u6e08\u307f
spiderajax.panel.table.cell.thirdparty = \u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3
spiderajax.panel.table.header.processed = \u51e6\u7406\u6e08\u307f
spiderajax.panel.title = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc

spiderajax.proxy.local.label.browsers = \u30d6\u30e9\u30a6\u30b6\u30fc\:
spiderajax.proxy.local.label.defaultElems = \u30c7\u30d5\u30a9\u30eb\u30c8\u8981\u7d20\u306e\u307f\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b (a\u3001button\u3001input)

spiderajax.scandialog.alreadyrunning.error = \u30b9\u30d1\u30a4\u30c0\u30fc\u30b9\u30ad\u30e3\u30f3\u304c\u65e2\u306b\u5b9f\u884c\u4e2d\u3067\u3059\u3002
spiderajax.scandialog.button.reset = \u30ea\u30bb\u30c3\u30c8
spiderajax.scandialog.button.scan = \u30b9\u30ad\u30e3\u30f3\u958b\u59cb
spiderajax.scandialog.label.adv = \u8a73\u7d30\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u8868\u793a
spiderajax.scandialog.label.browser = \u30d6\u30e9\u30a6\u30b6\u30fc\:
spiderajax.scandialog.label.context = \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\:
spiderajax.scandialog.label.inscope = \u30b9\u30b3\u30fc\u30d7\u5185\u306e\u307f\:
spiderajax.scandialog.label.logoutAvoidance = \u30ed\u30b0\u30a2\u30a6\u30c8\u56de\u907f\:
spiderajax.scandialog.label.spiderSubtreeOnly = \u30b5\u30d6\u30c4\u30ea\u30fc\u306e\u307f\u3092\u30b9\u30d1\u30a4\u30c0\u30fc
spiderajax.scandialog.label.start = \u958b\u59cb\u4f4d\u7f6e\:
spiderajax.scandialog.label.user = \u30e6\u30fc\u30b6\u30fc\:
spiderajax.scandialog.nobrowser.error = \u30d6\u30e9\u30a6\u30b6\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
spiderajax.scandialog.nostart.context.error = \u9078\u629e\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u958b\u59cb\u70b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
spiderajax.scandialog.nostart.error = \u6709\u52b9\u306a\u958b\u59cb\u5730\u70b9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u542b\u3081\u3066\u304f\u3060\u3055\u3044 (\u4f8b\: https\://www.example.com)\u3002
spiderajax.scandialog.nostart.subtreeOnly.error = \u30b5\u30a4\u30c8\u306e\u30b5\u30d6\u30c4\u30ea\u30fc\u3092\u30b9\u30d1\u30a4\u30c0\u30fc\u3059\u308b\u306b\u306f\u3001\u30b5\u30a4\u30c8\u30c4\u30ea\u30fc\u306e\u30ce\u30fc\u30c9\u3092\u9078\u629e\u3059\u308b\u304b\u3001URL\u3092\u624b\u52d5\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
spiderajax.scandialog.notSafe.error = \u300c\u30bb\u30fc\u30d5\u300d\u30e2\u30fc\u30c9\u3067\u306f\u3001Ajax \u30b9\u30d1\u30a4\u30c0\u30fc\u306e\u30b9\u30ad\u30e3\u30f3\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
spiderajax.scandialog.startNotInContext.error = \u958b\u59cb\u70b9\u304c\u9078\u629e\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093\u3002
spiderajax.scandialog.startNotInScope.error = \u958b\u59cb\u70b9\u304c\u30b9\u30b3\u30fc\u30d7\u5185\u306b\u3042\u308a\u307e\u305b\u3093\u3002
spiderajax.scandialog.startProtectedMode.error = \u958b\u59cb\u70b9\u306f\u300c\u30d7\u30ed\u30c6\u30af\u30c8\u300d\u30e2\u30fc\u30c9\u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
spiderajax.scandialog.tab.elements = \u8981\u7d20
spiderajax.scandialog.tab.options = \u30aa\u30d7\u30b7\u30e7\u30f3
spiderajax.scandialog.tab.scope = \u30b9\u30b3\u30fc\u30d7
spiderajax.scandialog.title = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc

spiderajax.site.popup = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc...

spiderajax.toolbar.button.start = \u65b0\u898fAJAX\u30b9\u30d1\u30a4\u30c0\u30fc
spiderajax.toolbar.button.stop = AJAX\u30b9\u30d1\u30a4\u30c0\u30fc\u505c\u6b62
