#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=Reglas de Escaneo Activa

ascanrules.bufferoverflow.name=Buffer Overflow
ascanrules.bufferoverflow.desc=Los errores de Buffer Overflow se caracterizan por la sobrescritura de espacios de memoria del proceso web en segundo plano, que no deber\u00edan haber sido modificados, intencionadamente o no. Sobrescribir los valores de IP (Instruction Pointer), BP (Base Pointer) y otros registros causan excepciones, violaciones del segmento y otros errores. Normalmente estos errores terminan la ejecuci\u00f3n de la aplicaci\u00f3n de manera inseperada. 
ascanrules.bufferoverflow.soln=Reescribir el programa en segundo plano realizando una correcta comprobaci\u00f3n de la longitud de retorno. Esto requerir\u00e1 el recompilado del ejecutable en segundo plano.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=Potencial desbordamiento de buffer. El script ha cerrado la conexi\u00f3n y ha lanzado un error interno del servidor 500


ascanrules.commandinjectionplugin.name=Inyecci\u00f3n Remota de Comandos OS
ascanrules.commandinjectionplugin.desc=T\u00e9cnica de ataque usada para la ejecuci\u00f3n no autorizada de comandos del sistema operativo. Este ataque es posible cuando una aplicaci\u00f3n acepta la entrada que no es de confianza para construir comandos del sistema operativo de una manera insegura involucrando desinfecci\u00f3n inadecuada de datos, y/o llamada inadecuada de programas externos.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html\nhttps\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=Error de formato de cadena
ascanrules.formatstring.desc=Un error de formato de cadena ocurre cuando los datos de una cadena de entrada es evaluada como un comando por la aplicaci\u00f3n. 
ascanrules.formatstring.soln=Reescribir el programa en segundo plano usando un borrado apropiado de las cadenas de caracteres err\u00f3neas. Esto requerir\u00e1 el recompilado del ejecutable en segundo plano.
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en /%s
ascanrules.formatstring.error2=Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en /%s y /%x
ascanrules.formatstring.error3=Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en una cadena de formato de error de microsoft


ascanrules.testscrosssitescriptv2.name=Cross Site Scripting (Reflejada)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=Iniciado con POCA confianza, puesto que el contenido (Content-Type) no es HTML

ascanrules.testpersistentxssattack.name=Cross Site Scripting (Persistente)
ascanrules.testpersistentxssattack.otherinfo=URL de la fuente\: {0}

ascanrules.testpersistentxssprime.name=Cross Site Scripting (Persistente) - Principal
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (Persistente) - Spider
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=Falla por Inyecci\u00f3n SQL
ascanrules.testsqlinjection.desc=Inyecci\u00f3n SQL puede ser posible.
ascanrules.testsqlinjection.soln=No conf\u00ede en los valores de entrada del lado del cliente, incluso si en el lado del cliente se realice una validaci\u00f3n.\nEn general, comprobar todos los datos de entrado en el servidor.\nSi la aplicaci\u00f3n usa JDBC, usar PreparedStatement o CallableStatement, con par\u00e1metros pasados por '?'\nSi la aplicaci\u00f3n utiliza ASP, usar ADO Command Objects con una fuerte comprobaci\u00f3n de tipos de consultas y par\u00e1metros. \nSi la Base de Datos puede usar Stored Procedures (Procedimientos Almacenados), \u00faselos.\n\u00a1NO concatenar cadenas en los query (consultas) en el procedimientos almacenados,  o utilizar 'exec', 'exec immediate', o su funcionalidad equivalente\!\nNo crear consultas SQL din\u00e1micas  usando una sencilla concatenaci\u00f3n de cadenas.\nAplique aun lista blanca (allow list) de caracteres permitidos, o una lista negra (deny list) de caracteres no permitidos en la entrada (input) del usuario.\nAplique el privilegio m\u00ednimo posible al usuario de la base de datos de los privilegios usados.\nEn particular evitar el uso de los usuario de base de datos 'sa' o 'db-owner'. Esto no elimina la inyecci\u00f3n SQL, pero minimiza su impacto.\nConceder el m\u00ednimo acceso de base de datos que es necesario para la aplicaci\u00f3n.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-a1 https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=[{0}] campo\: [{1}], valor [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=Valor Original\: [{0}]. Valor Modificado\: [{1}]. Valor de Control\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[{0}] campo\: [{1}], valor [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[{0}] campo\: [{1}], valor [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=Probable RDBMS [{0}], expresi\u00f3n regular del mensaje de error que aparece [{1}] corresponde con los resultados HTML.\nLa vulnerabilidad fue detectado por la manipulaci\u00f3n del par\u00e1metro para causar un mensaje de error de base de datos a ser retornado y reconocido
ascanrules.testsqlinjection.alert.unionbased.extrainfo=Probable RDBMS [{0}], dado la expresi\u00f3n regular del mensaje de error UNION-specific [{1}] corresponde con los resultados HTML\nLa vulnerabilidad fue detectada por la manipulaci\u00f3n del par\u00e1metro con una cl\u00e1usula SQL ''UNION'' para causar un mensaje de error de base de datos a ser retornado y reconocido
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=Los resultados de las p\u00e1ginas originales fueron replicados con \u00e9xito utilizando la expresi\u00f3n [{0}] como valor del par\u00e1metro\nEl valor de par\u00e1metro que est\u00e1 modificado fue {1} eliminado de la salida HTML para los fines de la comparaci\u00f3n
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=Los resultados de las p\u00e1ginas originales fueron replicados con \u00e9xito utilizando la expresi\u00f3n "ORDER BY" [{0}] como valor del par\u00e1metro\nEl valor de par\u00e1metro que est\u00e1 modificado fue {1} eliminado de la salida HTML para fines de la comparaci\u00f3n
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=Mensaje no modificado retorn\u00f3 estado HTTP [{0}], mensaje modificado retorn\u00f3 estado HTTP [{1}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=Mensaje no modificado retorn\u00f3 estado HTTP [{0}] y longitud [{1}]; Mensaje modificado retorn\u00f3 estado HTTP [{2}] y longitud [{3}]. Un tercer mensaje (con valor sin inyecci\u00f3n SQL) retorn\u00f3 estado HTTP [{4}] y longitud [{5}]
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=Los resultados de la p\u00e1gina se manipularon con \u00e9xito utilizando las condiciones booleanas [{0}] y [{1}]\nEl valor de par\u00e1metro que est\u00e1 modificado fue {2} eliminado de la salida HTML para fines de la comparaci\u00f3n
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=Los datos fueron devueltos por el par\u00e1metro original. \nLa vulnerabilidad fue detectada con \u00e9xito mediante la restricci\u00f3n de los datos originalmente devueltos, por la manipulaci\u00f3n del par\u00e1metro
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=Los datos NO fueron revueltos por el par\u00e1metro original.\nLa vulnerabilidad fue detectada con \u00e9xito recuperando mas datos retornados originalmente, por la manipulaci\u00f3n del par\u00e1metro
ascanrules.testsqlinjection.alert.timebased.extrainfo=El tiempo de consulta es controlable a trav\u00e9s del valor del par\u00e1metro [{0}], el cual caus\u00f3 que la solicitud tomara [{1}] milisegundos, mientras que la consulta original, no modificada, tom\u00f3 [{2}] [{3}] milisegundos 
ascanrules.testsqlinjection.authbypass.name=Inyecci\u00f3n SQL - Omisi\u00f3n de Autenticaci\u00f3n
ascanrules.testsqlinjection.authbypass.desc=Inyecci\u00f3n SQL puede ser posible en una p\u00e1gina de acceso (login), permitiendo potencialmente a los mecanismo de autenticaci\u00f3n de la aplicaci\u00f3n ser anulada

ascanrules.testexternalredirect.name=Re-direcci\u00f3n Externa
ascanrules.testexternalredirect.reason.location.header=La respuesta contiene una re-direcci\u00f3n en su Location header que permite establecer una URL externa.
ascanrules.testexternalredirect.reason.location.meta=La respuesta contiene una re-direcci\u00f3n en su etiqueta meta http-equiv para 'Location', que permite establecer una URL externa.
ascanrules.testexternalredirect.reason.refresh.header=La respuesta contiene una re-direcci\u00f3n en su Refresh header que permite establecer una URL externa.
ascanrules.testexternalredirect.reason.refresh.meta=La respuesta contiene una re-direcci\u00f3n en su etiqueta meta http-equiv de 'Refresh' que permite establecer una URL externa.
ascanrules.testexternalredirect.reason.javascript=La respuesta contiene una re-direcci\u00f3n en su c\u00f3digo JavaScript que permite establecer una URL externa.
ascanrules.testexternalredirect.reason.notfound=No resultados para esto...

ascanrules.codeinjectionplugin.name=Inyecci\u00f3n de C\u00f3digo de la Lado del Servidor
ascanrules.codeinjectionplugin.name.asp=Inyecci\u00f3n de c\u00f3digo del lado del servidor - inyecci\u00f3n de c\u00f3digo ASP
ascanrules.codeinjectionplugin.name.php=Inyecci\u00f3n de c\u00f3digo del lado del servidor - inyecci\u00f3n de c\u00f3digo PHP
ascanrules.codeinjectionplugin.desc=Una inyecci\u00f3n de c\u00f3digo puede ser posible incluyendo el c\u00f3digo personalizado que ser\u00e1 evaluado por el motor de scripting
ascanrules.codeinjectionplugin.soln=No conf\u00ede en los valores de entrada del lado del cliente, incluso si en el lado del cliente se realice una validaci\u00f3n.\nEn general, comprobar todos los datos de entrada en el lado del servidor y escapar de todos los datos recibidos desde el cliente.\n\u00a0Evite el uso de funciones eval() combinados con los datos de entrada del usuario.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html\nhttps\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection')

ascanrules.testdirectorybrowsing.name=Exploraci\u00f3n de Directorios
ascanrules.testdirectorybrowsing.desc=Es posible ver el listado de directorios. La lista de directorios puede revelar scripts ocultos, incluyen archivos, copia de seguridad de los archivos de origen, etc, que se pueden acceder para leer informaci\u00f3n sensible.
ascanrules.testdirectorybrowsing.soln=Desactivar la exploraci\u00f3n de directorios. Si esto es necesario, aseg\u00farese de que los archivos de la lista no induce riesgos.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\nhttp\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html

ascanrules.testinjectioncrlf.name=Inyecci\u00f3n CRLF
ascanrules.testinjectioncrlf.desc=La Cookies puede configurarse a trav\u00e9s de inyecci\u00f3n CRLF. Tambi\u00e9n puede ser posible establecer respuestas HTTP headers arbitrarias. Adem\u00e1s, por la cuidadosa elaboraci\u00f3n de la response inyectado usando script cross-site, tambi\u00e9n puede existir vulnerabilidad por envenenamiento cach\u00e9.
ascanrules.testinjectioncrlf.soln=Escriba verificando el par\u00e1metro enviado con cuidado. No permita que CRLF para ser inyectado mediante el filtrado de CRLF.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\nhttp\://webappfirewall.com/lib/crlf-injection.txtnull\nhttp\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=Manipulando Par\u00e1metros
ascanrules.testparametertamper.desc=La manipulaci\u00f3n de par\u00e1metros caus\u00f3 una p\u00e1gina de error o Java stack trace que se mostrar\u00e1n. Esto indicaba la falta de manejo de excepciones y potenciales \u00e1reas para su posterior explotaci\u00f3n.
ascanrules.testparametertamper.soln=Identificar la causa del error y solucionarlo. No conf\u00ede en la entrada del lado del cliente y hacer cumplir un control exhaustivo en el lado del servidor. Adem\u00e1s, detectar la excepci\u00f3n correctamente. Utilice una p\u00e1gina de error 500 gen\u00e9rico para error interno del servidor.

ascanrules.testpathtraversal.name=Directory Traversal

ascanrules.testremotefileinclude.name=Inclusi\u00f3n Remota de Archivos

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=Ciertos par\u00e1metros pueden causar comandos del Server Side Include ser ejecutados. Esto puede permitir la conexi\u00f3n a base de datos o ejecutar c\u00f3digo arbitrario.
ascanrules.testserversideinclude.soln=No conf\u00ede en la entrada (input) de lado del cliente y hacer cumplir un control exhaustivo en el lado del servidor. Deshabilitar el server side includes.
Refer=el manual para desactivar el Server Side Include (SSI).\n\nUtilice privilegios m\u00ednimos para ejecutar el servidor web o servidor de aplicaciones.\n\nPara Apache, deshabilitar lo siguiente\:\n\nLas opciones de \u00edndices incluye FollowSymLinks\n\nAgregar el tipo application/x-httpd-cgi .cgi\n\nAgregar el tipo text/x-server-parsed-html .html\n
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

