
ascanrules.bufferoverflow.desc = \u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u30a8\u30e9\u30fc\u306f\u3001\u672c\u6765\u5909\u66f4\u3055\u308c\u308b\u3079\u304d\u3067\u306f\u306a\u3044\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9Web\u30d7\u30ed\u30bb\u30b9\u306e\u30e1\u30e2\u30ea\u9818\u57df\u304c\u4e0a\u66f8\u304d\u3055\u308c\u308b\u3053\u3068\u3067\u767a\u751f\u3057\u307e\u3059\u3002IP (\u547d\u4ee4\u30dd\u30a4\u30f3\u30bf) \u3084 BP (\u30d9\u30fc\u30b9\u30dd\u30a4\u30f3\u30bf)\u3001\u305d\u306e\u4ed6\u306e\u30ec\u30b8\u30b9\u30bf\u306e\u5024\u304c\u4e0a\u66f8\u304d\u3055\u308c\u308b\u3068\u3001\u4f8b\u5916\u3084\u30bb\u30b0\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u9055\u53cd\u3001\u305d\u306e\u4ed6\u306e\u30d7\u30ed\u30bb\u30b9\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3059\u3002\u901a\u5e38\u3001\u3053\u308c\u3089\u306e\u30a8\u30e9\u30fc\u306b\u3088\u308a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u4e88\u671f\u305b\u305a\u7d42\u4e86\u3057\u307e\u3059\u3002
ascanrules.bufferoverflow.name = \u30d0\u30c3\u30d5\u30a1 \u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc
ascanrules.bufferoverflow.other = \u6f5c\u5728\u7684\u306a\u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u3002\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u63a5\u7d9a\u3092\u9589\u3058\u3001500 Internal Server Error \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002
ascanrules.bufferoverflow.refs = https\://owasp.org/www-community/attacks/Buffer_overflow_attack
ascanrules.bufferoverflow.soln = \u9069\u5207\u306a\u623b\u308a\u5024\u9577\u30c1\u30a7\u30c3\u30af\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u3001\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u66f8\u304d\u63db\u3048\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u306f\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306e\u518d\u30b3\u30f3\u30d1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002

ascanrules.cloudmetadata.desc = \u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u653b\u6483 (Cloud Metadata Attack) \u306f\u3001\u8a2d\u5b9a\u30df\u30b9\u306e\u3042\u308bNGINX\u30b5\u30fc\u30d0\u30fc\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3057\u3001AWS\u3001GCP\u3001Azure\u306a\u3069\u306e\u30af\u30e9\u30a6\u30c9\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304c\u7ba1\u7406\u3059\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30e1\u30bf\u30c7\u30fc\u30bf\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a66\u307f\u307e\u3059\u3002\n\u3053\u308c\u3089\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f\u3059\u3079\u3066\u3001\u5185\u90e8\u306e\u30eb\u30fc\u30c6\u30a3\u30f3\u30b0\u4e0d\u53ef\u80fd\u306aIP\u30a2\u30c9\u30ec\u30b9\u300c169.254.169.254\u300d\u3092\u4ecb\u3057\u3066\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u63d0\u4f9b\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u4e0d\u9069\u5207\u306b\u8a2d\u5b9a\u3055\u308c\u305fNGINX\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u516c\u958b\u3055\u308c\u3001Host\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3053\u306eIP\u30a2\u30c9\u30ec\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanrules.cloudmetadata.name = \u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u9732\u5448\u3059\u308b\u53ef\u80fd\u6027
ascanrules.cloudmetadata.otherinfo = \u6210\u529f\u3057\u305f\u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304b\u3089\u5224\u65ad\u3057\u3066\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30ec\u30b9\u30dd\u30f3\u30b9\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3001\u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002\n\u8fd4\u3055\u308c\u305f\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u306f\u3001\u653b\u6483\u8005\u304c\u30b7\u30b9\u30c6\u30e0\u3092\u5b8c\u5168\u306b\u4fb5\u5bb3\u3059\u308b\u3053\u3068\u3092\u53ef\u80fd\u306b\u3059\u308b\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.cloudmetadata.refs = https\://blog.nginx.org/blog/trust-no-one-perils-of-trusting-user-input
ascanrules.cloudmetadata.soln = NGINX \u8a2d\u5b9a\u3067\u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u3092\u4fe1\u983c\u3057\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30b1\u30fc\u30b9\u3067\u306f\u3001\u304a\u305d\u3089\u304f 'Host' \u30d8\u30c3\u30c0\u30fc\u304b\u3089\u8a2d\u5b9a\u3055\u308c\u3001\u653b\u6483\u8005\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u3046\u308b $host \u5909\u6570\u306e\u4f7f\u7528\u304c\u539f\u56e0\u3067\u3059\u3002

ascanrules.codeinjection.desc = \u30b9\u30af\u30ea\u30d7\u30c8\u30a8\u30f3\u30b8\u30f3\u306b\u3088\u3063\u3066\u8a55\u4fa1\u3055\u308c\u308b\u30ab\u30b9\u30bf\u30e0\u30b3\u30fc\u30c9\u3092\u542b\u3080\u3001\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.codeinjection.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.name.asp = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - ASP\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.name.php = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - PHP\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.refs = https\://cwe.mitre.org/data/definitions/94.html\nhttps\://owasp.org/www-community/attacks/Direct_Dynamic_Code_Evaluation_Eval%20Injection
ascanrules.codeinjection.soln = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u5165\u529b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u3067\u691c\u8a3c\u304c\u884c\u308f\u308c\u3066\u3044\u3066\u3082\u4fe1\u983c\u3057\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002\n\u4e00\u822c\u7684\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u306e\u578b\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u53d7\u3051\u53d6\u3063\u305f\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u3092\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u30c7\u30fc\u30bf\u3068\u7d44\u307f\u5408\u308f\u305b\u3066 eval() \u95a2\u6570\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.commandinjection.desc = \u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u30b3\u30de\u30f3\u30c9\u3092\u4e0d\u6b63\u306b\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u653b\u6483\u624b\u6cd5\u3002 \u3053\u306e\u653b\u6483\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u3092\u53d7\u3051\u53d6\u308a\u3001\u4e0d\u9069\u5207\u306a\u7121\u5bb3\u5316\u3084\u5916\u90e8\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u4e0d\u9069\u5207\u306a\u547c\u3073\u51fa\u3057\u3068\u3044\u3063\u305f\u5b89\u5168\u3067\u306a\u3044\u65b9\u6cd5\u3067\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u30b3\u30de\u30f3\u30c9\u3092\u69cb\u7bc9\u3059\u308b\u969b\u306b\u767a\u751f\u3057\u307e\u3059\u3002
ascanrules.commandinjection.name = \u30ea\u30e2\u30fc\u30c8OS\u30b3\u30de\u30f3\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.commandinjection.otherinfo = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306b [{0}] \u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u3067\u3001\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30b3\u30de\u30f3\u30c9\u306e\u5185\u5bb9\u3092\u53d6\u5f97\u3067\u304d\u307e\u3057\u305f\u3002
ascanrules.commandinjection.refs = https\://cwe.mitre.org/data/definitions/78.html\nhttps\://owasp.org/www-community/attacks/Command_Injection

ascanrules.commandinjection.time.name = \u30ea\u30e2\u30fc\u30c8OS\u30b3\u30de\u30f3\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.commandinjection.time.otherinfo = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306b [{0}] \u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u3067\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5fdc\u7b54\u6642\u9593\u3092\u5236\u5fa1\u3067\u304d\u307e\u3057\u305f\u3002

ascanrules.crlfinjection.desc = CRLF\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3092\u4ecb\u3057\u3066Cookie\u304c\u8a2d\u5b9a\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u4efb\u610f\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u308b\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002\u3055\u3089\u306b\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f7f\u7528\u3057\u3066\u3001\u6ce8\u5165\u3055\u308c\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u6ce8\u610f\u6df1\u304f\u4f5c\u6210\u3059\u308b\u3053\u3068\u3067\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u30dd\u30a4\u30ba\u30cb\u30f3\u30b0\u306e\u8106\u5f31\u6027\u3082\u5b58\u5728\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.crlfinjection.name = CRLF\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.crlfinjection.refs = https\://owasp.org/www-community/vulnerabilities/CRLF_Injection\nhttps\://cwe.mitre.org/data/definitions/113.html
ascanrules.crlfinjection.soln = \u9001\u4fe1\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u614e\u91cd\u306b\u578b\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002CRLF\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3059\u308b\u3053\u3068\u3067\u3001\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3092\u8a31\u53ef\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002

ascanrules.crosssitescripting.json.desc = XSS\u653b\u6483\u304cJSON\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u53cd\u6620\u3055\u308c\u307e\u3057\u305f\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u6d88\u8cbb\u3059\u308b\u5074\u304c\u30c7\u30fc\u30bf\u3092\u9069\u5207\u306b\u51e6\u7406\u3057\u306a\u3044\u5834\u5408\u3001\u653b\u6483\u306b\u5bfe\u3057\u3066\u8106\u5f31\u306b\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.crosssitescripting.json.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0\u306e\u5f31\u70b9 (JSON\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u53cd\u6620)
ascanrules.crosssitescripting.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u53cd\u5c04\u578b)
ascanrules.crosssitescripting.otherinfo.accesskey = accesskey \u5c5e\u6027\u306f\u3001\u8981\u7d20\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3059\u308b\u3001\u307e\u305f\u306f\u30d5\u30a9\u30fc\u30ab\u30b9\u3059\u308b\u305f\u3081\u306e\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u30ad\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u306e\u5c5e\u6027\u306f\u3001\u975e\u6a19\u6e96\u307e\u305f\u306f\u30ab\u30b9\u30bf\u30e0\u30bf\u30b0\u306b\u5bfe\u3057\u3066\u30da\u30a4\u30ed\u30fc\u30c9\u3092\u8d77\u52d5\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n
ascanrules.crosssitescripting.otherinfo.nothtml = Content-Type\u304cHTML\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u4f4e\u3044\u4fe1\u983c\u5ea6\u3067\u8b66\u544a\u3092\u767a\u751f\u3055\u305b\u307e\u3057\u305f\u3002

ascanrules.desc = \u30ea\u30ea\u30fc\u30b9\u7248\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

ascanrules.directorybrowsing.desc = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4e00\u89a7\u3092\u8868\u793a\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\u96a0\u308c\u305f\u30b9\u30af\u30ea\u30d7\u30c8\u3084\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u7b49\u306e\u6a5f\u5bc6\u60c5\u5831\u3078\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.directorybrowsing.name = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0
ascanrules.directorybrowsing.refs = https\://httpd.apache.org/docs/current/mod/core.html\#options
ascanrules.directorybrowsing.soln = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u6a5f\u80fd\u304c\u5fc5\u8981\u306a\u5834\u5408\u3001\u30ea\u30b9\u30af\u306e\u3042\u308b\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.elmah.desc = Error Logging Modules and Handlers (ELMAH [elmah.axd]) HTTP\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u5229\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u304c\u767a\u898b\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u5927\u91cf\u306e\u4fa1\u5024\u3042\u308b\u60c5\u5831\u3092\u6f0f\u6d29\u3055\u305b\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.elmah.name = ELMAH \u304b\u3089\u306e\u60c5\u5831\u6f0f\u6d29
ascanrules.elmah.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304b\u3089\u5224\u65ad\u3057\u3066\u3001ELMAH \u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u30e1\u30ab\u30cb\u30ba\u30e0\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.elmah.refs = https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanrules.elmah.soln = ELMAH \u304c\u672c\u756a\u74b0\u5883\u3067\u672c\u5f53\u306b\u5fc5\u8981\u304b\u3069\u3046\u304b\u3092\u691c\u8a0e\u3057\u3001\u5fc5\u8981\u306a\u3051\u308c\u3070\u7121\u52b9\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3082\u3057\u5fc5\u8981\u3067\u3042\u308c\u3070\u3001\u8a8d\u8a3c\u3068\u8a8d\u53ef\u3092\u5fc5\u9808\u3068\u3059\u308b\u3053\u3068\u3067\u3001\u30a2\u30af\u30bb\u30b9\u3092\u78ba\u5b9f\u306b\u4fdd\u8b77\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u53c2\u8003\: https\://elmah.github.io/a/securing-error-log-pages/

ascanrules.envfiles.desc = \u30b5\u30fc\u30d0\u30fc\u4e0a\u30671\u3064\u4ee5\u4e0a\u306e .env \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u3063\u305f\u3088\u3046\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30a4\u30f3\u30d5\u30e9\u30b9\u30c8\u30e9\u30af\u30c1\u30e3\u3084\u7ba1\u7406\u8005\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u8a8d\u8a3c\u60c5\u5831\u3001API\u30ad\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30ad\u30fc\u3001\u305d\u306e\u4ed6\u306e\u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u8a2d\u5b9a\u60c5\u5831\u3092\u516c\u958b\u3057\u3066\u3044\u308b\u3053\u3068\u304c\u3088\u304f\u3042\u308a\u307e\u3059\u3002
ascanrules.envfiles.name = .env \u304b\u3089\u306e\u60c5\u5831\u6f0f\u6d29
ascanrules.envfiles.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304b\u3089\u5224\u65ad\u3057\u3066\u3001.env \u30d5\u30a1\u30a4\u30eb\u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u30e1\u30ab\u30cb\u30ba\u30e0\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.envfiles.refs = https\://www.google.com/search?q\=db_password+filetype%3Aenv
ascanrules.envfiles.soln = .env \u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u3088\u3046\u306b\u3059\u308b

ascanrules.externalredirect.name = \u5916\u90e8\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
ascanrules.externalredirect.reason.javascript = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8URL\u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b JavaScript \u30b3\u30fc\u30c9\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.externalredirect.reason.location.header = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e Location \u30d8\u30c3\u30c0\u30fc\u306b\u3001\u5916\u90e8URL\u304c\u8a2d\u5b9a\u53ef\u80fd\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.externalredirect.reason.location.meta = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e meta http-equiv \u30bf\u30b0\u306e 'Location' \u306b\u3001\u5916\u90e8URL\u304c\u8a2d\u5b9a\u53ef\u80fd\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.externalredirect.reason.notfound = \u9069\u5207\u306a\u7406\u7531\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u2026
ascanrules.externalredirect.reason.refresh.header = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e Refresh \u30d8\u30c3\u30c0\u30fc\u306b\u3001\u5916\u90e8URL\u304c\u8a2d\u5b9a\u53ef\u80fd\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.externalredirect.reason.refresh.meta = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e meta http-equiv \u30bf\u30b0\u306e 'Refresh' \u306b\u3001\u5916\u90e8URL\u304c\u8a2d\u5b9a\u53ef\u80fd\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002

ascanrules.formatstring.desc = \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u30a8\u30e9\u30fc\u306f\u3001\u5165\u529b\u6587\u5b57\u5217\u3068\u3057\u3066\u9001\u4fe1\u3055\u308c\u305f\u30c7\u30fc\u30bf\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u30b3\u30de\u30f3\u30c9\u3068\u3057\u3066\u8a55\u4fa1\u3055\u308c\u308b\u3068\u304d\u306b\u767a\u751f\u3057\u307e\u3059\u3002
ascanrules.formatstring.error1 = \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u30a8\u30e9\u30fc\u306e\u53ef\u80fd\u6027\u3002\u30b9\u30af\u30ea\u30d7\u30c8\u304c /%s \u3092\u542b\u3080\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u63a5\u7d9a\u3092\u9589\u3058\u307e\u3057\u305f\u3002
ascanrules.formatstring.error2 = \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u30a8\u30e9\u30fc\u306e\u53ef\u80fd\u6027\u3002\u30b9\u30af\u30ea\u30d7\u30c8\u304c /%s \u3068 /%x \u3092\u542b\u3080\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u63a5\u7d9a\u3092\u9589\u3058\u307e\u3057\u305f\u3002
ascanrules.formatstring.error3 = \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u30a8\u30e9\u30fc\u306e\u53ef\u80fd\u6027\u3002\u30b9\u30af\u30ea\u30d7\u30c8\u304c Microsoft \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u30a8\u30e9\u30fc\u3067\u63a5\u7d9a\u3092\u9589\u3058\u307e\u3057\u305f\u3002
ascanrules.formatstring.name = \u66f8\u5f0f\u6587\u5b57\u5217\u30a8\u30e9\u30fc
ascanrules.formatstring.refs = https\://owasp.org/www-community/attacks/Format_string_attack
ascanrules.formatstring.soln = \u4e0d\u6b63\u306a\u6587\u5b57\u5217\u3092\u9069\u5207\u306b\u524a\u9664\u3059\u308b\u3088\u3046\u3001\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u66f8\u304d\u63db\u3048\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u306f\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306e\u518d\u30b3\u30f3\u30d1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002

ascanrules.getforpost.desc = \u5f53\u521dPOST\u30e1\u30bd\u30c3\u30c9\u3067\u89b3\u6e2c\u3055\u308c\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u304cGET\u30e1\u30bd\u30c3\u30c9\u3067\u3082\u51e6\u7406\u3055\u308c\u308b\u3053\u3068\u304c\u5224\u660e\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u73fe\u8c61\u5358\u72ec\u3067\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4e0a\u306e\u76f4\u63a5\u7684\u306a\u8105\u5a01\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u653b\u6483\u624b\u6cd5\u306e\u5358\u7d14\u5316\u3092\u53ef\u80fd\u306b\u3059\u308b\u8981\u7d20\u3068\u306a\u308a\u5f97\u307e\u3059\u3002\u5177\u4f53\u4f8b\u3068\u3057\u3066\u3001\u5143\u306ePOST\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (XSS) \u8106\u5f31\u6027\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u3088\u308a\u30b7\u30f3\u30d7\u30eb\u306aGET\u30d9\u30fc\u30b9\u306eXSS\u653b\u6483\u306e\u5b9f\u884c\u53ef\u80fd\u6027\u3092\u793a\u5506\u3057\u3066\u3044\u307e\u3059\u3002
ascanrules.getforpost.name = GET for POST
ascanrules.getforpost.soln = POST\u304c\u8981\u6c42\u3055\u308c\u308b\u5834\u6240\u3067\u306f\u3001POST\u306e\u307f\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.heartbleed.desc = OpenSSL \u306e\u30d0\u30fc\u30b8\u30e7\u30f3 1.0.1g \u3088\u308a\u524d\u306e 1.0.1 \u7cfb\u306b\u306f\u3001Heartbeat\u62e1\u5f35\u30d1\u30b1\u30c3\u30c8\u3092\u6b63\u3057\u304f\u51e6\u7406\u3057\u306a\u3044\u8106\u5f31\u6027\u304c\u5b58\u5728\u3057\u307e\u3059\u3002\u3053\u308c\u3092\u60aa\u7528\u3059\u308b\u3088\u3046\u7d30\u5de5\u3055\u308c\u305f\u30d1\u30b1\u30c3\u30c8\u306b\u3088\u3063\u3066\u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30ea\u30fc\u30c9\u3092\u5f15\u304d\u8d77\u3053\u3057\u3001\u30ea\u30e2\u30fc\u30c8\u306e\u653b\u6483\u8005\u306b\u30d7\u30ed\u30bb\u30b9\u306e\u30e1\u30e2\u30ea\u304b\u3089\u6a5f\u5bc6\u60c5\u5831\u3092\u53d6\u5f97\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.heartbleed.extrainfo = \u3053\u306e\u554f\u984c\u306f {0} \u3092\u4f7f\u7528\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30c7\u30fc\u30bf\u3092 \u7a83\u53d6\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u8aa4\u691c\u77e5\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u4f4e\u3044\u3067\u3059\u3002
ascanrules.heartbleed.name = Heartbleed OpenSSL \u306e\u8106\u5f31\u6027
ascanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
ascanrules.heartbleed.soln = OpenSSL \u3092 1.0.1g \u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u66f4\u65b0\u3057\u3001HTTPS \u8a3c\u660e\u66f8\u3092\u518d\u767a\u884c\u3057\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u975e\u5bfe\u79f0\u79d8\u5bc6\u9375\u3068\u3001\u5171\u6709\u79d8\u5bc6\u9375\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u6050\u308c\u304c\u3042\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3001\u3053\u308c\u3089\u3092\u5909\u66f4\u3057\u3066\u4e0b\u3055\u3044\u3002

ascanrules.hidden.files.alert.name = \u96a0\u3057\u30d5\u30a1\u30a4\u30eb\u767a\u898b
ascanrules.hidden.files.desc = \u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u4e0d\u9069\u5207\u306a\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u306a\u72b6\u614b\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u8106\u5f31\u6027\u306b\u3088\u308a\u3001\u7ba1\u7406\u8005\u60c5\u5831\u3001\u30b7\u30b9\u30c6\u30e0\u8a2d\u5b9a\u60c5\u5831\u3001\u8a8d\u8a3c\u60c5\u5831\u306a\u3069\u306e\u91cd\u8981\u306a\u60c5\u5831\u304c\u6f0f\u6d29\u3059\u308b\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u3053\u308c\u3089\u306e\u60c5\u5831\u3092\u60aa\u7528\u3057\u3066\u3001\u30b7\u30b9\u30c6\u30e0\u306b\u5bfe\u3059\u308b\u8ffd\u52a0\u653b\u6483\u306e\u5b9f\u884c\u3084\u30bd\u30fc\u30b7\u30e3\u30eb\u30a8\u30f3\u30b8\u30cb\u30a2\u30ea\u30f3\u30b0\u624b\u6cd5\u306b\u3088\u308b\u653b\u6483\u3092\u884c\u3046\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.hidden.files.name = \u96a0\u3057\u30d5\u30a1\u30a4\u30eb\u30d5\u30a1\u30a4\u30f3\u30c0\u30fc
ascanrules.hidden.files.refs = https\://blog.hboeck.de/archives/892-Introducing-Snallygaster-a-Tool-to-Scan-for-Secrets-on-Web-Servers.html
ascanrules.hidden.files.soln = \u305d\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u672c\u756a\u74b0\u5883\u3067\u5b9f\u969b\u306b\u5fc5\u8981\u304b\u3069\u3046\u304b\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4e0d\u8981\u3067\u3042\u308c\u3070\u7121\u52b9\u5316\u3057\u3001\u5fc5\u8981\u3067\u3042\u308b\u5834\u5408\u306f\u9069\u5207\u306a\u8a8d\u8a3c\u30fb\u8a8d\u53ef\u306e\u4ed5\u7d44\u307f\u3092\u5b9f\u88c5\u3059\u308b\u304b\u3001\u5185\u90e8\u30b7\u30b9\u30c6\u30e0\u3084\u7279\u5b9a\u306e\u9001\u4fe1\u5143IP\u30a2\u30c9\u30ec\u30b9\u304b\u3089\u306e\u30a2\u30af\u30bb\u30b9\u306b\u5236\u9650\u3059\u308b\u306a\u3069\u306e\u5bfe\u7b56\u3092\u8b1b\u3058\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.htaccess.desc = .htaccess\u30d5\u30a1\u30a4\u30eb\u306f\u3001Apache Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u3092\u5909\u66f4\u3057\u3001Apache\u304c\u63d0\u4f9b\u3059\u308b\u8ffd\u52a0\u6a5f\u80fd\u3092\u6709\u52b9/\u7121\u52b9\u306b\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
ascanrules.htaccess.name = .htaccess \u304b\u3089\u306e\u60c5\u5831\u6f0f\u6d29
ascanrules.htaccess.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304b\u3089\u5224\u65ad\u3057\u3066\u3001.htaccess \u30d5\u30a1\u30a4\u30eb\u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u30e1\u30ab\u30cb\u30ba\u30e0\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.htaccess.refs = https\://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Server-side/Apache_Configuration_htaccess\nhttps\://httpd.apache.org/docs/2.4/howto/htaccess.html
ascanrules.htaccess.soln = .htaccess \u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u3088\u3046\u306b\u3059\u308b

ascanrules.log4shell.cve44228.desc = Apache Log4j2 \u30d0\u30fc\u30b8\u30e7\u30f32.14.1\u4ee5\u524d\u3067\u306f\u3001\u8a2d\u5b9a\u3001\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u4f7f\u7528\u3055\u308c\u308bJNDI\u6a5f\u80fd\u304c\u3001\u653b\u6483\u8005\u304c\u5236\u5fa1\u3059\u308bLDAP\u30b5\u30fc\u30d0\u30fc\u3084\u305d\u306e\u4ed6\u306eJNDI\u95a2\u9023\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306b\u5bfe\u3059\u308b\u9069\u5207\u306a\u4fdd\u8b77\u3092\u63d0\u4f9b\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u653b\u6483\u8005\u304c\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8\u307e\u305f\u306f\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u5236\u5fa1\u53ef\u80fd\u306a\u5834\u5408\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u7f6e\u63db\u6a5f\u80fd\u304c\u6709\u52b9\u3067\u3042\u308c\u3070\u3001LDAP\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u3092\u8aad\u307f\u8fbc\u3093\u3067\u5b9f\u884c\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002Log4j 2.15.0\u4ee5\u964d\u3067\u306f\u3001\u3053\u306e\u5371\u967a\u306a\u52d5\u4f5c\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u7121\u52b9\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.log4shell.cve44228.name = Log4Shell (CVE-2021-44228)
ascanrules.log4shell.cve44228.refs = https\://github.com/lunasec-io/lunasec/blob/c6bb0762b4ce308768baca72c7e34415402e9647/docs/blog/2021-12-09-log4j-zero-day.mdx\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-44228
ascanrules.log4shell.cve44228.soln = Log4j2\u3092\u30d0\u30fc\u30b8\u30e7\u30f32.17.1\u4ee5\u964d\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4ee5\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 (2.10\u3088\u308a\u65b0\u3057\u3044\u3082\u306e) \u3067\u306f\u3001\u4ee5\u4e0b\u306e\u65b9\u6cd5\u3067\u3053\u306e\u554f\u984c\u3092\u8efd\u6e1b\u3067\u304d\u307e\u3059\uff1a\n* \u30b7\u30b9\u30c6\u30e0\u30d7\u30ed\u30d1\u30c6\u30a3 "log4j2.formatMsgNoLookups" \u3092 "true" \u306b\u8a2d\u5b9a\n* \u30af\u30e9\u30b9\u30d1\u30b9\u304b\u3089JndiLookup\u30af\u30e9\u30b9\u3092\u524a\u9664 (\u4f8b\: zip -q -d log4j-core-*.jar org/apache/logging/log4j/core/lookup/JndiLookup.class)\n\u306a\u304a\u3001Java 8u121 (\u8a73\u7d30\u306f https\://www.oracle.com/java/technologies/javase/8u121-relnotes.html \u3092\u53c2\u7167) \u3067\u306f\u3001"com.sun.jndi.rmi.object.trustURLCodebase" \u3068 "com.sun.jndi.cosnaming.object.trustURLCodebase" \u304c\u30c7\u30d5\u30a9\u30eb\u30c8\u3067 "false" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u304a\u308a\u3001\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u653b\u6483\u304b\u3089\u4fdd\u8b77\u3055\u308c\u307e\u3059\u3002
ascanrules.log4shell.cve45046.desc = Apache Log4j 2.15.0\u306b\u5b9f\u88c5\u3055\u308c\u305f CVE-2021-44228 \u3078\u306e\u4fee\u6b63\u304c\u3001\u7279\u5b9a\u306e\u975e\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u74b0\u5883\u306b\u304a\u3044\u3066\u4e0d\u5b8c\u5168\u3067\u3042\u308b\u3053\u3068\u304c\u767a\u898b\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u4e0d\u5099\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u304cJNDI\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u30d1\u30bf\u30fc\u30f3\u3092\u60aa\u7528\u3057\u3066\u7d30\u5de5\u3055\u308c\u305f\u5165\u529b\u30c7\u30fc\u30bf\u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u3067\u3001\u4e00\u90e8\u306e\u74b0\u5883\u306b\u304a\u3044\u3066\u60c5\u5831\u6f0f\u6d29\u3084\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.log4shell.cve45046.name = Log4Shell (CVE-2021-45046)
ascanrules.log4shell.cve45046.refs = https\://github.com/lunasec-io/lunasec/blob/c6bb0762b4ce308768baca72c7e34415402e9647/docs/blog/2021-12-09-log4j-zero-day.mdx\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-45046
ascanrules.log4shell.cve45046.soln = Log4j2\u3092\u30d0\u30fc\u30b8\u30e7\u30f32.17.1\u4ee5\u964d\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanrules.log4shell.name = Log4Shell
ascanrules.log4shell.skipped = Active Scan OAST\u30b5\u30fc\u30d3\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093

ascanrules.name = \u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

ascanrules.paddingoracle.desc = \u653b\u6483\u8005\u304c\u6697\u53f7\u5316\u6587\u5b57\u5217\u306e\u30d1\u30c7\u30a3\u30f3\u30b0\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u3001'\u30d1\u30c7\u30a3\u30f3\u30b0\u30aa\u30e9\u30af\u30eb'\u8106\u5f31\u6027\u306e\u5b58\u5728\u3092\u793a\u5506\u3059\u308b\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8a98\u767a\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u8106\u5f31\u6027\u306f\u3001ASP.net\u306e\u7279\u5b9a\u30d0\u30fc\u30b8\u30e7\u30f3\u3001Java Server Faces\u3001Mono\u306a\u3069\u3001\u6697\u53f7\u5316\u51e6\u7406\u3092\u4e0d\u9069\u5207\u306b\u5b9f\u88c5\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3084\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u306b\u5f71\u97ff\u3092\u53ca\u307c\u3059\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u3053\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3057\u3066\u30c7\u30fc\u30bf\u306e\u5fa9\u53f7\u5316\u3084\u6697\u53f7\u5316\u30ad\u30fc\u306e\u53d6\u5f97\u3092\u884c\u3044\u3001\u6a5f\u5bc6\u60c5\u5831\u306e\u95b2\u89a7\u30fb\u6539\u3056\u3093\u3092\u5b9f\u73fe\u3059\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30eb\u30fc\u30eb\u306f\u3001CustomErrors \u304c\u6709\u52b9\u306a\u74b0\u5883\u306b\u304a\u3044\u3066\u3001ASP.net\u306e MS10-070 \u30d1\u30c7\u30a3\u30f3\u30b0\u30aa\u30e9\u30af\u30eb\u8106\u5f31\u6027\u3092\u691c\u51fa\u3057\u307e\u3059\u3002
ascanrules.paddingoracle.name = \u4e00\u822c\u30d1\u30c7\u30a3\u30f3\u30b0\u30aa\u30e9\u30af\u30eb
ascanrules.paddingoracle.refs = https\://learn.microsoft.com/en-us/security-updates/securitybulletins/2010/ms10-070\nhttps\://www.mono-project.com/docs/about-mono/vulnerabilities/\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799
ascanrules.paddingoracle.soln = \u5f71\u97ff\u3092\u53d7\u3051\u308b\u30b5\u30fc\u30d0\u30fc\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u3092\u66f4\u65b0\u3059\u308b\u304b\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4fee\u6b63\u3057\u3066\u3001\u5fa9\u53f7\u3092\u8a66\u307f\u308b\u524d\u306b\u6697\u53f7\u5316\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3092\u9069\u5207\u306b\u691c\u8a3c\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.parametertamper.desc = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u64cd\u4f5c\u306b\u3088\u3063\u3066\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u307e\u305f\u306fJava\u30b9\u30bf\u30c3\u30af\u30c8\u30ec\u30fc\u30b9\u304c\u8868\u793a\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u4f8b\u5916\u51e6\u7406\u304c\u4e0d\u5341\u5206\u3067\u3042\u308a\u3001\u3055\u3089\u306a\u308b\u60aa\u7528\u306e\u53ef\u80fd\u6027\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002
ascanrules.parametertamper.name = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u6539\u3056\u3093
ascanrules.parametertamper.soln = \u30a8\u30e9\u30fc\u306e\u6839\u672c\u539f\u56e0\u3092\u7279\u5b9a\u3057\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u306e\u5165\u529b\u3092\u4fe1\u983c\u305b\u305a\u3001\u30b5\u30fc\u30d0\u30fc\u5074\u3067\u53b3\u5bc6\u306a\u5165\u529b\u691c\u8a3c\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u307e\u305f\u3001\u4f8b\u5916\u51e6\u7406\u3092\u9069\u5207\u306b\u5b9f\u88c5\u3057\u3001\u5185\u90e8\u30b5\u30fc\u30d0\u30fc\u30a8\u30e9\u30fc\u306b\u5bfe\u3057\u3066\u306f\u6c4e\u7528\u7684\u306a500\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u3092\u8868\u793a\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.pathtraversal.info = \u8a3c\u62e0\u30d5\u30a3\u30fc\u30eb\u30c9\u306f {0} \u3092\u793a\u3057\u3066\u3044\u307e\u3059\u304c\u3001\u3053\u306e\u30eb\u30fc\u30eb\u304c\u5b9f\u969b\u306b\u30c1\u30a7\u30c3\u30af\u3057\u305f\u306e\u306f\u3001\u4ee5\u4e0b\u306e\u3059\u3079\u3066\u306e\u9805\u76ee\u304c\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3067\u3059\: {1}\u3002
ascanrules.pathtraversal.name = \u30d1\u30b9 \u30c8\u30e9\u30d0\u30fc\u30b5\u30eb

ascanrules.payloader.desc = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306b\u304a\u3051\u308b\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
ascanrules.payloader.name = \u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306e\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9

ascanrules.persistentxssattack.json.desc = JSON\u30ec\u30b9\u30dd\u30f3\u30b9\u3067XSS\u653b\u6483\u304c\u767a\u898b\u3055\u308c\u307e\u3057\u305f\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u5229\u7528\u8005\u304c\u30c7\u30fc\u30bf\u3092\u9069\u5207\u306b\u51e6\u7406\u3057\u306a\u3044\u5834\u5408\u3001\u653b\u6483\u306b\u5bfe\u3057\u3066\u8106\u5f31\u306b\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.persistentxssattack.json.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0\u306e\u5f31\u70b9 (JSON\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u304a\u3051\u308b\u6301\u7d9a\u7684XSS)
ascanrules.persistentxssattack.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u683c\u7d0d\u578b)
ascanrules.persistentxssattack.otherinfo = \u9001\u4fe1\u5143URL\: {0}
ascanrules.persistentxssattack.otherinfo.nothtml = Content-Type\u304cHTML\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u4f4e\u3044\u4fe1\u983c\u5ea6\u3067\u8b66\u544a\u3092\u767a\u751f\u3055\u305b\u307e\u3057\u305f\u3002

ascanrules.persistentxssprime.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u683c\u7d0d\u578b) - Prime

ascanrules.persistentxssspider.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u683c\u7d0d\u578b) - \u30b9\u30d1\u30a4\u30c0\u30fc

ascanrules.react2shell.desc = The server is running Next.js and vulnerable versions of React Server Components with Next.js which allow remote attackers to execute arbitrary code.
ascanrules.react2shell.name = Remote Code Execution (React2Shell)
ascanrules.react2shell.otherinfo = The attack verifies that the server is running vulnerable React Server Components, and that the remote code execution (RCE) vulnerability is present without causing any damage.\nIt forces an error via a malformed multipart request and checks for the presence of a string which confirms RCE is possible.
ascanrules.react2shell.refs = https\://react2shell.com/\nhttps\://react.dev/blog/2025/12/03/critical-security-vulnerability-in-react-server-components\nhttps\://slcyber.io/research-center/high-fidelity-detection-mechanism-for-rsc-next-js-rce-cve-2025-55182-cve-2025-66478/
ascanrules.react2shell.soln = Upgrade to the latest versions of the React libraries you are using. 
ascanrules.react2shell.technologies.framework = Framework

ascanrules.remotecodeexecution.cve-2012-1823.desc = CGI\u3067\u5b9f\u884c\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u305f\u4e00\u90e8\u306ePHP\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u30a8\u30b9\u30b1\u30fc\u30d7\u3055\u308c\u3066\u3044\u306a\u3044 "\=" \u6587\u5b57\u3092\u6b20\u304f\u30af\u30a8\u30ea\u6587\u5b57\u5217\u3092\u6b63\u3057\u304f\u51e6\u7406\u3067\u304d\u305a\u3001\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u30b1\u30fc\u30b9\u3067\u306f\u3001\u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u30b3\u30de\u30f3\u30c9\u304c\u5b9f\u884c\u3055\u308c\u3001\u305d\u306e\u7d50\u679c\u304c\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u306b\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.remotecodeexecution.cve-2012-1823.name = \u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c - CVE-2012-1823
ascanrules.remotecodeexecution.cve-2012-1823.soln = PHP\u306e\u6700\u65b0\u5b89\u5b9a\u7248\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u304b\u3001Apache \u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u3068 mod_rewrite \u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001RewriteCond \u304a\u3088\u3073 RewriteRule \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u4f7f\u3044\u60aa\u610f\u306e\u3042\u308b\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.remotefileinclude.name = \u30ea\u30e2\u30fc\u30c8 \u30d5\u30a1\u30a4\u30eb\u3000\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3

ascanrules.serversideinclude.desc = \u7279\u5b9a\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3088\u3063\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 (SSI) \u30b3\u30de\u30f3\u30c9\u304c\u5b9f\u884c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u3084\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u304c\u5b9f\u884c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n
ascanrules.serversideinclude.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30a4\u30f3\u30af\u30eb\u30fc\u30c9
ascanrules.serversideinclude.refs = https\://httpd.apache.org/docs/current/howto/ssi.html
ascanrules.serversideinclude.soln = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u5165\u529b\u3092\u4fe1\u983c\u305b\u305a\u3001\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u53b3\u683c\u306a\u30c1\u30a7\u30c3\u30af\u3092\u9069\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30a4\u30f3\u30af\u30eb\u30fc\u30c9\uff08SSI\uff09\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002SSI\u3092\u7121\u52b9\u306b\u3059\u308b\u306b\u306f\u3001\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nWeb\u30b5\u30fc\u30d0\u30fc\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3092\u3001\u6700\u5c0f\u6a29\u9650\u306e\u539f\u5247\u306b\u57fa\u3065\u3044\u3066\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nApache\u306e\u5834\u5408\u3001\u4ee5\u4e0b\u306e\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\n    * Options Indexes FollowSymLinks Includes\n    * AddType application/x-httpd-cgi .cgi\n    * AddType text/x-server-parsed-html .html

ascanrules.sourcecodedisclosurecve-2012-1823.desc = CGI\u3067\u5b9f\u884c\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u305f\u4e00\u90e8\u306ePHP\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u30a8\u30b9\u30b1\u30fc\u30d7\u3055\u308c\u3066\u3044\u306a\u3044 "\=" \u6587\u5b57\u3092\u6b20\u304f\u30af\u30a8\u30ea\u6587\u5b57\u5217\u3092\u6b63\u3057\u304f\u51e6\u7406\u3067\u304d\u305a\u3001PHP\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u958b\u793a\u3084\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u30b1\u30fc\u30b9\u3067\u306f\u3001PHP\u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u304c\u305d\u306e\u307e\u307e\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u51fa\u529b\u306b\u306f\u901a\u5e38PHP\u304c\u542b\u307e\u308c\u307e\u3059\u304c\u3001\u7d14\u7c8b\u306aHTML\u3082\u542b\u307e\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.sourcecodedisclosurecve-2012-1823.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - CVE-2012-1823
ascanrules.sourcecodedisclosurecve-2012-1823.soln = PHP\u306e\u6700\u65b0\u5b89\u5b9a\u7248\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u304b\u3001Apache \u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u3068 mod_rewrite \u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001RewriteCond \u304a\u3088\u3073 RewriteRule \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u4f7f\u3044\u60aa\u610f\u306e\u3042\u308b\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.sourcecodedisclosurewebinf.desc = Java\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304c\u3001\u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066WEB-INF\u30d5\u30a9\u30eb\u30c0\u30fc\u5185\u306eJava\u30af\u30e9\u30b9\u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u958b\u793a\u3055\u308c\u307e\u3057\u305f\u3002\u30af\u30e9\u30b9\u30d5\u30a1\u30a4\u30eb\u306f\u9006\u30a2\u30bb\u30f3\u30d6\u30eb\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u3068\u975e\u5e38\u306b\u8fd1\u3044\u30b3\u30fc\u30c9\u3092\u751f\u6210\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
ascanrules.sourcecodedisclosurewebinf.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - /WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc
ascanrules.sourcecodedisclosurewebinf.propertiesfile.desc = /WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc\u5185\u306eJava\u30af\u30e9\u30b9\u304c\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306e\u5b58\u5728\u3092\u660e\u3089\u304b\u306b\u3057\u307e\u3057\u305f\u3002\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u4e00\u822c\u306b\u516c\u958b\u3055\u308c\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3057\u3066\u304a\u3089\u305a\u3001\u901a\u5e38\u3001\u8a2d\u5b9a\u60c5\u5831\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8a8d\u8a3c\u60c5\u5831\u3001\u307e\u305f\u306f\u6697\u53f7\u9375\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.sourcecodedisclosurewebinf.propertiesfile.extrainfo = \u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u53c2\u7167\u306f\u3001Java\u30af\u30e9\u30b9 [{0}] \u306e\u9006\u30a2\u30bb\u30f3\u30d6\u30eb\u3055\u308c\u305fJava\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u5185\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
ascanrules.sourcecodedisclosurewebinf.propertiesfile.name = \u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306e\u9732\u898b - /WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc
ascanrules.sourcecodedisclosurewebinf.propertiesfile.soln = \u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u306f\u3001/WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc\u307e\u305f\u306f\u305d\u306e\u5185\u5bb9\u3092\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u306b\u63d0\u4f9b\u3057\u306a\u3044\u3088\u3046\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001/WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc\u3092\u524a\u9664\u3067\u304d\u308b\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002
ascanrules.sourcecodedisclosurewebinf.soln = \u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u305fJava\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u3084\u3001\u8a8d\u8a3c\u60c5\u5831\u3092\u542b\u3080\u53ef\u80fd\u6027\u306e\u3042\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306a\u3069\u306e\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u305f\u3081\u3001/WEB-INF \u30d5\u30a9\u30eb\u30c0\u30fc\u307e\u305f\u306f\u305d\u306e\u5185\u5bb9\u3092\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u306b\u63d0\u4f9b\u3057\u306a\u3044\u3088\u3046\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u591a\u5c64\u9632\u5fa1 (defence-in-depth) \u306e\u30a2\u30d7\u30ed\u30fc\u30c1\u306b\u304a\u3051\u308b\u8ffd\u52a0\u306e\u9632\u5fa1\u7b56\u3068\u3057\u3066\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3068\u3068\u3082\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u308bJava\u30af\u30e9\u30b9\u306f\u96e3\u8aad\u5316 (obfuscated) \u3055\u308c\u308b\u3079\u304d\u3067\u3059\u3002

ascanrules.spring4shell.desc = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001CVE-2022-22965 (\u901a\u79f0\: Spring4Shell) \u3068\u3057\u3066\u77e5\u3089\u308c\u308b\u3001\u30c7\u30fc\u30bf\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u4ecb\u3057\u305f\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c (RCE) \u306e\u8106\u5f31\u6027\u3092\u6301\u3063\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
ascanrules.spring4shell.name = Spring4Shell
ascanrules.spring4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-22965\nhttps\://www.rapid7.com/blog/post/2022/03/30/spring4shell-zero-day-vulnerability-in-spring-framework/\nhttps\://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement/\#vulnerability\nhttps\://spring.io/security/cve-2022-22965/
ascanrules.spring4shell.soln = Spring Framework \u3092\u30d0\u30fc\u30b8\u30e7\u30f3 5.3.18\u30015.2.20\u3001\u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.springactuator.desc = Spring Actuator\u306e Health \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u95a2\u3059\u308b\u6a5f\u5bc6\u60c5\u5831\u304c\u6f0f\u6d29\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002Spring Actuator\u306f\u3001\u76e3\u8996\u76ee\u7684\u3067\u5229\u7528\u3067\u304d\u307e\u3059\u304c\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3084\u305d\u306e\u30a4\u30f3\u30d5\u30e9\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u904e\u5ea6\u306b\u516c\u958b\u3057\u306a\u3044\u3088\u3046\u3001\u6ce8\u610f\u3057\u3066\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.springactuator.name = Spring Actuator \u60c5\u5831\u6f0f\u6d29
ascanrules.springactuator.refs = https\://docs.spring.io/spring-boot/api/rest/actuator/index.html\#overview
ascanrules.springactuator.soln = Health Actuator\u3084\u305d\u306e\u4ed6\u306e\u30a2\u30af\u30c1\u30e5\u30a8\u30fc\u30bf\u30fc\u3092\u7121\u52b9\u306b\u3059\u308b\u304b\u3001\u7ba1\u7406\u8005\u30e6\u30fc\u30b6\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3092\u5236\u9650\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#ascanrules.sqlinjection.alert.errorbased.attack={1}
ascanrules.sqlinjection.alert.booleanbased.extrainfo = \u30da\u30fc\u30b8\u306e\u7d50\u679c\u306f\u30d6\u30fc\u30eb\u6761\u4ef6 [{0}] \u3068 [{1}] \u3092\u4f7f\u7528\u3057\u3066\u6b63\u5e38\u306b\u64cd\u4f5c\u3055\u308c\u307e\u3057\u305f\u3002\n\u6bd4\u8f03\u306e\u305f\u3081\u306b\u3001\u5909\u66f4\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u306f HTML \u51fa\u529b\u304b\u3089\u9664\u5916\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists = \u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5bfe\u3057\u3066\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u3005\u8fd4\u3055\u308c\u308b\u30c7\u30fc\u30bf\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u306b\u6210\u529f\u3057\u305f\u305f\u3081\u3001\u8106\u5f31\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists = \u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5bfe\u3057\u3066\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u3005\u8fd4\u3055\u308c\u306a\u304b\u3063\u305f\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u306b\u6210\u529f\u3057\u305f\u305f\u3081\u3001\u8106\u5f31\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo = \u672a\u5909\u66f4\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306fHTTP\u30b9\u30c6\u30fc\u30bf\u30b9 [{0}]\u3001\u30dc\u30c7\u30a3\u9577 [{1}] \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002\u5909\u66f4\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306fHTTP\u30b9\u30c6\u30fc\u30bf\u30b9 [{2}]\u3001\u30dc\u30c7\u30a3\u9577 [{3}] \u3092\u8fd4\u3057\u307e\u3057\u305f\u30023\u756a\u76ee\u306e (SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3092\u8a98\u767a\u3057\u306a\u3044) \u5024\u306fHTTP\u30b9\u30c6\u30fc\u30bf\u30b9 [{4}]\u3001\u30dc\u30c7\u30a3\u9577 [{5}] \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.errorbased.extrainfo = HTML\u7d50\u679c\u3068\u4e00\u81f4\u3059\u308b\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u6b63\u898f\u8868\u73fe [{1}] \u304b\u3089\u5224\u65ad\u3057\u3066\u3001RDBMS\u306f [{0}] \u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3057\u3066\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8fd4\u3055\u305b\u3001\u305d\u308c\u3092\u8a8d\u8b58\u3059\u308b\u3053\u3068\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo = \u672a\u5909\u66f4\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306fHTTP\u30b9\u30c6\u30fc\u30bf\u30b9 [{0}] \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002\u5909\u66f4\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u306fHTTP\u30b9\u30c6\u30fc\u30bf\u30b9 [{1}] \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.expressionbased.extrainfo = \u30d6\u30fc\u30eb\u5f0f [{0}] \u3092\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u306e\u30da\u30fc\u30b8\u306e\u7d50\u679c\u304c\u6b63\u5e38\u306b\u518d\u73fe\u3055\u308c\u307e\u3057\u305f\u3002\n\u6bd4\u8f03\u306e\u305f\u3081\u3001\u5909\u66f4\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u306f HTML \u51fa\u529b\u304b\u3089\u9664\u5916\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.orderbybased.extrainfo = "ORDER BY" \u5f0f [{0}] \u3092\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u306e\u30da\u30fc\u30b8\u306e\u7d50\u679c\u304c\u6b63\u5e38\u306b\u518d\u73fe\u3055\u308c\u307e\u3057\u305f\u3002\n\u6bd4\u8f03\u306e\u305f\u3081\u3001\u5909\u66f4\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u306f HTML \u51fa\u529b\u304b\u3089\u9664\u5916\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.timebased.extrainfo = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 [{0}] \u306b\u3088\u3063\u3066\u30af\u30a8\u30ea\u306e\u51e6\u7406\u6642\u9593\u3092\u5236\u5fa1\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u5024\u3092\u4f7f\u7528\u3057\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u306f [{1}] \u30df\u30ea\u79d2\u3067\u51e6\u7406\u3055\u308c\u3001\u5143\u306e\u5024 [{2}] \u3067\u306e\u51e6\u7406\u6642\u9593 [{3}] \u30df\u30ea\u79d2\u3068\u6709\u610f\u306a\u5dee\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.unionbased.extrainfo = HTML\u7d50\u679c\u3068\u4e00\u81f4\u3059\u308b UNION \u7279\u6709\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u6b63\u898f\u8868\u73fe [{1}] \u304b\u3089\u5224\u65ad\u3057\u3066\u3001RDBMS\u306f [{0}] \u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001SQL \u306e ''UNION'' \u53e5\u3092\u7528\u3044\u3066\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3057\u3066\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8fd4\u3055\u305b\u3001\u305d\u308c\u3092\u8a8d\u8b58\u3059\u308b\u3053\u3068\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.authbypass.desc = \u30ed\u30b0\u30a4\u30f3\u30da\u30fc\u30b8\u3067SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u53ef\u80fd\u306a\u5834\u5408\u304c\u3042\u308a\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u30d0\u30a4\u30d1\u30b9\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.sqlinjection.authbypass.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - \u8a8d\u8a3c\u30d0\u30a4\u30d1\u30b9
ascanrules.sqlinjection.desc = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.sqlinjection.hypersonic.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - Hypersonic SQL (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.sqlinjection.mssql.alert.timebased.extrainfo = \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 [{0}] \u306b\u3088\u3063\u3066\u30af\u30a8\u30ea\u306e\u51e6\u7406\u6642\u9593\u3092\u5236\u5fa1\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u5024\u3092\u4f7f\u7528\u3057\u305f\u30ea\u30af\u30a8\u30b9\u30c8\u306f [{1}] \u30df\u30ea\u79d2\u3067\u51e6\u7406\u3055\u308c\u3001\u5143\u306e\u5024 [{2}] \u3067\u306e\u51e6\u7406\u6642\u9593 [{3}] \u30df\u30ea\u79d2\u3068\u6709\u610f\u306a\u5dee\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.mssql.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - MsSQL (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.sqlinjection.mysql.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - MySQL (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.sqlinjection.name = SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.sqlinjection.name.rdbms = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - {0}
ascanrules.sqlinjection.oracle.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - Oracle (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.sqlinjection.postgres.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - PostgreSQL (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanrules.sqlinjection.soln = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u306b\u691c\u8a3c\u6a5f\u80fd\u304c\u3042\u3063\u3066\u3082\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u306e\u5165\u529b\u3092\u4fe1\u983c\u3057\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002\n\u4e00\u822c\u7684\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u5074\u3067\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u306e\u578b\u30c1\u30a7\u30c3\u30af\u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nJDBC\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001PreparedStatement \u307e\u305f\u306f CallableStatement \u3092\u4f7f\u7528\u3057\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f'?'\u3067\u6e21\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nASP\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u5f37\u3044\u578b\u30c1\u30a7\u30c3\u30af\u3068\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5316\u30af\u30a8\u30ea\u3092\u5099\u3048\u305fADO\u30b3\u30de\u30f3\u30c9\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b9\u30c8\u30a2\u30c9\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u304c\u5229\u7528\u53ef\u80fd\u306a\u5834\u5408\u306f\u3001\u305d\u308c\u3089\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30b9\u30c8\u30a2\u30c9\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u5185\u3067\u6587\u5b57\u5217\u3092\u30af\u30a8\u30ea\u306b\u9023\u7d50\u3057\u305f\u308a\u3001'exec'\u3001'exec immediate'\u3001\u307e\u305f\u306f\u540c\u7b49\u306e\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u305f\u308a\u3057\u3066\u306f\u7d76\u5bfe\u306b\u3044\u3051\u307e\u305b\u3093\uff01\n\u5358\u7d14\u306a\u6587\u5b57\u5217\u9023\u7d50\u306b\u3088\u308b\u52d5\u7684SQL\u30af\u30a8\u30ea\u306e\u4f5c\u6210\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002\n\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u53d7\u4fe1\u3057\u305f\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u3092\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u306b\u5bfe\u3057\u3066\u8a31\u53ef\u6587\u5b57\u306e'\u8a31\u53ef\u30ea\u30b9\u30c8'\u307e\u305f\u306f\u7981\u6b62\u6587\u5b57\u306e'\u62d2\u5426\u30ea\u30b9\u30c8'\u3092\u9069\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u53ef\u80fd\u306a\u9650\u308a\u6700\u5c0f\u7279\u6a29\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u3092\u4f7f\u7528\u3057\u3001\u6700\u5c0f\u7279\u6a29\u306e\u539f\u5247\u3092\u9069\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u7279\u306b 'sa' \u3084 'db-owner' \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u306e\u4f7f\u7528\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u3088\u308aSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u5b8c\u5168\u306b\u9632\u3052\u308b\u308f\u3051\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u5f71\u97ff\u3092\u6700\u5c0f\u9650\u306b\u6291\u3048\u3089\u308c\u307e\u3059\u3002\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5fc5\u8981\u306a\u6700\u5c0f\u9650\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30a2\u30af\u30bb\u30b9\u6a29\u9650\u306e\u307f\u3092\u4ed8\u4e0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanrules.sqlinjection.sqlite.alert.timing.error.extrainfo = \u65e2\u77e5\u306eSQLite\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8 [{0}] \u304c\u8a98\u767a\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.sqlite.alert.timing.extrainfo = \u8907\u6570\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u3067\u30af\u30a8\u30ea\u51e6\u7406\u6642\u9593\u306e\u5236\u5fa1\u304c\u53ef\u80fd\u3067\u3059\u3002\u30c6\u30b9\u30c8\u5024 [{0}] \u3067 [{1}] \u30df\u30ea\u79d2\u3001\u30c6\u30b9\u30c8\u5024 [{2}] \u3067 [{3}] \u30df\u30ea\u79d2\u8981\u3057\u3001\u6b63\u5e38\u5024 [{4}] \u3067\u306e [{5}] \u30df\u30ea\u79d2\u3068\u6bd4\u8f03\u3057\u3066\u6709\u610f\u306a\u5dee\u304c\u8907\u6570\u30d1\u30bf\u30fc\u30f3\u3067\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.sqlite.timing.name = SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - SQLite (\u6642\u9593\u30d9\u30fc\u30b9)

ascanrules.ssti.alert.otherinfo = [{0}] \u3067\u8a3c\u62e0\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\n\u5185\u5bb9\uff1a\n[{1}]
ascanrules.ssti.desc = \u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u6642\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u5b89\u5168\u306b\u51e6\u7406\u305b\u305a\u3001\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u5185\u306b\u76f4\u63a5\u633f\u5165\u3059\u308b\u3068\u3001\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a8\u30f3\u30b8\u30f3\u304c\u305d\u306e\u5165\u529b\u3092\u30b3\u30fc\u30c9\u3068\u3057\u3066\u8a55\u4fa1\u3059\u308b\u5371\u967a\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a8\u30f3\u30b8\u30f3\u306e\u7a2e\u985e\u306b\u3088\u3063\u3066\u306f\u3001\u3053\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3057\u3066\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanrules.ssti.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.ssti.refs = https\://portswigger.net/research/server-side-template-injection
ascanrules.ssti.soln = \u30e6\u30fc\u30b6\u30fc\u306e\u5165\u529b\u3092\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306b\u633f\u5165\u3059\u308b\u306e\u3067\u306f\u306a\u304f\u3001\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u5f15\u6570\u3068\u3057\u3066\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.sstiblind.alert.recvdcallback.otherinfo = \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
ascanrules.sstiblind.desc = \u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u6642\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u5b89\u5168\u306b\u51e6\u7406\u305b\u305a\u3001\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u5185\u306b\u76f4\u63a5\u633f\u5165\u3059\u308b\u3068\u3001\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a8\u30f3\u30b8\u30f3\u304c\u305d\u306e\u5165\u529b\u3092\u30b3\u30fc\u30c9\u3068\u3057\u3066\u8a55\u4fa1\u3059\u308b\u5371\u967a\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a8\u30f3\u30b8\u30f3\u306e\u7a2e\u985e\u306b\u3088\u3063\u3066\u306f\u3001\u3053\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3057\u3066\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanrules.sstiblind.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 (\u30d6\u30e9\u30a4\u30f3\u30c9)
ascanrules.sstiblind.refs = https\://portswigger.net/research/server-side-template-injection
ascanrules.sstiblind.soln = \u30e6\u30fc\u30b6\u30fc\u306e\u5165\u529b\u3092\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306b\u633f\u5165\u3059\u308b\u306e\u3067\u306f\u306a\u304f\u3001\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u5f15\u6570\u3068\u3057\u3066\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.traceaxd.desc = ASP.NET Trace Viewer (trace.axd) \u304c\u5229\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306f\u3001\u5927\u91cf\u306e\u4fa1\u5024\u3042\u308b\u60c5\u5831\u3092\u6f0f\u6d29\u3055\u305b\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.traceaxd.name = Trace.axd \u60c5\u5831\u6f0f\u6d29
ascanrules.traceaxd.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u304b\u3089\u5224\u65ad\u3057\u3066\u3001Trace Viewer\u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u306e\u4ed5\u7d44\u307f\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.traceaxd.refs = https\://learn.microsoft.com/en-us/previous-versions/bb386420(v\=vs.140)\nhttps\://learn.microsoft.com/en-us/previous-versions/wwh16c6c(v\=vs.140)
ascanrules.traceaxd.soln = Trace Viewer\u304c\u672c\u756a\u74b0\u5883\u3067\u5b9f\u969b\u306b\u5fc5\u8981\u304b\u3069\u3046\u304b\u3092\u691c\u8a0e\u3057\u3001\u4e0d\u8981\u3067\u3042\u308c\u3070\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3082\u3057\u5fc5\u8981\u3067\u3042\u308c\u3070\u3001\u30a2\u30af\u30bb\u30b9\u306b\u8a8d\u8a3c\u3068\u8a8d\u53ef\u3092\u5fc5\u9808\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.useragent.desc = \u30d5\u30a1\u30ba\u3055\u308c\u305f (fuzzed) \u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8 (\u4f8b\: \u30e2\u30d0\u30a4\u30eb\u30b5\u30a4\u30c8\u3001\u691c\u7d22\u30a8\u30f3\u30b8\u30f3\u306e\u30af\u30ed\u30fc\u30e9\u30fc\u3068\u3057\u3066\u30a2\u30af\u30bb\u30b9) \u306b\u57fa\u3065\u3044\u3066\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u9055\u3044\u3092\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u3068\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u306e\u30cf\u30c3\u30b7\u30e5\u30b3\u30fc\u30c9\u3092\u5143\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u3068\u6bd4\u8f03\u3057\u307e\u3059\u3002\n
ascanrules.useragent.name = \u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30d5\u30a1\u30b6\u30fc (User Agent Fuzzer)
ascanrules.useragent.refs = https\://owasp.org/wstg
ascanrules.useragent.useragentparmname = \u30d8\u30c3\u30c0\u30fc\uff1aUser-Agent

ascanrules.xpathinjection.name = XPath\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3

ascanrules.xsltinjection.command.otherinfo = \u30b3\u30de\u30f3\u30c9\u5b9f\u884c\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.xsltinjection.desc = XSL\u5909\u63db\u3092\u4f7f\u7528\u3057\u305f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u53ef\u80fd\u306a\u5834\u5408\u304c\u3042\u308a\u3001\u653b\u6483\u8005\u304c\u30b7\u30b9\u30c6\u30e0\u60c5\u5831\u3092\u8aad\u307f\u53d6\u3063\u305f\u308a\u3001\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u66f8\u304d\u3092\u884c\u3063\u305f\u308a\u3001\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u3092\u5b9f\u884c\u3057\u305f\u308a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.xsltinjection.error.otherinfo = XSLT\u30c8\u30fc\u30af\u30f3\u3092\u9001\u4fe1\u3057\u305f\u969b\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u3001XSLT\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b\u8106\u5f31\u6027\u3092\u793a\u5506\u3059\u308b\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002
ascanrules.xsltinjection.name = XSLT\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.xsltinjection.portscan.otherinfo = \u30dd\u30fc\u30c8\u30b9\u30ad\u30e3\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.xsltinjection.refs = https\://book.hacktricks.wiki/en/pentesting-web/xslt-server-side-injection-extensible-stylesheet-language-transformations.html
ascanrules.xsltinjection.soln = \u3042\u3089\u3086\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u304b\u3089\u306e\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u30b5\u30cb\u30bf\u30a4\u30ba (\u7121\u5bb3\u5316) \u3057\u3001\u5206\u6790\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanrules.xsltinjection.vendor.otherinfo = \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u5f8c\u3001XSLT\u30d7\u30ed\u30bb\u30c3\u30b5\u306e\u30d9\u30f3\u30c0\u30fc\u540d "{0}" \u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002

ascanrules.xxe.name = XML\u5916\u90e8\u5b9f\u4f53\u53c2\u7167 (XXE) \u653b\u6483
