ascanrules.desc = Release status active scan rules
ascanrules.name = Active Scan Rules

ascanrules.bufferoverflow.name = Estouro de Buffer
ascanrules.bufferoverflow.desc = Erros de estouro de Buffer s\u00e3o caracterizados pela sobrescri\u00e7\u00e3o de espa\u00e7os de mem\u00f3ria do processo web de segundo plano, o qual nunca deveria ser modificado com ou sem inten\u00e7\u00e3o. Sobrescrever valores do IP (Instruction Pointer), BP (Base Pointer) e outros registros causam exce\u00e7\u00f5es, falhas de segmenta\u00e7\u00e3o, e a ocorr\u00eancia de outros erros de processos. Normalmente esses erros finalizam a execu\u00e7\u00e3o do aplicativo de forma inesperada.
ascanrules.bufferoverflow.soln = Reescreva o programa de plano de fundo utilizando o correto controle de retorno de comprimento. Isso ir\u00e1 requerer uma recompila\u00e7\u00e3o do execut\u00e1vel que roda em background.
ascanrules.bufferoverflow.refs = https\://owasp.org/www-community/attacks/Buffer_overflow_attack\n\

ascanrules.bufferoverflow.other = Potencial Estouro de Buffer. O script fechou a conex\u00e3o e lan\u00e7ou um Erro Interno de Servidor 500

ascanrules.commandinjection.name=Inje\u00e7\u00e3o Remota de Comandos de SO
ascanrules.commandinjection.desc=T\u00e9cnica de ataque usada para execu\u00e7\u00e3o n\u00e3o autorizada de comandos do sistema operacional. Esse ataque \u00e9 poss\u00edvel quando um aplicativo aceita entrada n\u00e3o confi\u00e1vel para criar comandos do sistema operacional de maneira insegura, envolvendo sanitiza\u00e7\u00e3o inadequada de dados e chamada inadequada de programas externos.
ascanrules.commandinjection.refs=http\://cwe.mitre.org/data/definitions/78.html\n\
https\://owasp.org/www-community/attacks/Command_Injection
ascanrules.commandinjection.otherinfo.feedback-based=The scan rule was able to retrieve the content of a file or command by sending [{0}] to the operating system running this application
ascanrules.commandinjection.otherinfo.time-based=The scan rule was able to control the timing of the application response by sending [{0}] to the operating system running this application

ascanrules.elmah.name = Vazamento de Informa\u00e7\u00e3o ELMAH
ascanrules.elmah.desc = O m\u00f3dulo HTTP Error Logging Modules and Handlers (ELMAH [elmah.axd]) foi encontrado como dispon\u00edvel. Esse m\u00f3dulo pode vazar uma quantidade significativa de informa\u00e7\u00f5es valiosas.
ascanrules.elmah.otherinfo = Baseado na resposta o c\u00f3digo de status ELMAH pode ser protegido por um mecanismo de autentica\u00e7\u00e3o ou autoriza\u00e7\u00e3o.  
ascanrules.elmah.refs = https\://www.troyhunt.com/aspnet-session-hijacking-with-google/ \n\
https\://www.nuget.org/packages/elmah \n\
https\://elmah.github.io/
ascanrules.elmah.soln = Considere se o ELMAH \u00e9 necess\u00e1rio ou n\u00e3o na produ\u00e7\u00e3o, se n\u00e3o for ent\u00e3o desative-o. Se for, ent\u00e3o garanta que o acesso a ele necessite de autentica\u00e7\u00e3o e autoriza\u00e7\u00e3o. Veja tamb\u00e9m\: https\://elmah.github.io/a/securing-error-log-pages/

ascanrules.formatstring.name=Erro de Formato de String
ascanrules.formatstring.desc=Um erro de Formato de String ocorre quando o dado enviado de uma string de entrada \u00e9 avaliado como um comando pelo aplicativo. 
ascanrules.formatstring.soln= Reescreva o programa de plano de fundo utilizando o apagamento apropriado das bad character strings. Isso ir\u00e1 requerer uma recompila\u00e7\u00e3o do execut\u00e1vel do plano de fundo.
ascanrules.formatstring.refs=https\://owasp.org/www-community/attacks/Format_string_attack\n\

ascanrules.formatstring.error1 = Poss\u00edvel Erro de Formato de String. O script fechou a conex\u00e3o em /%s
ascanrules.formatstring.error2 = Poss\u00edvel Erro de Formato de String. O script fechou a conex\u00e3o entre /%s e /%x
ascanrules.formatstring.error3 = Poss\u00edvel Erro de Formato de String. O script fechou a conex\u00e3o devido a um erro de formato de string da Microsoft

ascanrules.htaccess.name = Vazamento de informa\u00e7\u00f5es .htaccess
ascanrules.htaccess.desc = Os arquivos htaccess podem ser usados para alterar a configura\u00e7\u00e3o do software Apache Web Servidor para habilitar/desabilitar funcionalidades e recursos adicionais que o software Apache Web Servidor tem a oferecer.
ascanrules.htaccess.otherinfo = Com base no c\u00f3digo de status de resposta, o arquivo htaccess pode ser protegido por um mecanismo de autentica\u00e7\u00e3o ou autoriza\u00e7\u00e3o.
ascanrules.htaccess.refs = http\://www.htaccess-guide.com/
ascanrules.htaccess.soln = Certifique-se de que o arquivo .htaccess n\u00e3o esteja acess\u00edvel.

ascanrules.sourcecodedisclosurewebinf.name = Divulga\u00e7\u00e3o de C\u00f3digo-Fonte - Pasta /WEB-INF
ascanrules.sourcecodedisclosurewebinf.desc = O c\u00f3digo-fonte Java foi divulgado pelo servidor web em arquivos de classe Java na pasta WEB-INF. Os arquivos de classe podem ser desmontados para produzir c\u00f3digo-fonte que corresponda muito de perto ao c\u00f3digo-fonte original.  
ascanrules.sourcecodedisclosurewebinf.soln = O servidor web deve ser configurado para n\u00e3o servir a pasta /WEB-INF ou seu conte\u00fado para navegadores web, uma vez que cont\u00e9m informa\u00e7\u00f5es confidenciais, como c\u00f3digo-fonte Java compilado e arquivos de propriedades que podem conter credenciais. As classes Java implantadas com o aplicativo devem ser ofuscadas, como uma camada adicional de defesa em uma abordagem de "defesa em profundidade".
ascanrules.sourcecodedisclosurewebinf.propertiesfile.name = Divulga\u00e7\u00e3o de Arquivo de Propriedades - Pasta /WEB-INF
ascanrules.sourcecodedisclosurewebinf.propertiesfile.desc = Uma classe Java na pasta /WEB-INF revelou a presen\u00e7a de um arquivo de propriedades. O arquivo de propriedades n\u00e3o se destina a ser acessado publicamente e geralmente cont\u00e9m informa\u00e7\u00f5es de configura\u00e7\u00e3o, credenciais de aplicativo ou chaves criptogr\u00e1ficas.   
ascanrules.sourcecodedisclosurewebinf.propertiesfile.soln = O servidor web deve ser configurado para n\u00e3o servir a pasta /WEB-INF ou seu conte\u00fado para navegadores web. Tamb\u00e9m pode ser poss\u00edvel remover a pasta /WEB-INF.  
ascanrules.sourcecodedisclosurewebinf.propertiesfile.extrainfo = A refer\u00eancia ao arquivo de propriedades foi encontrada no c\u00f3digo-fonte Java disassemblado para a classe Java [{0}].

ascanrules.crosssitescripting.name = Cross Site Scripting (Refletido)
ascanrules.crosssitescripting.json.name = Fraqueza de script entre sites (refletida na resposta JSON)
ascanrules.crosssitescripting.json.desc = Um ataque XSS foi refletido em uma resposta JSON, isso pode deixar os consumidores de conte\u00fado vulner\u00e1veis a ataques se eles n\u00e3o manipularem os dados (resposta) de forma adequada.
ascanrules.crosssitescripting.otherinfo.nothtml = Gerado com BAIXA confian\u00e7a, pois o Tipo de conte\u00fado n\u00e3o \u00e9 HTML
ascanrules.crosssitescripting.otherinfo.accesskey = The accesskey attribute specifies a shortcut key to activate/focus an element. This attribute can trigger payloads for non-conventional or custom tags.

ascanrules.persistentxssattack.name=Cross Site Scripting (Persistente)
ascanrules.persistentxssattack.otherinfo=URL de Origem\: {0}
ascanrules.persistentxssattack.json.name = Fraqueza de script entre sites (persistente na resposta JSON)
ascanrules.persistentxssattack.json.desc = Um ataque XSS foi encontrado em uma resposta JSON, isso pode deixar os consumidores de conte\u00fado vulner\u00e1veis a ataques se eles n\u00e3o manipularem os dados (resposta) de forma adequada.
ascanrules.persistentxssattack.otherinfo.nothtml = Gerado com BAIXA confian\u00e7a, pois o Tipo de conte\u00fado n\u00e3o \u00e9 HTML

ascanrules.persistentxssprime.name=Cross Site Scripting (Persistente) - Prim\u00e1rio
ascanrules.persistentxssprime.misc=N/A

ascanrules.persistentxssspider.name=Cross Site Scripting (Persistente) - Spider
ascanrules.persistentxssspider.misc=N/A

ascanrules.sqlinjection.name=Inje\u00e7\u00e3o SQL
ascanrules.sqlinjection.desc=Inje\u00e7\u00e3o SQL pode ser poss\u00edvel.
ascanrules.sqlinjection.soln=N\u00e3o confie na entrada do lado do cliente, mesmo se houver valida\u00e7\u00e3o do lado do cliente em vigor.\n\
Em geral, digite verificar todos os dados no lado do servidor.\n\
Se o aplicativo usar JDBC, use Declara\u00e7\u00e3o preparada ou Declara\u00e7\u00e3o exig\u00edvel, com par\u00e2metros passados \u200b\u200bpor '?'\n\
Se o aplicativo usa ASP, use objetos de comando ADO com verifica\u00e7\u00e3o de tipo forte e consultas parametrizadas.\n\
Se os procedimentos armazenados do banco de dados puderem ser usados, use-os.\n\
* N\u00e3o * concatene strings em consultas no procedimento armazenado ou use 'exec', 'exec imediato' ou funcionalidade equivalente\!\n\
N\u00e3o crie consultas SQL din\u00e2micas usando concatena\u00e7\u00e3o de string simples.\n\
Escape de todos os dados recebidos do cliente.\n\
Aplique uma 'lista de permiss\u00e3o' de caracteres permitidos ou uma 'lista de nega\u00e7\u00e3o' de caracteres n\u00e3o permitidos na entrada do usu\u00e1rio.\n\
Aplique o princ\u00edpio do menor privil\u00e9gio usando o usu\u00e1rio de banco de dados com o menor privil\u00e9gio poss\u00edvel.\n\
Em particular, evite usar os usu\u00e1rios do banco de dados 'sa' ou 'db-owner'. Isso n\u00e3o elimina a inje\u00e7\u00e3o de SQL, mas minimiza seu impacto.\n\
Conceda o m\u00ednimo de acesso ao banco de dados necess\u00e1rio para o aplicativo.
ascanrules.sqlinjection.refs=https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanrules.sqlinjection.alert.errorbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack=Valor Original\: [{0}]. Valor Modificado\: [{1}]. Valor de Controle\: [{2}]
ascanrules.sqlinjection.alert.booleanbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.sqlinjection.alert.unionbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.sqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] provavelmente, dada a express\u00e3o regular da mensagem de erro [{1}] correspondente aos resultados HTML.\n\
A vulnerabilidade foi detectada manipulando o par\u00e2metro para fazer com que uma mensagem de erro do banco de dados fosse retornada e reconhecida
ascanrules.sqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] provavelmente, dada a express\u00e3o regular da mensagem de erro espec\u00edfica da UNION [{1}] correspondida aos resultados HTML\n\
A vulnerabilidade foi detectada manipulando o par\u00e2metro com uma cl\u00e1usula SQL ''UNION'' para fazer com que uma mensagem de erro do banco de dados fosse retornada e reconhecida
ascanrules.sqlinjection.alert.expressionbased.extrainfo=Os resultados da p\u00e1gina original foram replicados com sucesso usando a express\u00e3o [{0}] como o valor do par\u00e2metro\n\
O valor do par\u00e2metro sendo modificado foi {1} retirado da sa\u00edda HTML para fins de compara\u00e7\u00e3o
ascanrules.sqlinjection.alert.orderbybased.extrainfo=Os resultados da p\u00e1gina original foram replicados com sucesso usando a express\u00e3o "ORDENAR POR" [{0}] como o valor do par\u00e2metro\n\
O valor do par\u00e2metro sendo modificado foi {1} retirado da sa\u00edda HTML para fins de compara\u00e7\u00e3o
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Mensagem n\u00e3o modificada fornece status HTTP [{0}], Mensagem modificada fornece status HTTP [{1}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo=Mensagem n\u00e3o modificada fornece status HTTP [{0}], comprimento do corpo [{1}], mensagem modificada fornece status HTTP [{2}], comprimento do corpo [{3}]. Um terceiro (valor que n\u00e3o induz a inje\u00e7\u00e3o SQL) fornece status HTTP [{4}], comprimento do corpo [{5}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo=Os resultados da p\u00e1gina foram manipulados com sucesso usando as condi\u00e7\u00f5es booleanas [{0}] e [{1}]\n\
O valor do par\u00e2metro sendo modificado foi {2} retirado da sa\u00edda HTML para fins de compara\u00e7\u00e3o
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists=Os dados foram retornados para o par\u00e2metro original.\n\
A vulnerabilidade foi detectada ao restringir com sucesso os dados originalmente retornados, manipulando o par\u00e2metro
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists=Os dados N\u00c3O foram retornados para o par\u00e2metro original.\n\
A vulnerabilidade foi detectada ao recuperar com sucesso mais dados do que os originalmente retornados, manipulando o par\u00e2metro
ascanrules.sqlinjection.alert.timebased.extrainfo=O tempo da query \u00e9 control\u00e1vel utilizando o valor do par\u00e2metro [{0}], o qual causou a requisi\u00e7\u00e3o a levar [{1}] milissegundos, enquanto o valor original da query sem modifica\u00e7\u00e3o com o valor [{2}] levou [{3}] milissegundos
ascanrules.sqlinjection.authbypass.name=Inje\u00e7\u00e3o SQL - Desvio de Autentica\u00e7\u00e3o
ascanrules.sqlinjection.authbypass.desc=A inje\u00e7\u00e3o de SQL pode ser poss\u00edvel em uma p\u00e1gina de login, potencialmente permitindo que o mecanismo de autentica\u00e7\u00e3o do aplicativo seja contornado

ascanrules.externalredirect.name=Redirecionamento Externo
ascanrules.externalredirect.reason.location.header=A resposta cont\u00e9m um redirecionamento em seu cabe\u00e7alho Localiza\u00e7\u00e3o que permite que um URL externo seja definido.
ascanrules.externalredirect.reason.location.meta=A resposta cont\u00e9m um redirecionamento em sua meta tag http-equiv para 'Local', que permite que um URL externo seja definido.
ascanrules.externalredirect.reason.refresh.header=A resposta cont\u00e9m um redirecionamento em seu cabe\u00e7alho Atualizar que permite que um URL externo seja definido.
ascanrules.externalredirect.reason.refresh.meta=A resposta cont\u00e9m um redirecionamento em sua meta tag http-equiv para 'Atualizar', que permite que um URL externo seja definido.
ascanrules.externalredirect.reason.javascript=A resposta cont\u00e9m um redirecionamento em seu c\u00f3digo JavaScript que permite que um URL externo seja definido.
ascanrules.externalredirect.reason.notfound=Nenhum motivo encontrado para isso...

ascanrules.codeinjection.name=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor
ascanrules.codeinjection.name.asp=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor - Inje\u00e7\u00e3o de C\u00f3digo ASP
ascanrules.codeinjection.name.php=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor - Inje\u00e7\u00e3o de C\u00f3digo PHP
ascanrules.codeinjection.desc=Uma inje\u00e7\u00e3o de c\u00f3digo pode ser poss\u00edvel incluindo um c\u00f3digo personalizado que ser\u00e1 avaliado pelo mecanismo de script
ascanrules.codeinjection.soln=N\u00e3o confie na entrada do lado do cliente, mesmo se existir uma valida\u00e7\u00e3o no lado cliente.\n\
Em geral, verifique o tipo de dados no lado do servidor e evite todos os dados recebidos do cliente.\n\
 Evite o uso de fun\u00e7\u00f5es eval() combinadas com dados de entrada de usu\u00e1rios.
ascanrules.codeinjection.refs=http\://cwe.mitre.org/data/definitions/94.html\n\
https\://owasp.org/www-community/attacks/Direct_Dynamic_Code_Evaluation_Eval%20Injection\n\


ascanrules.directorybrowsing.name=Navega\u00e7\u00e3o no Diret\u00f3rio
ascanrules.directorybrowsing.desc=\u00c9 poss\u00edvel visualizar a lista de diret\u00f3rios. A listagem de diret\u00f3rios pode revelar scripts ocultos, incluir arquivos, arquivos de origem de backup, etc., que podem ser acessados para ler informa\u00e7\u00f5es confidenciais.
ascanrules.directorybrowsing.soln=Desative a navega\u00e7\u00e3o no diret\u00f3rio. Se isso for necess\u00e1rio, certifique-se de que os arquivos listados n\u00e3o causem riscos.
ascanrules.directorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\n\
http\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html

ascanrules.crlfinjection.name=Inje\u00e7\u00e3o CRLF
ascanrules.crlfinjection.desc=O cookie pode ser definido por meio de inje\u00e7\u00e3o CRLF. Tamb\u00e9m pode ser poss\u00edvel definir cabe\u00e7alhos de resposta HTTP arbitr\u00e1rios. Al\u00e9m disso, ao criar cuidadosamente a resposta injetada usando script de site cruzado, tamb\u00e9m pode existir vulnerabilidade de envenenamento de cache.
ascanrules.crlfinjection.soln=Digite verifique o par\u00e2metro enviado com cuidado. N\u00e3o permita que o CRLF seja injetado filtrando o CRLF.
ascanrules.crlfinjection.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\n\
http\://webappfirewall.com/lib/crlf-injection.txtnull\n\
http\://www.securityfocus.com/bid/9804

ascanrules.parametertamper.name=Adultera\u00e7\u00e3o de par\u00e2metros
ascanrules.parametertamper.desc=A manipula\u00e7\u00e3o de par\u00e2metros causou a exibi\u00e7\u00e3o de uma p\u00e1gina de erro ou rastreamento de pilha Java. Isso indicou a falta de tratamento de exce\u00e7\u00f5es e \u00e1reas potenciais para explora\u00e7\u00e3o posterior.
ascanrules.parametertamper.soln=Identifique a causa do erro e corrija. N\u00e3o confie na entrada do lado do cliente e aplique uma verifica\u00e7\u00e3o rigorosa no lado do servidor. Al\u00e9m disso, capture a exce\u00e7\u00e3o corretamente. Use uma p\u00e1gina de erro 500 gen\u00e9rica para erro interno do servidor.

ascanrules.pathtraversal.name=Travessia/Passagem de Caminho
ascanrules.pathtraversal.other=Verifique {0}

ascanrules.remotefileinclude.name=Inclus\u00e3o de Arquivo Remoto

ascanrules.serversideinclude.name=Incluir Lado do Servidor
ascanrules.serversideinclude.desc=Certos par\u00e2metros podem fazer com que os comandos de inclus\u00e3o do lado do servidor sejam executados. Isso pode permitir a execu\u00e7\u00e3o de uma conex\u00e3o de banco de dados ou de um c\u00f3digo arbitr\u00e1rio.
ascanrules.serversideinclude.soln=N\u00e3o confie na entrada do lado do cliente e aplique uma verifica\u00e7\u00e3o rigorosa no lado do servidor. Desative as inclus\u00f5es do lado do servidor.
Refer=para desativa\u00e7\u00e3o manual de Sever Side Include.\n\
\n\
Use o menor privil\u00e9gio poss\u00edvel para executar seu servidor web ou servidor de aplicativos.\n\
\n\
Para Apache, desative o seguinte\:\n\
\n\
Options Indexes FollowSymLinks Includes\n\
\n\
AddType application/x-httpd-cgi .cgi\n\
\n\
AddType text/x-server-parsed-html .html
ascanrules.serversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html\n\

