#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=\u0938\u0915\u094d\u0930\u093f\u092f \u0938\u094d\u0915\u0948\u0928 \u0928\u093f\u092f\u092e

ascanrules.bufferoverflow.name=\u092c\u092b\u093c\u0930 \u0913\u0935\u0930\u092b\u093c\u094d\u0932\u094b
ascanrules.bufferoverflow.desc=\u092c\u092b\u093c\u0930 \u0913\u0935\u0930\u092b\u093c\u094d\u0932\u094b \u0924\u094d\u0930\u0941\u091f\u093f\u092f\u094b\u0902 \u092a\u0943\u0937\u094d\u0920\u092d\u0942\u092e\u093f \u0935\u0947\u092c \u092a\u094d\u0930\u0915\u094d\u0930\u093f\u092f\u093e \u0939\u0948, \u091c\u094b \u0915\u092d\u0940 \u091c\u093e\u0928\u092c\u0942\u091d\u0915\u0930 \u092f\u093e \u0905\u0928\u091c\u093e\u0928\u0947 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948 \u091a\u093e\u0939\u093f\u090f \u0915\u0947 \u0938\u094d\u092e\u0943\u0924\u093f \u0930\u093f\u0915\u094d\u0924 \u0938\u094d\u0925\u093e\u0928 \u0915\u0947 overwriting \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u0935\u093f\u0936\u0947\u0937\u0924\u093e \u0939\u0948\u0902\u0964 \u0906\u0908\u092a\u0940 (\u0905\u0928\u0941\u0926\u0947\u0936 \u0938\u0942\u091a\u0915), \u092c\u0940. \u092a\u0940. (\u092c\u0947\u0938 \u0938\u0942\u091a\u0915) \u0914\u0930 \u0926\u0942\u0938\u0930\u0947 \u0915\u0947 \u092e\u093e\u0928 \u0915\u094b \u0905\u0927\u093f\u0932\u0947\u0916\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u093e\u0930\u0923\u094b\u0902 \u0905\u092a\u0935\u093e\u0926, \u0935\u093f\u092d\u093e\u091c\u0928 \u0926\u094b\u0937, \u0914\u0930 \u0905\u0928\u094d\u092f \u092a\u094d\u0930\u0915\u094d\u0930\u093f\u092f\u093e \u0924\u094d\u0930\u0941\u091f\u093f\u092f\u094b\u0902 \u0915\u0947 \u0918\u091f\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0902\u091c\u0940\u0915\u0943\u0924 \u0915\u0930\u0924\u093e \u0939\u0948\u0964 \u0906\u092e\u0924\u094c\u0930 \u092a\u0930 \u0907\u0928 \u0924\u094d\u0930\u0941\u091f\u093f\u092f\u093e\u0901 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u092e\u0947\u0902 \u0905\u092a\u094d\u0930\u0924\u094d\u092f\u093e\u0936\u093f\u0924 \u0924\u0930\u0940\u0915\u0947 \u0905\u0902\u0924\u0964 
ascanrules.bufferoverflow.soln=\u0909\u091a\u093f\u0924 \u0935\u093e\u092a\u0938\u0940 \u0932\u092e\u094d\u092c\u093e\u0908 \u0915\u0940 \u091c\u093e\u0901\u091a \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u0943\u0937\u094d\u0920\u092d\u0942\u092e\u093f \u092a\u094d\u0930\u094b\u0917\u094d\u0930\u093e\u092e \u0915\u094b \u092b\u093f\u0930 \u0938\u0947 \u0932\u093f\u0916\u0928\u093e\u0964  \u092f\u0939 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u092f\u094b\u0917\u094d\u092f \u092a\u0943\u0937\u094d\u0920\u092d\u0942\u092e\u093f \u0915\u093e \u090f\u0915 recompile \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e \u0939\u094b\u0917\u0940\u0964
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u092c\u092b\u0930 \u0905\u0924\u093f\u092a\u094d\u0930\u0935\u093e\u0939\u0964  \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092c\u0902\u0926 \u0915\u0930 \u0926\u093f\u092f\u093e \u0914\u0930 \u090f\u0915 500 \u0906\u0902\u0924\u0930\u093f\u0915 \u0938\u0930\u094d\u0935\u0930 \u0924\u094d\u0930\u0941\u091f\u093f \u092b\u0947\u0902\u0915 \u0926\u093f\u092f\u093e


ascanrules.commandinjectionplugin.name=\u0926\u0942\u0930\u0938\u094d\u0925 OS \u0915\u092e\u093e\u0902\u0921 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanrules.commandinjectionplugin.desc=\u0911\u092a\u0930\u0947\u091f\u093f\u0902\u0917 \u0938\u093f\u0938\u094d\u091f\u092e \u0906\u0926\u0947\u0936\u094b\u0902 \u0915\u0940 \u0905\u0928\u0927\u093f\u0915\u0943\u0924 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u0915\u0947 \u0932\u093f\u090f \u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093f\u092f\u093e \u091c\u093e\u0924\u093e \u0924\u0915\u0928\u0940\u0915 \u092a\u0930 \u0939\u092e\u0932\u093e\u0964 \u0907\u0938 \u0939\u092e\u0932\u0947 \u0938\u0902\u092d\u0935 \u091c\u092c \u0915\u094b\u0908 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093f\u0938\u0940 \u0905\u0938\u0941\u0930\u0915\u094d\u0937\u093f\u0924 \u0924\u0930\u0940\u0915\u0947 \u0938\u0947 \u0905\u0928\u0941\u091a\u093f\u0924 \u0921\u0947\u091f\u093e \u0938\u094d\u0935\u091a\u094d\u091b\u0924\u093e \u0915\u094b \u0936\u093e\u092e\u093f\u0932 \u092e\u0947\u0902 \u0911\u092a\u0930\u0947\u091f\u093f\u0902\u0917 \u0938\u093f\u0938\u094d\u091f\u092e \u0906\u0926\u0947\u0936\u094b\u0902 \u0915\u0947 \u0928\u093f\u0930\u094d\u092e\u093e\u0923 \u0915\u0947 \u0932\u093f\u090f \u0905\u0935\u093f\u0936\u094d\u0935\u0938\u094d\u0924 \u0907\u0928\u092a\u0941\u091f \u0938\u094d\u0935\u0940\u0915\u093e\u0930 \u0915\u0930\u0924\u093e \u0939\u0948, \u0914\u0930/\u092f\u093e \u0905\u0928\u0941\u091a\u093f\u0924 \u092c\u093e\u0939\u0930\u0940 \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0930\u092e\u094b\u0902 \u0915\u0947 \u092c\u0941\u0932\u093e \u0930\u0939\u0940 \u0939\u0948\u0964
ascanrules.commandinjectionplugin.refs=' https\://www.owasp.org/index.php/Command_Injection http\://cwe.mitre.org/data/definitions/78.html

ascanrules.formatstring.name=\u0938\u094d\u0935\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f
ascanrules.formatstring.desc=\u090f\u0915 \u092a\u094d\u0930\u093e\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f \u0924\u092c \u0939\u094b\u0924\u0940 \u0939\u0948 \u091c\u092c \u090f\u0915 \u0907\u0928\u092a\u0941\u091f \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0915\u0947 \u0938\u092c\u092e\u093f\u091f \u0915\u093f\u090f \u0917\u090f \u0921\u0947\u091f\u093e \u0935\u093e\u0932\u0947 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0926\u094d\u0935\u093e\u0930\u093e \u090f\u0915 \u0915\u092e\u093e\u0902\u0921 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u0928 \u0915\u093f\u092f\u093e \u091c\u093e\u0924\u093e \u0939\u0948\u0964 
ascanrules.formatstring.soln=\u092c\u0941\u0930\u0947 \u091a\u0930\u093f\u0924\u094d\u0930 \u0924\u093e\u0930 \u0915\u0940 \u0909\u091a\u093f\u0924 \u0935\u093f\u0932\u094b\u092a\u0928 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u0943\u0937\u094d\u0920\u092d\u0942\u092e\u093f \u092a\u094d\u0930\u094b\u0917\u094d\u0930\u093e\u092e \u0915\u094b \u092b\u093f\u0930 \u0938\u0947 \u0932\u093f\u0916\u0928\u093e\u0964  \u092f\u0939 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u0928 \u092f\u094b\u0917\u094d\u092f \u092a\u0943\u0937\u094d\u0920\u092d\u0942\u092e\u093f \u0915\u093e \u090f\u0915 recompile \u0915\u0940 \u0906\u0935\u0936\u094d\u092f\u0915\u0924\u093e \u0939\u094b\u0917\u0940\u0964
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0938\u094d\u0935\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f\u0964  \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u090f\u0915 /%s \u092a\u0930 \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092c\u0902\u0926 \u0915\u0930 \u0926\u093f\u092f\u093e
ascanrules.formatstring.error2=\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0938\u094d\u0935\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f\u0964  \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u090f\u0915 /%s \u092a\u0930 \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092c\u0902\u0926 \u0915\u0930 \u0926\u093f\u092f\u093e
ascanrules.formatstring.error3=\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0938\u094d\u0935\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f\u0964  \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u0915\u093f\u0938\u0940 microsoft \u0938\u094d\u0935\u0930\u0942\u092a \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0924\u094d\u0930\u0941\u091f\u093f \u092a\u0930 \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092c\u0902\u0926 \u0915\u0930 \u0926\u093f\u092f\u093e


ascanrules.testscrosssitescriptv2.name=\u0915\u094d\u0930\u0949\u0938 \u0938\u093e\u0907\u091f \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f\u093f\u0902\u0917 (\u092a\u094d\u0930\u0924\u093f\u092c\u093f\u0902\u092c\u093f\u0924)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=\u0938\u093e\u092e\u0917\u094d\u0930\u0940-\u092a\u094d\u0930\u0915\u093e\u0930 HTML \u0928\u0939\u0940\u0902 \u0939\u0948 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0915\u092e \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0915\u0947 \u0938\u093e\u0925 \u0909\u0920\u093e\u092f\u093e

ascanrules.testpersistentxssattack.name=\u0915\u094d\u0930\u0949\u0938 \u0938\u093e\u0907\u091f \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f\u093f\u0902\u0917 (\u0932\u0917\u093e\u0924\u093e\u0930)
ascanrules.testpersistentxssattack.otherinfo=\u0938\u094d\u0930\u094b\u0924 URL\: {0}

ascanrules.testpersistentxssprime.name=\u0915\u094d\u0930\u0949\u0938 (\u0932\u0917\u093e\u0924\u093e\u0930) \u092a\u091f\u0915\u0925\u093e - \u092a\u094d\u0930\u093e\u0907\u092e \u0938\u093e\u0907\u091f
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=\u0915\u094d\u0930\u0949\u0938 (\u0932\u0917\u093e\u0924\u093e\u0930) \u092a\u091f\u0915\u0925\u093e - \u092a\u094d\u0930\u093e\u0907\u092e \u0938\u093e\u0907\u091f
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanrules.testsqlinjection.desc=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanrules.testsqlinjection.soln=\u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u0905\u0917\u0930 \u0935\u0939\u093e\u0901 \u0939\u0948 \u091c\u0917\u0939 \u092e\u0947\u0902 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0938\u0924\u094d\u092f\u093e\u092a\u0928 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f, \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0947\u0964   \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u092e\u0947\u0902, \u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092a\u0930 \u0938\u092d\u0940 \u0921\u0947\u091f\u093e \u0915\u0940 \u091c\u093e\u0901\u091a \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f JDBC \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, PreparedStatement \u092f\u093e CallableStatement, \u092a\u093e\u0930\u093f\u0924 \u0915\u0930 \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0938\u093e\u0925 \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902 '?' \u092f\u0926\u093f ASP \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, \u092e\u091c\u092c\u0942\u0924 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u091c\u093e\u0901\u091a \u0914\u0930 \u0905\u0928\u094d\u092f \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u0915\u0947 \u0938\u093e\u0925 ADO \u0906\u0926\u0947\u0936 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f\u092f\u093e\u0901 \u0909\u092a\u092f\u094b\u0917 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u0909\u0928\u094d\u0939\u0947\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u0915\u0930 * \u0928 * \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f \u092e\u0947\u0902 \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092e\u0947\u0902 \u0924\u093e\u0930 \u091c\u094b\u0921\u093c\u0928\u093e, \u092f\u093e 'exec', '\u0924\u0924\u094d\u0915\u093e\u0932 exec' \u092f\u093e \u0938\u092e\u0924\u0941\u0932\u094d\u092f \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0937\u092e\u0924\u093e \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\! \u0938\u0930\u0932 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0915\u0921\u093c\u0940 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0921\u093e\u092f\u0928\u0947\u092e\u093f\u0915 SQL \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092c\u0928\u093e\u0928\u093e \u0928\u0939\u0940\u0902\u0964 \u0938\u092d\u0940 \u0917\u094d\u0930\u093e\u0939\u0915 \u0938\u0947 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u093e\u091f\u093e \u0938\u0947 \u092c\u091a\u0964 \u090f\u0915 '\u0936\u094d\u0935\u0947\u0924 \u0938\u0942\u091a\u0940', \u092f\u093e \u090f\u0915 '\u092c\u094d\u0932\u0948\u0915\u0932\u093f\u0938\u094d\u091f' \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0935\u0930\u094d\u0923 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u092e\u0947\u0902 \u0938\u094d\u0935\u0940\u0915\u0943\u0924 \u0935\u0930\u094d\u0923\u094b\u0902 \u0915\u0947 \u0932\u093e\u0917\u0942 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0938\u0947 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u0902\u092d\u0935 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0932\u093e\u0917\u0942 \u0915\u0930\u0947\u0902\u0964 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947, '\u0938\u093e' \u092f\u093e 'db-\u0938\u094d\u0935\u093e\u092e\u0940' \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e\u0913\u0902 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917 \u0938\u0947 \u092c\u091a\u0947\u0902\u0964 \u0907\u0938 SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u094b \u0916\u0924\u094d\u092e \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0940 \u0939\u0948, \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0915\u0947 \u092a\u094d\u0930\u092d\u093e\u0935 \u0915\u094b \u0915\u092e \u0915\u0930\u0924\u093e \u0939\u0948\u0964 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0932\u093f\u090f \u091c\u0930\u0942\u0930\u0940 \u0939\u0948 \u0915\u093f \u0915\u092e \u0938\u0947 \u0915\u092e \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u092a\u094d\u0930\u0926\u093e\u0928 \u0915\u0930\u0924\u0947 \u0939\u0948\u0902\u0964
ascanrules.testsqlinjection.refs=' https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet https\://www.owasp.org/index.php/Top_10_2010-A1
ascanrules.testsqlinjection.alert.errorbased.attack=[{0}] \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}], \u092e\u0942\u0932\u094d\u092f [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=\u092e\u0942\u0932 \u092e\u0942\u0932\u094d\u092f\: [{0}]\u0964 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u092e\u093e\u0928\: [{1}]\u0964 \u0928\u093f\u092f\u0902\u0924\u094d\u0930\u0923 \u092e\u093e\u0928\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[{0}] \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}], \u092e\u0942\u0932\u094d\u092f [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[{0}] \u0915\u094d\u0937\u0947\u0924\u094d\u0930\: [{1}], \u092e\u0942\u0932\u094d\u092f [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=\u0928\u093f\u092f\u092e\u093f\u0924 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092e\u093f\u0932\u093e\u0928 \u0926\u094d\u0935\u093e\u0930\u093e HTML \u092a\u0930\u093f\u0923\u093e\u092e [{1}] RDBMS [{0}] \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0915\u094b \u0926\u0947\u0916\u0924\u0947 \u0939\u0941\u090f \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936\u0964 \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0932\u094c\u091f\u0947 \u0914\u0930 \u092e\u093e\u0928\u094d\u092f\u0924\u093e \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0939\u094b\u0928\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 \u0915\u093e \u0915\u093e\u0930\u0923 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u091c\u094b\u0921\u093c \u0924\u094b\u0921\u093c \u0926\u094d\u0935\u093e\u0930\u093e \u0916\u094b\u091c\u093e \u0917\u092f\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0939\u0948, HTML \u092a\u0930\u093f\u0923\u093e\u092e \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0938\u093e\u0925 \u0932\u094c\u091f \u0906\u090f \u0914\u0930 \u092e\u093e\u0928\u094d\u092f\u0924\u093e \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0939\u094b\u0928\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 \u0915\u093e \u0915\u093e\u0930\u0923 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 SQL ''\u0938\u0902\u0918'' \u0916\u0902\u0921 \u091c\u094b\u0921\u093c \u0924\u094b\u0921\u093c \u0926\u094d\u0935\u093e\u0930\u093e \u0916\u094b\u091c\u093e \u0917\u092f\u093e \u0925\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u092e\u093f\u0932\u093e\u0928 \u0938\u0902\u0918-\u0935\u093f\u0936\u093f\u0937\u094d\u091f \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 \u0928\u093f\u092f\u092e\u093f\u0924 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f [{1}] \u0926\u0940
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=\u092e\u0942\u0932 \u092a\u0943\u0937\u094d\u0920 \u092a\u0930\u093f\u0923\u093e\u092e \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u092a\u094d\u0930\u0924\u093f\u0930\u0942\u092a\u093f\u0924 \u0925\u0947 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f [{0}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 {1}stripped HTML \u0906\u0909\u091f\u092a\u0941\u091f \u0938\u0947 \u0924\u0941\u0932\u0928\u093e \u0915\u0947 \u092a\u094d\u0930\u092f\u094b\u091c\u0928\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=\u092e\u0942\u0932 \u092a\u0943\u0937\u094d\u0920 \u092a\u0930\u093f\u0923\u093e\u092e \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u092a\u094d\u0930\u0924\u093f\u0930\u0942\u092a\u093f\u0924 \u0925\u0947 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f [{0}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 {1}stripped HTML \u0906\u0909\u091f\u092a\u0941\u091f \u0938\u0947 \u0924\u0941\u0932\u0928\u093e \u0915\u0947 \u092a\u094d\u0930\u092f\u094b\u091c\u0928\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{0}] unmodified \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e, HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{1}] \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{0}] unmodified \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e, HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{2}], \u0936\u0930\u0940\u0930 \u0915\u0940 \u0932\u0902\u092c\u093e\u0908 [{3}] \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0936\u0930\u0940\u0930 \u0932\u0902\u092c\u093e\u0908 [{1}], \u0915\u093e \u0938\u0902\u0926\u0947\u0936 \u0926\u093f\u092f\u093e \u0925\u093e\u0964 \u090f\u0915 \u0924\u093f\u0939\u093e\u0908 (\u0917\u0948\u0930-SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u092e\u093e\u0928 \u0909\u0924\u094d\u092a\u094d\u0930\u0947\u0930\u0923) HTTP \u0938\u094d\u0925\u093f\u0924\u093f [{4}], \u0936\u0930\u0940\u0930 \u0915\u0940 \u0932\u0902\u092c\u093e\u0908 [{5}] \u0926\u093f\u092f\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=\u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u092a\u0930\u093f\u0923\u093e\u092e \u092e\u0947\u0902 \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u092c\u0942\u0932\u093f\u092f\u0928 \u0936\u0930\u094d\u0924\u094b\u0902 [{0}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0939\u0947\u0930\u092b\u0947\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0914\u0930 [{1}] {2}stripped \u0924\u0941\u0932\u0928\u093e \u0915\u0947 \u092a\u094d\u0930\u092f\u094b\u091c\u0928\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f \u0906\u0909\u091f\u092a\u0941\u091f HTML \u0938\u0947 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=\u0921\u0947\u091f\u093e \u092e\u0942\u0932 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0932\u093f\u090f \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u0921\u0947\u091f\u093e \u0938\u0940\u092e\u093f\u0924 \u092e\u0942\u0932\u0924\u0903, \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u0947\u0902 \u0939\u0947\u0930-\u092b\u0947\u0930 \u0915\u0930\u0915\u0947 \u0932\u094c\u091f\u093e \u092a\u093e\u092f\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=\u0921\u0947\u091f\u093e \u092e\u0942\u0932 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0932\u093f\u090f \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u092d\u0947\u0926\u094d\u092f\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u0938\u092b\u0932\u0924\u093e\u092a\u0942\u0930\u094d\u0935\u0915 \u0921\u0947\u091f\u093e \u0938\u0940\u092e\u093f\u0924 \u092e\u0942\u0932\u0924\u0903, \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u0947\u0902 \u0939\u0947\u0930-\u092b\u0947\u0930 \u0915\u0930\u0915\u0947 \u0932\u094c\u091f\u093e \u092a\u093e\u092f\u093e \u0925\u093e
ascanrules.testsqlinjection.alert.timebased.extrainfo=\u0915\u094d\u0935\u0947\u0930\u0940 \u0938\u092e\u092f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 [{0}], \u091c\u093f\u0938\u0915\u0947 \u0915\u093e\u0930\u0923 \u091c\u092c \u092e\u0942\u0932\u094d\u092f [{2}] \u0915\u0947 \u0938\u093e\u0925 \u092e\u0942\u0932 unmodified \u0915\u094d\u0935\u0947\u0930\u0940 [{3}] \u092e\u093f\u0932\u0940\u0938\u0947\u0915\u0902\u0921 \u0932\u093f\u092f\u093e [{1}] \u092e\u093f\u0938\u0947, \u0932\u0947 \u0932\u094b \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u091a\u0932\u093e\u092f\u093e \u0939\u0941\u0906 \u0939\u0948 
ascanrules.testsqlinjection.authbypass.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u092c\u093e\u0908\u092a\u093e\u0938
ascanrules.testsqlinjection.authbypass.desc=\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0924\u0902\u0924\u094d\u0930 \u0915\u094b \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u090f\u0915 \u092a\u094d\u0930\u0935\u0947\u0936 \u092a\u0943\u0937\u094d\u0920 \u092a\u0930, \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 

ascanrules.testexternalredirect.name=\u092c\u093e\u0939\u094d\u092f \u092a\u0941\u0928\u0930\u094d\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u0928
ascanrules.testexternalredirect.reason.location.header=\u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0907\u0938\u0915\u093e \u0938\u094d\u0925\u093e\u0928 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 \u091c\u094b \u0915\u093f\u0938\u0940 \u092c\u093e\u0939\u0930\u0940 Url \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u090f\u0915 \u0905\u0928\u0941\u092a\u094d\u0930\u0947\u0937\u093f\u0924 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964
ascanrules.testexternalredirect.reason.location.meta=\u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u090f\u0915 \u092a\u0941\u0928\u0930\u094d\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u0928 \u0905\u092a\u0928\u0947 \u092e\u0947\u091f\u093e http-equiv \u091f\u0948\u0917 \u092e\u0947\u0902 ' \u091c\u094b \u090f\u0915 \u092c\u093e\u0939\u0930\u0940 Url \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0925\u093e\u0928' \u0939\u094b\u0924\u093e \u0939\u0948\u0964
ascanrules.testexternalredirect.reason.refresh.header=\u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092e\u0947\u0902 \u0907\u0938\u0915\u093e \u0938\u094d\u0925\u093e\u0928 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 \u091c\u094b \u0915\u093f\u0938\u0940 \u092c\u093e\u0939\u0930\u0940 Url \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u090f\u0915 \u0905\u0928\u0941\u092a\u094d\u0930\u0947\u0937\u093f\u0924 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964
ascanrules.testexternalredirect.reason.refresh.meta=\u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u090f\u0915 \u092a\u0941\u0928\u0930\u094d\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u0928 \u0905\u092a\u0928\u0947 \u092e\u0947\u091f\u093e http-equiv \u091f\u0948\u0917 \u092e\u0947\u0902 ' \u091c\u094b \u090f\u0915 \u092c\u093e\u0939\u0930\u0940 Url \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0925\u093e\u0928' \u0939\u094b\u0924\u093e \u0939\u0948\u0964
ascanrules.testexternalredirect.reason.javascript=\u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u090f\u0915 \u092a\u0941\u0928\u0930\u094d\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u0928 \u0905\u092a\u0928\u0947 \u091c\u093e\u0935\u093e\u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u0915\u094b\u0921 \u0939\u0948 \u091c\u094b \u0915\u093f\u0938\u0940 \u092c\u093e\u0939\u0930\u0940 Url \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0926\u0947\u0924\u093e \u0939\u0948 \u092e\u0947\u0902 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902\u0964
ascanrules.testexternalredirect.reason.notfound=\u092c\u093f\u0928\u093e \u0915\u093f\u0938\u0940 \u0915\u093e\u0930\u0923 \u0915\u0947 \u0932\u093f\u090f \u092f\u0939 \u092a\u093e\u092f\u093e...

ascanrules.codeinjectionplugin.name=\u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u0915\u094b\u0921 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanrules.codeinjectionplugin.name.asp=Server Side Code Injection - ASP Code Injection
ascanrules.codeinjectionplugin.name.php=Server Side Code Injection - PHP Code Injection
ascanrules.codeinjectionplugin.desc=\u0915\u0938\u094d\u091f\u092e \u0915\u094b\u0921 \u0939\u0948 \u0915\u093f \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f\u093f\u0902\u0917 \u0907\u0902\u091c\u0928 \u0926\u094d\u0935\u093e\u0930\u093e \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u0928 \u0915\u093f\u092f\u093e \u091c\u093e\u090f\u0917\u093e \u0938\u0939\u093f\u0924 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 \u090f\u0915 \u0915\u094b\u0921 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanrules.codeinjectionplugin.soln=\u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u0905\u0917\u0930 \u0935\u0939\u093e\u0901 \u0939\u0948 \u091c\u0917\u0939 \u092e\u0947\u0902 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0938\u0924\u094d\u092f\u093e\u092a\u0928 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f, \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0947\u0964 \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u092e\u0947\u0902, \u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092a\u0930 \u0938\u092d\u0940 \u0921\u0947\u091f\u093e \u0915\u0940 \u091c\u093e\u0901\u091a \u0915\u0930\u0947\u0902 \u0914\u0930 \u0938\u092d\u0940 \u0917\u094d\u0930\u093e\u0939\u0915 \u0938\u0947 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u093e\u091f\u093e \u0938\u0947 \u092c\u091a\u0964 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u0921\u0947\u091f\u093e \u0915\u0947 \u0938\u093e\u0925 \u0938\u0902\u092f\u0941\u0915\u094d\u0924 eval () \u092b\u093c\u0902\u0915\u094d\u0936\u0928 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917 \u0938\u0947 \u092c\u091a\u0947\u0902\u0964
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html https\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation _('Eval_Injection')

ascanrules.testdirectorybrowsing.name=\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u093f\u0902\u0917
ascanrules.testdirectorybrowsing.desc=\u092f\u0939 \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u0932\u093f\u0938\u094d\u091f\u093f\u0902\u0917 \u0926\u0947\u0916\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u0948\u0964  \u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u0932\u093f\u0938\u094d\u091f\u093f\u0902\u0917 \u091b\u0941\u092a\u0947 \u0932\u093f\u092a\u093f\u092f\u094b\u0902 \u0938\u0947 \u092a\u0924\u093e \u091a\u0932\u0924\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0936\u093e\u092e\u093f\u0932 \u0915\u0930\u0947\u0902, \u092c\u0948\u0915\u0905\u092a \u0938\u094d\u0930\u094b\u0924 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0906\u0926\u093f \u091c\u094b \u0938\u0902\u0935\u0947\u0926\u0928\u0936\u0940\u0932 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0915\u094b \u092a\u0922\u093c\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u0939\u0941\u0901\u091a\u093e \u0939\u094b\u0964
ascanrules.testdirectorybrowsing.soln=\u0928\u093f\u0930\u094d\u0926\u0947\u0936\u093f\u0915\u093e \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u093f\u0902\u0917 \u0915\u094b \u0905\u0915\u094d\u0937\u092e \u0915\u0930\u0947\u0902\u0964  \u092f\u0926\u093f \u092f\u0939 \u0906\u0935\u0936\u094d\u092f\u0915 \u0939\u0948, \u0924\u094b \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u0938\u0942\u091a\u0940\u092c\u0926\u094d\u0927 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0928\u0939\u0940\u0902 \u091c\u094b\u0916\u093f\u092e\u094b\u0902 \u0915\u094b \u092a\u094d\u0930\u0947\u0930\u093f\u0924\u0964
ascanrules.testdirectorybrowsing.refs='http\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html 'http\://httpd.apache.org/docs/mod/core.html\#options

ascanrules.testinjectioncrlf.name=CRLF \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanrules.testinjectioncrlf.desc=\u0915\u0941\u0915\u0940 CRLF \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u0947\u091f \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0939\u0948\u0964  \u092f\u0939 \u092d\u0940 \u092e\u0928\u092e\u093e\u0928\u0947 \u0922\u0902\u0917 \u0938\u0947 HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 \u0938\u0947\u091f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964 \u0907\u0938\u0915\u0947 \u0905\u0932\u093e\u0935\u093e, \u0927\u094d\u092f\u093e\u0928 \u0938\u0947 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u0907\u091f \u0938\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u091f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e crafting \u0926\u094d\u0935\u093e\u0930\u093e, \u0915\u0948\u0936 \u0935\u093f\u0937\u093e\u0915\u094d\u0924\u0924\u093e \u091c\u094b\u0916\u093f\u092e \u092d\u0940 \u092e\u094c\u091c\u0942\u0926 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanrules.testinjectioncrlf.soln=\u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u092c\u092e\u093f\u091f \u0915\u093f\u090f \u0917\u090f \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0927\u094d\u092f\u093e\u0928 \u0938\u0947 \u091c\u093e\u0901\u091a \u0915\u0930\u0947\u0902\u0964  CRLF CRLF \u0926\u094d\u0935\u093e\u0930\u093e \u092b\u093c\u093f\u0932\u094d\u091f\u0930\u093f\u0902\u0917 \u0905\u0902\u0924\u0903\u0915\u094d\u0937\u093f\u092a\u094d\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0926\u0947\u0924\u0940\u0902\u0964
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf http\://webappfirewall.com/lib/crlf-injection.txtnull http\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=\u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u091b\u0947\u0921\u093c\u091b\u093e\u0921\u093c
ascanrules.testparametertamper.desc=\u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0939\u0947\u0930\u092b\u0947\u0930 \u090f\u0915 \u0924\u094d\u0930\u0941\u091f\u093f \u092a\u0943\u0937\u094d\u0920 \u092f\u093e \u091c\u093e\u0935\u093e \u0938\u094d\u091f\u0948\u0915 \u091f\u094d\u0930\u0947\u0938 \u092a\u094d\u0930\u0926\u0930\u094d\u0936\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093e\u0930\u0923 \u0939\u0948\u0964  \u092f\u0939 \u0905\u092a\u0935\u093e\u0926 \u0939\u0948\u0902\u0921\u0932\u093f\u0902\u0917 \u0914\u0930 \u0906\u0917\u0947 \u0915\u093e \u092b\u093e\u092f\u0926\u093e \u0909\u0920\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0915\u094d\u0937\u0947\u0924\u094d\u0930\u094b\u0902 \u0915\u0940 \u0915\u092e\u0940 \u0915\u0947 \u0938\u0902\u0915\u0947\u0924 \u0926\u093f\u092f\u093e\u0964
ascanrules.testparametertamper.soln=\u0924\u094d\u0930\u0941\u091f\u093f \u0915\u0947 \u0915\u093e\u0930\u0923 \u0915\u094b \u092a\u0939\u091a\u093e\u0928\u0928\u0947 \u0914\u0930 \u0907\u0938\u0947 \u0920\u0940\u0915 \u0915\u0930\u0947\u0902\u0964  \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0915\u0930\u094b \u0914\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092e\u0947\u0902 \u090f\u0915 \u0924\u0902\u0917 \u091a\u0947\u0915 \u092a\u094d\u0930\u0935\u0930\u094d\u0924\u093f\u0924\u0964  \u0907\u0938\u0915\u0947 \u0905\u0932\u093e\u0935\u093e, \u0905\u092a\u0935\u093e\u0926 \u0920\u0940\u0915 \u0938\u0947 \u092a\u0915\u0921\u093c\u0928\u093e\u0964  \u0906\u0902\u0924\u0930\u093f\u0915 \u0938\u0930\u094d\u0935\u0930 \u0924\u094d\u0930\u0941\u091f\u093f \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 \u091c\u0947\u0928\u0947\u0930\u093f\u0915 500 \u0924\u094d\u0930\u0941\u091f\u093f \u092a\u0943\u0937\u094d\u0920 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964

ascanrules.testpathtraversal.name=\u092a\u0925 Traversal

ascanrules.testremotefileinclude.name=\u0926\u0942\u0930\u0938\u094d\u0925 \u092b\u093c\u093e\u0907\u0932 \u0938\u092e\u093e\u0935\u0947\u0936

ascanrules.testserversideinclude.name=\u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902
ascanrules.testserversideinclude.desc=\u0915\u0941\u091b \u092e\u093e\u092a\u0926\u0902\u0921\u094b\u0902 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902 \u0915\u092e\u093e\u0902\u0921 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093e\u0930\u0923 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964  \u0907\u0938 \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0915\u0928\u0947\u0915\u094d\u0936\u0928 \u092f\u093e \u092e\u0928\u092e\u093e\u0928\u093e \u0915\u094b\u0921 \u0928\u093f\u0937\u094d\u092a\u093e\u0926\u093f\u0924 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u092e\u0924\u093f \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964
ascanrules.testserversideinclude.soln=\u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0915\u0930\u094b \u0914\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092e\u0947\u0902 \u090f\u0915 \u0924\u0902\u0917 \u091a\u0947\u0915 \u092a\u094d\u0930\u0935\u0930\u094d\u0924\u093f\u0924\u0964 \u0905\u0915\u094d\u0937\u092e \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092d\u0940 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0964\n
Refer=\u0905\u0915\u094d\u0937\u092e \u0924\u094b\u0921\u093c \u0938\u093e\u0907\u0921 \u0936\u093e\u092e\u093f\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092e\u0948\u0928\u0941\u0905\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f\u0964 \u0906\u092a\u0915\u0947 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092f\u093e \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u094b \u091a\u0932\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u092e \u0938\u0947 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 Apache \u0915\u0947 \u0932\u093f\u090f, \u0928\u093f\u092e\u094d\u0928\u0932\u093f\u0916\u093f\u0924 \u0915\u094b \u0905\u0915\u094d\u0937\u092e \u0915\u0930\u0947\u0902\: \u0935\u093f\u0915\u0932\u094d\u092a \u0905\u0928\u0941\u0915\u094d\u0930\u092e\u0923\u093f\u0915\u093e\u0913\u0902 FollowSymLinks AddType \u092d\u0940 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917/x-httpd-cgi .cgi AddType \u092a\u093e\u0920/\u090f\u0915\u094d\u0938-\u0938\u0930\u094d\u0935\u0930-\u092a\u093e\u0930\u094d\u0938-html. html
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

