#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=\u0642\u0648\u0627\u0646\u06cc\u0646 \u0627\u06a9\u062a\u06cc\u0648 \u0627\u0633\u06a9\u0646

ascanrules.bufferoverflow.name=\u0633\u0631\u0631\u06cc\u0632 \u0628\u0627\u0641\u0631
ascanrules.bufferoverflow.desc=\u062e\u0637\u0627\u0647\u0627\u06cc \u0633\u0631\u0631\u06cc\u0632 \u0628\u0627\u0641\u0631 \u062a\u0648\u0633\u0637 \u0628\u0627\u0632\u0646\u0648\u06cc\u0633\u06cc \u0641\u0636\u0627\u0647\u0627\u06cc \u062d\u0627\u0641\u0638\u0647 \u0641\u0631\u0622\u06cc\u0646\u062f \u067e\u0633 \u0632\u0645\u06cc\u0646\u0647 \u0648\u0628 \u0645\u0634\u062e\u0635 \u0645\u06cc \u0634\u0648\u062f\u060c \u06a9\u0647 \u0646\u0628\u0627\u06cc\u062f \u0628\u0647 \u0635\u0648\u0631\u062a \u0639\u0645\u062f\u06cc \u0648\u06cc\u0627 \u063a\u06cc\u0631 \u0639\u0645\u062f\u06cc \u0627\u0635\u0644\u0627\u062d \u0634\u0648\u0646\u062f. \u0645\u0642\u0627\u062f\u06cc\u0631 \u0628\u0627\u0632\u0646\u0648\u06cc\u0633\u06cc IP (\u0646\u0634\u0627\u0646\u06af\u0631 \u062f\u0633\u062a\u0648\u0631\u0627\u0644\u0639\u0645\u0644)\u060cBP (\u0646\u0634\u0627\u0646\u06af\u0631 \u067e\u0627\u06cc\u0647) \u0648 \u062f\u06cc\u06af\u0631 \u062b\u0628\u0627\u062a \u06cc\u0627 \u0631\u062c\u06cc\u0633\u062a\u0631\u0647\u0627 \u0645\u0648\u062c\u0628 \u0627\u0633\u062a\u062b\u0646\u0627\u060c \u062a\u0642\u0633\u06cc\u0645 \u0634\u062f\u0646 \u0639\u06cc\u0648\u0628 \u0648 \u0633\u0627\u06cc\u0631 \u062e\u0637\u0627\u0647\u0627\u06cc \u067e\u0631\u062f\u0627\u0632\u0634\u06cc \u0645\u06cc \u0634\u0648\u0646\u062f. \u0645\u0639\u0645\u0648\u0644\u0627 \u0627\u06cc\u0646 \u062e\u0637\u0627\u0647\u0627 \u0627\u062c\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u0647 \u0631\u0648\u0634\u06cc \u063a\u06cc\u0631\u0645\u0646\u062a\u0638\u0631\u0647 \u067e\u0627\u06cc\u0627\u0646 \u0645\u06cc \u062f\u0647\u0646\u062f. 
ascanrules.bufferoverflow.soln=\u0628\u0631\u0646\u0627\u0645\u0647 \u067e\u0633 \u0632\u0645\u06cc\u0646\u0647 \u0631\u0627 \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0628\u0631\u0631\u0633\u06cc \u0648\u06cc\u0698\u0647 \u0637\u0648\u0644 \u0628\u0627\u0632\u06af\u0634\u062a \u0628\u0627\u0632\u0646\u0648\u06cc\u0633\u06cc \u06a9\u0646\u06cc\u062f. \u0627\u06cc\u0646 \u0646\u06cc\u0627\u0632\u0645\u0646\u062f \u06a9\u0627\u0645\u067e\u0627\u06cc\u0644 \u0645\u062c\u062f\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \u067e\u0633 \u0632\u0645\u06cc\u0646\u0647 \u0642\u0627\u0628\u0644 \u0627\u062c\u0631\u0627 \u062e\u0648\u0627\u0647\u062f \u0628\u0648\u062f.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=\u067e\u062a\u0627\u0646\u0633\u06cc\u0644 \u0633\u0631\u0631\u06cc\u0632 \u0628\u0627\u0641\u0631. \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u062a\u0635\u0627\u0644 \u0631\u0627 \u0642\u0637\u0639 \u06a9\u0631\u062f \u0648 \u0645\u0648\u062c\u0628 500 \u062e\u0637\u0627\u06cc \u0633\u0631\u0648\u0631 \u062f\u0627\u062e\u0644\u06cc \u0634\u062f


ascanrules.commandinjectionplugin.name=\u06a9\u0646\u062a\u0631\u0644 \u0627\u0632 \u0631\u0627\u0647 \u062f\u0648\u0631 \u0633\u06cc\u0633\u062a\u0645 \u0639\u0627\u0645\u0644 \u0641\u0631\u0645\u0627\u0646 \u062a\u0632\u0631\u06cc\u0642
ascanrules.commandinjectionplugin.desc=\u062a\u06a9\u0646\u06cc\u06a9 \u062d\u0645\u0644\u0647 \u0628\u0631\u0627\u06cc \u0627\u062c\u0631\u0627\u06cc \u063a\u06cc\u0631\u0645\u062c\u0627\u0632 \u0641\u0631\u0645\u0627\u0646 \u0647\u0627\u06cc \u0633\u06cc\u0633\u062a\u0645 \u0639\u0627\u0645\u0644 \u0645\u0648\u0631\u062f \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0642\u0631\u0627\u0631 \u0645\u06cc \u06af\u06cc\u0631\u062f. \u0627\u06cc\u0646 \u062d\u0645\u0644\u0647 \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0632\u0645\u0627\u0646\u06cc \u0631\u062e \u062f\u0647\u062f \u06a9\u0647 \u06cc\u06a9 \u0628\u0631\u0646\u0627\u0645\u0647 \u0648\u0631\u0648\u062f\u06cc \u0627\u06cc \u0646\u0627\u0645\u0639\u062a\u0628\u0631 \u0628\u0631\u0627\u06cc \u0633\u0627\u062e\u062a \u0633\u06cc\u0633\u062a\u0645 \u0639\u0627\u0645\u0644 \u0628\u0647 \u0634\u06cc\u0648\u0647 \u0627\u06cc \u0646\u0627 \u0627\u0645\u0646 \u0642\u0628\u0648\u0644 \u0645\u06cc \u06a9\u0646\u062f \u0634\u0627\u0645\u0644 \u067e\u0627\u06a9 \u0633\u0627\u0632\u06cc \u0646\u0627\u062f\u0631\u0633\u062a \u062f\u0627\u062f\u0647 \u0648 \u06cc\u0627 \u0627\u0646\u062a\u0642\u0627\u0644 \u0646\u0627\u062f\u0631\u0633\u062a \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc \u062e\u0631\u0648\u062c\u06cc.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html\nhttps\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=\u062e\u0637\u0627\u06cc \u0642\u0627\u0644\u0628 \u0631\u0634\u062a\u0647
ascanrules.formatstring.desc=\u062e\u0637\u0627\u06cc \u0631\u0634\u062a\u0647 \u0641\u0631\u0645\u062a \u0632\u0645\u0627\u0646\u06cc \u0631\u062e \u0645\u06cc \u062f\u0647\u062f \u06a9\u0647 \u062f\u0627\u062f\u0647 \u0647\u0627\u06cc \u0627\u0631\u0627\u0626\u0647 \u0634\u062f\u0647 \u06cc \u06cc\u06a9 \u0631\u0634\u062a\u0647 \u0648\u0631\u0648\u062f\u06cc \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u06cc\u06a9 \u062f\u0633\u062a\u0648\u0631 \u062a\u0648\u0633\u0637 \u0628\u0631\u0646\u0627\u0645\u0647 \u0633\u0646\u062c\u06cc\u062f\u0647 \u0645\u06cc \u0634\u0648\u062f. 
ascanrules.formatstring.soln=\u0628\u0631\u0646\u0627\u0645\u0647 \u067e\u0633 \u0632\u0645\u06cc\u0646\u0647 \u0631\u0627 \u0628\u0627 \u0627\u0633\u062a\u0641\u062a\u062f\u0647 \u0627\u0632 \u062d\u0630\u0641 \u0645\u0646\u0627\u0633\u0628 \u0631\u0634\u062a\u0647 \u0647\u0627\u06cc \u06a9\u0627\u0631\u0627\u06a9\u062a\u0631 \u0628\u062f \u0628\u0627\u0632\u0646\u0648\u06cc\u0633\u06cc \u06a9\u0646\u06cc\u062f. \u0627\u06cc\u0646 \u0646\u06cc\u0627\u0632\u0645\u0646\u062f \u06a9\u0627\u0645\u067e\u0627\u06cc\u0644 \u0645\u062c\u062f\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \u067e\u0633 \u0632\u0645\u06cc\u0646\u0647 \u0642\u0627\u0628\u0644 \u0627\u062c\u0631\u0627 \u0645\u06cc \u0628\u0627\u0634\u062f.
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=\u067e\u062a\u0627\u0646\u0633\u06cc\u0644 \u062e\u0637\u0627 \u0631\u0634\u062a\u0647 \u0641\u0631\u0645\u062a. \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u062a\u0635\u0627\u0644 \u0631\u0627 \u062f\u0631 %s \u0628\u0633\u062a
ascanrules.formatstring.error2=\u067e\u062a\u0627\u0646\u0633\u06cc\u0644 \u062e\u0637\u0627 \u0631\u0634\u062a\u0647 \u0641\u0631\u0645\u062a. \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u062a\u0635\u0627\u0644 \u0631\u0627 \u062f\u0631 %s \u0648 %x \u0628\u0633\u062a
ascanrules.formatstring.error3=\u067e\u062a\u0627\u0646\u0633\u06cc\u0644 \u062e\u0637\u0627 \u0631\u0634\u062a\u0647 \u0641\u0631\u0645\u062a. \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u062a\u0635\u0627\u0644 \u0631\u0627 \u062f\u0631\u06cc\u06a9 \u062e\u0637\u0627\u06cc \u0631\u0634\u062a\u0647 \u0641\u0631\u0645\u062a \u0645\u0627\u06cc\u06a9\u0631\u0648\u0633\u0627\u0641\u062a \u0628\u0633\u062a


ascanrules.testscrosssitescriptv2.name=\u062a\u0642\u0627\u0628\u0644 \u0633\u0627\u06cc\u062a \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a (\u0627\u0646\u0639\u06a9\u0627\u0633)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=\u0627\u0637\u0645\u06cc\u0646\u0627\u0646 \u0636\u0639\u06cc\u0641 \u0645\u0637\u0631\u062d \u0634\u062f\u0647 \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0645\u062d\u062a\u0648\u0627-\u0646\u0648\u0639 HTML \u0646\u06cc\u0633\u062a

ascanrules.testpersistentxssattack.name=\u062a\u0642\u0627\u0628\u0644 \u0633\u0627\u06cc\u062a \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a (\u062f\u0648\u0627\u0645)
ascanrules.testpersistentxssattack.otherinfo=\u0645\u0646\u0628\u0639 \u0622\u062f\u0631\u0633\: {0}

ascanrules.testpersistentxssprime.name=\u062a\u0642\u0627\u0628\u0644 \u0633\u0627\u06cc\u062a \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a (\u062f\u0648\u0627\u0645) - \u0627\u0648\u0644\u06cc\u0647
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (Persistent) - Spider
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=SQL Injection
ascanrules.testsqlinjection.desc=\u062a\u0632\u0631\u06cc\u0642 SQL (\u0632\u0628\u0627\u0646 \u067e\u0631\u0633 \u0648 \u062c\u0648\u06cc \u0633\u0627\u062e\u062a\u0627\u0631\u06cc) \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u06cc\u0633\u0631 \u0634\u0648\u062f.
ascanrules.testsqlinjection.soln=\u0628\u0647 \u0627\u0639\u062a\u0628\u0627\u0631 \u0648\u0631\u0648\u062f\u06cc \u0645\u062a\u0642\u0627\u0636\u06cc \u0627\u0639\u062a\u0645\u0627\u062f \u0646\u06a9\u0646\u06cc\u062f\u060c \u062d\u062a\u06cc \u0627\u06af\u0631 \u0627\u0639\u062a\u0628\u0627\u0631 \u0633\u0646\u062c\u06cc \u0633\u0645\u062a \u0645\u062a\u0642\u0627\u0636\u06cc \u0648\u062c\u0648\u062f \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u062f.  \n\u0628\u0647 \u0637\u0648\u0631 \u06a9\u0644\u06cc\u060c \u062a\u0627\u06cc\u067e \u0647\u0645\u0647 \u062f\u0627\u062f\u0647 \u0647\u0627 \u0631\u0627 \u0627\u0632 \u0633\u0631\u0648\u0631 \u0686\u06a9 \u06a9\u0646\u06cc\u062f.\n\u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0632 JDBC \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u062f\u060c \u0627\u0632 \u062f\u0633\u062a\u0648\u0631\u0639\u0645\u0644 \u0622\u0645\u0627\u062f\u0647 \u06cc\u0627 \u062f\u0633\u062a\u0648\u0631\u0639\u0645\u0644 \u0641\u0631\u0627\u062e\u0648\u0627\u0646\u062f\u0646\u06cc\u060c \u0628\u0627 \u0627\u0646\u062a\u0642\u0627\u0644 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0647\u0627 \u062a\u0648\u0633\u0637 "\u061f" \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f.\n\u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0632 ASP \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc \u06a9\u0646\u062f\u060c \u0627\u0632 \u06a9\u062f\u0647\u0627\u06cc \u062f\u0633\u062a\u0648\u0631 ADO \u0628\u0627 \u0686\u06a9 \u06a9\u0631\u062f\u0646 \u0642\u0648\u06cc \u0648 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0633\u0627\u0632\u06cc \u0627\u06cc\u0631\u0627\u062f \u0647\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f.\n\u0627\u06af\u0631 \u0645\u06cc \u062a\u0648\u0627\u0646 \u0627\u0632 \u0631\u0648\u0634 \u0630\u062e\u06cc\u0631\u0647 \u0634\u062f\u0647 \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0631\u062f\u060c \u0627\u0632 \u0622\u0646\u0647\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f.\n\u0631\u0634\u062a\u0647 \u0647\u0627\u06cc *not* \u062f\u0627\u062e\u0644 \u0627\u06cc\u0631\u0627\u062f \u0647\u0627 \u062f\u0631 \u067e\u0631\u062f\u0627\u0632\u0647 \u0630\u062e\u06cc\u0631\u0647 \u0634\u062f\u0647 \u0631\u0627 \u0628\u0647 \u0647\u0645 \u067e\u06cc\u0648\u0633\u062a\u0647 \u06a9\u0646\u06cc\u062f\u060c \u06cc\u0627 \u0627\u0632  'exec', 'exec immediate'\u060c \u0648\u06cc\u0627 \u0627\u0632 \u0645\u0639\u0627\u062f\u0644 \u0647\u0627\u06cc \u0622\u0646 \u0647\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f.\n\u0627\u06cc\u0631\u0627\u062f \u0647\u0627\u06cc SQL \u062f\u06cc\u0646\u0627\u0645\u06cc\u06a9 \u0631\u0627 \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u067e\u06cc\u0648\u0646\u062f \u0631\u0634\u062a\u0647 \u0627\u06cc \u0633\u0627\u062f\u0647 \u0627\u06cc\u062c\u0627\u062f \u0646\u06a9\u0646\u06cc\u062f.\n\u0627\u0632 \u062a\u0645\u0627\u0645\u06cc \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u062f\u0631\u06cc\u0627\u0641\u062a \u0634\u062f\u0647 \u0627\u0632 \u0645\u062a\u0642\u0627\u0636\u06cc \u062e\u0644\u0627\u0635 \u0634\u0648\u06cc\u062f.\n\u06cc\u06a9 "\u0644\u06cc\u0633\u062a \u0633\u0641\u06cc\u062f" \u0627\u0632 \u06a9\u0627\u0631\u0627\u06a9\u062a\u0631\u0647\u0627\u06cc \u0645\u062c\u0627\u0632 \u06cc\u0627 \u06cc\u06a9 "\u0644\u06cc\u0633\u062a \u0633\u06cc\u0627\u0647" \u0627\u0632 \u06a9\u0627\u0631\u0627\u06a9\u062a\u0631\u0647\u0627\u06cc \u0647\u0627\u06cc \u063a\u06cc\u0631 \u0645\u062c\u0627\u0632 \u062f\u0631 \u0648\u0631\u0648\u062f\u06cc \u06a9\u0627\u0631\u0628\u0631 \u0627\u0639\u0645\u0627\u0644 \u06a9\u0646\u06cc\u062f.\n\u062a\u0627 \u062c\u0627\u06cc\u06cc \u06a9\u0647 \u0627\u0645\u06a9\u0627\u0646 \u062f\u0627\u0631\u062f \u0627\u0635\u0644 \u0627\u062e\u062a\u06cc\u0627\u0631 \u062d\u062f\u0627\u0642\u0644 \u062f\u0631 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u0631\u0627 \u0628\u0631\u0627\u06cc \u06a9\u0627\u0631\u0628\u0631 \u0627\u0639\u0645\u0627\u0644 \u06a9\u0646\u06cc\u062f.\n\u062c\u062f\u0627\u060c \u0627\u0632 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 "sa" \u06cc\u0627 "db-owner" \u0627\u062c\u062a\u0646\u0627\u0628 \u06a9\u0646\u06cc\u062f.\n\u0627\u06cc\u0646 \u0645\u0648\u062c\u0628 \u062d\u0630\u0641 \u062a\u0632\u0631\u06cc\u0642 SQL \u0646\u0645\u06cc \u0634\u0648\u062f\u060c \u0627\u0645\u0627 \u062a\u0627\u062b\u06cc\u0631 \u0622\u0646 \u0631\u0627 \u0628\u0647 \u062d\u062f\u0627\u0642\u0644 \u0645\u06cc \u0631\u0633\u0627\u0646\u062f.\n\u062d\u062f\u0627\u0642\u0644 \u062f\u0633\u062a\u0631\u0633\u06cc \u0628\u0647 \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u0631\u0627 \u06a9\u0647 \u0628\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0636\u0631\u0648\u0631\u06cc \u0627\u0633\u062a\u060c \u0627\u0631\u0627\u0626\u0647 \u062f\u0647\u06cc\u062f.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=\u0641\u06cc\u0644\u062f [{0}]\: [{1}] \u0645\u0642\u062f\u0627\u0631 [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=\u0645\u0642\u062f\u0627\u0631 \u0627\u0648\u0644\u06cc\u0647\: {0}. \u0645\u0642\u062f\u0627\u0631 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647\: {1}. \u0645\u0642\u062f\u0627\u0631 \u06a9\u0646\u062a\u0631\u0644\: {2}
ascanrules.testsqlinjection.alert.booleanbased.attack=\u0641\u06cc\u0644\u062f [{0}]\: [{1}] \u0645\u0642\u062f\u0627\u0631 [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=\u0641\u06cc\u0644\u062f [{0}]\: [{1}] \u0645\u0642\u062f\u0627\u0631 [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] \u0627\u062d\u062a\u0645\u0627\u0644\u06cc\u060c \u0639\u0628\u0627\u0631\u062a \u0639\u0627\u062f\u06cc \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627 {1} \u0645\u0637\u0627\u0628\u0642 \u0628\u0627 \u0646\u062a\u0627\u06cc\u062c HTML \u0631\u0627 \u0645\u06cc \u062f\u0647\u062f. \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0628\u0627 \u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0634\u0646\u0627\u0633\u0627\u06cc\u06cc \u0634\u062f \u062a\u0627 \u0639\u0644\u062a \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627\u06cc \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u0631\u0627 \u0628\u0627\u0632\u06af\u0631\u062f\u0627\u0646\u062f\u0647 \u0648 \u0634\u0646\u0627\u0633\u0627\u06cc\u06cc \u06a9\u0646\u062f
ascanrules.testsqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] \u0627\u062d\u062a\u0645\u0627\u0644\u06cc\u060c \u0639\u0628\u0627\u0631\u062a \u0639\u0627\u062f\u06cc \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627 UNION-specific {1} \u0647\u0645\u0627\u0647\u0646\u06af \u0634\u062f\u0647 \u0628\u0627 \u0646\u062a\u0627\u06cc\u062c HTML \u0631\u0627 \u0645\u06cc \u062f\u0647\u062f\n\u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0628\u0627 \u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u06cc\u06a9 \u0628\u0646\u062f "SQL" UNION \u0628\u0631\u0627\u06cc \u062a\u0634\u062e\u06cc\u0635 \u06cc\u06a9 \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627\u06cc \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u06af\u0632\u0627\u0631\u0634 \u0648 \u0634\u0646\u0627\u0633\u0627\u06cc\u06cc \u0634\u062f
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=\u0646\u062a\u0627\u06cc\u062c \u0635\u0641\u062d\u0647 \u0627\u0635\u0644\u06cc \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0639\u0628\u0627\u0631\u062a {0} \u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0628\u0627 \u0645\u0648\u0641\u0642\u06cc\u062a \u062a\u06a9\u0631\u0627\u0631 \u0634\u062f\u0646\u062f\n\u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 {1} \u0627\u0632 \u062e\u0631\u0648\u062c\u06cc HTML \u0628\u0631\u0627\u06cc \u0645\u0642\u0627\u06cc\u0633\u0647 \u0627\u0633\u062a\u0631\u06cc\u067e \u0634\u062f
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=\u0646\u062a\u0627\u06cc\u062c \u0635\u0641\u062d\u0647 \u0627\u0635\u0644\u06cc \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0639\u0628\u0627\u0631\u062a "ORDER BY"{0} \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u062c\u0627\u06cc\u06af\u0630\u0627\u0631\u06cc \u0634\u062f\u0646\u062f\n\u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 {1} \u0627\u0632 \u062e\u0631\u0648\u062c\u06cc HTML \u0628\u0627 \u0647\u062f\u0641 \u0645\u0642\u0627\u06cc\u0633\u0647 \u0627\u0633\u062a\u0631\u06cc\u067e \u0634\u062f
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=\u067e\u06cc\u0627\u0645 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 \u0648\u0636\u0639\u06cc\u062a HTTP {0} \u0631\u0627 \u0645\u06cc \u062f\u0647\u062f\u060c \u067e\u06cc\u0627\u0645 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 \u0648\u0636\u0639\u06cc\u062a HTTP{1} \u0631\u0627 \u0645\u06cc \u062f\u0647\u062f
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=\u067e\u06cc\u0627\u0645 \u0627\u0635\u0644\u0627\u062d \u0646\u0634\u062f\u0647 \u0648\u0636\u0639\u06cc\u062a HTTP {0} \u0631\u0627 \u062f\u0627\u062f\u0647 \u0627\u0633\u062a\u060c \u0637\u0648\u0644 \u0628\u062f\u0646\u0647 {1}\u060c \u067e\u06cc\u0627\u0645 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 \u0648\u0636\u0639\u06cc\u062a HTTP {2} \u0631\u0627 \u062f\u0627\u062f\u0647 \u0627\u0633\u062a\u060c \u0637\u0648\u0644 \u0628\u062f\u0646\u0647 {3}. \u0633\u0648\u0645 (\u0645\u0642\u062f\u0627\u0631 \u0642\u06cc\u0627\u0633\u06cc \u062a\u0632\u0631\u06cc\u0642 \u063a\u06cc\u0631 SQL) \u0648\u0636\u0639\u06cc\u062a HTTP{4} \u0631\u0627 \u0628\u0627 \u0637\u0648\u0644 \u0628\u062f\u0646\u0647 {5} \u062f\u0627\u062f\u0647 \u0627\u0633\u062a
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=\u0646\u062a\u0627\u06cc\u062c \u0635\u0641\u062d\u0647 \u0627\u0635\u0644\u06cc \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0645\u0648\u0642\u0639\u06cc\u062a \u0647\u0627\u06cc boolean {0} \u0648{1} \u0628\u0627 \u0645\u0648\u0641\u0642\u06cc\u062a \u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u0634\u062f\u0646\u062f\n\u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0627\u0635\u0644\u0627\u062d \u0634\u062f\u0647 {2} \u0627\u0632 \u062e\u0631\u0648\u062c\u06cc HTML \u0628\u0631\u0627\u06cc \u0645\u0642\u0627\u06cc\u0633\u0647 \u0627\u0633\u062a\u0631\u06cc\u067e \u0634\u062f
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=\u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0628\u0647 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0647\u0627\u06cc \u0627\u0635\u0644\u06cc \u0628\u0627\u0632\u06af\u0634\u062a\u0647 \u0628\u0648\u062f\u0646\u062f.\n\u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0628\u0627 \u0645\u062d\u062f\u0648\u062f \u06a9\u0631\u062f\u0646 \u0645\u0648\u0641\u0642\u06cc\u062a \u0622\u0645\u06cc\u0632 \u062f\u0627\u062f\u0647 \u0627\u0648\u0644\u06cc\u0647 \u0628\u0631\u06af\u0634\u062a\u06cc \u062a\u0648\u0633\u0637 \u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0645\u0634\u062e\u0635 \u0634\u062f
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=\u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0628\u0631\u0627\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0627\u0635\u0644\u06cc \u0628\u0627\u0632\u06af\u0631\u062f\u0627\u0646\u062f\u0647 \u0646\u0634\u062f\u0646\u062f.\n\u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0628\u0627 \u0628\u0627\u0632\u06cc\u0627\u0628\u06cc \u0645\u0648\u0641\u0642\u06cc\u062a \u0622\u0645\u06cc\u0632 \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0628\u0633\u06cc\u0627\u0631\u06cc \u06a9\u0647 \u062f\u0631 \u0622\u063a\u0627\u0632 \u062a\u0648\u0633\u0637 \u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0628\u0627\u0632\u06cc\u0627\u0628\u06cc \u0634\u062f\u0647 \u0628\u0648\u062f\u0646\u062f\u060c \u0645\u0634\u062e\u0635 \u0634\u062f
ascanrules.testsqlinjection.alert.timebased.extrainfo=\u0632\u0645\u0627\u0646 query(\u0631\u0648\u0646\u062f \u0627\u0633\u062a\u062e\u0631\u0627\u062c \u062f\u0627\u062f\u0647 \u0647\u0627 \u0627\u0632 \u067e\u0627\u06cc\u06af\u0627\u0647 \u0648 \u0628\u0647 \u06a9\u0627\u0631 \u06af\u06cc\u0631\u06cc \u0622\u0646 \u0647\u0627) \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0645\u0642\u062f\u0627\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u0642\u0627\u0628\u0644 \u06a9\u0646\u062a\u0631\u0644 \u0627\u0633\u062a\u060c \u06a9\u0647 \u0645\u0648\u062c\u0628 \u0634\u062f \u062f\u0631\u062e\u0648\u0627\u0633\u062a {1} \u0645\u06cc\u0644\u06cc \u062b\u0627\u0646\u06cc\u0647 \u0628\u06af\u06cc\u0631\u062f\u060c \u0632\u0645\u0627\u0646\u06cc \u06a9\u0647 query \u0627\u0635\u0644\u0627\u062d \u0646\u0634\u062f\u0647 \u0627\u0635\u0644\u06cc \u0628\u0627 \u0645\u0642\u062f\u0627\u0631 {2} {3} \u0645\u06cc\u0644\u06cc \u062b\u0627\u0646\u06cc\u0647 \u0645\u06cc\u06af\u06cc\u0631\u062f 
ascanrules.testsqlinjection.authbypass.name=\u062a\u0632\u0631\u06cc\u0642 SQL - \u0634\u0646\u0627\u0633\u0627\u06cc\u06cc \u0645\u0633\u06cc\u0631 \u0641\u0631\u0639\u06cc
ascanrules.testsqlinjection.authbypass.desc=\u062a\u0632\u0631\u06cc\u0642 SQL \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u062f\u0631 \u06cc\u06a9 \u0635\u0641\u062d\u0647 \u0648\u0631\u0648\u062f\u06cc \u0645\u06cc\u0633\u0631 \u0634\u0648\u062f\u060c \u0628\u0627\u0644\u0642\u0648\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc \u062f\u0647\u062f \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u0639\u062a\u0628\u0627\u0631 \u0633\u0646\u062c\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u06a9\u0646\u0627\u0631 \u06af\u0630\u0627\u0634\u062a\u0647 \u0634\u0648\u062f 

ascanrules.testexternalredirect.name=\u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062e\u0627\u0631\u062c\u06cc
ascanrules.testexternalredirect.reason.location.header=\u067e\u0627\u0633\u062e \u0634\u0627\u0645\u0644 \u06cc\u06a9 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062f\u0631 \u0645\u06a9\u0627\u0646 header \u0627\u0633\u062a \u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc\u062f\u0647\u062f Url \u062e\u0631\u0648\u062c\u06cc \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f.
ascanrules.testexternalredirect.reason.location.meta=\u067e\u0627\u0633\u062e \u0634\u0627\u0645\u0644 \u06cc\u06a9 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062f\u0631 \u062a\u06af meta http-equiv \u0628\u0631\u0627\u06cc "\u0645\u06a9\u0627\u0646" \u0627\u0633\u062a \u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc\u062f\u0647\u062f Url \u062e\u0631\u0648\u062c\u06cc \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f.
ascanrules.testexternalredirect.reason.refresh.header=\u067e\u0627\u0633\u062e \u0634\u0627\u0645\u0644 \u06cc\u06a9 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062f\u0631 \u0646\u0648\u0633\u0627\u0632\u06cc header \u0627\u0633\u062a \u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc \u062f\u0647\u062f Url \u062e\u0631\u0648\u062c\u06cc \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f.
ascanrules.testexternalredirect.reason.refresh.meta=\u067e\u0627\u0633\u062e \u0634\u0627\u0645\u0644 \u06cc\u06a9 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062f\u0631 \u062a\u06af meta http-equiv \u0628\u0631\u0627\u06cc "\u0646\u0648\u0633\u0627\u0632\u06cc" \u0627\u0633\u062a \u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc\u062f\u0647\u062f Url \u062e\u0631\u0648\u062c\u06cc \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f.
ascanrules.testexternalredirect.reason.javascript=\u067e\u0627\u0633\u062e \u0634\u0627\u0645\u0644 \u06cc\u06a9 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062f\u0631 \u06a9\u062f \u062c\u0627\u0648\u0627 \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u0633\u062a \u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc \u062f\u0647\u062f Url \u062e\u0631\u0648\u062c\u06cc \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f.
ascanrules.testexternalredirect.reason.notfound=\u0647\u06cc\u0686 \u062f\u0644\u06cc\u0644\u06cc \u0628\u0631\u0627\u06cc \u0622\u0646 \u06cc\u0627\u0641\u062a...

ascanrules.codeinjectionplugin.name=\u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f \u0633\u0645\u062a \u0633\u0631\u0648\u0631
ascanrules.codeinjectionplugin.name.asp=\u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f \u0633\u0645\u062a \u0633\u0631\u0648\u0631 -- \u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f ASP
ascanrules.codeinjectionplugin.name.php=\u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f \u0633\u0645\u062a \u0633\u0631\u0648\u0631 - \u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f PHP
ascanrules.codeinjectionplugin.desc=\u062a\u0632\u0631\u06cc\u0642 \u06a9\u062f \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0634\u0627\u0645\u0644 \u06a9\u062f \u0633\u0641\u0627\u0631\u0634\u06cc \u0628\u0627\u0634\u062f \u06a9\u0647 \u062a\u0648\u0633\u0637 \u0645\u0648\u062a\u0648\u0631 \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0627\u0631\u0632\u06cc\u0627\u0628\u06cc \u0634\u0648\u062f
ascanrules.codeinjectionplugin.soln=\u0628\u0647 \u0648\u0631\u0648\u062f\u06cc \u0645\u062a\u0642\u0627\u0636\u06cc \u062d\u062a\u06cc \u0627\u06af\u0631 \u0627\u0639\u062a\u0628\u0627\u0631 \u0633\u0646\u062c\u06cc \u062f\u0631 \u0633\u0645\u062a \u0622\u0646 \u0648\u062c\u0648\u062f \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u062f\u060c \u0627\u0639\u062a\u0645\u0627\u062f \u0646\u06a9\u0646\u06cc\u062f.\n\u0628\u0647 \u0637\u0648\u0631 \u06a9\u0644\u06cc\u060c \u062a\u0627\u06cc\u067e \u0647\u0645\u0647 \u062f\u0627\u062f\u0647 \u0647\u0627 \u0631\u0627 \u0627\u0632 \u0633\u0645\u062a \u0633\u0631\u0648\u0631 \u0686\u06a9 \u06a9\u0646\u06cc\u062f \u0648 \u0627\u0632 \u062a\u0645\u0627\u0645\u06cc \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u062f\u0631\u06cc\u0627\u0641\u062a \u0634\u062f\u0647 \u0627\u0632 \u0645\u0634\u062a\u0631\u06cc \u0627\u062c\u062a\u0646\u0627\u0628 \u06a9\u0646\u06cc\u062f.\n \u0627\u0632 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u062a\u0648\u0627\u0628\u0639 eval() \u062a\u0631\u06a9\u06cc\u0628 \u0634\u062f\u0647 \u0628\u0627 \u062f\u0627\u062f\u0647 \u0648\u0631\u0648\u062f\u06cc \u06a9\u0627\u0631\u0628\u0631 \u062f\u0648\u0631\u06cc \u06a9\u0646\u06cc\u062f.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html\nhttps\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection')

ascanrules.testdirectorybrowsing.name=\u0645\u0631\u0648\u0631 \u062f\u0627\u06cc\u0631\u06a9\u062a\u0648\u0631\u06cc \u0647\u0627
ascanrules.testdirectorybrowsing.desc=\u0645\u0634\u0627\u0647\u062f\u0647 \u0641\u0647\u0631\u0633\u062a \u0631\u0627\u0647\u0646\u0645\u0627 \u0644\u06cc\u0633\u062a \u0634\u062f\u0647 \u0627\u0645\u06a9\u0627\u0646 \u067e\u0630\u06cc\u0631 \u0627\u0633\u062a. \u0641\u0647\u0631\u0633\u062a \u0631\u0627\u0647\u0646\u0645\u0627 \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a \u0647\u0627\u06cc \u0645\u062e\u0641\u06cc \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u06a9\u0646\u062f\u060c \u0634\u0627\u0645\u0644 \u0641\u0627\u06cc\u0644 \u0647\u0627\u060c \u0641\u0627\u06cc\u0644 \u0647\u0627\u06cc \u0645\u0646\u0628\u0639 \u067e\u0634\u062a\u06cc\u0628\u0627\u0646 \u0648 \u063a\u06cc\u0631\u0647 \u06a9\u0647 \u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u0628\u0631\u0627\u06cc \u062e\u0648\u0627\u0646\u062f\u0646 \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u062d\u0633\u0627\u0633 \u062f\u0631 \u062f\u0633\u062a\u0631\u0633 \u0642\u0631\u0627\u0631 \u06af\u06cc\u0631\u062f.
ascanrules.testdirectorybrowsing.soln=\u0645\u0631\u0648\u0631 \u062f\u0627\u06cc\u0631\u06a9\u062a\u0648\u0631\u06cc \u0647\u0627 \u0631\u0627 \u063a\u06cc\u0631 \u0641\u0639\u0627\u0644 \u06a9\u0646\u06cc\u062f. \u0627\u06af\u0631 \u0627\u06cc\u0646 \u0636\u0631\u0648\u0631\u06cc \u0627\u0633\u062a\u060c \u0645\u0637\u0645\u0626\u0646 \u0634\u0648\u06cc\u062f \u0641\u0627\u06cc\u0644 \u0647\u0627\u06cc \u0644\u06cc\u0633\u062a \u0634\u062f\u0647 \u0631\u06cc\u0633\u06a9\u06cc \u0646\u062f\u0627\u0631\u0646\u062f.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\nhttp\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html\n

ascanrules.testinjectioncrlf.name=\u062a\u0632\u0631\u06cc\u0642 CRLF
ascanrules.testinjectioncrlf.desc=\u06a9\u0648\u06a9\u06cc \u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u0628\u0627 \u062a\u0632\u0631\u06cc\u0642 CRLF \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f. \u0647\u0645\u0686\u0646\u06cc\u0646 \u0627\u06cc\u0646 \u0627\u0645\u06a9\u0627\u0646 \u0648\u062c\u0648\u062f \u062f\u0627\u0631\u062f header \u0647\u0627\u06cc \u067e\u0627\u0633\u062e HTTP \u062f\u0644\u062e\u0648\u0627\u0647 \u062a\u0646\u0638\u06cc\u0645 \u0634\u0648\u062f. \u0628\u0647 \u0639\u0644\u0627\u0648\u0647\u060c \u062a\u0648\u0633\u0637 \u067e\u0631\u062f\u0627\u0632\u0634 \u062f\u0642\u06cc\u0642 \u067e\u0627\u0633\u062e \u062a\u0632\u0631\u06cc\u0642 \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0627\u0633\u06a9\u0631\u06cc\u067e\u062a cross-site\u060c \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0645\u0633\u0645\u0648\u0645\u06cc\u062a \u062d\u0627\u0641\u0638\u0647 \u0646\u0647\u0627\u06cc\u06cc \u0627\u06cc\u062c\u0627\u062f \u0634\u0648\u062f.
ascanrules.testinjectioncrlf.soln=\u0646\u0648\u0639 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0627\u0631\u0627\u0626\u0647 \u0634\u062f\u0647 \u0631\u0627 \u0628\u0627 \u062f\u0642\u062a \u0686\u06a9 \u06a9\u0646\u06cc\u062f. \u0627\u062c\u0627\u0632\u0647 \u0646\u062f\u0647\u06cc\u062f CRLF \u0628\u0627 \u0641\u06cc\u0644\u062a\u0631 \u06a9\u0631\u062f\u0646 CRLF \u062a\u0632\u0631\u06cc\u0642 \u0634\u0648\u062f.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\nhttp\://webappfirewall.com/lib/crlf-injection.txtnull\nhttp\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=\u0645\u062f\u0627\u062e\u0644\u0647 \u062f\u0631 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0647\u0627
ascanrules.testparametertamper.desc=\u062f\u0633\u062a\u06a9\u0627\u0631\u06cc \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0645\u0648\u062c\u0628 \u06cc\u06a9 \u0635\u0641\u062d\u0647 \u062e\u0637\u0627 \u06cc\u0627 \u0646\u0645\u0627\u06cc\u0634 \u0631\u062f\u06cc\u0627\u0628\u06cc \u062d\u0627\u0641\u0638\u0647 \u0631\u0632\u0631\u0648 \u0634\u062f\u0647(\u067e\u0634\u062a\u0647) \u062c\u0627\u0648\u0627 \u0645\u06cc \u0634\u0648\u062f. \u0627\u06cc\u0646 \u0646\u0634\u0627\u0646 \u062f\u0647\u0646\u062f\u0647 \u0639\u062f\u0645 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0627\u0633\u062a\u062b\u0646\u0627 \u0647\u0646\u062f\u0644\u06cc\u0646\u06af \u0648 \u0632\u0645\u06cc\u0646\u0647 \u0647\u0627\u06cc \u0628\u0627\u0644\u0642\u0648\u0647 \u0628\u0631\u0627\u06cc \u0628\u0647\u0631\u0647 \u0628\u0631\u062f\u0627\u0631\u06cc \u0628\u06cc\u0634\u062a\u0631 \u0627\u0633\u062a.
ascanrules.testparametertamper.soln=\u062a\u0634\u062e\u06cc\u0635 \u0639\u062a \u062e\u0637\u0627 \u0648 \u062f\u0631\u0633\u062a \u06a9\u0631\u062f\u0646 \u0622\u0646. \u0628\u0647 \u0648\u0631\u0648\u062f\u06cc \u0645\u062a\u0642\u0627\u0636\u06cc \u0627\u0639\u062a\u0645\u0627\u062f \u0646\u06a9\u0646\u06cc\u062f \u0648 \u06cc\u06a9 \u0686\u06a9 \u062f\u0642\u06cc\u0642 \u0627\u0632 \u0633\u0645\u062a \u0633\u0631\u0648\u0631 \u0627\u062c\u0631\u0627 \u06a9\u0646\u06cc\u062f. \u0628\u0647 \u0639\u0644\u0627\u0648\u0647 \u0627\u0633\u062a\u062b\u0646\u0627 \u0631\u0627 \u0628\u0647 \u062f\u0631\u0633\u062a\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u06cc\u062f. \u0628\u0631\u0627\u06cc \u062e\u0637\u0627\u06cc \u0633\u0631\u0648\u0631 \u062f\u0627\u062e\u0644\u06cc \u0627\u0632 \u0635\u0641\u062d\u0647 \u062e\u0637\u0627\u06cc 500 \u0639\u0645\u0648\u0645\u06cc \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f.

ascanrules.testpathtraversal.name=Path Traversal

ascanrules.testremotefileinclude.name=Remote File Inclusion

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=\u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u0647\u0627\u06cc \u0645\u0634\u062e\u0635 \u0645\u06cc\u062a\u0648\u0627\u0646\u062f \u0645\u0648\u062c\u0628 \u0627\u062c\u0631\u0627\u06cc \u062f\u0633\u062a\u0648\u0631\u0627\u062a \u0633\u0631\u0648\u0631 \u0634\u0648\u062f. \u0627\u06cc\u0646 \u0627\u0645\u06a9\u0627\u0646 \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc \u062f\u0647\u062f \u0627\u062a\u0635\u0627\u0644 \u067e\u0627\u06cc\u06af\u0627\u0647 \u062f\u0627\u062f\u0647 \u06cc\u0627 \u06a9\u062f \u062f\u0644\u062e\u0648\u0627\u0647 \u0627\u062c\u0631\u0627 \u0634\u0648\u062f.
ascanrules.testserversideinclude.soln=\u0628\u0647 \u0648\u0631\u0648\u062f\u06cc \u0645\u062a\u0642\u0627\u0636\u06cc \u0627\u0639\u062a\u0645\u0627\u062f \u0646\u06a9\u0646\u06cc\u062f \u0648 \u06cc\u06a9 \u0628\u0631\u0631\u0633\u06cc \u062f\u0642\u06cc\u0642 \u0627\u0632 \u0633\u0631\u0648\u0631 \u0627\u0646\u062c\u0627\u0645 \u062f\u0647\u06cc\u062f. \u0634\u0627\u0645\u0644 \u0633\u0645\u062a \u063a\u06cc\u0631\u0641\u0639\u0627\u0644 \u0633\u0631\u0648\u0631 \u0627\u0633\u062a.\n
Refer=\u0628\u0631\u0627\u06cc \u063a\u06cc\u0631\u0641\u0639\u0627\u0644 \u06a9\u0631\u062f\u0646 \u0633\u0631\u0648\u0631 \u062c\u0627\u0646\u0628\u06cc\u060c \u0628\u0647 \u0631\u0627\u0647\u0646\u0645\u0627 \u0645\u0631\u0627\u062c\u0639\u0647 \u06a9\u0646\u06cc\u062f.\n\u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u062d\u062f\u0627\u0642\u0644 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0628\u0631\u0627\u06cc \u0627\u062c\u0631\u0627\u06cc \u0633\u0631\u0648\u0631 \u0648\u0628 \u06cc\u0627 \u0633\u0631\u0648\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0634\u0645\u0627.\n\u0628\u0631\u0627\u06cc Apache\u060c \u0645\u0648\u0627\u0631\u062f \u0632\u06cc\u0631 \u0631\u0627 \u063a\u06cc\u0631 \u0641\u0639\u0627\u0644 \u06a9\u0646\u06cc\u062f\:\n\u06af\u0632\u06cc\u0646\u0647 \u0647\u0627\u06cc \u0634\u0627\u062e\u0635 \u0634\u0627\u0645\u0644 FollowSymLinks\nAddType application/x-httpd-cgi .cgi\nAddType text/x-server-parsed-html .html
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

