
ascanrules.bufferoverflow.desc = \u041f\u043e\u043c\u0438\u043b\u043a\u0438 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u0431\u0443\u0444\u0435\u0440\u0430 \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440\u0438\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0438\u0441\u043e\u043c \u043f\u0440\u043e\u0441\u0442\u043e\u0440\u0456\u0432 \u043f\u0430\u043c\u2019\u044f\u0442\u0456 \u0444\u043e\u043d\u043e\u0432\u043e\u0433\u043e \u0432\u0435\u0431-\u043f\u0440\u043e\u0446\u0435\u0441\u0443, \u044f\u043a\u0438\u0439 \u043d\u0456\u043a\u043e\u043b\u0438 \u043d\u0435 \u0441\u043b\u0456\u0434 \u0431\u0443\u043b\u043e \u0437\u043c\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u043d\u0430\u0432\u043c\u0438\u0441\u043d\u043e \u0447\u0438 \u043d\u0435\u043d\u0430\u0432\u043c\u0438\u0441\u043d\u043e. \u041f\u0435\u0440\u0435\u0437\u0430\u043f\u0438\u0441 \u0437\u043d\u0430\u0447\u0435\u043d\u044c IP (\u0432\u043a\u0430\u0437\u0456\u0432\u043d\u0438\u043a \u0456\u043d\u0441\u0442\u0440\u0443\u043a\u0446\u0456\u0439), BP (\u0431\u0430\u0437\u043e\u0432\u0438\u0439 \u0432\u043a\u0430\u0437\u0456\u0432\u043d\u0438\u043a) \u0442\u0430 \u0456\u043d\u0448\u0438\u0445 \u0440\u0435\u0433\u0456\u0441\u0442\u0440\u0456\u0432 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0454 \u0432\u0438\u043d\u044f\u0442\u043a\u0438, \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u0441\u0435\u0433\u043c\u0435\u043d\u0442\u0430\u0446\u0456\u0457 \u0442\u0430 \u0456\u043d\u0448\u0456 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u043f\u0440\u043e\u0446\u0435\u0441\u0443. \u0417\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0446\u0456 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u044f\u0442\u044c \u0434\u043e \u043d\u0435\u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u043d\u044f \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438.
ascanrules.bufferoverflow.name = \u041f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u0431\u0443\u0444\u0435\u0440\u0443
ascanrules.bufferoverflow.other = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0435 \u043f\u0435\u0440\u0435\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u0431\u0443\u0444\u0435\u0440\u0430. \u0421\u0446\u0435\u043d\u0430\u0440\u0456\u0439 \u0437\u0430\u043a\u0440\u0438\u0432 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u0442\u0430 \u0432\u0438\u0434\u0430\u0432 \u0432\u043d\u0443\u0442\u0440\u0456\u0448\u043d\u044e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 500
ascanrules.bufferoverflow.refs = https\://owasp.org/www-community/attacks/Buffer_overflow_attack
ascanrules.bufferoverflow.soln = \u041f\u0435\u0440\u0435\u043f\u0438\u0448\u0456\u0442\u044c \u0444\u043e\u043d\u043e\u0432\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043d\u0430\u043b\u0435\u0436\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0434\u043e\u0432\u0436\u0438\u043d\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043d\u044f. \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0437\u043d\u0430\u0434\u043e\u0431\u0438\u0442\u044c\u0441\u044f \u043f\u0435\u0440\u0435\u043a\u043e\u043c\u043f\u0456\u043b\u044e\u0432\u0430\u0442\u0438 \u0444\u043e\u043d\u043e\u0432\u0438\u0439 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u043d\u0438\u0439 \u0444\u0430\u0439\u043b.

ascanrules.cloudmetadata.desc = \u0410\u0442\u0430\u043a\u0430 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0438\u0445 \u0445\u043c\u0430\u0440\u0438 \u043d\u0430\u043c\u0430\u0433\u0430\u0454\u0442\u044c\u0441\u044f \u0437\u043b\u043e\u0432\u0436\u0438\u0432\u0430\u0442\u0438 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u043c \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c NGINX, \u0449\u043e\u0431 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0438\u0445 \u0435\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440\u0456\u0432, \u044f\u043a\u0456 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u044e\u0442\u044c\u0441\u044f \u043f\u043e\u0441\u0442\u0430\u0447\u0430\u043b\u044c\u043d\u0438\u043a\u0430\u043c\u0438 \u0445\u043c\u0430\u0440\u043d\u0438\u0445 \u043f\u043e\u0441\u043b\u0443\u0433, \u0442\u0430\u043a\u0438\u043c\u0438 \u044f\u043a AWS, GCP \u0456 Azure.\n\u0423\u0441\u0456 \u0446\u0456 \u043f\u043e\u0441\u0442\u0430\u0447\u0430\u043b\u044c\u043d\u0438\u043a\u0438 \u043d\u0430\u0434\u0430\u044e\u0442\u044c \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u0447\u0435\u0440\u0435\u0437 \u0432\u043d\u0443\u0442\u0440\u0456\u0448\u043d\u044e \u043d\u0435\u043c\u0430\u0440\u0448\u0440\u0443\u0442\u0438\u0437\u043e\u0432\u0430\u043d\u0443 IP-\u0430\u0434\u0440\u0435\u0441\u0443 '169.254.169.254' \u2014 \u0446\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c\u0438 NGINX \u0456 \u043c\u043e\u0436\u0435 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0446\u0456\u0454\u0457 IP-\u0430\u0434\u0440\u0435\u0441\u0438 \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0445\u043e\u0441\u0442\u0443.
ascanrules.cloudmetadata.name = \u041c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u0445\u043c\u0430\u0440\u0438 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0456
ascanrules.cloudmetadata.otherinfo = \u041d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043a\u043e\u0434\u0443 \u0441\u0442\u0430\u043d\u0443 \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u0457 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u0445\u043c\u0430\u0440\u0438 \u043c\u043e\u0433\u043b\u0438 \u0431\u0443\u0442\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u0456 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c. \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0434\u0430\u043d\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0449\u043e\u0431 \u043f\u043e\u0431\u0430\u0447\u0438\u0442\u0438, \u0447\u0438 \u0431\u0443\u043b\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u0456 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u0445\u043c\u0430\u0440\u0438.\n\u041f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u0456 \u043c\u0435\u0442\u0430\u0434\u0430\u043d\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u044f\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u044c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u043f\u043e\u0432\u043d\u0456\u0441\u0442\u044e \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u0443\u0432\u0430\u0442\u0438 \u0441\u0438\u0441\u0442\u0435\u043c\u0443.
ascanrules.cloudmetadata.refs = https\://www.nginx.com/blog/trust-no-one-perils-of-trusting-user-input/
ascanrules.cloudmetadata.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0436\u043e\u0434\u043d\u0438\u043c \u0434\u0430\u043d\u0438\u043c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0432 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f\u0445 NGINX. \u0423 \u0446\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0446\u0435, \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0437\u043c\u0456\u043d\u043d\u043e\u0457 $host, \u044f\u043a\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454\u0442\u044c\u0441\u044f \u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u00abHost\u00bb \u0456 \u043c\u043e\u0436\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c.

ascanrules.codeinjection.desc = \u041c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u043c \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0447\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434, \u044f\u043a\u0438\u0439 \u0431\u0443\u0434\u0435 \u043e\u0446\u0456\u043d\u0435\u043d\u043e \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u043e\u043c \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432
ascanrules.codeinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanrules.codeinjection.name.asp = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 - \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443 ASP
ascanrules.codeinjection.name.php = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 - \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443 PHP
ascanrules.codeinjection.refs = https\://cwe.mitre.org/data/definitions/94.html\nhttps\://owasp.org/www-community/attacks/Direct_Dynamic_Code_Evaluation_Eval%20Injection
ascanrules.codeinjection.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u0438\u043c \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0456\u0441\u043d\u0443\u0454 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\u0417\u0430\u0433\u0430\u043b\u043e\u043c, \u0432\u0432\u0435\u0434\u0456\u0442\u044c \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0442\u0430 \u0443\u043d\u0438\u043a\u043d\u0443\u0442\u0438 \u0432\u0441\u0456\u0445 \u0434\u0430\u043d\u0438\u0445, \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u0438\u0445 \u0432\u0456\u0434 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n  \u0423\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0444\u0443\u043d\u043a\u0446\u0456\u0439 eval() \u0443 \u043f\u043e\u0454\u0434\u043d\u0430\u043d\u043d\u0456 \u0437 \u0432\u0432\u0435\u0434\u0435\u043d\u0438\u043c\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u0434\u0430\u043d\u0438\u043c\u0438.

ascanrules.commandinjection.desc = \u0422\u0435\u0445\u043d\u0456\u043a\u0430 \u0430\u0442\u0430\u043a\u0438, \u044f\u043a\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u043c\u0430\u043d\u0434 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438. \u0426\u044f \u0430\u0442\u0430\u043a\u0430 \u043c\u043e\u0436\u043b\u0438\u0432\u0430, \u043a\u043e\u043b\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u043f\u0440\u0438\u0439\u043c\u0430\u0454 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0439 \u0432\u0445\u0456\u0434 \u0434\u043b\u044f \u043f\u043e\u0431\u0443\u0434\u043e\u0432\u0438 \u043a\u043e\u043c\u0430\u043d\u0434 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438 \u0432 \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0447\u0438 \u043d\u0435\u043d\u0430\u043b\u0435\u0436\u043d\u0443 \u043e\u0431\u0440\u043e\u0431\u043a\u0443 \u0434\u0430\u043d\u0438\u0445 \u0456/\u0430\u0431\u043e \u043d\u0435\u043d\u0430\u043b\u0435\u0436\u043d\u0438\u0439 \u0432\u0438\u043a\u043b\u0438\u043a \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u0456\u0445 \u043f\u0440\u043e\u0433\u0440\u0430\u043c.
ascanrules.commandinjection.name = \u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043a\u043e\u043c\u0430\u043d\u0434 OS
ascanrules.commandinjection.otherinfo.feedback-based = \u041f\u0440\u0430\u0432\u0438\u043b\u0443 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0434\u0430\u043b\u043e\u0441\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442 \u0444\u0430\u0439\u043b\u0443 \u0430\u0431\u043e \u043a\u043e\u043c\u0430\u043d\u0434\u0438, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0432\u0448\u0438 [{0}] \u0434\u043e \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0437\u0430\u043f\u0443\u0449\u0435\u043d\u0430 \u0446\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430
ascanrules.commandinjection.otherinfo.time-based = \u041f\u0440\u0430\u0432\u0438\u043b\u0443 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0434\u0430\u043b\u043e\u0441\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442 \u0444\u0430\u0439\u043b\u0443 \u0430\u0431\u043e \u043a\u043e\u043c\u0430\u043d\u0434\u0438, \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0432\u0448\u0438 [{0}] \u0434\u043e \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0437\u0430\u043f\u0443\u0449\u0435\u043d\u0430 \u0446\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430
ascanrules.commandinjection.refs = https\://cwe.mitre.org/data/definitions/78.html\nhttps\://owasp.org/www-community/attacks/Command_Injection

ascanrules.crlfinjection.desc = Cookie \u043c\u043e\u0436\u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f CRLF. \u0422\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0434\u043e \u043e\u0442\u0440\u0443\u0454\u043d\u043d\u044f \u043a\u0435\u0448\u0443 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u0456\u0441\u043d\u0443\u0432\u0430\u0442\u0438, \u0440\u0435\u0442\u0435\u043b\u044c\u043d\u043e \u0441\u0442\u0432\u043e\u0440\u044e\u044e\u0447\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e.
ascanrules.crlfinjection.name = CRLF \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f
ascanrules.crlfinjection.refs = https\://owasp.org/www-community/vulnerabilities/CRLF_Injection\nhttps\://cwe.mitre.org/data/definitions/113.html
ascanrules.crlfinjection.soln = \u0423\u0432\u0430\u0436\u043d\u043e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u0438\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440. \u041d\u0435 \u0434\u043e\u043f\u0443\u0441\u043a\u0430\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f CRLF \u0448\u043b\u044f\u0445\u043e\u043c \u0444\u0456\u043b\u044c\u0442\u0440\u0430\u0446\u0456\u0457 CRLF.

ascanrules.crosssitescripting.json.desc = XSS-\u0430\u0442\u0430\u043a\u0430 \u0431\u0443\u043b\u0430 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u0430 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 JSON, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0441\u043f\u043e\u0436\u0438\u0432\u0430\u0447\u0456\u0432 \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c\u0438 \u0434\u043e \u0430\u0442\u0430\u043a, \u044f\u043a\u0449\u043e \u0432\u043e\u043d\u0438 \u043d\u0435 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0442\u0438\u043c\u0443\u0442\u044c \u0434\u0430\u043d\u0456 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c (\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c).
ascanrules.crosssitescripting.json.name = \u0421\u043b\u0430\u0431\u043a\u0456\u0441\u0442\u044c \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e (\u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043e \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 JSON)
ascanrules.crosssitescripting.name = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 (\u0412\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043e)
ascanrules.crosssitescripting.otherinfo.accesskey = \u0410\u0442\u0440\u0438\u0431\u0443\u0442 accesskey \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u0454 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u044e \u043a\u043b\u0430\u0432\u0456\u0448 \u0434\u043b\u044f \u0430\u043a\u0442\u0438\u0432\u0430\u0446\u0456\u0457 \u0430\u0431\u043e \u0444\u043e\u043a\u0443\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430. \u0426\u0435\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043c\u043e\u0436\u0435 \u0456\u043d\u0456\u0446\u0456\u044e\u0432\u0430\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u043d\u0435 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u043d\u0435\u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 \u0430\u0431\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u0445 \u0442\u0435\u0433\u0456\u0432.
ascanrules.crosssitescripting.otherinfo.nothtml = \u0412\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0437 \u041d\u0418\u0417\u042c\u041a\u041e\u042e \u0434\u043e\u0441\u0442\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044e, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 Content-Type \u043d\u0435 \u0454 HTML

ascanrules.desc = \u0412\u0438\u043f\u0443\u0441\u043a \u0441\u0442\u0430\u043d\u0443 \u0430\u043a\u0442\u0438\u0432\u043d\u0438\u0445 \u043f\u0440\u0430\u0432\u0438\u043b \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f

ascanrules.directorybrowsing.desc = \u0404 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u043b\u0456\u043a \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443. \u041f\u0435\u0440\u0435\u043b\u0456\u043a \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443 \u043c\u043e\u0436\u0435 \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0456 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457, \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0444\u0430\u0439\u043b\u0438, \u0432\u0438\u0445\u0456\u0434\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 \u0440\u0435\u0437\u0435\u0440\u0432\u043d\u0438\u0445 \u043a\u043e\u043f\u0456\u0439 \u0442\u043e\u0449\u043e, \u0434\u043e \u044f\u043a\u0438\u0445 \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043b\u044f \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457.
ascanrules.directorybrowsing.name = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u0434 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0456\u0432
ascanrules.directorybrowsing.refs = https\://httpd.apache.org/docs/mod/core.html\#options
ascanrules.directorybrowsing.soln = \u0412\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443. \u042f\u043a\u0449\u043e \u0446\u0435 \u0434\u0456\u0439\u0441\u043d\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0435\u0440\u0435\u043b\u0456\u0447\u0435\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 \u043d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u044e\u0442\u044c \u0440\u0438\u0437\u0438\u043a\u0456\u0432.

ascanrules.elmah.desc = \u041c\u043e\u0434\u0443\u043b\u0456 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u043c\u0438\u043b\u043e\u043a \u0456 \u043e\u0431\u0440\u043e\u0431\u043d\u0438\u043a\u0438 (ELMAH [elmah.axd]) HTTP \u0432\u0438\u044f\u0432\u0438\u043b\u0438\u0441\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c\u0438. \u0426\u0435\u0439 \u043c\u043e\u0434\u0443\u043b\u044c \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0437\u043d\u0430\u0447\u043d\u043e\u0457 \u043a\u0456\u043b\u044c\u043a\u043e\u0441\u0442\u0456 \u0446\u0456\u043d\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457.
ascanrules.elmah.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 ELMAH
ascanrules.elmah.otherinfo = \u041d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043a\u043e\u0434\u0443 \u0441\u0442\u0430\u043d\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 ELMAH \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u043e\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0430\u0431\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457.
ascanrules.elmah.refs = https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanrules.elmah.soln = \u0427\u0438 ELMAH \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0446\u0442\u0432\u0456, \u044f\u043a\u0449\u043e \u043d\u0456, \u0432\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u0439\u043e\u0433\u043e. \u042f\u043a\u0449\u043e \u0446\u0435 \u0442\u0430\u043a, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0435\u0431\u0443\u0454 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0442\u0430 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457. \u0414\u0438\u0432\u0456\u0442\u044c\u0441\u044f \u0442\u0430\u043a\u043e\u0436\: https\://elmah.github.io/a/securing-error-log-pages/

ascanrules.envfiles.desc = \u0421\u0445\u043e\u0436\u0435, \u043e\u0434\u0438\u043d \u0430\u0431\u043e \u043a\u0456\u043b\u044c\u043a\u0430 \u0444\u0430\u0439\u043b\u0456\u0432 .env \u0440\u043e\u0437\u0442\u0430\u0448\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0456. \u0426\u0456 \u0444\u0430\u0439\u043b\u0438 \u0447\u0430\u0441\u0442\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u044e\u0442\u044c \u0456\u043d\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443 \u0430\u0431\u043e \u0430\u0434\u043c\u0456\u043d\u0456\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u0456 \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u0456 \u0434\u0430\u043d\u0456, \u043a\u043b\u044e\u0447\u0456 API \u0430\u0431\u043e APP \u0430\u0431\u043e \u0456\u043d\u0448\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e.
ascanrules.envfiles.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 .env
ascanrules.envfiles.otherinfo = \u041d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043a\u043e\u0434\u0443 \u0441\u0442\u0430\u0442\u0443\u0441\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0444\u0430\u0439\u043b .env \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u043e\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0430\u0431\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457.
ascanrules.envfiles.refs = https\://www.google.com/search?q\=db_password+filetype%3Aenv\nhttps\://mobile.twitter.com/svblxyz/status/1045013939904532482
ascanrules.envfiles.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0444\u0430\u0439\u043b .env \u043d\u0435\u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439.

ascanrules.externalredirect.name = \u0417\u043e\u0432\u043d\u0456\u0448\u043d\u0454 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f
ascanrules.externalredirect.reason.javascript = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0443 \u043a\u043e\u0434\u0456 JavaScript, \u044f\u043a\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u044e URL-\u0430\u0434\u0440\u0435\u0441\u0443.
ascanrules.externalredirect.reason.location.header = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u041c\u0456\u0441\u0446\u0435\u0437\u043d\u0430\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u044e URL-\u0430\u0434\u0440\u0435\u0441\u0443.
ascanrules.externalredirect.reason.location.meta = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0443 \u0441\u0432\u043e\u0454\u043c\u0443 \u043c\u0435\u0442\u0430\u0442\u0435\u0491\u0443 http-equiv \u0434\u043b\u044f \u00ab\u041c\u0456\u0441\u0446\u0435\u0437\u043d\u0430\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f\u00bb, \u044f\u043a\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u044e URL-\u0430\u0434\u0440\u0435\u0441\u0443.
ascanrules.externalredirect.reason.notfound = \u041f\u0440\u0438\u0447\u0438\u043d \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u043d\u0435 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e...
ascanrules.externalredirect.reason.refresh.header = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u0441\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u043d\u043d\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u044e URL-\u0430\u0434\u0440\u0435\u0441\u0443.
ascanrules.externalredirect.reason.refresh.meta = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0435\u0440\u0435\u0441\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u043d\u043d\u044f \u0443 \u0441\u0432\u043e\u0454\u043c\u0443 \u043c\u0435\u0442\u0430\u0442\u0435\u0491\u0443 http-equiv \u0434\u043b\u044f \u00ab\u041e\u043d\u043e\u0432\u0438\u0442\u0438\u00bb, \u044f\u043a\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u044e URL-\u0430\u0434\u0440\u0435\u0441\u0443.\n

ascanrules.formatstring.desc = \u0412\u0438\u043d\u0438\u043a\u0430\u0454 \u043f\u043e\u043c\u0438\u043b\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u0440\u044f\u0434\u043a\u0430, \u043a\u043e\u043b\u0438 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u043d\u0456 \u0434\u0430\u043d\u0456 \u0432\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u043e\u0446\u0456\u043d\u044e\u044e\u0442\u044c\u0441\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043e\u044e \u044f\u043a \u043a\u043e\u043c\u0430\u043d\u0434\u0430.
ascanrules.formatstring.error1 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u043f\u043e\u043c\u0438\u043b\u043a\u0430 \u0440\u044f\u0434\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443. \u0421\u0446\u0435\u043d\u0430\u0440\u0456\u0439 \u0437\u0430\u043a\u0440\u0438\u0432 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u043d\u0430 /%s
ascanrules.formatstring.error2 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u043f\u043e\u043c\u0438\u043b\u043a\u0430 \u0440\u044f\u0434\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443. \u0421\u0446\u0435\u043d\u0430\u0440\u0456\u0439 \u0437\u0430\u043a\u0440\u0438\u0432 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u043d\u0430 /%s \u0442\u0430 /%x
ascanrules.formatstring.error3 = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u043f\u043e\u043c\u0438\u043b\u043a\u0430 \u0440\u044f\u0434\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443. \u0421\u0446\u0435\u043d\u0430\u0440\u0456\u0439 \u0437\u0430\u043a\u0440\u0438\u0432 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u0447\u0435\u0440\u0435\u0437 \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0440\u044f\u0434\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443 Microsoft
ascanrules.formatstring.name = \u041f\u043e\u043c\u0438\u043b\u043a\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u0440\u044f\u0434\u043a\u0430
ascanrules.formatstring.refs = https\://owasp.org/www-community/attacks/Fromat_string_attack
ascanrules.formatstring.soln = \u041f\u0435\u0440\u0435\u043f\u0438\u0448\u0456\u0442\u044c \u0444\u043e\u043d\u043e\u0432\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443, \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0432\u0438\u0434\u0430\u043b\u0438\u0432\u0448\u0438 \u0440\u044f\u0434\u043a\u0438 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0438\u0445 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432. \u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u043f\u0435\u0440\u0435\u043a\u043e\u043c\u043f\u0456\u043b\u044e\u0432\u0430\u0442\u0438 \u0444\u043e\u043d\u043e\u0432\u0438\u0439 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u043d\u0438\u0439 \u0444\u0430\u0439\u043b.

ascanrules.getforpost.desc = \u0417\u0430\u043f\u0438\u0442, \u044f\u043a\u0438\u0439 \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u0441\u043f\u043e\u0441\u0442\u0435\u0440\u0456\u0433\u0430\u0432\u0441\u044f \u044f\u043a POST, \u0442\u0430\u043a\u043e\u0436 \u0431\u0443\u0432 \u043f\u0440\u0438\u0439\u043d\u044f\u0442\u0438\u0439 \u044f\u043a GET. \u0426\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0441\u0430\u043c\u0430 \u043f\u043e \u0441\u043e\u0431\u0456 \u043d\u0435 \u0454 \u0441\u043b\u0430\u0431\u043a\u0456\u0441\u0442\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u043e\u0434\u043d\u0430\u043a \u0432\u043e\u043d\u0430 \u043c\u043e\u0436\u0435 \u0441\u043f\u0440\u0438\u044f\u0442\u0438 \u0441\u043f\u0440\u043e\u0449\u0435\u043d\u043d\u044e \u0456\u043d\u0448\u0438\u0445 \u0430\u0442\u0430\u043a. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u044f\u043a\u0449\u043e \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0438\u0439 POST \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0454 \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u043c\u0443 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e (XSS), \u0442\u043e \u0446\u0435 \u043c\u043e\u0436\u0435 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u043d\u0430 \u0442\u0435, \u0449\u043e \u0441\u043f\u0440\u043e\u0449\u0435\u043d\u0438\u0439 (\u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 GET) XSS \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u043c.
ascanrules.getforpost.name = GET \u0434\u043b\u044f POST
ascanrules.getforpost.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e POST \u043f\u0440\u0438\u0439\u043c\u0430\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0442\u0430\u043c, \u0434\u0435 POST \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u044c\u0441\u044f.

ascanrules.heartbleed.desc = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f TLS \u0432 OpenSSL 1.0.1 \u0434\u043e 1.0.1g \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454 \u043f\u0430\u043a\u0435\u0442\u0438 Heartbeat Extension, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0437 \u043f\u0430\u043c\u2019\u044f\u0442\u0456 \u043f\u0440\u043e\u0446\u0435\u0441\u0443 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0445 \u043f\u0430\u043a\u0435\u0442\u0456\u0432, \u044f\u043a\u0456 \u0437\u0430\u043f\u0443\u0441\u043a\u0430\u044e\u0442\u044c \u043d\u0430\u0434\u043c\u0456\u0440\u043d\u0435 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u0431\u0443\u0444\u0435\u0440\u0430, \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u044e\u0447\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e.
ascanrules.heartbleed.extrainfo = \u0426\u044e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443 \u0431\u0443\u043b\u043e \u043f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0436\u0435\u043d\u043e \u0432\u0438\u043a\u0440\u0430\u0434\u0435\u043d\u043d\u044f\u043c \u0434\u0430\u043d\u0438\u0445 \u0456\u0437 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e {0}. \u0426\u0435 \u043d\u0430\u0432\u0440\u044f\u0434 \u0447\u0438 \u0431\u0443\u0434\u0435 \u043f\u043e\u043c\u0438\u043b\u043a\u043e\u0432\u0438\u043c \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u043e\u043c.
ascanrules.heartbleed.name = \u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c Heartbleed OpenSSL
ascanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
ascanrules.heartbleed.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e OpenSSL 1.0.1g \u0430\u0431\u043e \u043d\u043e\u0432\u0456\u0448\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457. \u041f\u0435\u0440\u0435\u0432\u0438\u0434\u0430\u0439\u0442\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u0438 HTTPS. \u0417\u043c\u0456\u043d\u0456\u0442\u044c \u0430\u0441\u0438\u043c\u0435\u0442\u0440\u0438\u0447\u043d\u0456 \u0437\u0430\u043a\u0440\u0438\u0442\u0456 \u043a\u043b\u044e\u0447\u0456 \u0442\u0430 \u0441\u043f\u0456\u043b\u044c\u043d\u0456 \u0441\u0435\u043a\u0440\u0435\u0442\u043d\u0456 \u043a\u043b\u044e\u0447\u0456, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0432\u043e\u043d\u0438 \u043c\u043e\u0433\u043b\u0438 \u0431\u0443\u0442\u0438 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u0456, \u0431\u0435\u0437 \u0434\u043e\u043a\u0430\u0437\u0456\u0432 \u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u0430\u0446\u0456\u0457 \u0443 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.

ascanrules.hidden.files.alert.name = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0438\u0439 \u0444\u0430\u0439\u043b
ascanrules.hidden.files.desc = \u041a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439 \u0444\u0430\u0439\u043b \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0438\u0439 \u0430\u0431\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0430\u0434\u043c\u0456\u043d\u0456\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u043e\u0457, \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0430\u0431\u043e \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0430 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c\u0438 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0457 \u0430\u0442\u0430\u043a\u0438 \u043d\u0430 \u0441\u0438\u0441\u0442\u0435\u043c\u0443 \u0430\u0431\u043e \u043f\u0440\u043e\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0441\u043e\u0446\u0456\u043e\u0442\u0435\u0445\u043d\u0456\u043a\u0438.
ascanrules.hidden.files.name = \u041f\u043e\u0448\u0443\u043a \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0438\u0445 \u0444\u0430\u0439\u043b\u0456\u0432
ascanrules.hidden.files.refs = https\://blog.hboeck.de/archives/892-Introducing-Snallygaster-a-Tool-to-Scan-for-Secrets-on-Web-Servers.htm
ascanrules.hidden.files.soln = \u0417\u0432\u0430\u0436\u0442\u0435, \u0447\u0438 \u0434\u0456\u0439\u0441\u043d\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0446\u0442\u0432\u0456, \u0456 \u044f\u043a\u0449\u043e \u043d\u0456, \u0432\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u0439\u043e\u0433\u043e. \u042f\u043a\u0449\u043e \u0442\u0430\u043a, \u0442\u043e \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0435\u0431\u0443\u0454 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0457 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0442\u0430 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457, \u0430\u0431\u043e \u043e\u0431\u043c\u0435\u0436\u0442\u0435 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0432\u043d\u0443\u0442\u0440\u0456\u0448\u043d\u0456\u0445 \u0441\u0438\u0441\u0442\u0435\u043c \u0447\u0438 \u043f\u0435\u0432\u043d\u0438\u0445 \u0434\u0436\u0435\u0440\u0435\u043b IP-\u0430\u0434\u0440\u0435\u0441 \u0442\u043e\u0449\u043e.

ascanrules.htaccess.desc = \u0424\u0430\u0439\u043b\u0438 htaccess \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0437\u043c\u0456\u043d\u0438 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e\u0433\u043e \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430 Apache, \u0449\u043e\u0431 \u0443\u0432\u0456\u043c\u043a\u043d\u0443\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0442\u0430 \u0444\u0443\u043d\u043a\u0446\u0456\u0457, \u044f\u043a\u0456 \u043f\u0440\u043e\u043f\u043e\u043d\u0443\u0454 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 Apache.
ascanrules.htaccess.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0444\u0430\u0439\u043b\u0443 .htaccess 
ascanrules.htaccess.otherinfo = \u041d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043a\u043e\u0434\u0443 \u0441\u0442\u0430\u0442\u0443\u0441\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0444\u0430\u0439\u043b htaccess \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u043e\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0430\u0431\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457.
ascanrules.htaccess.refs = https\://developer.mozilla.org/en-US/docs/Learn/Server-side/Apache_Configuration_htaccess\nhttps\://httpd.apache.org/docs/2.4/howto/htaccess.html
ascanrules.htaccess.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0444\u0430\u0439\u043b .htaccess \u043d\u0435\u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439.

ascanrules.log4shell.cve44228.desc = Apache Log4j2 <\=2.14.1 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 JNDI, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457, \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0442\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u0445, \u043d\u0435 \u0437\u0430\u0445\u0438\u0449\u0430\u044e\u0442\u044c \u0432\u0456\u0434 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c LDAP \u0442\u0430 \u0456\u043d\u0448\u0438\u0445 \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0445 \u0442\u043e\u0447\u043e\u043a, \u043f\u043e\u0432'\u044f\u0437\u0430\u043d\u0438\u0445 \u0437 JNDI. \u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0430\u0431\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c \u0436\u0443\u0440\u043d\u0430\u043b\u0443, \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434, \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u0438\u0439 \u0437 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u0432 LDAP, \u043a\u043e\u043b\u0438 \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u043f\u0456\u0434\u043c\u0456\u043d\u0443 \u043f\u043e\u0448\u0443\u043a\u0443 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c. \u041f\u043e\u0447\u0438\u043d\u0430\u044e\u0447\u0438 \u0437 \u0432\u0435\u0440\u0441\u0456\u0457 log4j 2.15.0, \u0442\u0430\u043a\u0443 \u043f\u043e\u0432\u0435\u0434\u0456\u043d\u043a\u0443 \u0431\u0443\u043b\u043e \u0432\u0438\u043c\u043a\u043d\u0435\u043d\u043e \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c.
ascanrules.log4shell.cve44228.name = Log4Shell (CVE-2021-44228)
ascanrules.log4shell.cve44228.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-44228
ascanrules.log4shell.cve44228.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Log4j2 \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 2.17.1 \u0430\u0431\u043e \u0432\u0438\u0449\u043e\u0457. \u0423 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u0456\u0445 \u0432\u0435\u0440\u0441\u0456\u044f\u0445 (>2.10) \u0446\u044e \u043f\u043e\u0432\u0435\u0434\u0456\u043d\u043a\u0443 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043f\u0440\u0430\u0432\u0438\u0442\u0438, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0432\u0448\u0438 \u0441\u0438\u0441\u0442\u0435\u043c\u043d\u0443 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u0456\u0441\u0442\u044c "log4j2.formatMsgNoLookups" \u0443 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "true", \u0430\u0431\u043e \u0432\u0438\u0434\u0430\u043b\u0438\u0432\u0448\u0438 \u043a\u043b\u0430\u0441 JndiLookup \u0437\u0456 \u0448\u043b\u044f\u0445\u0443 \u0434\u043e \u043a\u043b\u0430\u0441\u0456\u0432 (\u043f\u0440\u0438\u043a\u043b\u0430\u0434\: zip -q -d log4j-core-*.jar org/apache/logging/log4j/core/lookup/JndiLookup.class). Java 8u121 (\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 https\://www.oracle.com/java/technologies/javase/8u121-relnotes.html) \u0437\u0430\u0445\u0438\u0449\u0430\u0454 \u0432\u0456\u0434 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u044e\u0447\u0438 \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c "com.sun.jndi.rmi.object.trustURLCodebase" \u0442\u0430 "com.sun.jndi.cosnaming.object.trustURLCodebase" \u0432 "false".
ascanrules.log4shell.cve45046.desc = \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e, \u0449\u043e \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f CVE-2021-44228 \u0432 Apache Log4j 2.15.0 \u0431\u0443\u043b\u043e \u043d\u0435\u043f\u043e\u0432\u043d\u0438\u043c \u0443 \u043f\u0435\u0432\u043d\u0438\u0445 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f\u0445 \u043d\u0435 \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c. \u0426\u0435 \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0441\u0442\u0432\u043e\u0440\u044e\u0432\u0430\u0442\u0438 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0456 \u0432\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0448\u0430\u0431\u043b\u043e\u043d\u0443 JNDI Lookup, \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u0435\u0434\u0435 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0442\u0430 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443 \u0432 \u0434\u0435\u044f\u043a\u0438\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430\u0445.
ascanrules.log4shell.cve45046.name = Log4Shell (CVE-2021-45046)
ascanrules.log4shell.cve45046.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-45046
ascanrules.log4shell.cve45046.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Log4j2 \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0457 2.17.1 \u0430\u0431\u043e \u0432\u0438\u0449\u0435.
ascanrules.log4shell.name = Log4Shell
ascanrules.log4shell.skipped = \u043d\u0435 \u0432\u0438\u0431\u0440\u0430\u043d\u043e \u0441\u043b\u0443\u0436\u0431\u0443 Active Scan OAST.

ascanrules.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f

ascanrules.paddingoracle.desc = \u0428\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u0434\u043e\u043f\u043e\u0432\u043d\u044e\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0441\u0442\u0432\u043e\u0440\u0438\u0442\u0438 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443, \u044f\u043a\u0435 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u043c\u043e\u0436\u043b\u0438\u0432\u0443 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c "padding oracle". \u0422\u0430\u043a\u0430 \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u043c\u043e\u0436\u0435 \u0432\u043f\u043b\u0438\u043d\u0443\u0442\u0438 \u043d\u0430 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u0430\u0431\u043e \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443, \u0449\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0448\u0438\u0444\u0440\u0443\u0432\u0430\u043d\u043d\u044f, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0434\u0435\u044f\u043a\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 ASP.net, Java Server Faces \u0442\u0430 Mono. \u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0443 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0446\u044e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443, \u0449\u043e\u0431 \u0434\u0435\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 \u0434\u0430\u043d\u0456 \u0442\u0430 \u0432\u0456\u0434\u043d\u043e\u0432\u043b\u044e\u0432\u0430\u0442\u0438 \u043a\u043b\u044e\u0447\u0456 \u0448\u0438\u0444\u0440\u0443\u0432\u0430\u043d\u043d\u044f, \u0430 \u0442\u0430\u043a\u043e\u0436, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0442\u0438 \u0442\u0430 \u0437\u043c\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456. \u0426\u0435 \u043f\u0440\u0430\u0432\u0438\u043b\u043e \u043f\u043e\u0432\u0438\u043d\u043d\u043e \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c MS10-070 "padding oracle" \u0432 ASP.net, \u044f\u043a\u0449\u043e \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u0456 CustomErrors.
ascanrules.paddingoracle.name = \u0417\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0439 Padding Oracle
ascanrules.paddingoracle.refs = https\://learn.microsoft.com/en-us/security-updates/securitybulletins/2010/ms10-070\nhttps\://www.mono-project.com/docs/about-mono/vulnerabilities/\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799
ascanrules.paddingoracle.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c \u0443\u0440\u0430\u0436\u0435\u043d\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0430\u0431\u043e \u0437\u043c\u0456\u043d\u0456\u0442\u044c \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457, \u0449\u043e\u0431 \u0432\u043e\u043d\u0438 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u043b\u0438 \u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u0456 \u0434\u0430\u043d\u0456 \u043f\u0435\u0440\u0435\u0434 \u0441\u043f\u0440\u043e\u0431\u043e\u044e \u0440\u043e\u0437\u0448\u0438\u0444\u0440\u043e\u0432\u043a\u0438.

ascanrules.parametertamper.desc = \u041c\u0430\u043d\u0456\u043f\u0443\u043b\u044f\u0446\u0456\u0457 \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c\u0438 \u043f\u0440\u0438\u0437\u0432\u0435\u043b\u0438 \u0434\u043e \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u0430\u0431\u043e \u0442\u0440\u0430\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0442\u0435\u043a\u0430 Java. \u0426\u0435 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0441\u0442\u044c \u043e\u0431\u0440\u043e\u0431\u043a\u0438 \u0432\u0438\u043d\u044f\u0442\u043a\u0456\u0432 \u0456 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u043e\u0431\u043b\u0430\u0441\u0442\u0456 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f.
ascanrules.parametertamper.name = \u041f\u0456\u0434\u0440\u043e\u0431\u043a\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0443
ascanrules.parametertamper.soln = \u0412\u0438\u0437\u043d\u0430\u0447\u0442\u0435 \u043f\u0440\u0438\u0447\u0438\u043d\u0443 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u0442\u0430 \u0443\u0441\u0443\u043d\u044c\u0442\u0435 \u0457\u0457. \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044e \u0437 \u0431\u043e\u043a\u0443 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0442\u0430 \u0432\u0438\u043a\u043e\u043d\u0443\u0439\u0442\u0435 \u0441\u0443\u0432\u043e\u0440\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043f\u0435\u0440\u0435\u0445\u043e\u043f\u043b\u044e\u0439\u0442\u0435 \u0432\u0438\u043d\u044f\u0442\u043e\u043a. \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0437\u0430\u0433\u0430\u043b\u044c\u043d\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 500 \u0434\u043b\u044f \u0432\u043d\u0443\u0442\u0440\u0456\u0448\u043d\u044c\u043e\u0457 \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.

ascanrules.pathtraversal.name = \u041e\u0431\u0445\u0456\u0434 \u0448\u043b\u044f\u0445\u0443

ascanrules.payloader.desc = \u0417\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u0445 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u044c \u0443 \u043f\u0440\u0430\u0432\u0438\u043b\u0430\u0445 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f.
ascanrules.payloader.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u041a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u0446\u044c\u043a\u0456 \u043a\u043e\u0440\u0438\u0441\u043d\u0456 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f

ascanrules.persistentxssattack.json.desc = \u0423 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 JSON \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e XSS-\u0430\u0442\u0430\u043a\u0443. \u0426\u0435 \u043c\u043e\u0436\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0441\u043f\u043e\u0436\u0438\u0432\u0430\u0447\u0456\u0432 \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c\u0438 \u0434\u043e \u0430\u0442\u0430\u043a, \u044f\u043a\u0449\u043e \u0432\u043e\u043d\u0438 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0442\u0438\u043c\u0443\u0442\u044c \u0434\u0430\u043d\u0456 (\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c).
ascanrules.persistentxssattack.json.name = \u0421\u043b\u0430\u0431\u043a\u0456\u0441\u0442\u044c \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e (\u043f\u043e\u0441\u0442\u0456\u0439\u043d\u0438\u0439 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 JSON)
ascanrules.persistentxssattack.name = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 (\u041f\u043e\u0441\u0442\u0456\u0439\u043d\u0438\u0439)
ascanrules.persistentxssattack.otherinfo = \u0414\u0436\u0435\u0440\u0435\u043b\u043e URL-\u0430\u0434\u0440\u0435\u0441\u0438\: {0}
ascanrules.persistentxssattack.otherinfo.nothtml = \u0412\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0437 \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044e LOW, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 Content-Type \u043d\u0435 \u0454 HTML

ascanrules.persistentxssprime.name = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 (\u041f\u043e\u0441\u0442\u0456\u0439\u043d\u0438\u0439) - Prime

ascanrules.persistentxssspider.name = \u041c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 (\u041f\u043e\u0441\u0442\u0456\u0439\u043d\u0438\u0439) - Spider

ascanrules.remotecodeexecution.cve-2012-1823.desc = \u0414\u0435\u044f\u043a\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 PHP, \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0440\u043e\u0431\u043e\u0442\u0443 \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c CGI, \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c \u0440\u044f\u0434\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443, \u0443 \u044f\u043a\u0438\u0445 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u043d\u0435\u0435\u043a\u0440\u0430\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0441\u0438\u043c\u0432\u043e\u043b "\=", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434. \u0423 \u0446\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0431\u0443\u043b\u043e \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u043d\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u043c\u0430\u043d\u0434\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438, \u0430 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u043e \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0443.
ascanrules.remotecodeexecution.cve-2012-1823.name = \u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443 - CVE-2012-1823
ascanrules.remotecodeexecution.cve-2012-1823.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c PHP \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0441\u0442\u0430\u0431\u0456\u043b\u044c\u043d\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 Apache \u0456 \u043c\u043e\u0434\u0443\u043b\u044c mod_rewrite \u0434\u043b\u044f \u0444\u0456\u043b\u044c\u0442\u0440\u0430\u0446\u0456\u0457 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432 "RewriteCond" \u0456 "RewriteRule".

ascanrules.remotefileinclude.name = \u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0456\u0432

ascanrules.serversideinclude.desc = \u041f\u0435\u0432\u043d\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u043c\u0430\u043d\u0434 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u0426\u0435 \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u0434\u043e \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443.
ascanrules.serversideinclude.name = \u0421\u0435\u0440\u0432\u0435\u0440\u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0430 \u0432\u043a\u043b\u044e\u0447\u0430\u0454
ascanrules.serversideinclude.refs = https\://httpd.apache.org/docs/current/howto/ssi.html
ascanrules.serversideinclude.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044e \u0437 \u0431\u043e\u043a\u0443 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0442\u0430 \u0432\u0438\u043a\u043e\u043d\u0443\u0439\u0442\u0435 \u0441\u0443\u0432\u043e\u0440\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u0412\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u043d\u0456 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0438.\n\u0417\u0432\u0435\u0440\u043d\u0456\u0442\u044c\u0441\u044f \u0434\u043e \u043f\u043e\u0441\u0456\u0431\u043d\u0438\u043a\u0430, \u0449\u043e\u0431 \u0432\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.\n\u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043d\u0430\u0439\u043c\u0435\u043d\u0448\u0456 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457 \u0434\u043b\u044f \u0437\u0430\u043f\u0443\u0441\u043a\u0443 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0430\u0431\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c.\n\u0414\u043b\u044f Apache \u0432\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0435\:\n\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0412\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f FollowSymLinks \u0412\u043a\u043b\u044e\u0447\u0430\u0454\nAddType application/x-httpd-cgi .cgi\nAddType text/x-server-parsed-html .html

ascanrules.sourcecodedisclosurecve-2012-1823.desc = \u0414\u0435\u044f\u043a\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 PHP, \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u0440\u043e\u0431\u043e\u0442\u0443 \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c CGI, \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c \u0440\u044f\u0434\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443, \u0443 \u044f\u043a\u0438\u0445 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u043d\u0435\u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u0438\u0439 \u0441\u0438\u043c\u0432\u043e\u043b "\=", \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 PHP \u0456 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434. \u0423 \u0446\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0432\u043c\u0456\u0441\u0442 PHP \u0444\u0430\u0439\u043b\u0443 \u0431\u0443\u043b\u043e \u043f\u043e\u0434\u0430\u043d\u043e \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0443 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440. \u0426\u0435\u0439 \u0432\u0438\u0445\u0456\u0434 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043c\u0456\u0441\u0442\u0438\u0442\u0438\u043c\u0435 PHP, \u0445\u043e\u0447\u0430 \u0432\u0456\u043d \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0439 HTML.
ascanrules.sourcecodedisclosurecve-2012-1823.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - CVE-2012-1823
ascanrules.sourcecodedisclosurecve-2012-1823.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0441\u0442\u0430\u0431\u0456\u043b\u044c\u043d\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457 PHP \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 Apache \u0456 \u043c\u043e\u0434\u0443\u043b\u044c mod_rewrite, \u0449\u043e\u0431 \u0432\u0456\u0434\u0444\u0456\u043b\u044c\u0442\u0440\u0443\u0432\u0430\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432 \u00abRewriteCond\u00bb \u0456 \u00abRewriteRule\u00bb.

ascanrules.sourcecodedisclosurewebinf.desc = \u0412\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 Java \u0431\u0443\u0432 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438\u0439 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c \u0443 \u0444\u0430\u0439\u043b\u0430\u0445 \u043a\u043b\u0430\u0441\u0456\u0432 Java \u0443 \u0442\u0435\u0446\u0456 WEB-INF. \u0424\u0430\u0439\u043b\u0438 \u043a\u043b\u0430\u0441\u0456\u0432 \u043c\u043e\u0436\u043d\u0430 \u0440\u043e\u0437\u0456\u0431\u0440\u0430\u0442\u0438 \u0434\u043b\u044f \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443, \u044f\u043a\u0438\u0439 \u0434\u0443\u0436\u0435 \u0442\u043e\u0447\u043d\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u043e\u043c\u0443 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u043a\u043e\u0434\u0443.
ascanrules.sourcecodedisclosurewebinf.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443 - \u0442\u0435\u043a\u0430 /WEB-INF
ascanrules.sourcecodedisclosurewebinf.propertiesfile.desc = \u041a\u043b\u0430\u0441 Java \u0443 \u0442\u0435\u0446\u0456 /WEB-INF \u0432\u0438\u044f\u0432\u0438\u0432 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u0444\u0430\u0439\u043b\u0443 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0435\u0439. \u0424\u0430\u0439\u043b \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0435\u0439 \u043d\u0435 \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u0434\u043b\u044f \u0437\u0430\u0433\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0442\u0430 \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e, \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u0456 \u0434\u0430\u043d\u0456 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438 \u0430\u0431\u043e \u043a\u0440\u0438\u043f\u0442\u043e\u0433\u0440\u0430\u0444\u0456\u0447\u043d\u0456 \u043a\u043b\u044e\u0447\u0456.
ascanrules.sourcecodedisclosurewebinf.propertiesfile.extrainfo = \u041f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043d\u0430 \u0444\u0430\u0439\u043b \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0435\u0439 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0432 \u0440\u043e\u0437\u0456\u0431\u0440\u0430\u043d\u043e\u043c\u0443 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u043c\u0443 \u043a\u043e\u0434\u0456 Java \u0434\u043b\u044f \u043a\u043b\u0430\u0441\u0443 Java [{0}].
ascanrules.sourcecodedisclosurewebinf.propertiesfile.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0444\u0430\u0439\u043b\u0443 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0435\u0439 - \u0442\u0435\u043a\u0430 /WEB-INF
ascanrules.sourcecodedisclosurewebinf.propertiesfile.soln = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u0439 \u0442\u0430\u043a, \u0449\u043e\u0431 \u0442\u0435\u043a\u0430 /WEB-INF \u0430\u0431\u043e \u0457\u0457 \u0432\u043c\u0456\u0441\u0442 \u043d\u0435 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u043b\u0438\u0441\u044f \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u043c\u0438. \u0422\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0442\u0435\u043a\u0443 /WEB-INF.
ascanrules.sourcecodedisclosurewebinf.soln = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u0439 \u0442\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0449\u043e\u0431 \u043d\u0435 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0442\u0435\u043a\u0443 /WEB-INF \u0430\u0431\u043e \u0457\u0457 \u0432\u043c\u0456\u0441\u0442 \u0443 \u0432\u0435\u0431\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0447\u0430\u0445, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0432\u043e\u043d\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0442\u0430\u043a\u0443 \u044f\u043a \u0441\u043a\u043e\u043c\u043f\u0456\u043b\u044c\u043e\u0432\u0430\u043d\u0438\u0439 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 Java \u0456 \u0444\u0430\u0439\u043b\u0438 \u0432\u043b\u0430\u0441\u0442\u0438\u0432\u043e\u0441\u0442\u0435\u0439, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u0456 \u0434\u0430\u043d\u0456. \u041a\u043b\u0430\u0441\u0438 Java, \u0449\u043e \u0440\u043e\u0437\u0433\u043e\u0440\u0442\u0430\u044e\u0442\u044c\u0441\u044f \u0440\u0430\u0437\u043e\u043c \u0456\u0437 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043e\u044e, \u043c\u0430\u044e\u0442\u044c \u0431\u0443\u0442\u0438 \u043e\u0431\u0444\u0443\u0441\u043a\u043e\u0432\u0430\u043d\u0456 \u044f\u043a \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0432 \u043f\u0456\u0434\u0445\u043e\u0434\u0456 \u00ab\u043f\u043e\u0433\u043b\u0438\u0431\u043b\u0435\u043d\u043e\u0433\u043e \u0437\u0430\u0445\u0438\u0441\u0442\u0443\u00bb.

ascanrules.spring4shell.desc = \u0414\u043e\u0434\u0430\u0442\u043e\u043a \u0432\u0438\u044f\u0432\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043b\u044f CVE-2022-22965 (\u0442\u0430\u043a\u043e\u0436 \u0432\u0456\u0434\u043e\u043c\u043e\u0457 \u044f\u043a Spring4Shell) - \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443 (RCE) \u0447\u0435\u0440\u0435\u0437 \u0437\u0432'\u044f\u0437\u0443\u0432\u0430\u043d\u043d\u044f \u0434\u0430\u043d\u0438\u0445.
ascanrules.spring4shell.name = Spring4Shell
ascanrules.spring4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-22965\nhttps\://www.rapid7.com/blog/post/2022/03/30/spring4shell-zero-day-vulnerability-in-spring-framework/\nhttps\://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement\#vulnerability\nhttps\://tanzu.vmware.com/security/cve-2022-22965
ascanrules.spring4shell.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c Spring Framework \u0434\u043e \u0432\u0435\u0440\u0441\u0456\u0439 5.3.18, 5.2.20 \u0430\u0431\u043e \u043d\u043e\u0432\u0456\u0448\u043e\u0457.

ascanrules.springactuator.desc = Spring Actuator for Health \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e \u0442\u0430 \u043c\u043e\u0436\u0435 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0446\u044e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443. Spring Actuators \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0441\u043f\u0440\u0430\u0432\u0436\u043d\u044c\u043e\u0433\u043e \u043c\u043e\u043d\u0456\u0442\u043e\u0440\u0438\u043d\u0433\u0443, \u0430\u043b\u0435 \u0457\u0445 \u0441\u043b\u0456\u0434 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0437 \u043e\u0431\u0435\u0440\u0435\u0436\u043d\u0456\u0441\u0442\u044e, \u0449\u043e\u0431 \u043d\u0435 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438 \u0437\u0430\u043d\u0430\u0434\u0442\u043e \u0431\u0430\u0433\u0430\u0442\u043e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443 \u0447\u0438 \u0456\u043d\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443, \u043d\u0430 \u044f\u043a\u0456\u0439 \u0432\u043e\u043d\u0430 \u0432\u0438\u043a\u043e\u043d\u0443\u0454\u0442\u044c\u0441\u044f.
ascanrules.springactuator.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 Spring Actuator
ascanrules.springactuator.refs = https\://docs.spring.io/spring-boot/docs/current/actuator-api/htmlsingle/\#overview
ascanrules.springactuator.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c Health Actuators \u0442\u0430 \u0456\u043d\u0448\u0456 \u0430\u043a\u0442\u0438\u0432\u0430\u0442\u043e\u0440\u0438 \u0430\u0431\u043e \u043e\u0431\u043c\u0435\u0436\u0442\u0435 \u0457\u0445 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0456\u0437 \u043f\u0440\u0430\u0432\u0430\u043c\u0438 \u0430\u0434\u043c\u0456\u043d\u0456\u0441\u0442\u0440\u0430\u0442\u043e\u0440\u0430.

#ascanrules.sqlinjection.alert.errorbased.attack={1}
ascanrules.sqlinjection.alert.booleanbased.attack = \u043f\u043e\u043b\u0435\: [{0}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{1}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo = \u0420\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u0438 \u0443\u0441\u043f\u0456\u0448\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u0435\u043d\u0456 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043b\u043e\u0433\u0456\u0447\u043d\u0438\u0445 \u0443\u043c\u043e\u0432 [{0}] \u0456 [{1}]\n\u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430, \u0449\u043e \u0437\u043c\u0456\u043d\u044e\u0454\u0442\u044c\u0441\u044f, \u0431\u0443\u043b\u043e {2}\u0432\u0438\u043b\u0443\u0447\u0435\u043d\u043e \u0437 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0443 HTML \u0434\u043b\u044f \u0446\u0456\u043b\u0435\u0439 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u044f
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists = \u041f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043e \u0434\u0430\u043d\u0456 \u0434\u043b\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430.\n\u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u0430 \u0448\u043b\u044f\u0445\u043e\u043c \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u0433\u043e \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u043d\u044f \u043f\u0435\u0440\u0432\u0456\u0441\u043d\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists = \u0414\u0430\u043d\u0456 \u041d\u0415 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u043e \u0434\u043b\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430.\n\u0412\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u0430 \u0448\u043b\u044f\u0445\u043e\u043c \u0443\u0441\u043f\u0456\u0448\u043d\u043e\u0433\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0431\u0456\u043b\u044c\u0448\u043e\u0457 \u043a\u0456\u043b\u044c\u043a\u043e\u0441\u0442\u0456 \u0434\u0430\u043d\u0438\u0445, \u043d\u0456\u0436 \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u043e, \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c
ascanrules.sqlinjection.alert.errorbased.attack = [{0}] \u043f\u043e\u043b\u0435\: [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack = \u041e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\: [{0}]. \u0417\u043c\u0456\u043d\u0435\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\: [{1}]. \u041a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\: [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo = \u041d\u0435\u0437\u043c\u0456\u043d\u0435\u043d\u043e\u043c\u0443 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044e \u043f\u0440\u0438\u0441\u0432\u043e\u0454\u043d\u043e \u0441\u0442\u0430\u0442\u0443\u0441 HTTP [{0}], \u0434\u043e\u0432\u0436\u0438\u043d\u0443 \u0442\u0456\u043b\u0430 [{1}], \u0437\u043c\u0456\u043d\u0435\u043d\u043e\u043c\u0443 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044e \u043f\u0440\u0438\u0441\u0432\u043e\u0454\u043d\u043e \u0441\u0442\u0430\u0442\u0443\u0441 HTTP [{2}], \u0434\u043e\u0432\u0436\u0438\u043d\u0443 \u0442\u0456\u043b\u0430 [{3}]. \u0422\u0440\u0435\u0442\u0454 (\u043d\u0435-SQL \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f, \u0449\u043e \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0454 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f) \u043c\u0430\u0454 \u0441\u0442\u0430\u0442\u0443\u0441 HTTP [{4}], \u0434\u043e\u0432\u0436\u0438\u043d\u0443 \u0442\u0456\u043b\u0430 [{5}].
ascanrules.sqlinjection.alert.errorbased.extrainfo = RDBMS [{0}], \u0456\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u0437\u0430\u0434\u0430\u043d\u043e \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 [{1}], \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0430\u043c HTML.\n\u0412\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u0430 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u0430 \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c, \u0449\u043e\u0431 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043d\u044f \u0442\u0430 \u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo = \u041d\u0435\u0437\u043c\u0456\u043d\u0435\u043d\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043c\u0430\u0454 \u0441\u0442\u0430\u0442\u0443\u0441 HTTP [{0}], \u0437\u043c\u0456\u043d\u0435\u043d\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043c\u0430\u0454 \u0441\u0442\u0430\u0442\u0443\u0441 HTTP [{1}]
ascanrules.sqlinjection.alert.expressionbased.extrainfo = \u041f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0456 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u043e \u0443\u0441\u043f\u0456\u0448\u043d\u043e \u0432\u0456\u0434\u0442\u0432\u043e\u0440\u0435\u043d\u043e \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u0432\u0438\u0440\u0430\u0437\u0443 [{0}] \u044f\u043a \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\n\u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430, \u0449\u043e \u0437\u043c\u0456\u043d\u044e\u0454\u0442\u044c\u0441\u044f, \u0431\u0443\u043b\u043e {1}\u0432\u0438\u043b\u0443\u0447\u0435\u043d\u043e \u0437 \u0432\u0438\u0432\u043e\u0434\u0443 HTML \u0434\u043b\u044f \u0446\u0456\u043b\u0435\u0439 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u044f
ascanrules.sqlinjection.alert.orderbybased.extrainfo = \u041f\u043e\u0447\u0430\u0442\u043a\u043e\u0432\u0456 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0438 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0431\u0443\u043b\u043e \u0443\u0441\u043f\u0456\u0448\u043d\u043e \u0432\u0456\u0434\u0442\u0432\u043e\u0440\u0435\u043d\u043e \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0438\u0440\u0430\u0437\u0443 "\u0421\u041e\u0420\u0422\u0423\u0412\u0410\u0422\u0418 \u0417\u0410" [{0}] \u044f\u043a \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\n\u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430, \u0449\u043e \u0437\u043c\u0456\u043d\u044e\u0454\u0442\u044c\u0441\u044f, \u0431\u0443\u043b\u043e {1}\u0432\u0438\u043b\u0443\u0447\u0435\u043d\u043e \u0437 \u0432\u0438\u0432\u043e\u0434\u0443 HTML \u0434\u043b\u044f \u0446\u0456\u043b\u0435\u0439 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u044f
ascanrules.sqlinjection.alert.timebased.extrainfo = \u0427\u0430\u0441 \u0437\u0430\u043f\u0438\u0442\u0443 \u043c\u043e\u0436\u043d\u0430 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{0}], \u0447\u0435\u0440\u0435\u0437 \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0437\u0430\u0439\u043c\u0430\u0432 [{1}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434, \u0442\u043e\u0434\u0456 \u044f\u043a \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043d\u0435\u0437\u043c\u0456\u043d\u0435\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{2}] \u0437\u0430\u0439\u043c\u0430\u0432 [{3}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434
ascanrules.sqlinjection.alert.unionbased.attack = [{0}] \u043f\u043e\u043b\u0435\: [{1}], \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f [{2}]
ascanrules.sqlinjection.alert.unionbased.extrainfo = RDBMS [{0}] \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u0432\u0440\u0430\u0445\u043e\u0432\u0443\u044e\u0447\u0438 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 UNION [{1}], \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0430\u043c HTML\n\u0412\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0448\u043b\u044f\u0445\u043e\u043c \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043f\u0440\u043e\u043f\u043e\u0437\u0438\u0446\u0456\u0457 SQL ''UNION'', \u0449\u043e\u0431 \u0441\u043f\u0440\u0438\u0447\u0438\u043d\u0438\u0442\u0438 \u043f\u043e\u0432\u0435\u0440\u043d\u0435\u043d\u043d\u044f \u0442\u0430 \u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445
ascanrules.sqlinjection.authbypass.desc = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0435 \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0432\u0445\u043e\u0434\u0443, \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0447\u0438 \u043e\u0431\u0456\u0439\u0442\u0438 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438
ascanrules.sqlinjection.authbypass.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f SQL - \u043e\u0431\u0445\u0456\u0434 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457
ascanrules.sqlinjection.desc = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f SQL \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0435.
ascanrules.sqlinjection.hypersonic.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f SQL - Hypersonic SQL
ascanrules.sqlinjection.mssql.alert.timebased.extrainfo = \u0427\u0430\u0441 \u0437\u0430\u043f\u0438\u0442\u0443 \u043c\u043e\u0436\u043d\u0430 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{0}], \u0447\u0435\u0440\u0435\u0437 \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0437\u0430\u0439\u043c\u0430\u0432 [{1}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434, \u0442\u043e\u0434\u0456 \u044f\u043a \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043d\u0435\u0437\u043c\u0456\u043d\u0435\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{2}] \u0437\u0430\u0439\u043c\u0430\u0432 [{3}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434.
ascanrules.sqlinjection.mssql.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f - MsSQL
ascanrules.sqlinjection.mysql.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f - MySQL
ascanrules.sqlinjection.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f
ascanrules.sqlinjection.oracle.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f - Oracle
ascanrules.sqlinjection.postgres.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f - PostgreSQL
ascanrules.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanrules.sqlinjection.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u0438\u043c \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0456\u0441\u043d\u0443\u0454 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\u0417\u0430\u0433\u0430\u043b\u043e\u043c, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.\n\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 JDBC, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 PreparedStatement \u0430\u0431\u043e CallableStatement \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c\u0438, \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u0438\u043c\u0438 \u0447\u0435\u0440\u0435\u0437 '?'\n\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 ASP, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 ADO Command Objects \u0456\u0437 \u0441\u0438\u043b\u044c\u043d\u043e\u044e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0442\u0438\u043f\u0443 \u0442\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0437\u0430\u043f\u0438\u0442\u0430\u043c\u0438.\n\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0438 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0457\u0445.\n*\u041d\u0435* \u043e\u0431\u2019\u0454\u0434\u043d\u0443\u0439\u0442\u0435 \u0440\u044f\u0434\u043a\u0438 \u0432 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456\u0439 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0456 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u00abexec\u00bb, \u00abexec immediate\u00bb \u0430\u0431\u043e \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457\!\n\u041d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0439\u0442\u0435 \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u0456 SQL-\u0437\u0430\u043f\u0438\u0442\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043f\u0440\u043e\u0441\u0442\u0443 \u043a\u043e\u043d\u043a\u0430\u0442\u0435\u043d\u0430\u0446\u0456\u044e \u0440\u044f\u0434\u043a\u0456\u0432.\n\u0412\u0438\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456, \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u0456 \u0432\u0456\u0434 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 \u00ab\u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0445\u00bb \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0445 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0430\u0431\u043e \u00ab\u0441\u043f\u0438\u0441\u043e\u043a \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0438\u0445\u00bb \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0438\u0445 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0443 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c.\n\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 \u043f\u0440\u0438\u043d\u0446\u0438\u043f \u043d\u0430\u0439\u043c\u0435\u043d\u0448\u0438\u0445 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043d\u0430\u0439\u043c\u0435\u043d\u0448 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0439\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445.\n\u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u0443\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445 \u00absa\u00bb \u0430\u0431\u043e \u00abdb-owner\u00bb. \u0426\u0435 \u043d\u0435 \u0443\u0441\u0443\u0432\u0430\u0454 SQL-\u0456\u043d\u2019\u0454\u043a\u0446\u0456\u044e, \u0430\u043b\u0435 \u043c\u0456\u043d\u0456\u043c\u0456\u0437\u0443\u0454 \u0457\u0457 \u0432\u043f\u043b\u0438\u0432.\n\u041d\u0430\u0434\u0430\u0439\u0442\u0435 \u043c\u0456\u043d\u0456\u043c\u0430\u043b\u044c\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u043d\u0435\u043e\u0431\u0445\u0456\u0434\u043d\u0438\u0439 \u0434\u043b\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438.
ascanrules.sqlinjection.sqlite.alert.errorbased.extrainfo = \u0411\u0443\u043b\u043e \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0435 \u0432\u0456\u0434\u043e\u043c\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 SQLite\: [{0}].
ascanrules.sqlinjection.sqlite.alert.timebased.extrainfo = \u0427\u0430\u0441 \u0437\u0430\u043f\u0438\u0442\u0443 \u043c\u043e\u0436\u043d\u0430 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{0}], \u0447\u0435\u0440\u0435\u0437 \u044f\u043a\u0435 \u0437\u0430\u043f\u0438\u0442 \u0437\u0430\u0439\u043c\u0430\u0454 [{1}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434, \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 [{2}], \u0447\u0435\u0440\u0435\u0437 \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u0437\u0430\u0439\u043c\u0430\u0454 [{3}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434, \u043a\u043e\u043b\u0438 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043d\u0435\u0437\u043c\u0456\u043d\u0435\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442 \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c [{4}] \u0437\u0430\u0439\u043d\u044f\u0432 [{5}] \u043c\u0456\u043b\u0456\u0441\u0435\u043a\u0443\u043d\u0434.
ascanrules.sqlinjection.sqlite.alert.versionnumber.extrainfo = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0430\u0442\u0430\u043a\u0443 SQL Injection \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 UNION \u0456 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u043e\u0433\u043e \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f SQLite, \u0431\u0443\u043b\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e, \u0449\u043e \u0432\u0435\u0440\u0441\u0456\u044f SQLite [{0}].\n\u0417\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0442\u043e\u0447\u043e\u043a \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u043f\u043e\u0432\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0432\u0435\u0440\u0441\u0456\u044e SQLite, \u0430\u043b\u0435 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0447\u0438\u0441\u043b\u043e\u0432\u0438\u0445 \u0442\u043e\u0447\u043e\u043a \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u043b\u0438\u0448\u0435 \u0447\u0430\u0441\u0442\u043a\u043e\u0432\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0432\u0435\u0440\u0441\u0456\u044e SQLite.\n\u0411\u0456\u043b\u044c\u0448\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0432\u0435\u0440\u0441\u0456\u044e SQLite [{0}] \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e \u0437\u0430 \u0430\u0434\u0440\u0435\u0441\u043e\u044e https\://www.sqlite.org/changes.html
ascanrules.sqlinjection.sqlite.name = SQL \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f - SQLite

ascanrules.ssti.alert.otherinfo = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0436\u0435\u043d\u043d\u044f \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043d\u0430 [{0}]\n\u0437\u043c\u0456\u0441\u0442\:\n[{1}]
ascanrules.ssti.desc = \u041a\u043e\u043b\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0432\u0441\u0442\u0430\u0432\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u0432 \u0448\u0430\u0431\u043b\u043e\u043d \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u044f\u043a \u0430\u0440\u0433\u0443\u043c\u0435\u043d\u0442 \u043f\u0456\u0434 \u0447\u0430\u0441 \u0432\u0456\u0437\u0443\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457, \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u043e\u0431\u0440\u043e\u0431\u043d\u0438\u043a\u043e\u043c \u0448\u0430\u0431\u043b\u043e\u043d\u0456\u0432. \u0417\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u0443 \u0448\u0430\u0431\u043b\u043e\u043d\u0456\u0432 \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443.
ascanrules.ssti.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0448\u0430\u0431\u043b\u043e\u043d\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430
ascanrules.ssti.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.ssti.soln = \u0417\u0430\u043c\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u0432\u043b\u044f\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0443 \u0448\u0430\u0431\u043b\u043e\u043d, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0439\u043e\u0433\u043e \u044f\u043a \u0430\u0440\u0433\u0443\u043c\u0435\u043d\u0442 \u0440\u0435\u043d\u0434\u0435\u0440\u0438\u043d\u0433\u0443.

ascanrules.sstiblind.alert.recvdcallback.otherinfo = \u041e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0437\u0432\u043e\u0440\u043e\u0442\u043d\u0438\u0439 \u0434\u0437\u0432\u0456\u043d\u043e\u043a \u0432\u0456\u0434 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.
ascanrules.sstiblind.desc = \u041a\u043e\u043b\u0438 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0432\u0441\u0442\u0430\u0432\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u0432 \u0448\u0430\u0431\u043b\u043e\u043d \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u044f\u043a \u0430\u0440\u0433\u0443\u043c\u0435\u043d\u0442 \u043f\u0456\u0434 \u0447\u0430\u0441 \u0432\u0456\u0437\u0443\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457, \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u043e\u0431\u0440\u043e\u0431\u043d\u0438\u043a\u043e\u043c \u0448\u0430\u0431\u043b\u043e\u043d\u0456\u0432. \u0417\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u0443 \u0448\u0430\u0431\u043b\u043e\u043d\u0456\u0432 \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443.
ascanrules.sstiblind.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0448\u0430\u0431\u043b\u043e\u043d\u0443 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 (\u0441\u043b\u0456\u043f\u0435 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f)
ascanrules.sstiblind.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.sstiblind.soln = \u0417\u0430\u043c\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e\u0431 \u0432\u0441\u0442\u0430\u0432\u043b\u044f\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0443 \u0448\u0430\u0431\u043b\u043e\u043d, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0439\u043e\u0433\u043e \u044f\u043a \u0430\u0440\u0433\u0443\u043c\u0435\u043d\u0442 \u0440\u0435\u043d\u0434\u0435\u0440\u0438\u043d\u0433\u0443.

ascanrules.traceaxd.desc = Trace Viewer ASP.NET (trace.axd) \u0432\u0438\u044f\u0432\u0438\u0432\u0441\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c. \u0426\u0435\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0437\u043d\u0430\u0447\u043d\u043e\u0457 \u043a\u0456\u043b\u044c\u043a\u043e\u0441\u0442\u0456 \u0446\u0456\u043d\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457.
ascanrules.traceaxd.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 Trace.axd
ascanrules.traceaxd.otherinfo = \u041d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043a\u043e\u0434\u0443 \u0441\u0442\u0430\u0442\u0443\u0441\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 Trace Viewer \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u043e\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0430\u0431\u043e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457.
ascanrules.traceaxd.refs = https\://msdn.microsoft.com/en-us/library/bb386420.aspx\nhttps\://msdn.microsoft.com/en-us/library/wwh16c6c.aspx\nhttps\://www.dotnetperls.com/trace
ascanrules.traceaxd.soln = \u041f\u043e\u0434\u0443\u043c\u0430\u0439\u0442\u0435, \u0447\u0438 \u0434\u0456\u0439\u0441\u043d\u043e Trace Viewer \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0446\u0442\u0432\u0456, \u044f\u043a\u0449\u043e \u0432\u0456\u043d \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d, \u0442\u043e\u0434\u0456 \u0432\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u0439\u043e\u0433\u043e. \u042f\u043a\u0449\u043e \u0446\u0435 \u0442\u0430\u043a, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0435\u0431\u0443\u0454 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0442\u0430 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457.

ascanrules.useragent.desc = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u043d\u0430 \u0432\u0456\u0434\u043c\u0456\u043d\u043d\u043e\u0441\u0442\u0456 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u043d\u0435\u0447\u0456\u0442\u043a\u043e\u0433\u043e \u0430\u0433\u0435\u043d\u0442\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u043c\u043e\u0431\u0456\u043b\u044c\u043d\u0456 \u0441\u0430\u0439\u0442\u0438, \u0434\u043e\u0441\u0442\u0443\u043f \u0432 \u044f\u043a\u043e\u0441\u0442\u0456 Search Engine Crawler). \u041f\u043e\u0440\u0456\u0432\u043d\u044f\u0439\u0442\u0435 \u043a\u043e\u0434 \u0441\u0442\u0430\u0442\u0443\u0441\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0442\u0430 \u0445\u0435\u0448-\u043a\u043e\u0434 \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437 \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u043e\u044e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0434\u044e.
ascanrules.useragent.name = Fuzzer \u0430\u0433\u0435\u043d\u0442\u0430-\u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430
ascanrules.useragent.refs = https\://owasp.org/wstg
ascanrules.useragent.useragentparmname = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0430\u0433\u0435\u043d\u0442\u0430-\u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430

ascanrules.xpathinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f XPath

ascanrules.xsltinjection.command.otherinfo = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u043c\u0430\u043d\u0434\u0438.
ascanrules.xsltinjection.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c XSL-\u0442\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439, \u0449\u043e \u043c\u043e\u0436\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u0447\u0438\u0442\u0430\u0442\u0438 \u0441\u0438\u0441\u0442\u0435\u043c\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0447\u0438\u0442\u0430\u0442\u0438 \u0442\u0430 \u0437\u0430\u043f\u0438\u0441\u0443\u0432\u0430\u0442\u0438 \u0444\u0430\u0439\u043b\u0438 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043a\u043e\u0434.
ascanrules.xsltinjection.error.otherinfo = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u043d\u043d\u044f XSLT-\u0442\u043e\u043a\u0435\u043d\u0443 \u043c\u0456\u0441\u0442\u0438\u043b\u0430 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0438, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0441\u0432\u0456\u0434\u0447\u0438\u0442\u0438 \u043f\u0440\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0434\u043e XSLT-dghjdfl\u00f1tym.
ascanrules.xsltinjection.name = \u0406\u043d'\u0454\u043a\u0446\u0456\u044f XSLT
ascanrules.xsltinjection.portscan.otherinfo = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0440\u0442\u0443.
ascanrules.xsltinjection.refs = https\://www.contextis.com/blog/xslt-server-side-injection-attacks
ascanrules.xsltinjection.soln = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0442\u0430 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0439\u0442\u0435 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456, \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c, \u0449\u043e \u043d\u0430\u0434\u0445\u043e\u0434\u044f\u0442\u044c \u0437 \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0457 \u043a\u043b\u0456\u0454\u043d\u0442\u0441\u044c\u043a\u043e\u0457 \u0441\u0442\u043e\u0440\u043e\u043d\u0438.
ascanrules.xsltinjection.vendor.otherinfo = \u041f\u0456\u0441\u043b\u044f \u0437\u0430\u043f\u0438\u0442\u0443 \u043d\u0430 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0431\u0443\u043b\u043e \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0442\u043e \u0456\u043c''\u044f \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u043a\u0430 XSLT-\u043f\u0440\u043e\u0446\u0435\u0441\u043e\u0440\u0430 "{0}".

ascanrules.xxe.name = \u0410\u0442\u0430\u043a\u0430 \u043d\u0430 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u0456 \u043e\u0431'\u0454\u043a\u0442\u0438 XML
