
ascanrules.bufferoverflow.desc = Los errores de Buffer Overflow se caracterizan por la sobrescritura de espacios de memoria del proceso web en segundo plano, que no deber\u00edan haber sido modificados, intencionadamente o no. Sobrescribir los valores de IP (Instruction Pointer), BP (Base Pointer) y otros registros causan excepciones, violaciones del segmento y otros errores. Normalmente estos errores terminan la ejecuci\u00f3n de la aplicaci\u00f3n de manera inseperada. 
ascanrules.bufferoverflow.name = Buffer Overflow
ascanrules.bufferoverflow.other = Potencial Buffer Overflow. El script ha cerrado la conexi\u00f3n y ha lanzado un error interno del servidor 500
ascanrules.bufferoverflow.refs = https\://owasp.org/www-community/attacks/Buffer_overflow_attack
ascanrules.bufferoverflow.soln = Reescribir el programa en segundo plano realizando una correcta comprobaci\u00f3n de la longitud de retorno. Esto requerir\u00e1 el recompilado del ejecutable en segundo plano.

ascanrules.cloudmetadata.desc = El Ataque a los Metadatos de la Nube intenta abusar de un servidor NGINX mal configurado para acceder a la instancia de los metadatos mantenidos por proveedores de servicios en la nube como AWS, GCP y Azure.\nTodos estos proveedores proporcionan metadatos a trav\u00e9s de una direcci\u00f3n IP interna no enrutable '169.254.169.254' - esta puede ser expuesta por servidores NGINX configurados incorrectamente y accedida utilizando esta direcci\u00f3n IP en el campo head Host.\n\nTraducci\u00f3n realizada con la versi\u00f3n gratuita del traductor www.DeepL.com/Translator
ascanrules.cloudmetadata.name = Metadatos de la Nube Potencialmente Expuestos
ascanrules.cloudmetadata.otherinfo = Seg\u00fan el c\u00f3digo de estado de la respuesta correcta, es posible que se hayan devuelto metadatos de nube en la respuesta (response). Compruebe los datos de respuesta para ver si se ha devuelto alg\u00fan metadato de nube.\nLos metadatos devueltos pueden incluir informaci\u00f3n que permitir\u00eda a un atacante comprometer completamente el sistema.
ascanrules.cloudmetadata.refs = https\://www.nginx.com/blog/trust-no-one-perils-of-trusting-user-input/
ascanrules.cloudmetadata.soln = No conf\u00ede en ning\u00fan dato de usuario en las configuraciones de NGINX. En este caso, probablemente sea el uso de la variable $host que se establece desde el encabezado (header) 'Host' y puede estar controlado por un atacante.

ascanrules.codeinjection.desc = Una inyecci\u00f3n de c\u00f3digo puede ser posible, que incluya un c\u00f3digo personalizado que ser\u00e1 evaluado por el motor de secuencias de comandos
ascanrules.codeinjection.name = Server Side Code Injection
ascanrules.codeinjection.name.asp = Inyecci\u00f3n de C\u00f3digo en el Lado del Servidor - Inyecci\u00f3n de c\u00f3digo ASP
ascanrules.codeinjection.name.php = Inyecci\u00f3n de C\u00f3digo en el Lado del Servidor - Inyecci\u00f3n de c\u00f3digo PHP
ascanrules.codeinjection.refs = https\://cwe.mitre.org/data/definitions/94.html\nhttps\://owasp.org/www-community/attacks/Direct_Dynamic_Code_Evaluation_Eval%20Injection
ascanrules.codeinjection.soln = No conf\u00ede en los valores de entrada del lado del cliente, incluso si en el lado del cliente se realice una validaci\u00f3n.\nEn general, comprobar todos los datos de entrada en el lado del servidor y escapar de todos los datos recibidos desde el cliente.\nEvite el uso de funciones eval() combinados con los datos de entrada del usuario.

ascanrules.commandinjection.desc = T\u00e9cnica de ataque utilizada para la ejecuci\u00f3n no autorizada de comandos del sistema operativo. Este ataque es posible cuando una aplicaci\u00f3n acepta datos de entrada que no son de confianza para crear comandos del sistema operativo de manera insegura, lo que implica que tiene un filtro de datos inadecuado y/o una llamada incorrecta de programas externos.
ascanrules.commandinjection.name = Remote OS Command Injection (Inyecci\u00f3n Remota de Comandos del Sistema Operativo)
ascanrules.commandinjection.otherinfo.feedback-based = La regla de escaneo pudo recuperar el contenido de un archivo o comando enviando [{0}] al sistema operativo que ejecuta esta aplicaci\u00f3n
ascanrules.commandinjection.otherinfo.time-based = La regla de escaneo pudo controlar el tiempo de respuesta de la aplicaci\u00f3n enviando [{0}] al sistema operativo que ejecuta esta aplicaci\u00f3n
ascanrules.commandinjection.refs = https\://cwe.mitre.org/data/definitions/78.html\nhttps\://owasp.org/www-community/attacks/Command_Injection

ascanrules.crlfinjection.desc = La cookie se puede modificar con inyecci\u00f3n CRLF. Tambi\u00e9n es posible establecer encabezados de respuesta HTTP arbitrarios. Adem\u00e1s, al crear cuidadosamente la respuesta para inyectar mediante secuencias de comandos entre sitios XSS, tambi\u00e9n puede darse una vulnerabilidad de envenenamiento de cach\u00e9.
ascanrules.crlfinjection.name = Inyecci\u00f3n CRLF
ascanrules.crlfinjection.refs = https\://owasp.org/www-community/vulnerabilities/CRLF_Injection\nhttps\://cwe.mitre.org/data/definitions/113.html
ascanrules.crlfinjection.soln = Verifique cuidadosamente el par\u00e1metro enviado. No permita que se inyecte CRLF filtrando CRLF.

ascanrules.crosssitescripting.json.desc = Se encontr\u00f3 un ataque XSS reflejado en una respuesta JSON, esto podr\u00eda dejar a los usuarios del contenido vulnerables a un ataque si no controlan adecuadamente los datos (respuesta).
ascanrules.crosssitescripting.json.name = Cross Site Scripting XSS (reflejada en la respuesta de JSON)
ascanrules.crosssitescripting.name = Cross Site Scripting (Reflected)
ascanrules.crosssitescripting.otherinfo.accesskey = El atributo accesskey especifica una tecla de atajo para activar/enfocar un elemento. Este atributo puede desencadenar cargas \u00fatiles para etiquetas no convencionales o personalizadas.
ascanrules.crosssitescripting.otherinfo.nothtml = Creado con confianza BAJA, ya que Content-Type no es HTML

ascanrules.desc = Liberar el estado de las reglas activas de escaneo

ascanrules.directorybrowsing.desc = Es posible listar el directorio de sistema. El directorio de sistema puede mostrar scripts ocultos, archivos, archivos de copia de seguridad, etc., a los que se puede acceder para leer su informaci\u00f3n.
ascanrules.directorybrowsing.name = Directory Browsing (Exploraci\u00f3n de directorios)
ascanrules.directorybrowsing.refs = https\://httpd.apache.org/docs/mod/core.html\#options
ascanrules.directorybrowsing.soln = Deshabilita el explorador de archivos. Si es necesario, aseg\u00farate de que los archivos que pueda mostrar no sean un riesgo.

ascanrules.elmah.desc = Los M\u00f3dulos Error Logging y Handlers (ELMAH [elmah.axd]) M\u00f3dulo HTTP fue encontrado disponible. Este m\u00f3dulo puede tener fugas de una cantidad importante de informaci\u00f3n valiosa.
ascanrules.elmah.name = ELMAH Information Leak (Fuga de informaci\u00f3n ELMAH)
ascanrules.elmah.otherinfo = Basado en el c\u00f3digo de estado de respuesta ELMAH podr\u00eda estar protegida por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.  
ascanrules.elmah.refs = https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanrules.elmah.soln = Considere si o no ELMAH es actualmente requerido en la producci\u00f3n, si no es as\u00ed entonces deshabilitarlo. Si lo es, asegurar que el acceso al mismo requiere autenticaci\u00f3n y autorizaci\u00f3n. Vea tambi\u00e9n\: https\://elmah.github.io/a/securing-error-log-pages/

ascanrules.envfiles.desc = Parece que se han ubicado uno o m\u00e1s archivos .env en el servidor. Estos archivos a menudo exponen credenciales de cuentas administrativas o de infraestructura, claves de API o APP u otra informaci\u00f3n de configuraci\u00f3n confidencial. 
ascanrules.envfiles.name = Fuga de informaci\u00f3n .env
ascanrules.envfiles.otherinfo = Seg\u00fan el c\u00f3digo de estado de respuesta, el archivo .env puede estar protegido por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.
ascanrules.envfiles.refs = https\://www.google.com/search?q\=db_password+filetype%3Aenv\nhttps\://mobile.twitter.com/svblxyz/status/1045013939904532482
ascanrules.envfiles.soln = Aseg\u00farate de que el archivo .env no sea accesible.

ascanrules.externalredirect.name = Redirecci\u00f3n Externa
ascanrules.externalredirect.reason.javascript = La respuesta contiene una redirecci\u00f3n en su c\u00f3digo JavaScript que permite establecer una URL externa.
ascanrules.externalredirect.reason.location.header = La respuesta contiene una redirecci\u00f3n en su encabezado de ubicaci\u00f3n que permite configurar una URL externa.
ascanrules.externalredirect.reason.location.meta = La respuesta contiene una redirecci\u00f3n en su etiqueta meta http-equiv para 'Location' que permite configurar una URL externa.
ascanrules.externalredirect.reason.notfound = No se encontr\u00f3 raz\u00f3n para ello...
ascanrules.externalredirect.reason.refresh.header = La respuesta contiene una redirecci\u00f3n en su encabezado Refresh (header) que permite establecer una URL externa.
ascanrules.externalredirect.reason.refresh.meta = La respuesta contiene una redirecci\u00f3n en su etiqueta meta http-equiv para 'Refresh' que permite configurar una URL externa.

ascanrules.formatstring.desc = Un error de formato de cadena ocurre cuando los datos de una cadena de entrada es evaluada como un comando por la aplicaci\u00f3n. 
ascanrules.formatstring.error1 = Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en /%s
ascanrules.formatstring.error2 = Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en /%s y /%x
ascanrules.formatstring.error3 = Potencial error de formato de cadena. El script cerr\u00f3 la conexi\u00f3n en una cadena de formato de error de microsoft
ascanrules.formatstring.name = Format String Error (Error de formato de cadena)
ascanrules.formatstring.refs = https\://owasp.org/www-community/attacks/Format_string_attack
ascanrules.formatstring.soln = Reescribir el programa en segundo plano usando un borrado apropiado de las cadenas de caracteres err\u00f3neas. Esto requerir\u00e1 el recompilado del ejecutable en segundo plano.

ascanrules.getforpost.desc = Una solicitud que originalmente se observ\u00f3 como POST tambi\u00e9n se acept\u00f3 como GET. Este problema no representa una debilidad de seguridad en s\u00ed mismo, sin embargo, puede facilitar la simplificaci\u00f3n de otros ataques. Por ejemplo, si el POST original est\u00e1 sujeto a Cross-Site Scripting (XSS), este descubrimiento puede indicar que tambi\u00e9n es posible un ataque XSS simplificado (basado en GET).
ascanrules.getforpost.name = GET para POST
ascanrules.getforpost.soln = Aseg\u00farate de que solo se acepta POST donde se espera POST.

ascanrules.heartbleed.desc = La implementaci\u00f3n de TLS en OpenSSL 1.0.1 antes de 1.0.1g, no maneja adecuadamente los paquetes de extensi\u00f3n Heartbeat, lo que permite a los atacantes remotos obtener informaci\u00f3n confidencial de la memoria de proceso mediante paquetes hechos a mano que desencadenan un b\u00fafer de lectura excesiva, para potencialmente revelar informaci\u00f3n confidencial.
ascanrules.heartbleed.extrainfo = Este problema se confirm\u00f3 extrayendo datos del servidor mediante {0}. Es poco probable que sea un falso positivo.
ascanrules.heartbleed.name = Vulnerabilidades de OpenSSL HeartBleed
ascanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
ascanrules.heartbleed.soln = Actualice a OpenSSL 1.0.1g o superior. Vuelva a emitir los certificados HTTPS. Cambie las claves privadas asim\u00e9tricas y las claves secretas compartidas, ya que pueden haber sido comprometidas, sin que haya evidencia de ello en los archivos de registro del servidor.

ascanrules.hidden.files.alert.name = Hidden File Found (Archivo Oculto Encontrado)
ascanrules.hidden.files.desc = Se identific\u00f3 un archivo confidencial como accesible o disponible. Esto puede filtrar informaci\u00f3n administrativa, de configuraci\u00f3n o de credenciales que puede ser aprovechada por un individuo malintencionado para atacar m\u00e1s adelante el sistema o mejorar la manera en que realiza ataques de ingenier\u00eda social.
ascanrules.hidden.files.name = Hidden File Finder (Buscador de Archivos Ocultos)
ascanrules.hidden.files.refs = https\://blog.hboeck.de/archives/892-Introducing-Snallygaster-a-Tool-to-Scan-for-Secrets-on-Web-Servers.html
ascanrules.hidden.files.soln = Considera si este componente es realmente necesario en producci\u00f3n; si no es as\u00ed, desact\u00edvelo. Si es as\u00ed, asegurar que el acceso requiera la autenticaci\u00f3n y autorizaci\u00f3n adecuadas, o limita la exposici\u00f3n solo a sistemas internos o IPs de origen definidas, etc.

ascanrules.htaccess.desc = Los archivos htaccess se usan para modificar la configuraci\u00f3n del software Apache Web Server, y para habilitar/deshabilitar funciones y caracter\u00edsticas adicionales que el software Apache Web Server puede ofrecer. 
ascanrules.htaccess.name = Filtrado de informaci\u00f3n en .htaccess
ascanrules.htaccess.otherinfo = Seg\u00fan el c\u00f3digo de estado de respuesta, el archivo htaccess puede estar protegido por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.
ascanrules.htaccess.refs = https\://developer.mozilla.org/en-US/docs/Learn/Server-side/Apache_Configuration_htaccess\nhttps\://httpd.apache.org/docs/2.4/howto/htaccess.html
ascanrules.htaccess.soln = Aseg\u00farese de que el archivo .htaccess no sea accesible.

ascanrules.log4shell.cve44228.desc = Apache Log4j2 <\=2.14.1 Las caracter\u00edsticas de JNDI utilizadas en la configuraci\u00f3n, los mensajes de registro y los par\u00e1metros no protegen contra un LDAP controlado por atacantes y otros endpoints relacionados con JNDI. Un atacante que puede controlar los mensajes de registro o los par\u00e1metros de los mensajes de registro puede ejecutar c\u00f3digo arbitrario cargado desde servidores LDAP cuando la sustituci\u00f3n de mensajes est\u00e1 habilitada. Desde log4j 2.15.0, este comportamiento est\u00e1 desactivado de forma predeterminada.
ascanrules.log4shell.cve44228.name = Log4Shell (CVE-2021-44228)
ascanrules.log4shell.cve44228.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-44228
ascanrules.log4shell.cve44228.soln = Actualice Log4j2 a la versi\u00f3n 2.17.1 o superior. En versiones anteriores (>2.10), este comportamiento se puede mitigar configurando la propiedad del sistema "log4j2.formatMsgNoLookups" en "true" o eliminando la clase JndiLookup del classpath (ejemplo\: zip -q -d log4j-core-*.jar org /apache/logging/log4j/core/lookup/JndiLookup.class). Java 8u121 (consulte https\://www.oracle.com/java/technologies/javase/8u121-relnotes.html) protege contra la ejecuci\u00f3n remota de c\u00f3digo al establecer de manera predeterminada "com.sun.jndi.rmi.object.trustURLCodebase" y "com. sun.jndi.cosnaming.object.trustURLCodebase" a "falso".
ascanrules.log4shell.cve45046.desc = Se encontr\u00f3 que la soluci\u00f3n para abordar CVE-2021-44228 en Apache Log4j 2.15.0 estaba incompleta en algunas configuraciones no predeterminadas. Esto podr\u00eda permitir a los atacantes crear datos de entrada maliciosos mediante un patr\u00f3n de b\u00fasqueda JNDI, lo que provocar\u00eda una fuga de informaci\u00f3n y la ejecuci\u00f3n remota de c\u00f3digo en algunos entornos.
ascanrules.log4shell.cve45046.name = Log4Shell (CVE-2021-45046)
ascanrules.log4shell.cve45046.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-45046
ascanrules.log4shell.cve45046.soln = Actualiza Log4j2 a la versi\u00f3n 2.17.1 o una superior.
ascanrules.log4shell.name = Log4Shell
ascanrules.log4shell.skipped = no se ha seleccionado ning\u00fan servicio de Escaneo Activo OAST.

ascanrules.name = Reglas de Escaneo Activas

ascanrules.paddingoracle.desc = Al manipular el contenido de una cadena cifrada, un atacante puede generar un mensaje de error que indica una posible vulnerabilidad 'padding oracle'. Esta vulnerabilidad puede afectar a cualquier aplicaci\u00f3n o marco que utilice el cifrado de forma incorrecta, como algunas versiones de ASP.net, Java Server Faces y Mono. Un atacante puede explotar este fallo para descifrar datos y recuperar claves de cifrado, con lo que podr\u00eda ver y modificar datos confidenciales. Esta regla deber\u00eda detectar la vulnerabilidad padding oracle MS10-070 en ASP.net si CustomErrors est\u00e1 habilitado para eso.
ascanrules.paddingoracle.name = Padding Oracle Gen\u00e9rico
ascanrules.paddingoracle.refs = https\://learn.microsoft.com/en-us/security-updates/securitybulletins/2010/ms10-070\nhttps\://www.mono-project.com/docs/about-mono/vulnerabilities/\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799
ascanrules.paddingoracle.soln = Actualice el software del servidor afectado o modifique los scripts para que validen correctamente los datos cifrados antes de intentar descifrarlos.

ascanrules.parametertamper.desc = La manipulaci\u00f3n de par\u00e1metros provoc\u00f3 que se mostrara una p\u00e1gina de error o un seguimiento de la pila de Java. Esto indica un fallo en como maneja las excepciones se podr\u00eda explotar en el futuro.
ascanrules.parametertamper.name = Parameter Tampering (Manipulaci\u00f3n de Par\u00e1metros)
ascanrules.parametertamper.soln = Identificar la causa del error y solucionarlo. No conf\u00ede en la entrada del lado del cliente y hacer cumplir un control exhaustivo en el lado del servidor. Adem\u00e1s, detectar la excepci\u00f3n correctamente. Utilice una p\u00e1gina de error 500 gen\u00e9rico para error interno del servidor.

ascanrules.pathtraversal.name = Ruta Transversal

ascanrules.payloader.desc = Brinda soporte para cargas \u00fatiles personalizadas en reglas de escaneo.
ascanrules.payloader.name = Reglas Personalizadas de Escaneo Activo de Payloads

ascanrules.persistentxssattack.json.desc = Se encontr\u00f3 un ataque XSS en una respuesta JSON, esto podr\u00eda dejar a los usuarios del contenido vulnerables a un ataque si no controlan adecuadamente los datos (respuesta).
ascanrules.persistentxssattack.json.name = Cross Site Scripting (Persistente en la respuesta JSON)
ascanrules.persistentxssattack.name = Cross Site Scripting XSS (Persistente)
ascanrules.persistentxssattack.otherinfo = Fuente URL\: {0}
ascanrules.persistentxssattack.otherinfo.nothtml = Iniciado con BAJA confianza, ya que el contenido (Content-Type) no es HTML

ascanrules.persistentxssprime.name = Cross Site Scripting (Persistente) - Prime

ascanrules.persistentxssspider.name = Cross Site Scripting (Persistente) - Spider

ascanrules.remotecodeexecution.cve-2012-1823.desc = Ciertas versiones de PHP, cuando se configuran para ejecutarse mediante CGI, no manejan correctamente las cadenas de consulta que carecen de un car\u00e1cter "\=", lo que permite la ejecuci\u00f3n arbitraria de c\u00f3digo. En este caso, un comando del sistema operativo fue causado para ser ejecutado en el servidor web, y los resultados fueron devueltos al navegador web. 
ascanrules.remotecodeexecution.cve-2012-1823.name = Ejecuci\u00f3n Remota de C\u00f3digo - CVE-2012-1823
ascanrules.remotecodeexecution.cve-2012-1823.soln = Actualice a la \u00faltima versi\u00f3n estable de PHP o utilice el servidor web Apache y el m\u00f3dulo mod_rewrite para filtrar las peticiones maliciosas mediante las directivas "RewriteCond" y "RewriteRule".

ascanrules.remotefileinclude.name = Inclusi\u00f3n Remota de Archivos

ascanrules.serversideinclude.desc = Ciertos par\u00e1metros pueden hacer que se Incluyan comandos del Lado del Servidor (SSLI) y se ejecuten. Esto puede permitir que se realice una conexi\u00f3n con la base de datos o la ejecuci\u00f3n de c\u00f3digo arbitrario.
ascanrules.serversideinclude.name = Server Side Include
ascanrules.serversideinclude.refs = https\://httpd.apache.org/docs/current/howto/ssi.html
ascanrules.serversideinclude.soln = No conf\u00ede en la entrada del lado del cliente e imponga una comprobaci\u00f3n estricta en el lado del servidor.  Deshabilitar las inclusiones del lado del servidor.\nConsulte el manual para deshabilitar las directivas Sever Side Include.\nUtilice el privilegio m\u00ednimo para ejecutar su servidor web o servidor de aplicaciones.\nPara Apache, deshabilitar lo siguiente\:\nOptions Indexes FollowSymLinks Includes\nAddType application/x-httpd-cgi .cgi\nAddType text/x-server-parsed-html .html

ascanrules.sourcecodedisclosurecve-2012-1823.desc = Algunas versiones de PHP, cuando se configuran para ejecutarse utilizando CGI, no manejan correctamente las cadenas de consulta que carecen de un car\u00e1cter "\=" sin may\u00fasculas, lo que permite la divulgaci\u00f3n del c\u00f3digo fuente de PHP y la ejecuci\u00f3n de c\u00f3digo arbitrario. En este caso, el contenido del archivo PHP se serv\u00eda directamente al navegador web. Esta salida contendr\u00e1 t\u00edpicamente PHP, aunque tambi\u00e9n puede contener HTML directo.
ascanrules.sourcecodedisclosurecve-2012-1823.name = Divulgaci\u00f3n del C\u00f3digo Fuente - CVE-2012-1823
ascanrules.sourcecodedisclosurecve-2012-1823.soln = Actualice a la \u00faltima versi\u00f3n estable de PHP o utilice el servidor web Apache y el m\u00f3dulo mod_rewrite para filtrar las peticiones maliciosas mediante las directivas "RewriteCond" y "RewriteRule".

ascanrules.sourcecodedisclosurewebinf.desc = El c\u00f3digo fuente de Java fue expuesto por el servidor web en los archivos class de Java en la carpeta Web-INF. Los archivos class se pueden decompilar para producir c\u00f3digo fuente que coincida muy de cerca con el c\u00f3digo fuente original.  
ascanrules.sourcecodedisclosurewebinf.name = Divulgaci\u00f3n del c\u00f3digo fuente\: carpeta /WEB-INF
ascanrules.sourcecodedisclosurewebinf.propertiesfile.desc = Un Java class de la carpeta /Web-INF expuso la presencia del archivo properties. El archivo properties no est\u00e1 dise\u00f1ado para ser de acceso p\u00fablico, y com\u00fanmente contiene la informaci\u00f3n de configuraci\u00f3n, credenciales de aplicaci\u00f3n o claves criptogr\u00e1ficas.   
ascanrules.sourcecodedisclosurewebinf.propertiesfile.extrainfo = La referencia al archivo properties se encontr\u00f3 en el c\u00f3digo fuente de Java decompilado para la clase Java [{0}].
ascanrules.sourcecodedisclosurewebinf.propertiesfile.name = Divulgaci\u00f3n del Archivo Properties -/carpeta /WEB-INF
ascanrules.sourcecodedisclosurewebinf.propertiesfile.soln = El servidor web debe configurarse para que no muestre la carpeta /WEB-INF o sus contenidos a los navegadores web. Tambi\u00e9n es posible eliminar la carpeta /WEB-INF.  
ascanrules.sourcecodedisclosurewebinf.soln = Todo servidor web se debe configurar para que no muestre la carpeta /WEB-INF ni sus contenidos a los navegadores web, porque esta tiene informaci\u00f3n delicada como el c\u00f3digo fuente compilado de Java, adem\u00e1s de archivos que pueden contener credenciales como los properties. Los Java class implementados con la aplicaci\u00f3n se deben ocultar, en forma de una capa adicional de defensa, como una "defensa en profundidad (defence-in-depth)" .

ascanrules.spring4shell.desc = La aplicaci\u00f3n parece ser vulnerable a CVE-2022-22965 (tambi\u00e9n conocido como Spring4Shell)\: ejecuci\u00f3n remota de c\u00f3digo (RCE) a trav\u00e9s del enlace de datos.
ascanrules.spring4shell.name = Spring4Shell
ascanrules.spring4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-22965\nhttps\://www.rapid7.com/blog/post/2022/03/30/spring4shell-zero-day-vulnerability-in-spring-framework/\nhttps\://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement\#vulnerability\nhttps\://tanzu.vmware.com/security/cve-2022-22965
ascanrules.spring4shell.soln = Actualiza Spring Framework a las versiones 5.3.18, 5.2.20 o superiores.

ascanrules.springactuator.desc = Spring Actuator for Health est\u00e1 habilitado y puede revelar informaci\u00f3n confidencial sobre esta aplicaci\u00f3n. Los Spring Actuators se pueden usar con fines de monitoreo real, pero se deben usar con precauci\u00f3n para no exponer demasiada informaci\u00f3n sobre la aplicaci\u00f3n o la infraestructura que la ejecuta.
ascanrules.springactuator.name = Fuga de informaci\u00f3n de Spring Actuator
ascanrules.springactuator.refs = https\://docs.spring.io/spring-boot/docs/current/actuator-api/htmlsingle/\#overview
ascanrules.springactuator.soln = Deshabilite los Health Actuators y otros Actuators, o lim\u00edtelos a usuarios administradores.

#ascanrules.sqlinjection.alert.errorbased.attack={1}
ascanrules.sqlinjection.alert.booleanbased.attack = campo\: [{0}], valor [{1}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo = Los resultados de la p\u00e1gina se manipularon con \u00e9xito utilizando las condiciones booleanas [{0}] y [{1}]\nEl valor del par\u00e1metro que est\u00e1 modificado fue {2} eliminado de la salida HTML para fines de la comparaci\u00f3n
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists = Se han devuelto datos para el par\u00e1metro original.\nSe ha detectado la vulnerabilidad al restringir con \u00e9xito los datos devueltos originalmente, al manipular el par\u00e1metro
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists = NO se devolvieron datos para el par\u00e1metro original.\nLa vulnerabilidad se detect\u00f3 al recuperar con \u00e9xito m\u00e1s datos de los que se devolvieron originalmente, al manipular el par\u00e1metro
ascanrules.sqlinjection.alert.errorbased.attack = [{0}] campo\: [{1}], valor [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack = Valor Original\: [{0}]. Valor Modificado\: [{1}]. Valor de Control\: [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo = El mensaje sin modificar dio el status HTTP [{0}], longitud del cuerpo [{1}], el mensaje modificado dio el status HTTP [{2}], longitud del cuerpo [{3}]. Un tercero (valor inductor de inyecci\u00f3n no SQL) dio el status HTTP [{4}], longitud del cuerpo [{5}]
ascanrules.sqlinjection.alert.errorbased.extrainfo = RDBMS [{0}] probable, la expresi\u00f3n regular del mensaje de error que aparece [{1}] corresponde con los resultados HTML.\nLa vulnerabilidad fue detectada por la manipulaci\u00f3n del par\u00e1metro para causar un mensaje de error de base de datos a ser retornado y reconocido
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo = Mensaje no modificado retorn\u00f3 el status HTTP [{0}], mensaje modificado retorn\u00f3 el status HTTP [{1}]
ascanrules.sqlinjection.alert.expressionbased.extrainfo = Los resultados de la p\u00e1gina original se replicaron correctamente utilizando la expresi\u00f3n [{0}] como valor de par\u00e1metro\nEl valor de par\u00e1metro que se est\u00e1 modificando {1}se elimin\u00f3 de la salida HTML a efectos de comparaci\u00f3n.
ascanrules.sqlinjection.alert.orderbybased.extrainfo = Los resultados de la p\u00e1gina original se replicaron correctamente utilizando la expresi\u00f3n "ORDER BY" [{0}] como valor de par\u00e1metro\nEl valor de par\u00e1metro que se est\u00e1 modificando {1}se elimin\u00f3 de la salida HTML a efectos de comparaci\u00f3n.
ascanrules.sqlinjection.alert.timebased.extrainfo = El tiempo de consulta es controlable a trav\u00e9s del valor del par\u00e1metro [{0}], que hace que la petici\u00f3n tarde [{1}] milisegundos, cuando la consulta original sin modificar con valor [{2}] tarda [{3}] milisegundos 
ascanrules.sqlinjection.alert.unionbased.attack = [{0}] campo\: [{1}], valor [{2}]
ascanrules.sqlinjection.alert.unionbased.extrainfo = RDBMS [{0}] probable, la expresi\u00f3n regular del mensaje de error UNION espec\u00edficamente [{1}] corresponde con los resultados HTML\nLa vulnerabilidad fue detectada por la manipulaci\u00f3n del par\u00e1metro con una cl\u00e1usula SQL ''UNION'' para causar un mensaje de error de base de datos a ser retornado y reconocido
ascanrules.sqlinjection.authbypass.desc = Existe la posibilidad de realizar una Inyecci\u00f3n SQL en una p\u00e1gina de inicio de sesi\u00f3n, lo que podr\u00eda permitir saltar el mecanismo de autenticaci\u00f3n de la aplicaci\u00f3n. 
ascanrules.sqlinjection.authbypass.name = Inyecci\u00f3n SQL - Omisi\u00f3n de Autenticaci\u00f3n
ascanrules.sqlinjection.desc = Inyecci\u00f3n SQL puede ser posible.
ascanrules.sqlinjection.hypersonic.name = Inyecci\u00f3n SQL - SQL Hipers\u00f3nico
ascanrules.sqlinjection.mssql.alert.timebased.extrainfo = El tiempo de consulta se puede controlar mediante el valor del par\u00e1metro [{0}], lo que ha provocado que la solicitud tardara [{1}] milisegundos, cuando la consulta original sin modificar con el valor [{2}] tarda [{3}] milisegundos.
ascanrules.sqlinjection.mssql.name = Inyecci\u00f3n SQL - MsSQL 
ascanrules.sqlinjection.mysql.name = Inyecci\u00f3n SQL - MySQL
ascanrules.sqlinjection.name = Inyecci\u00f3n SQL
ascanrules.sqlinjection.oracle.name = Inyecci\u00f3n SQL - Oracle
ascanrules.sqlinjection.postgres.name = Inyecci\u00f3n SQL - PostgreSQL
ascanrules.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanrules.sqlinjection.soln = No conf\u00ede en los datos de entrada del lado del cliente, incluso si existe una validaci\u00f3n del lado del cliente.\nComo norma general, escriba la verificaci\u00f3n de los datos en el lado del servidor.\nSi la aplicaci\u00f3n usa JDBC, use PreparedStatement o CallableStatement, con par\u00e1metros pasados \u200b\u200bpor '?'\nSi la aplicaci\u00f3n usa ASP, use objetos de comando ADO con verificaci\u00f3n de tipo fuerte y consultas parametrizadas.\nSi se pueden usar los procedimientos almacenados de la base de datos, util\u00edcelos.\n\u00a1*No* concatene cadenas en consultas en el procedimiento almacenado, o use 'exec', 'exex immediate' o una funci\u00f3n equivalente\!\nNo cree consultas SQL din\u00e1micas mediante la concatenaci\u00f3n de cadenas simples.\nEscape todos los datos recibidos del cliente.\nAplique una 'lista de permitidos' para caracteres permitidos o una 'lista de denegados' para caracteres no permitidos en la entrada del usuario.\nAplique el principio de privilegio m\u00ednimo utilizando el usuario de base de datos con el menor privilegio posible.\nEn particular, evite utilizar usuarios de bases de datos 'sa' o 'db-owner'. Esto no elimina la inyecci\u00f3n SQL, pero minimiza su impacto.\nOtorgue el acceso m\u00ednimo a la base de datos que sea necesario para la aplicaci\u00f3n.
ascanrules.sqlinjection.sqlite.alert.errorbased.extrainfo = Se ha provocado el siguiente mensaje de error conocido de SQLite\: [{0}].
ascanrules.sqlinjection.sqlite.alert.timebased.extrainfo = El tiempo de consulta es controlable mediante el valor del par\u00e1metro [{0}], que hizo que la petici\u00f3n tardara [{1}] milisegundos, el valor del par\u00e1metro [{2}], que ha provocado que la solicitud tardara [{3}] milisegundos, cuando la consulta original sin modificar con el valor [{4}] tard\u00f3 [{5}] milisegundos.
ascanrules.sqlinjection.sqlite.alert.versionnumber.extrainfo = Utilizando un ataque de inyecci\u00f3n SQL basado en UNION y explotando el mecanismo de escritura din\u00e1mica de SQLite, se determin\u00f3 que la versi\u00f3n de SQLite era [{0}].\nCon puntos de inyecci\u00f3n basados en cadenas, se puede extraer informaci\u00f3n completa de la versi\u00f3n de SQLite, pero con puntos de inyecci\u00f3n num\u00e9ricos, solo se puede extraer informaci\u00f3n parcial de la versi\u00f3n de SQLite.\nM\u00e1s informaci\u00f3n sobre la versi\u00f3n SQLite [{0}] est\u00e1 disponible en https\://www.sqlite.org/changes.html
ascanrules.sqlinjection.sqlite.name = Inyecci\u00f3n SQL - SQLite

ascanrules.ssti.alert.otherinfo = Evidencia encontrada en [{0}]\ncontenido\:\n[{1}]
ascanrules.ssti.desc = Cuando la entrada del usuario se inserta en la plantilla en lugar de usarse como argumento en el renderizado, el motor de plantilla eval\u00faa. Dependiendo del motor de plantillas, puede producir ejecuci\u00f3n remota de c\u00f3digo.
ascanrules.ssti.name = Server Side Template Injection (SSTI) Plantilla de Inyecci\u00f3n del Lado del Servidor
ascanrules.ssti.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.ssti.soln = En lugar de insertar la entrada del usuario en la plantilla, util\u00edcela como argumento de renderizado.

ascanrules.sstiblind.alert.recvdcallback.otherinfo = Devoluci\u00f3n de llamada recibida del servidor.
ascanrules.sstiblind.desc = Cuando la entrada del usuario se inserta en la plantilla en lugar de usarse como argumento en el renderizado, el motor de plantilla eval\u00faa. Dependiendo del motor de plantillas, puede producir ejecuci\u00f3n remota de c\u00f3digo.
ascanrules.sstiblind.name = Server Side Template Injection (Blind-Ciego)
ascanrules.sstiblind.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.sstiblind.soln = En lugar de insertar la entrada del usuario en la plantilla, util\u00edcela como argumento de renderizado.

ascanrules.traceaxd.desc = Se encontr\u00f3 que ASP.NET Trace Viewer (trace.axd) est\u00e1 disponible. Este componente puede filtrar una cantidad significativa de informaci\u00f3n valiosa.
ascanrules.traceaxd.name = Filtrado de informaci\u00f3n en Trace.axd
ascanrules.traceaxd.otherinfo = Seg\u00fan el c\u00f3digo de estado de respuesta, Trace Viewer puede estar protegido por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.  
ascanrules.traceaxd.refs = https\://msdn.microsoft.com/en-us/library/bb386420.aspx\nhttps\://msdn.microsoft.com/en-us/library/wwh16c6c.aspx\nhttps\://www.dotnetperls.com/trace
ascanrules.traceaxd.soln = Considere si Trace Viewer es realmente necesario en producci\u00f3n; si no es as\u00ed, desact\u00edvelo. Si es as\u00ed, aseg\u00farese de que el acceso requiera autenticaci\u00f3n y autorizaci\u00f3n.

ascanrules.useragent.desc = Compare las diferencias en la respuesta seg\u00fan el fuzzeo de User Agent (por ejemplo, sitios m\u00f3viles, acceso como un motor de b\u00fasqueda). Compara el c\u00f3digo de estado de la respuesta y el hash del cuerpo de la respuesta con la respuesta original.
ascanrules.useragent.name = User Agent Fuzzer
ascanrules.useragent.refs = https\://owasp.org/wstg
ascanrules.useragent.useragentparmname = Header User-Agent

ascanrules.xpathinjection.name = Inyecci\u00f3n XPath

ascanrules.xsltinjection.command.otherinfo = Puede ser posible la ejecuci\u00f3n de comandos
ascanrules.xsltinjection.desc = La inyecci\u00f3n mediante transformaciones XSL puede ser posible y puede permitir que un atacante lea informaci\u00f3n del sistema, lea y escriba archivos o ejecute c\u00f3digo arbitrario.
ascanrules.xsltinjection.error.otherinfo = La respuesta al env\u00edo de un token XSLT incluy\u00f3 mensajes de error que pueden indicar una vulnerabilidad a las inyecciones XSLT.
ascanrules.xsltinjection.name = Inyecci\u00f3n XSLT
ascanrules.xsltinjection.portscan.otherinfo = Es posible realizar un escaneo de puertos.
ascanrules.xsltinjection.refs = https\://www.contextis.com/blog/xslt-server-side-injection-attacks
ascanrules.xsltinjection.soln = Analice, limpie y filtre cada entrada de usuario que venga de cualquier lado del cliente.
ascanrules.xsltinjection.vendor.otherinfo = El nombre del proveedor del procesador XSLT "{0}" a sido devuelto despu\u00e9s de una solicitud de inyecci\u00f3n.

ascanrules.xxe.name = Ataque de Entidad Externa XML
