
ascanrules.bufferoverflow.desc = \u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u30a8\u30e9\u30fc\u306f\u3001\u672c\u6765\u5909\u66f4\u3055\u308c\u308b\u3079\u304d\u3067\u306f\u306a\u3044\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9Web\u30d7\u30ed\u30bb\u30b9\u306e\u30e1\u30e2\u30ea\u9818\u57df\u304c\u4e0a\u66f8\u304d\u3055\u308c\u308b\u3053\u3068\u3067\u767a\u751f\u3057\u307e\u3059\u3002IP (\u547d\u4ee4\u30dd\u30a4\u30f3\u30bf) \u3084 BP (\u30d9\u30fc\u30b9\u30dd\u30a4\u30f3\u30bf)\u3001\u305d\u306e\u4ed6\u306e\u30ec\u30b8\u30b9\u30bf\u306e\u5024\u304c\u4e0a\u66f8\u304d\u3055\u308c\u308b\u3068\u3001\u4f8b\u5916\u3084\u30bb\u30b0\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u9055\u53cd\u3001\u305d\u306e\u4ed6\u306e\u30d7\u30ed\u30bb\u30b9\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3059\u3002\u901a\u5e38\u3001\u3053\u308c\u3089\u306e\u30a8\u30e9\u30fc\u306b\u3088\u308a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u4e88\u671f\u305b\u305a\u7d42\u4e86\u3057\u307e\u3059\u3002
ascanrules.bufferoverflow.name = \u30d0\u30c3\u30d5\u30a1 \u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc
ascanrules.bufferoverflow.other = \u6f5c\u5728\u7684\u306a\u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u53ef\u80fd\u6027\u3002\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u63a5\u7d9a\u3092\u9589\u3058\u3001500 Internal Server Error \u3092\u8fd4\u3057\u307e\u3057\u305f\u3002
ascanrules.bufferoverflow.refs = https\://owasp.org/www-community/attacks/Buffer_overflow_attack
ascanrules.bufferoverflow.soln = \u9069\u5207\u306a\u623b\u308a\u5024\u9577\u30c1\u30a7\u30c3\u30af\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u3001\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u66f8\u304d\u63db\u3048\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306b\u306f\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306e\u518d\u30b3\u30f3\u30d1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002

ascanrules.cloudmetadata.desc = \u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u653b\u6483 (Cloud Metadata Attack) \u306f\u3001\u8a2d\u5b9a\u30df\u30b9\u306e\u3042\u308bNGINX\u30b5\u30fc\u30d0\u30fc\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3057\u3001AWS\u3001GCP\u3001Azure\u306a\u3069\u306e\u30af\u30e9\u30a6\u30c9\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304c\u7ba1\u7406\u3059\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30e1\u30bf\u30c7\u30fc\u30bf\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a66\u307f\u307e\u3059\u3002\n\u3053\u308c\u3089\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f\u3059\u3079\u3066\u3001\u5185\u90e8\u306e\u30eb\u30fc\u30c6\u30a3\u30f3\u30b0\u4e0d\u53ef\u80fd\u306aIP\u30a2\u30c9\u30ec\u30b9\u300c169.254.169.254\u300d\u3092\u4ecb\u3057\u3066\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u63d0\u4f9b\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u4e0d\u9069\u5207\u306b\u8a2d\u5b9a\u3055\u308c\u305fNGINX\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u516c\u958b\u3055\u308c\u3001Host\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3053\u306eIP\u30a2\u30c9\u30ec\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanrules.cloudmetadata.name = \u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u9732\u5448\u3059\u308b\u53ef\u80fd\u6027
ascanrules.cloudmetadata.otherinfo = \u6210\u529f\u3057\u305f\u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u306b\u57fa\u3065\u304f\u3068\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30ec\u30b9\u30dd\u30f3\u30b9\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3001\u30af\u30e9\u30a6\u30c9\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u8abf\u3079\u3066\u304f\u3060\u3055\u3044\u3002\n\u8fd4\u3055\u308c\u305f\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u306f\u3001\u653b\u6483\u8005\u304c\u30b7\u30b9\u30c6\u30e0\u3092\u5b8c\u5168\u306b\u4fb5\u5bb3\u3059\u308b\u3053\u3068\u3092\u53ef\u80fd\u306b\u3059\u308b\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.cloudmetadata.refs = https\://www.nginx.com/blog/trust-no-one-perils-of-trusting-user-input/
ascanrules.cloudmetadata.soln = NGINX \u8a2d\u5b9a\u3067\u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u3092\u4fe1\u983c\u3057\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30b1\u30fc\u30b9\u3067\u306f\u3001\u304a\u305d\u3089\u304f 'Host' \u30d8\u30c3\u30c0\u30fc\u304b\u3089\u8a2d\u5b9a\u3055\u308c\u3001\u653b\u6483\u8005\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u3046\u308b $host \u5909\u6570\u306e\u4f7f\u7528\u304c\u539f\u56e0\u3067\u3059\u3002

ascanrules.codeinjection.desc = \u30b9\u30af\u30ea\u30d7\u30c8\u30a8\u30f3\u30b8\u30f3\u306b\u3088\u3063\u3066\u8a55\u4fa1\u3055\u308c\u308b\u30ab\u30b9\u30bf\u30e0\u30b3\u30fc\u30c9\u3092\u542b\u3080\u3001\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.codeinjection.name = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.name.asp = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - ASP\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.name.php = \u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - PHP\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.codeinjection.refs = https\://cwe.mitre.org/data/definitions/94.html\nhttps\://owasp.org/www-community/attacks/Direct_Dynamic_Code_Evaluation_Eval%20Injection
ascanrules.codeinjection.soln = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u5165\u529b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u3067\u691c\u8a3c\u304c\u884c\u308f\u308c\u3066\u3044\u3066\u3082\u4fe1\u983c\u3057\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002\n\u4e00\u822c\u7684\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u306e\u578b\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u53d7\u3051\u53d6\u3063\u305f\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u3092\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u30c7\u30fc\u30bf\u3068\u7d44\u307f\u5408\u308f\u305b\u3066 eval() \u95a2\u6570\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.commandinjection.desc = \u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u30b3\u30de\u30f3\u30c9\u3092\u4e0d\u6b63\u306b\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u653b\u6483\u624b\u6cd5\u3002 \u3053\u306e\u653b\u6483\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u3092\u53d7\u3051\u53d6\u308a\u3001\u4e0d\u9069\u5207\u306a\u7121\u5bb3\u5316\u3084\u5916\u90e8\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u4e0d\u9069\u5207\u306a\u547c\u3073\u51fa\u3057\u3068\u3044\u3063\u305f\u5b89\u5168\u3067\u306a\u3044\u65b9\u6cd5\u3067\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u30b3\u30de\u30f3\u30c9\u3092\u69cb\u7bc9\u3059\u308b\u969b\u306b\u767a\u751f\u3057\u307e\u3059\u3002
ascanrules.commandinjection.name = \u30ea\u30e2\u30fc\u30c8OS\u30b3\u30de\u30f3\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.commandinjection.otherinfo = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306b [{0}] \u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u3067\u3001\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30b3\u30de\u30f3\u30c9\u306e\u5185\u5bb9\u3092\u53d6\u5f97\u3067\u304d\u307e\u3057\u305f\u3002
ascanrules.commandinjection.refs = https\://cwe.mitre.org/data/definitions/78.html\nhttps\://owasp.org/www-community/attacks/Command_Injection

ascanrules.commandinjection.time.name = \u30ea\u30e2\u30fc\u30c8OS\u30b3\u30de\u30f3\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 (\u6642\u9593\u30d9\u30fc\u30b9)
ascanrules.commandinjection.time.otherinfo = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306b [{0}] \u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u3067\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5fdc\u7b54\u6642\u9593\u3092\u5236\u5fa1\u3067\u304d\u307e\u3057\u305f\u3002

ascanrules.crlfinjection.desc = CRLF\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3092\u4ecb\u3057\u3066Cookie\u304c\u8a2d\u5b9a\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u4efb\u610f\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u308b\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002\u3055\u3089\u306b\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f7f\u7528\u3057\u3066\u3001\u6ce8\u5165\u3055\u308c\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u6ce8\u610f\u6df1\u304f\u4f5c\u6210\u3059\u308b\u3053\u3068\u3067\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u30dd\u30a4\u30ba\u30cb\u30f3\u30b0\u306e\u8106\u5f31\u6027\u3082\u5b58\u5728\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.crlfinjection.name = CRLF\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.crlfinjection.refs = https\://owasp.org/www-community/vulnerabilities/CRLF_Injection\nhttps\://cwe.mitre.org/data/definitions/113.html
ascanrules.crlfinjection.soln = \u9001\u4fe1\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u614e\u91cd\u306b\u578b\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002CRLF\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3059\u308b\u3053\u3068\u3067\u3001\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u3092\u8a31\u53ef\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002

ascanrules.crosssitescripting.json.desc = XSS\u653b\u6483\u304cJSON\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u53cd\u6620\u3055\u308c\u307e\u3057\u305f\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u6d88\u8cbb\u3059\u308b\u5074\u304c\u30c7\u30fc\u30bf\u3092\u9069\u5207\u306b\u51e6\u7406\u3057\u306a\u3044\u5834\u5408\u3001\u653b\u6483\u306b\u5bfe\u3057\u3066\u8106\u5f31\u306b\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.crosssitescripting.json.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0\u306e\u8106\u5f31\u6027 (JSON\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u53cd\u6620)
ascanrules.crosssitescripting.name = \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u53cd\u5c04\u578b)
ascanrules.crosssitescripting.otherinfo.accesskey = accesskey \u5c5e\u6027\u306f\u3001\u8981\u7d20\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3059\u308b\u3001\u307e\u305f\u306f\u30d5\u30a9\u30fc\u30ab\u30b9\u3059\u308b\u305f\u3081\u306e\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u30ad\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u306e\u5c5e\u6027\u306f\u3001\u975e\u6a19\u6e96\u307e\u305f\u306f\u30ab\u30b9\u30bf\u30e0\u30bf\u30b0\u306b\u5bfe\u3057\u3066\u30da\u30a4\u30ed\u30fc\u30c9\u3092\u8d77\u52d5\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n
ascanrules.crosssitescripting.otherinfo.nothtml = Content-Type\u304cHTML\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u4f4e\u3044\u4fe1\u983c\u5ea6\u3067\u8b66\u544a\u3092\u767a\u751f\u3055\u305b\u307e\u3057\u305f\u3002

ascanrules.desc = \u30ea\u30ea\u30fc\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9 (\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb)

ascanrules.directorybrowsing.desc = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4e00\u89a7\u3092\u8868\u793a\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\u96a0\u308c\u305f\u30b9\u30af\u30ea\u30d7\u30c8\u3084\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u7b49\u306e\u6a5f\u5bc6\u60c5\u5831\u3078\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.directorybrowsing.name = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0
ascanrules.directorybrowsing.refs = https\://httpd.apache.org/docs/mod/core.html\#options
ascanrules.directorybrowsing.soln = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u6a5f\u80fd\u304c\u5fc5\u8981\u306a\u5834\u5408\u3001\u30ea\u30b9\u30af\u306e\u3042\u308b\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanrules.elmah.desc = Error Logging Modules and Handlers (ELMAH [elmah.axd]) HTTP\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u5229\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u304c\u767a\u898b\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u5927\u91cf\u306e\u4fa1\u5024\u3042\u308b\u60c5\u5831\u3092\u6f0f\u6d29\u3055\u305b\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.elmah.name = ELMAH \u304b\u3089\u306e\u60c5\u5831\u6f0f\u6d29
ascanrules.elmah.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u306b\u57fa\u3065\u304f\u3068\u3001ELMAH \u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u30e1\u30ab\u30cb\u30ba\u30e0\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.elmah.refs = https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanrules.elmah.soln = ELMAH \u304c\u672c\u756a\u74b0\u5883\u3067\u672c\u5f53\u306b\u5fc5\u8981\u304b\u3069\u3046\u304b\u3092\u691c\u8a0e\u3057\u3001\u5fc5\u8981\u306a\u3051\u308c\u3070\u7121\u52b9\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3082\u3057\u5fc5\u8981\u3067\u3042\u308c\u3070\u3001\u8a8d\u8a3c\u3068\u8a8d\u53ef\u3092\u5fc5\u9808\u3068\u3059\u308b\u3053\u3068\u3067\u3001\u30a2\u30af\u30bb\u30b9\u3092\u78ba\u5b9f\u306b\u4fdd\u8b77\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u53c2\u8003\: https\://elmah.github.io/a/securing-error-log-pages/

ascanrules.envfiles.desc = \u30b5\u30fc\u30d0\u30fc\u4e0a\u30671\u3064\u4ee5\u4e0a\u306e .env \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u3063\u305f\u3088\u3046\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30a4\u30f3\u30d5\u30e9\u30b9\u30c8\u30e9\u30af\u30c1\u30e3\u3084\u7ba1\u7406\u8005\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u8a8d\u8a3c\u60c5\u5831\u3001API\u30ad\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30ad\u30fc\u3001\u305d\u306e\u4ed6\u306e\u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u8a2d\u5b9a\u60c5\u5831\u3092\u516c\u958b\u3057\u3066\u3044\u308b\u3053\u3068\u304c\u3088\u304f\u3042\u308a\u307e\u3059\u3002
ascanrules.envfiles.name = .env \u304b\u3089\u306e\u60c5\u5831\u6f0f\u6d29
ascanrules.envfiles.otherinfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\u306b\u57fa\u3065\u304f\u3068\u3001.env \u30d5\u30a1\u30a4\u30eb\u306f\u8a8d\u8a3c\u307e\u305f\u306f\u8a8d\u53ef\u30e1\u30ab\u30cb\u30ba\u30e0\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.envfiles.refs = https\://www.google.com/search?q\=db_password+filetype%3Aenv\nhttps\://mobile.twitter.com/svblxyz/status/1045013939904532482
ascanrules.envfiles.soln = .env \u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u3088\u3046\u306b\u3059\u308b

ascanrules.externalredirect.name = \u5916\u90e8\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
ascanrules.externalredirect.reason.javascript = The response contains a redirect in its JavaScript code which allows an external Url to be set.
ascanrules.externalredirect.reason.location.header = The response contains a redirect in its Location header which allows an external Url to be set.
ascanrules.externalredirect.reason.location.meta = The response contains a redirect in its meta http-equiv tag for 'Location' which allows an external Url to be set.
ascanrules.externalredirect.reason.notfound = No reason found for it...
ascanrules.externalredirect.reason.refresh.header = The response contains a redirect in its Refresh header which allows an external Url to be set.
ascanrules.externalredirect.reason.refresh.meta = The response contains a redirect in its meta http-equiv tag for 'Refresh' which allows an external Url to be set.

ascanrules.formatstring.desc = A Format String error occurs when the submitted data of an input string is evaluated as a command by the application.
ascanrules.formatstring.error1 = Potential Format String Error. The script closed the connection on a /%s.
ascanrules.formatstring.error2 = Potential Format String Error. The script closed the connection on a /%s and /%x.
ascanrules.formatstring.error3 = Potential Format String Error. The script closed the connection on a Microsoft format string error.
ascanrules.formatstring.name = \u66f8\u5f0f\u6587\u5b57\u5217\u30a8\u30e9\u30fc
ascanrules.formatstring.refs = https\://owasp.org/www-community/attacks/Format_string_attack
ascanrules.formatstring.soln = Rewrite the background program using proper deletion of bad character strings. This will require a recompile of the background executable.

ascanrules.getforpost.desc = A request that was originally observed as a POST was also accepted as a GET. This issue does not represent a security weakness unto itself, however, it may facilitate simplification of other attacks. For example if the original POST is subject to Cross-Site Scripting (XSS), then this finding may indicate that a simplified (GET based) XSS may also be possible.
ascanrules.getforpost.name = GET for POST
ascanrules.getforpost.soln = Ensure that only POST is accepted where POST is expected.

ascanrules.heartbleed.desc = OpenSSL \u306e\u30d0\u30fc\u30b8\u30e7\u30f3 1.0.1g \u3088\u308a\u524d\u306e 1.0.1 \u7cfb\u306b\u306f\u3001Heartbeat\u62e1\u5f35\u30d1\u30b1\u30c3\u30c8\u3092\u6b63\u3057\u304f\u51e6\u7406\u3057\u306a\u3044\u8106\u5f31\u6027\u304c\u5b58\u5728\u3057\u307e\u3059\u3002\u3053\u308c\u3092\u60aa\u7528\u3059\u308b\u3088\u3046\u7d30\u5de5\u3055\u308c\u305f\u30d1\u30b1\u30c3\u30c8\u306b\u3088\u3063\u3066\u30d0\u30c3\u30d5\u30a1\u30aa\u30fc\u30d0\u30fc\u30ea\u30fc\u30c9\u3092\u5f15\u304d\u8d77\u3053\u3057\u3001\u30ea\u30e2\u30fc\u30c8\u306e\u653b\u6483\u8005\u306b\u30d7\u30ed\u30bb\u30b9\u306e\u30e1\u30e2\u30ea\u304b\u3089\u6a5f\u5bc6\u60c5\u5831\u3092\u53d6\u5f97\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanrules.heartbleed.extrainfo = \u3053\u306e\u554f\u984c\u306f {0} \u3092\u4f7f\u7528\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30c7\u30fc\u30bf\u3092 \u7a83\u53d6\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u8aa4\u691c\u77e5\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u4f4e\u3044\u3067\u3059\u3002
ascanrules.heartbleed.name = Heartbleed OpenSSL \u306e\u8106\u5f31\u6027
ascanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
ascanrules.heartbleed.soln = OpenSSL \u3092 1.0.1g \u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u66f4\u65b0\u3057\u3001HTTPS \u8a3c\u660e\u66f8\u3092\u518d\u767a\u884c\u3057\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u975e\u5bfe\u79f0\u79d8\u5bc6\u9375\u3068\u3001\u5171\u6709\u79d8\u5bc6\u9375\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u6050\u308c\u304c\u3042\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3001\u3053\u308c\u3089\u3092\u5909\u66f4\u3057\u3066\u4e0b\u3055\u3044\u3002

ascanrules.hidden.files.alert.name = Hidden File Found
ascanrules.hidden.files.desc = A sensitive file was identified as accessible or available. This may leak administrative, configuration, or credential information which can be leveraged by a malicious individual to further attack the system or conduct social engineering efforts.
ascanrules.hidden.files.name = Hidden File Finder
ascanrules.hidden.files.refs = https\://blog.hboeck.de/archives/892-Introducing-Snallygaster-a-Tool-to-Scan-for-Secrets-on-Web-Servers.html
ascanrules.hidden.files.soln = Consider whether or not the component is actually required in production, if it isn't then disable it. If it is then ensure access to it requires appropriate authentication and authorization, or limit exposure to internal systems or specific source IPs, etc.

ascanrules.htaccess.desc = htaccess files can be used to alter the configuration of the Apache Web Server software to enable/disable additional functionality and features that the Apache Web Server software has to offer.
ascanrules.htaccess.name = .htaccess Information Leak
ascanrules.htaccess.otherinfo = Based on response status code htaccess file may be protected by an authentication or authorization mechanism.
ascanrules.htaccess.refs = https\://developer.mozilla.org/en-US/docs/Learn/Server-side/Apache_Configuration_htaccess\nhttps\://httpd.apache.org/docs/2.4/howto/htaccess.html
ascanrules.htaccess.soln = Ensure the .htaccess file is not accessible.

ascanrules.log4shell.cve44228.desc = Apache Log4j2 <\=2.14.1 JNDI features used in configuration, log messages, and parameters do not protect against attacker controlled LDAP and other JNDI related endpoints. An attacker who can control log messages or log message parameters can execute arbitrary code loaded from LDAP servers when message lookup substitution is enabled. From log4j 2.15.0, this behavior has been disabled by default.
ascanrules.log4shell.cve44228.name = Log4Shell (CVE-2021-44228)
ascanrules.log4shell.cve44228.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-44228
ascanrules.log4shell.cve44228.soln = Upgrade Log4j2 to version 2.17.1 or newer. In previous releases (>2.10) this behavior can be mitigated by setting system property "log4j2.formatMsgNoLookups" to "true" or by removing the JndiLookup class from the classpath (example\: zip -q -d log4j-core-*.jar org/apache/logging/log4j/core/lookup/JndiLookup.class). Java 8u121 (see https\://www.oracle.com/java/technologies/javase/8u121-relnotes.html) protects against remote code execution by defaulting "com.sun.jndi.rmi.object.trustURLCodebase" and "com.sun.jndi.cosnaming.object.trustURLCodebase" to "false".
ascanrules.log4shell.cve45046.desc = It was found that the fix to address CVE-2021-44228 in Apache Log4j 2.15.0 was incomplete in certain non-default configurations. This could allow attackers to craft malicious input data using a JNDI Lookup pattern resulting in an information leak and remote code execution in some environments.
ascanrules.log4shell.cve45046.name = Log4Shell (CVE-2021-45046)
ascanrules.log4shell.cve45046.refs = https\://www.lunasec.io/docs/blog/log4j-zero-day/\nhttps\://nvd.nist.gov/vuln/detail/CVE-2021-45046
ascanrules.log4shell.cve45046.soln = Upgrade Log4j2 to version 2.17.1 or newer.
ascanrules.log4shell.name = Log4Shell
ascanrules.log4shell.skipped = no Active Scan OAST service is selected

ascanrules.name = Active Scan Rules

ascanrules.paddingoracle.desc = By manipulating the padding on an encrypted string, an attacker is able to generate an error message that indicates a likely 'padding oracle' vulnerability. Such a vulnerability can affect any application or framework that uses encryption improperly, such as some versions of ASP.net, Java Server Faces, and Mono. An attacker may exploit this issue to decrypt data and recover encryption keys, potentially viewing and modifying confidential data. This rule should detect the MS10-070 padding oracle vulnerability in ASP.net if CustomErrors are enabled for that.
ascanrules.paddingoracle.name = Generic Padding Oracle
ascanrules.paddingoracle.refs = https\://learn.microsoft.com/en-us/security-updates/securitybulletins/2010/ms10-070\nhttps\://www.mono-project.com/docs/about-mono/vulnerabilities/\nhttps\://bugzilla.redhat.com/show_bug.cgi?id\=623799
ascanrules.paddingoracle.soln = Update the affected server software, or modify the scripts so that they properly validate encrypted data before attempting decryption.

ascanrules.parametertamper.desc = Parameter manipulation caused an error page or Java stack trace to be displayed. This indicated lack of exception handling and potential areas for further exploit.
ascanrules.parametertamper.name = Parameter Tampering
ascanrules.parametertamper.soln = Identify the cause of the error and fix it. Do not trust client side input and enforce a tight check in the server side. Besides, catch the exception properly. Use a generic 500 error page for internal server error.

ascanrules.pathtraversal.info = While the evidence field indicates {0}, the rule actually checked that the response contains matches for all of the following\: {1}.
ascanrules.pathtraversal.name = \u30d1\u30b9 \u30c8\u30e9\u30d0\u30fc\u30b5\u30eb

ascanrules.payloader.desc = Provides support for custom payloads in scan rules.
ascanrules.payloader.name = Active Scan Rules Custom Payloads

ascanrules.persistentxssattack.json.desc = A XSS attack was found in a JSON response, this might leave content consumers vulnerable to attack if they don't appropriately handle the data (response).
ascanrules.persistentxssattack.json.name = Cross Site Scripting Weakness (Persistent in JSON Response)
ascanrules.persistentxssattack.name = Cross Site Scripting (Persistent)
ascanrules.persistentxssattack.otherinfo = Source URL\: {0}
ascanrules.persistentxssattack.otherinfo.nothtml = Content-Type\u304cHTML\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u4f4e\u3044\u4fe1\u983c\u5ea6\u3067\u8b66\u544a\u3092\u767a\u751f\u3055\u305b\u307e\u3057\u305f\u3002

ascanrules.persistentxssprime.name = Cross Site Scripting (Persistent) - Prime

ascanrules.persistentxssspider.name = Cross Site Scripting (Persistent) - Spider

ascanrules.remotecodeexecution.cve-2012-1823.desc = Some PHP versions, when configured to run using CGI, do not correctly handle query strings that lack an unescaped "\=" character, enabling arbitrary code execution. In this case, an operating system command was caused to be executed on the web server, and the results were returned to the web browser.
ascanrules.remotecodeexecution.cve-2012-1823.name = Remote Code Execution - CVE-2012-1823
ascanrules.remotecodeexecution.cve-2012-1823.soln = Upgrade to the latest stable version of PHP, or use the Apache web server and the mod_rewrite module to filter out malicious requests using the "RewriteCond" and "RewriteRule" directives.

ascanrules.remotefileinclude.name = \u30ea\u30e2\u30fc\u30c8 \u30d5\u30a1\u30a4\u30eb\u3000\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3

ascanrules.serversideinclude.desc = Certain parameters may cause Server Side Include commands to be executed. This may allow database connection or arbitrary code to be executed.
ascanrules.serversideinclude.name = Server Side Include
ascanrules.serversideinclude.refs = https\://httpd.apache.org/docs/current/howto/ssi.html
ascanrules.serversideinclude.soln = Do not trust client side input and enforce a tight check in the server side. Disable server side includes.\nRefer to manual to disable Sever Side Include.\nUse least privilege to run your web server or application server.\nFor Apache, disable the following\:\nOptions Indexes FollowSymLinks Includes\nAddType application/x-httpd-cgi .cgi\nAddType text/x-server-parsed-html .html.

ascanrules.sourcecodedisclosurecve-2012-1823.desc = Some PHP versions, when configured to run using CGI, do not correctly handle query strings that lack an unescaped "\=" character, enabling PHP source code disclosure, and arbitrary code execution. In this case, the contents of the PHP file were served directly to the web browser. This output will typically contain PHP, although it may also contain straight HTML.
ascanrules.sourcecodedisclosurecve-2012-1823.name = Source Code Disclosure - CVE-2012-1823
ascanrules.sourcecodedisclosurecve-2012-1823.soln = Upgrade to the latest stable version of PHP, or use the Apache web server and the mod_rewrite module to filter out malicious requests using the "RewriteCond" and "RewriteRule" directives.

ascanrules.sourcecodedisclosurewebinf.desc = Java source code was disclosed by the web server in Java class files in the WEB-INF folder. The class files can be dis-assembled to produce source code which very closely matches the original source code.
ascanrules.sourcecodedisclosurewebinf.name = Source Code Disclosure - /WEB-INF Folder
ascanrules.sourcecodedisclosurewebinf.propertiesfile.desc = A Java class in the /WEB-INF folder disclosed the presence of the properties file. Properties file are not intended to be publicly accessible, and typically contain configuration information, application credentials, or cryptographic keys.
ascanrules.sourcecodedisclosurewebinf.propertiesfile.extrainfo = The reference to the properties file was found in the dis-assembled Java source code for Java class [{0}].
ascanrules.sourcecodedisclosurewebinf.propertiesfile.name = Properties File Disclosure - /WEB-INF folder
ascanrules.sourcecodedisclosurewebinf.propertiesfile.soln = The web server should be configured to not serve the /WEB-INF folder or its contents to web browsers. It may also be possible to remove the /WEB-INF folder.
ascanrules.sourcecodedisclosurewebinf.soln = The web server should be configured to not serve the /WEB-INF folder or its contents to web browsers, since it contains sensitive information such as compiled Java source code and properties files which may contain credentials. Java classes deployed with the application should be obfuscated, as an additional layer of defence in a "defence-in-depth" approach.

ascanrules.spring4shell.desc = The application appears to be vulnerable to CVE-2022-22965 (otherwise known as Spring4Shell) - remote code execution (RCE) via data binding.
ascanrules.spring4shell.name = Spring4Shell
ascanrules.spring4shell.refs = https\://nvd.nist.gov/vuln/detail/CVE-2022-22965\nhttps\://www.rapid7.com/blog/post/2022/03/30/spring4shell-zero-day-vulnerability-in-spring-framework/\nhttps\://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement\#vulnerability\nhttps\://tanzu.vmware.com/security/cve-2022-22965
ascanrules.spring4shell.soln = Upgrade Spring Framework to versions 5.3.18, 5.2.20, or newer.

ascanrules.springactuator.desc = Spring Actuator for Health is enabled and may reveal sensitive information about this application. Spring Actuators can be used for real monitoring purposes, but should be used with caution as to not expose too much information about the application or the infrastructure running it.
ascanrules.springactuator.name = Spring Actuator Information Leak
ascanrules.springactuator.refs = https\://docs.spring.io/spring-boot/docs/current/actuator-api/htmlsingle/\#overview
ascanrules.springactuator.soln = Disable the Health Actuators and other actuators, or restrict them to administrative users.

#ascanrules.sqlinjection.alert.errorbased.attack={1}
ascanrules.sqlinjection.alert.booleanbased.extrainfo = The page results were successfully manipulated using the boolean conditions [{0}] and [{1}]\nThe parameter value being modified was {2}stripped from the HTML output for the purposes of the comparison.
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists = Data was returned for the original parameter.\nThe vulnerability was detected by successfully restricting the data originally returned, by manipulating the parameter.
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists = Data was NOT returned for the original parameter.\nThe vulnerability was detected by successfully retrieving more data than originally returned, by manipulating the parameter.
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo = Unmodified message gave HTTP status [{0}], body of length [{1}], modified message gave HTTP status [{2}], body of length [{3}]. A third (non-SQL injection inducing value) gave HTTP status [{4}], body of length [{5}].
ascanrules.sqlinjection.alert.errorbased.extrainfo = RDBMS [{0}] likely, given error message regular expression [{1}] matched by the HTML results.\nThe vulnerability was detected by manipulating the parameter to cause a database error message to be returned and recognised.
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo = Unmodified message gave HTTP status [{0}], modified message gave HTTP status [{1}].
ascanrules.sqlinjection.alert.expressionbased.extrainfo = The original page results were successfully replicated using the expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison.
ascanrules.sqlinjection.alert.orderbybased.extrainfo = The original page results were successfully replicated using the "ORDER BY" expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison.
ascanrules.sqlinjection.alert.timebased.extrainfo = The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds.
ascanrules.sqlinjection.alert.unionbased.extrainfo = RDBMS [{0}] likely, given UNION-specific error message regular expression [{1}] matched by the HTML results\nThe vulnerability was detected by manipulating the parameter with an SQL ''UNION'' clause to cause a database error message to be returned and recognised.
ascanrules.sqlinjection.authbypass.desc = SQL injection may be possible on a login page, potentially allowing the application's authentication mechanism to be bypassed
ascanrules.sqlinjection.authbypass.name = SQL Injection - Authentication Bypass
ascanrules.sqlinjection.desc = SQL injection may be possible.
ascanrules.sqlinjection.hypersonic.name = SQL Injection - Hypersonic SQL (Time Based)
ascanrules.sqlinjection.mssql.alert.timebased.extrainfo = The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds.
ascanrules.sqlinjection.mssql.name = SQL Injection - MsSQL (Time Based)
ascanrules.sqlinjection.mysql.name = SQL Injection - MySQL (Time Based)
ascanrules.sqlinjection.name = SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.sqlinjection.name.rdbms = SQL Injection - {0}
ascanrules.sqlinjection.oracle.name = SQL Injection - Oracle (Time Based)
ascanrules.sqlinjection.postgres.name = SQL Injection - PostgreSQL (Time Based)
ascanrules.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanrules.sqlinjection.soln = Do not trust client side input, even if there is client side validation in place.\nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply an 'allow list' of allowed characters, or a 'deny list' of disallowed characters in user input.\nApply the principle of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanrules.sqlinjection.sqlite.alert.timing.error.extrainfo = The following known SQLite error message was provoked\: [{0}].
ascanrules.sqlinjection.sqlite.alert.timing.extrainfo = The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, parameter value [{2}], which caused the request to take [{3}] milliseconds, when the original unmodified query with value [{4}] took [{5}] milliseconds.
ascanrules.sqlinjection.sqlite.timing.name = SQL Injection - SQLite (Time Based)

ascanrules.ssti.alert.otherinfo = Proof found at [{0}]\ncontent\:\n[{1}]
ascanrules.ssti.desc = When the user input is inserted in the template instead of being used as argument in rendering is evaluated by the template engine. Depending on the template engine it can lead to remote code execution.
ascanrules.ssti.name = Server Side Template Injection
ascanrules.ssti.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.ssti.soln = Instead of inserting the user input in the template, use it as rendering argument.

ascanrules.sstiblind.alert.recvdcallback.otherinfo = Received callback from the server.
ascanrules.sstiblind.desc = When the user input is inserted in the template instead of being used as argument in rendering is evaluated by the template engine. Depending on the template engine it can lead to remote code execution.
ascanrules.sstiblind.name = Server Side Template Injection (Blind)
ascanrules.sstiblind.refs = https\://portswigger.net/blog/server-side-template-injection
ascanrules.sstiblind.soln = Instead of inserting the user input in the template, use it as rendering argument.

ascanrules.traceaxd.desc = The ASP.NET Trace Viewer (trace.axd) was found to be available. This component can leak a significant amount of valuable information.
ascanrules.traceaxd.name = Trace.axd Information Leak
ascanrules.traceaxd.otherinfo = Based on response status code Trace Viewer may be protected by an authentication or authorization mechanism.
ascanrules.traceaxd.refs = https\://msdn.microsoft.com/en-us/library/bb386420.aspx\nhttps\://msdn.microsoft.com/en-us/library/wwh16c6c.aspx\nhttps\://www.dotnetperls.com/trace
ascanrules.traceaxd.soln = Consider whether or not Trace Viewer is actually required in production, if it isn't then disable it. If it is then ensure access to it requires authentication and authorization.

ascanrules.useragent.desc = Check for differences in response based on fuzzed User Agent (eg. mobile sites, access as a Search Engine Crawler). Compares the response statuscode and the hashcode of the response body with the original response.
ascanrules.useragent.name = User Agent Fuzzer
ascanrules.useragent.refs = https\://owasp.org/wstg
ascanrules.useragent.useragentparmname = Header User-Agent

ascanrules.xpathinjection.name = XPath \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3

ascanrules.xsltinjection.command.otherinfo = Command execution may be possible.
ascanrules.xsltinjection.desc = Injection using XSL transformations may be possible, and may allow an attacker to read system information, read and write files, or execute arbitrary code.
ascanrules.xsltinjection.error.otherinfo = The response to sending an XSLT token included error messages that may indicate a vulnerability to XSLT injections.
ascanrules.xsltinjection.name = XSLT Injection
ascanrules.xsltinjection.portscan.otherinfo = Port scanning may be possible.
ascanrules.xsltinjection.refs = https\://www.contextis.com/blog/xslt-server-side-injection-attacks
ascanrules.xsltinjection.soln = Sanitize and analyze every user input coming from any client-side.
ascanrules.xsltinjection.vendor.otherinfo = The XSLT processor vendor name "{0}" was returned after an injection request.

ascanrules.xxe.name = XML External Entity Attack
