#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=Aktif Tarama Kurallar\u0131

ascanrules.bufferoverflow.name=Bellek Ta\u015fmas\u0131
ascanrules.bufferoverflow.desc=Bellek ta\u015fma hatalar\u0131, arka planda \u00e7al\u0131\u015fan web i\u015flemlerinin bellekteki yerleri \u00fczerine bilerek ya da bilmeyerek yaz\u0131lmas\u0131yla olu\u015fan hatalard\u0131r. IP (Komut \u0130\u015faret\u00e7isi), BP(Temel Pointer) ve di\u011fer yazma\u00e7lar istisnai hatalar, segmentasyon hatalar\u0131 ve di\u011fer i\u015flemlerde problemler olu\u015fmas\u0131na neden olur. Genellikle bu hatalar uygulaman\u0131n beklenmedik bir \u015fekilde sona ermesine sebep olur. 
ascanrules.bufferoverflow.soln=Arka planda \u00e7al\u0131\u015fan program\u0131 uygun d\u00f6n\u00fc\u015f de\u011feri i\u00e7in uzunluk kontrol\u00fc yaparak tekrar yaz. Bu i\u015flem arka planda \u00e7al\u0131\u015fan program\u0131n tekrar derlenmesini gerektirir.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Bellek_tasmasi_saldirisi
ascanrules.bufferoverflow.other=Olas\u0131 Bellek Ta\u015fmas\u0131.  Betik ba\u011flant\u0131y\u0131 sonland\u0131rd\u0131 ve 500 \u0130\u00e7 Sunucu Hatas\u0131 verdi


ascanrules.commandinjectionplugin.name=Uzaktan OS Komut Enjeksiyonu
ascanrules.commandinjectionplugin.desc=I\u015fletim sistemi komutlar\u0131n\u0131n izinsiz y\u00fcr\u00fct\u00fclmesi i\u00e7in kullan\u0131lan sald\u0131r\u0131 tekni\u011fidir. Bu sald\u0131r\u0131, bir uygulama i\u015fletim sistemi komutlar\u0131n\u0131 olu\u015ftururken uygunsuz veri sanitizasyonu ve/veya uygunsuz harici programlar\u0131 \u00e7a\u011f\u0131rmak gibi g\u00fcvensiz y\u00f6ntemleri kulland\u0131\u011f\u0131nda ve g\u00fcvensiz girdileri kabul etti\u011finde ger\u00e7ekle\u015fir.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html https\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=Bi\u00e7im String Hatas\u0131
ascanrules.formatstring.desc=Girilen verinin uygulama taraf\u0131ndan bir komut olarak de\u011ferlendirilmesi sonucu Bi\u00e7im String hatas\u0131 olu\u015fur. 
ascanrules.formatstring.soln=Arka planda \u00e7al\u0131\u015fan program\u0131 uygun k\u00f6t\u00fc string karakterlerini silerek tekrar yaz\u0131n. Bu arka planda \u00e7al\u0131\u015fan program\u0131n tekrar derlenmesini gerektirir.
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_sald\u0131r\u0131s\u0131
ascanrules.formatstring.error1=Potansiyel bi\u00e7im string hatas\u0131.  Komut dosyas\u0131 bir /%s' de ba\u011flant\u0131 kapatt\u0131
ascanrules.formatstring.error2=Potansiyel bi\u00e7im string hatas\u0131.  Komut dosyas\u0131 bir /%s' de ve /%x ba\u011flant\u0131 kapatt\u0131
ascanrules.formatstring.error3=Muhtemel yaz\u0131 format\u0131 hatas\u0131. Komut dosyas\u0131 mikrosoft yaz\u0131 format\u0131 hatas\u0131 ile sonland\u0131


ascanrules.testscrosssitescriptv2.name=\u00c7apraz Site Betiklemesi (Yans\u0131yan)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=\u0130\u00e7erik t\u00fcr\u00fc HTML olmad\u0131\u011f\u0131 i\u00e7in d\u00fc\u015f\u00fck g\u00fcven seviyesine aktar\u0131ld\u0131

ascanrules.testpersistentxssattack.name=\u00c7apraz Site Betiklemesi (Kal\u0131c\u0131)
ascanrules.testpersistentxssattack.otherinfo=Kaynak URL\: {0}

ascanrules.testpersistentxssprime.name=\u00c7apraz Site Betiklemesi (Kal\u0131c\u0131) - As\u0131l
ascanrules.testpersistentxssprime.misc=N / A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (Kal\u0131c\u0131) - Spider
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=SQL Enjeksiyonu
ascanrules.testsqlinjection.desc=SQL enjeksiyonu m\u00fcmk\u00fcn olabilir.
ascanrules.testsqlinjection.soln=Yerinde istemci taraf\u0131nda do\u011frulama olsa bile, istemci taraf\u0131nda giri\u015fi g\u00fcvenmeyin.   \nGenel olarak, tip onay sunucu taraf\u0131nda t\u00fcm veriler. Uygulama JDBC kullan\u0131yorsa, ge\u00e7ti parametreleri ile PreparedStatement veya CallableStatement kullanmak '?' Uygulama ASP kullan\u0131yorsa, ADO Command g\u00fc\u00e7l\u00fc tip kontrol ve parametreli sorgu ile Objects kullan\u0131n. Veritaban\u0131 Stored Procedures kullan\u0131labilir, bunlar\u0131 kullan\u0131n. Do * de\u011fil * birle\u015ftirdi\u011finiz sakl\u0131 yordam sorgular\u0131 i\u00e7ine dizeleri veya 'exec' exec hemen 'veya e\u015fde\u011fer i\u015flevini kullanmak\! Basit dize birle\u015ftirme kullanarak dinamik SQL sorgular\u0131 olu\u015fturmak etmeyin. Istemciden al\u0131nan t\u00fcm verileri ka\u00e7\u0131\u015f. Izin verilen karakter bir 'beyaz liste' ya da kullan\u0131c\u0131 giri\u015fi izin verilmeyen bir karakter 'kara liste' Uygula. M\u00fcmk\u00fcn olan en az ayr\u0131cal\u0131kl\u0131 veritaban\u0131 kullan\u0131c\u0131 kullanarak en az ayr\u0131cal\u0131k ayr\u0131cal\u0131k uygulay\u0131n. \u00d6zellikle, 'sa' veya 'db sahibi' veritaban\u0131 kullan\u0131c\u0131lar\u0131 kullanmaktan ka\u00e7\u0131n\u0131n. Bu SQL enjeksiyon ortadan kald\u0131rmak, ancak etkisini en aza indirir de\u011fildir. Uygulama i\u00e7in gerekli olan asgari veritaban\u0131 eri\u015fimi verin.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=[ {0} ] alan\: [ {1} ], de\u011fer [ {2} ]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=Orijinal De\u011feri\: [{0}]. De\u011fi\u015ftirilmi\u015f De\u011feri\: [{1}]. Kontrol De\u011feri\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[ {0}] alan\: [ {1}], de\u011fer [ {2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[ {0}] alan\: [ {1}], de\u011fer [ {2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=RDBMS [ {0} ] olas\u0131l\u0131kla, verilen hata mesaj\u0131 d\u00fczenli ifade [ {1} ] HTML sonu\u00e7lar\u0131 e\u015fle\u015fti. G\u00fcvenlik a\u00e7\u0131\u011f\u0131, bir veritaban\u0131 hata mesaj\u0131 neden parametreyi manip\u00fcle ederek tespit edildi d\u00f6nd\u00fc ve tan\u0131nmas\u0131 i\u00e7in
ascanrules.testsqlinjection.alert.unionbased.extrainfo=RDBMS [ {0} ] olas\u0131l\u0131kla, verilen B\u0130RL\u0130\u011e\u0130 \u00f6zg\u00fc hata iletisi d\u00fczenli ifade [ {1} ] a\u00e7\u0131\u011f\u0131, bir veritaban\u0131 hata mesaj\u0131 neden f\u0131kra, bir SQL ''B\u0130RL\u0130\u011e\u0130'' ile parametre manip\u00fcle ederek tespit edildi HTML sonu\u00e7lar\u0131 e\u015fle\u015fti iade edilecek ve tan\u0131nm\u0131\u015f
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=Orijinal sayfa sonu\u00e7lar\u0131 ba\u015far\u0131yla ifade kullan\u0131larak \u00e7o\u011falt\u0131lm\u0131\u015f [ {0} ] parametre de\u011feri oldu de\u011fi\u015ftirilen parametre de\u011feri olarak {1} kar\u015f\u0131la\u015ft\u0131rma amac\u0131yla HTML \u00e7\u0131kt\u0131s\u0131 elimden
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=Orijinal sayfa sonu\u00e7lar\u0131 ba\u015far\u0131yla ifadesi "ORDER BY" se\u00e7ene\u011fini kullanarak \u00e7o\u011falt\u0131lm\u0131\u015f [ {0} ] parametre de\u011feri oldu de\u011fi\u015ftirilen parametre de\u011feri olarak {1} kar\u015f\u0131la\u015ft\u0131rma amac\u0131yla HTML \u00e7\u0131kt\u0131s\u0131 elimden
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=De\u011fi\u015ftirilmemi\u015f mesaj [HTTP stat\u00fcs\u00fc verdi {0} ], modifiye mesaj verdi HTTP durum [ {1} ]
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=De\u011fi\u015ftirilmemi\u015f mesaj [HTTP stat\u00fcs\u00fc verdi {0} ], uzunlu\u011fu v\u00fccut [ {1} ], modifiye mesaj HTTP stat\u00fcs\u00fc verdi [ {2} ], uzunluk v\u00fccut [ {3} ]. \u00dc\u00e7\u00fcnc\u00fc (non-SQL enjeksiyonu uyaran de\u011feri) HTTP stat\u00fcs\u00fc verdi [ {4} ], uzunlu\u011fu v\u00fccut [ {5} ]
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=sayfa sonu\u00e7lar\u0131 ba\u015far\u0131yla boolean ko\u015fullar kullan\u0131larak manip\u00fcle edildi [ {0} ] ve [ {1} ] parametre de\u011feri oldu de\u011fi\u015ftirilen {2} kar\u015f\u0131la\u015ft\u0131rma amac\u0131yla HTML \u00e7\u0131kt\u0131s\u0131 elimden
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=Veri orijinal parametre i\u00e7in iade edildi. G\u00fcvenlik a\u00e7\u0131\u011f\u0131 ba\u015far\u0131yla parametreyi manip\u00fcle ederek, veri asl\u0131nda geri d\u00f6nd\u00fc k\u0131s\u0131tlayarak tespit edildi
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=Veri orijinal parametre i\u00e7in iade DE\u011e\u0130LD\u0130. G\u00fcvenlik a\u00e7\u0131\u011f\u0131 ba\u015far\u0131yla parametreyi manip\u00fcle ederek, ba\u015flang\u0131\u00e7ta d\u00f6nd\u00fcr\u00fclen daha fazla veri alarak tespit edildi
ascanrules.testsqlinjection.alert.timebased.extrainfo=Sorgu s\u00fcresi parametre de\u011ferini kullanarak kontrol edilebilir [ {0} ], istek [almaya neden olan {1} de\u011feri ile orijinal de\u011fi\u015ftirilmemi\u015f sorgusu [zaman] milisaniye, {2} ] [s\u00fcrd\u00fc {3} ] milisaniye 
ascanrules.testsqlinjection.authbypass.name=SQL Injection - Kimlik Atlama
ascanrules.testsqlinjection.authbypass.desc=SQL injection potansiyel uygulaman\u0131n kimlik do\u011frulama mekanizmas\u0131 bypass sa\u011flayan bir giri\u015f sayfas\u0131nda m\u00fcmk\u00fcn olabilir 

ascanrules.testexternalredirect.name=D\u0131\u015f Y\u00f6nlendirme
ascanrules.testexternalredirect.reason.location.header=Yan\u0131t harici URL ayarlanmas\u0131na izin verir onun Konum ba\u015fl\u0131\u011f\u0131ndaki bir y\u00f6nlendirme i\u00e7eriyor.
ascanrules.testexternalredirect.reason.location.meta=Yan\u0131t harici URL ayarlanmas\u0131na izin verir 'Yer' i\u00e7in meta http-equiv etiketi bir y\u00f6nlendirme i\u00e7eriyor.
ascanrules.testexternalredirect.reason.refresh.header=Yan\u0131t harici URL ayarlanmas\u0131na izin verir kendi Yenile ba\u015fl\u0131\u011f\u0131ndaki bir y\u00f6nlendirme i\u00e7eriyor.
ascanrules.testexternalredirect.reason.refresh.meta=Yan\u0131t harici URL ayarlanmas\u0131na izin verir 'Yenile' i\u00e7in meta http-equiv etiketi bir y\u00f6nlendirme i\u00e7eriyor.
ascanrules.testexternalredirect.reason.javascript=Yan\u0131t harici URL ayarlanmas\u0131na izin verir onun JavaScript kodunda bir y\u00f6nlendirme i\u00e7eriyor.
ascanrules.testexternalredirect.reason.notfound=Bunun i\u00e7in bir neden bulunamad\u0131 ...

ascanrules.codeinjectionplugin.name=Server Side Kod Enjeksiyon
ascanrules.codeinjectionplugin.name.asp=Sunucu tarafl\u0131 kod enjeksiyonu - ASP kod enjeksiyonu
ascanrules.codeinjectionplugin.name.php=Sunucu tarafl\u0131 kod enjeksiyonu - PHP kod enjeksiyonu
ascanrules.codeinjectionplugin.desc=Bir kod enjeksiyon betik motoru taraf\u0131ndan de\u011ferlendirmeye al\u0131nacak \u00f6zel kod dahil olmak \u00fczere m\u00fcmk\u00fcn olabilir
ascanrules.codeinjectionplugin.soln=Yerinde istemci taraf\u0131nda do\u011frulama olsa bile, istemci taraf\u0131nda giri\u015fi g\u00fcvenmeyin. Genel olarak, sunucu taraf\u0131nda t\u00fcm verileri kontrol ve t\u00fcm veri m\u00fc\u015fteriden al\u0131nan ka\u00e7mak. Tipi\n  kullan\u0131c\u0131 giri\u015fi verileri ile kombine eval kullan\u0131m\u0131 () i\u015flevleri ka\u00e7\u0131n\u0131n.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html https\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection ')

ascanrules.testdirectorybrowsing.name=Dizin Tarama
ascanrules.testdirectorybrowsing.desc=Bu dizin listesini g\u00f6rmek m\u00fcmk\u00fcnd\u00fcr. Dizin listeleme gizli scriptler, hassas bilgileri okumak i\u00e7in eri\u015filebilir, vb dosyalar\u0131 yedekleme kaynak dosyalar\u0131 dahil ortaya \u00e7\u0131karabilir.
ascanrules.testdirectorybrowsing.soln=Dizin taramay\u0131 devre d\u0131\u015f\u0131 b\u0131rak. E\u011fer bu gerekiyse, listelenen dosyalar\u0131n risk olu\u015fturmad\u0131\u011f\u0131ndan emin olun.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options http\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html\n

ascanrules.testinjectioncrlf.name=CRLF Injection
ascanrules.testinjectioncrlf.desc=\u00c7erez CRLF enjeksiyon yoluyla ayarlanabilir. Ayr\u0131ca keyfi HTTP yan\u0131t ba\u015fl\u0131klar\u0131n\u0131 ayarlamak m\u00fcmk\u00fcn olabilir. Buna ek olarak, dikkatli bir cross-site komut dosyas\u0131 kullan\u0131larak enjekte yan\u0131t\u0131 i\u015f\u00e7ili\u011fi ile, \u00f6nbellek zehirlenmesi a\u00e7\u0131\u011f\u0131 da mevcut olabilir.
ascanrules.testinjectioncrlf.soln=Dikkatle sunulan parametreyi kontrol yaz\u0131n. Crlf filtreleme ile enjekte edilmesine izin vermeyin.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf http\://webappfirewall.com/lib/crlf-injection.txtnull http\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=Parametre Tampering
ascanrules.testparametertamper.desc=Parametre manip\u00fclasyon bir hata sayfas\u0131 veya Java y\u0131\u011f\u0131n izleme g\u00f6r\u00fcnt\u00fclenecek neden oldu. Bu da istismar i\u00e7in istisna i\u015fleme ve potansiyel alanlar\u0131n eksikli\u011fi g\u00f6sterdi.
ascanrules.testparametertamper.soln=Hatan\u0131n nedenini belirlemek ve d\u00fczeltmek. Istemci taraf\u0131nda giri\u015fi g\u00fcven ve sunucu taraf\u0131nda s\u0131k\u0131 bir onay zorlamak yok. Ayr\u0131ca, d\u00fczg\u00fcn \u00f6zel durumu yakalamak. I\u00e7 sunucu hatas\u0131 i\u00e7in genel 500 hata sayfas\u0131n\u0131 kullan\u0131n.

ascanrules.testpathtraversal.name=Yol Takibi

ascanrules.testremotefileinclude.name=Remote File Inclusion

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=Sunucu Taraf\u0131 neden olabilir belirli parametreler komutlar\u0131 y\u00fcr\u00fct\u00fclecek ekleyin. Bu veritaban\u0131 ba\u011flant\u0131s\u0131 veya rasgele kod y\u00fcr\u00fct\u00fclmesine izin verebilir.
ascanrules.testserversideinclude.soln=Istemci taraf\u0131nda giri\u015fi g\u00fcven ve sunucu taraf\u0131nda s\u0131k\u0131 bir onay zorlamak yok. Devre D\u0131\u015f\u0131 sunucu taraf\u0131 i\u00e7erir.\n
Refer=manuel i\u00e7in Sever Side Include devre d\u0131\u015f\u0131 b\u0131rakmak i\u00e7in. Web sunucusu veya uygulama sunucusu \u00e7al\u0131\u015ft\u0131rmak en az ayr\u0131cal\u0131k kullan\u0131n. Apache i\u00e7in a\u015fa\u011f\u0131daki devre d\u0131\u015f\u0131 b\u0131rak\u0131n\: Se\u00e7enekler Endeksleri FollowSymLinks AddType application / x-httpd-cgi .cgi AddType text / x-sunucu-ayr\u0131\u015ft\u0131r\u0131ld\u0131-html .html i\u00e7erir
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

