#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=Regras do Scan Ativo

ascanrules.bufferoverflow.name=Estouro de Buffer
ascanrules.bufferoverflow.desc=Erros de estouro de Buffer s\u00e3o caracterizados pela sobrescri\u00e7\u00e3o de espa\u00e7os de mem\u00f3ria do processo web de segundo plano, o qual nunca deveria ser modificado com ou sem inten\u00e7\u00e3o. Sobrescrever valores do IP (Instruction Pointer), BP (Base Pointer) e outros registros causam exce\u00e7\u00f5es, falhas de segmenta\u00e7\u00e3o, e a ocorr\u00eancia de outros erros de processos. Normalmente esses erros finalizam a execu\u00e7\u00e3o do aplicativo de forma inesperada. 
ascanrules.bufferoverflow.soln=Reescreva o programa de plano de fundo utilizando o correto controle de retorno de comprimento. Isso ir\u00e1 requerer uma recompila\u00e7\u00e3o do execut\u00e1vel do plano de fundo.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=Potencial Estouro de Buffer. O script fechou a conex\u00e3o e lan\u00e7ou um 500 Erro Interno de Servidor


ascanrules.commandinjectionplugin.name=Inje\u00e7\u00e3o Remota em Comandos em SO
ascanrules.commandinjectionplugin.desc=T\u00e9cnica de ataque utilizada para execu\u00e7\u00e3o n\u00e3o autorizada de comandos em sistemas operacionais. Este ataque \u00e9 poss\u00edvel quando uma aplica\u00e7\u00e3o aceita entrada n\u00e3o confi\u00e1vel para construir comandos de sistema operacional de uma forma insegura, envolvendo sanitiza\u00e7\u00e3o de dados impr\u00f3pria e/ou chamadas impr\u00f3pria a programas externos.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html\nhttps\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=Erro de Formato de String
ascanrules.formatstring.desc=Um erro de Formato de String ocorre quando o dado enviado de uma string de entrada \u00e9 avaliado como um comando pelo aplicativo. 
ascanrules.formatstring.soln=Reescreva o programa de plano de fundo utilizando o apagamento apropriado das bad character strings. Isso ir\u00e1 requerer uma recompila\u00e7\u00e3o do execut\u00e1vel do plano de fundo.
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=Potential Format String Error.  The script closed the connection on a /%s
ascanrules.formatstring.error2=Potential Format String Error.  The script closed the connection on a /%s and /%x
ascanrules.formatstring.error3=Potential Format String Error.  The script closed the connection on a microsoft format string error


ascanrules.testscrosssitescriptv2.name=Cross Site Scripting (Refletido)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=Raised with LOW confidence as the Content-Type is not HTML

ascanrules.testpersistentxssattack.name=Cross Site Scripting (Persistente)
ascanrules.testpersistentxssattack.otherinfo=URL de Origem\: {0}

ascanrules.testpersistentxssprime.name=Cross Site Scripting (Persistente) - Prim\u00e1rio
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (Persistente) - Spider
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=Inje\u00e7\u00e3o SQL
ascanrules.testsqlinjection.desc=Inje\u00e7\u00e3o SQL pode ser poss\u00edvel.
ascanrules.testsqlinjection.soln=N\u00e3o confie na entrada vinda do lado cliente, mesmo se houver uma valida\u00e7\u00e3o deste lado. \nEm geral, valide todos os dados no lado servidor. \nSe a aplica\u00e7\u00e3o utilizar JDBC, utilize PreparedStatement ou CallableStatement com os par\u00e2metros passados por '?' \nSe a aplica\u00e7\u00e3o utilizar ASP, utilize o ADO Command Objects com verifica\u00e7\u00e3o forte de tipagem e consultas parametrizadas. \nSe for poss\u00edvel utilizar Stored Procedures, use-os. \nN\u00c3O concatene strings nas consultas dentro dos Stored Procedures ou use 'exec', 'exec immediate' ou fun\u00e7\u00e3o equivalente\! \nN\u00e3o crie consultas SQL din\u00e2micas utilizando concatena\u00e7\u00e3o simples de strings. \nSanitize todos os dados recebidos do cliente. \nAplique uman 'allow list' de caracteres permitidos ou uma 'deny list' com os caracteres proibidos na entrada dos usu\u00e1rios. \nAplique o princ\u00edpio do privil\u00e9gio m\u00ednimo ao ter o usu\u00e1rio do banco de dados com as menores permiss\u00f5es necess\u00e1rias para uso do sistema. \nEm particular, evite o uso dos usu\u00e1rios 'sa' e 'db-owner'. Isto n\u00e3o elimina a inje\u00e7\u00e3o SQL, mas minimiza seu impacto. Garante o m\u00ednimo acesso a base de dados que for necess\u00e1ria para cada aplica\u00e7\u00e3o.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=Valor Original\: [{0}]. Valor Modificado\: [{1}]. Valor de Controle\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] e afins, fornece a express\u00e3o regular de mensagem de erro [{1}] acompanhada pelos resultados HTML.\nA vulnerabilidade foi detectada ao manipular o par\u00e2metro para causar o retorno de uma mensagem de erro de banco de dados que foi reconhecida
ascanrules.testsqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] e afins, fornece a express\u00e3o regular da mensagem de erro do comando UNION [{1}] acompanhado dos resultados HTML.\nA vulnerabilidade foi detectada ao manipular o par\u00e2metro com uma cl\u00e1usula SQL ''UNION'' para causar o retorno de uma mensagem de erro de banco de dados que foi reconhecida
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=Os resultados da p\u00e1gina original foram replicados com sucesso utilizando a express\u00e3o [{0}] como o valor de par\u00e2metro.\nO valor do par\u00e2metro foi modificado era {1}, retirado da sa\u00edda HTML para prop\u00f3sitos de compara\u00e7\u00e3o
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=Os resultados da p\u00e1gina original foram replicados com sucesso utilizando a express\u00e3o "ORDER BY" [{0}] como o valor de par\u00e2metro.\nO valor do par\u00e2metro foi modificado era {1}retirado da sa\u00edda HTML para prop\u00f3sito de compara\u00e7\u00e3o
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=Mensagem n\u00e3o modificada fornece status HTTP [{0}], Mensagem modificada fornece status HTTP [{1}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=Mensagem n\u00e3o modificada fornece status HTTP [{0}], comprimento do corpo [{1}], mensagem modificada fornece status HTTP [{2}], comprimento do corpo [{3}]. Um terceiro (valor que n\u00e3o induz a inje\u00e7\u00e3o SQL) fornece status HTTP [{4}], comprimento do corpo [{5}]
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=Os resultados da p\u00e1gina original foram manipulados com sucesso utilizando as condi\u00e7\u00f5es booleanas [{0}] e [{1}]\nO valor do par\u00e2metro foi modificado era {2}retirado da sa\u00edda HTML para prop\u00f3sito de compara\u00e7\u00e3o
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=Dados foram retornados do par\u00e2metro original.\nA vulnerabilidade foi detectada ao restringir com sucesso os dados originalmente retornados, atrav\u00e9s da manipula\u00e7\u00e3o de par\u00e2metros
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=Dados N\u00c3O foram retornados do par\u00e2metro original.\nA vulnerabilidade foi detectada ao restringir com sucesso os dados originalmente retornados, atrav\u00e9s da manipula\u00e7\u00e3o de par\u00e2metros
ascanrules.testsqlinjection.alert.timebased.extrainfo=O tempo da query \u00e9 control\u00e1vel utilizando o valor do par\u00e2metro [{0}], o qual causou a requisi\u00e7\u00e3o a levar [{1}] milissegundos, enquanto o valor original da query sem modifica\u00e7\u00e3o com o valor [{2}] levou [{3}] milissegundos
ascanrules.testsqlinjection.authbypass.name=Inje\u00e7\u00e3o SQL - Contorno de Autentica\u00e7\u00e3o
ascanrules.testsqlinjection.authbypass.desc=Inje\u00e7\u00e3o SQL pode ser poss\u00edvel em uma p\u00e1gina de login, potencialmente permitindo que o mecanismo de autentica\u00e7\u00e3o de uma aplica\u00e7\u00e3o seja contornado 

ascanrules.testexternalredirect.name=Redirecionamento Externo
ascanrules.testexternalredirect.reason.location.header=A resposta cont\u00e9m um redirecionamento no cabe\u00e7alho Local que permite uma Url externa ser configurada.
ascanrules.testexternalredirect.reason.location.meta=A resposta cont\u00e9m um redirecionamento em suas meta tags http-equiv para 'Location' que permite uma Url externa ser configurada.
ascanrules.testexternalredirect.reason.refresh.header=The response contains a redirect in its Refresh header which allows an external Url to be set.
ascanrules.testexternalredirect.reason.refresh.meta=The response contains a redirect in its meta http-equiv tag for 'Refresh' which allows an external Url to be set.
ascanrules.testexternalredirect.reason.javascript=The response contains a redirect in its JavaScript code which allows an external Url to be set.
ascanrules.testexternalredirect.reason.notfound=Nenhuma raz\u00e3o encontrada para isso...

ascanrules.codeinjectionplugin.name=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor
ascanrules.codeinjectionplugin.name.asp=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor - Inje\u00e7\u00e3o de C\u00f3digo ASP
ascanrules.codeinjectionplugin.name.php=Inje\u00e7\u00e3o de C\u00f3digo no Lado do Servidor - Inje\u00e7\u00e3o de C\u00f3digo PHP
ascanrules.codeinjectionplugin.desc=Uma inje\u00e7\u00e3o de c\u00f3digo pode ser poss\u00edvel incluindo um c\u00f3digo personalizado que ser\u00e1 avaliado pelo mecanismo de script
ascanrules.codeinjectionplugin.soln=N\u00e3o confie na entrada do lado do cliente, mesmo se existir uma valida\u00e7\u00e3o no lado cliente.\nEm geral, verifique o tipo de dados no lado do servidor e evite todos os dados recebidos do cliente.\n Evite o uso de fun\u00e7\u00f5es eval() combinadas com dados de entrada de usu\u00e1rios.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html \nhttps\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection')

ascanrules.testdirectorybrowsing.name=Pesquisa de Diret\u00f3rio
ascanrules.testdirectorybrowsing.desc=\u00c9 poss\u00edvel visualizar a listagem de diret\u00f3rios. A listagem de diret\u00f3rios podem revelar scripts escondidos, incluindo arquivos, arquivos de origem de backup etc que podem ser acessados para ler informa\u00e7\u00f5es de dados sens\u00edveis.
ascanrules.testdirectorybrowsing.soln=Desabilita a pesquisa de diret\u00f3rio. Se isso for necess\u00e1rio, certifique-se que os arquivos listados n\u00e3o induzem risco.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\nhttp\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html\n

ascanrules.testinjectioncrlf.name=CRLF Injection
ascanrules.testinjectioncrlf.desc=Cookie can be set via CRLF injection.  It may also be possible to set arbitrary HTTP response headers. In addition, by carefully crafting the injected response using cross-site script, cache poisoning vulnerability may also exist.
ascanrules.testinjectioncrlf.soln=Type check the submitted parameter carefully.  Do not allow CRLF to be injected by filtering CRLF.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\nhttp\://webappfirewall.com/lib/crlf-injection.txtnull\nhttp\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=Parameter Tampering
ascanrules.testparametertamper.desc=Parameter manipulation caused an error page or Java stack trace to be displayed.  This indicated lack of exception handling and potential areas for further exploit.
ascanrules.testparametertamper.soln=Identify the cause of the error and fix it.  Do not trust client side input and enforce a tight check in the server side.  Besides, catch the exception properly.  Use a generic 500 error page for internal server error.

ascanrules.testpathtraversal.name=Path Traversal

ascanrules.testremotefileinclude.name=Remote File Inclusion

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=Certain parameters may cause Server Side Include commands to be executed.  This may allow database connection or arbitrary code to be executed.
ascanrules.testserversideinclude.soln=Do not trust client side input and enforce a tight check in the server side.  Disable server side includes.\n
Refer=to manual to disable Sever Side Include.\n\nUse least privilege to run your web server or application server.\n\nFor Apache, disable the following\:\n\nOptions Indexes FollowSymLinks Includes\n\nAddType application/x-httpd-cgi .cgi\n\nAddType text/x-server-parsed-html .html
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

