#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=R\u00e8gles d'analyse active

ascanrules.bufferoverflow.name=D\u00e9bordement de tampon
ascanrules.bufferoverflow.desc=Les erreurs de d\u00e9bordement de tampon sont caract\u00e9ris\u00e9es par la sur\u00e9criture des espaces de m\u00e9moire du processus en arri\u00e8re-plan, qui ne devraient jamais \u00eatre modifi\u00e9s, intentionnellement ou non. \u00c9craser les valeurs de l'IP (Instruction Pointer), BP (pointeur de Base) et autres registres provoque des exceptions, des erreurs de segmentation et des erreurs dans d'autres processus. Ces erreurs terminent g\u00e9n\u00e9ralement l'ex\u00e9cution de l'application d'une mani\u00e8re inattendue. 
ascanrules.bufferoverflow.soln=R\u00e9\u00e9crire le programme d'arri\u00e8re-plan en utilisant une v\u00e9rification de la longueur de retour correcte.  Cela n\u00e9cessitera une recompilation de l'ex\u00e9cutable d'arri\u00e8re-plan.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=D\u00e9bordement de tampon potentiel. Le script a ferm\u00e9 la connexion et a lanc\u00e9 une erreur interne du serveur 500


ascanrules.commandinjectionplugin.name=Injection de commande de SE \u00e0 distance
ascanrules.commandinjectionplugin.desc=Technique d'attaque utilis\u00e9e pour l'ex\u00e9cution non autoris\u00e9e de commandes du syst\u00e8me d'exploitation. Cette attaque est possible lorsqu'une application accepte des entr\u00e9es douteuses pour g\u00e9n\u00e9rer des commandes de syst\u00e8me d'exploitation vuln\u00e9rables, sans assainissement correct des donn\u00e9es et/ou sans appel correct de programmes externes.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html\nhttps\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=Erreur de format de cha\u00eene
ascanrules.formatstring.desc=Une erreur de format de cha\u00eene s'est produite lorsque les donn\u00e9es provenant d'une cha\u00eene d'entr\u00e9e ont \u00e9t\u00e9 \u00e9valu\u00e9es comme une commande par l'application. 
ascanrules.formatstring.soln=R\u00e9\u00e9crire le programme d'arri\u00e8re-plan en supprimant de mani\u00e8re correcte les mauvaises cha\u00eenes de caract\u00e8res. Cela n\u00e9cessitera la recompilation de l'ex\u00e9cutable d'arri\u00e8re-plan .
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=\u00c9ventuelle erreur de formatage de cha\u00eene.  Le script a ferm\u00e9 la connexion sur un /%s
ascanrules.formatstring.error2=\u00c9ventuelle erreur de formatage de cha\u00eene.  Le script a ferm\u00e9 la connexion sur un /%s et /%x
ascanrules.formatstring.error3=\u00c9ventuelle erreur de formatage de cha\u00eene.  Le script a ferm\u00e9 la connexion sur une erreur de cha\u00eene au format microsoft


ascanrules.testscrosssitescriptv2.name=Cross Site Scripting (r\u00e9fl\u00e9chi)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=Lev\u00e9e avec le degr\u00e9 de confiance faible, car le Content-Type n'est pas HTML

ascanrules.testpersistentxssattack.name=Cross-Site Scripting (stock\u00e9)
ascanrules.testpersistentxssattack.otherinfo=URL de la source\: {0}

ascanrules.testpersistentxssprime.name=Cross Site Scripting (stock\u00e9) - premier
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (stock\u00e9) - Robot
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=Injection SQL
ascanrules.testsqlinjection.desc=Une injection SQL peut \u00eatre possible.
ascanrules.testsqlinjection.soln=Ne faites pas confiance aux entr\u00e9es du c\u00f4t\u00e9 client, m\u00eame si des m\u00e9canismes de validation sont en place c\u00f4t\u00e9 client. \nEn g\u00e9n\u00e9ral, contr\u00f4lez du c\u00f4t\u00e9 serveur le type de chaque donn\u00e9e.\nSi l'application utilise JDBC, utilisez les PreparedStatement ou CallableStatement, avec les param\u00e8tres pass\u00e9s par '?'\nSi l'application utilise ASP, utilisez les Objects de Commande ADO avec un typage fort et des requ\u00eates param\u00e9tr\u00e9es.\nSi l'utilisation de Proc\u00e9dure Stock\u00e9es est possible, utilisez-les. \nNe concat\u00e9nez *pas* les cha\u00eenes de caract\u00e8res dans les requ\u00eates des proc\u00e9dures stock\u00e9es, ou utilisez les fonctions 'exec', 'exec immediate' ou d'autre fonctions \u00e9quivalentes\!\nNe cr\u00e9ez pas des requ\u00eates SQL dynamiques par simples concat\u00e9nation de cha\u00eenes de caract\u00e8res.\n\u00c9chappez toutes les donn\u00e9es re\u00e7ues du client.\nAppliquez une 'liste blanche' des caract\u00e8res autoris\u00e9s, ou une 'liste noir' des caract\u00e8res interdits dans les entr\u00e9es de l'utilisateur.\nAppliquez le principe de moindre privil\u00e8ge en utilisant les privil\u00e8ges utilisateur minimaux sur la base de donn\u00e9e.\nEn particulier, \u00e9vitez l'utilisation des utilisateurs 'sa' ou 'db-owner'. Ceci n'\u00e9vite pas les injections SQL, mais minimise leur impact.\nAccordez les plus faibles droits d'acc\u00e8s aux bases de donn\u00e9es n\u00e9cessaires \u00e0 l'application.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=Valeur d''Origine\: [{0}]. Valeur Modifi\u00e9e\: [{1}]. Valeur de Contr\u00f4le\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=SGBDR [{0}] probable, compte tenu du message d''erreur trouv\u00e9 par l''expression r\u00e9guli\u00e8re [{1}] dans les r\u00e9sultats HTML.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e  dans le message d''erreur de la base de donn\u00e9e, message provoqu\u00e9 par la manipulation du param\u00e8tre
ascanrules.testsqlinjection.alert.unionbased.extrainfo=SGBDR [{0}] probable, compte tenu du message d''erreur sp\u00e9cifique \u00e0 l''UNION, trouv\u00e9 par l''expression r\u00e9guli\u00e8re [{1}] dans les r\u00e9sultats HTML.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e dans le message d''erreur provoqu\u00e9 par la manipulation du param\u00e8tre d''une clause SQL ''UNION''.
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=Les r\u00e9sultats de la page originale ont \u00e9t\u00e9 reproduits avec succ\u00e8s en utilisant l''expression [{0}] comme valeur du param\u00e8tre\nLa valeur du param\u00e8tre {1} en cours de modification est extraite de la sortie HTML \u00e0 fin de comparaison
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=Les r\u00e9sultats de la page originale ont \u00e9t\u00e9 reproduits avec succ\u00e8s en utilisant l''expression "ORDER BY" [{0}] comme valeur de param\u00e8tre\nLa valeur du param\u00e8tre {1} en cours de modification est extraite de la sortie HTML \u00e0 fin de comparaison
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], le message modifi\u00e9 donne le statut HTTP [{1}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], un corps d''une longueur [{1}], le message modifi\u00e9 donne le statut HTTP [{2}], un corps d''une longueur [{3}]. Un tiers (une injection non-SQL induisant une valeur) donne un statut HTTP [{4}], un corps d''une longueur [{5}]
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=Les r\u00e9sultats de la page ont \u00e9t\u00e9 manipul\u00e9s avec succ\u00e8s en utilisant les conditions bool\u00e9ennes [{0}] et [{1}]\nLa valeur du param\u00e8tre en cours de modification {2} est extraite de la sortie HTML \u00e0 fin de comparaison
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=La donn\u00e9e a \u00e9t\u00e9 retourn\u00e9e pour le param\u00e8tre d'origine.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre, ce qui a restreint avec succ\u00e8s les donn\u00e9es initialement retourn\u00e9es,
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=Les donn\u00e9es n'ont PAS \u00e9t\u00e9 retourn\u00e9es pour le param\u00e8tre d'origine.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre pour r\u00e9cup\u00e9rer avec succ\u00e8s plus de donn\u00e9es qu'initialement retourn\u00e9es,
ascanrules.testsqlinjection.alert.timebased.extrainfo=Le temps de la requ\u00eate est contr\u00f4lable \u00e0 l''aide de la valeur du param\u00e8tre [{0}], qui lui fait ainsi prendre [{1}] millisecondes, alors que la requ\u00eate d''origine, non modifi\u00e9e avec la valeur [{2}] prend, quant \u00e0 elle, [{3}] millisecondes 
ascanrules.testsqlinjection.authbypass.name=Injection SQL - Contournement de l'authentification
ascanrules.testsqlinjection.authbypass.desc=L'injection SQL peut \u00eatre possible sur une page de connexion, ce qui peut permettre de contourner le m\u00e9canisme d'authentification de l'application 

ascanrules.testexternalredirect.name=Redirection externe
ascanrules.testexternalredirect.reason.location.header=La r\u00e9ponse contient une redirection dans le champ d'en-t\u00eate Location, ce qui permet de d\u00e9finir une Url externe.
ascanrules.testexternalredirect.reason.location.meta=La r\u00e9ponse contient une redirection pour 'Location' dans sa balise meta http-equiv, ce qui permet de d\u00e9finir une Url externe.
ascanrules.testexternalredirect.reason.refresh.header=La r\u00e9ponse contient une redirection dans le champ d'en-t\u00eate Refresh, ce qui permet de d\u00e9finir une Url externe.
ascanrules.testexternalredirect.reason.refresh.meta=La r\u00e9ponse contient une redirection pour 'Refresh' dans sa balise meta http-equiv, ce qui permet de d\u00e9finir une Url externe.
ascanrules.testexternalredirect.reason.javascript=La r\u00e9ponse contient une redirection dans son code JavaScript, ce qui permet de d\u00e9finir une Url externe.
ascanrules.testexternalredirect.reason.notfound=Aucune raison trouv\u00e9e pour ceci...

ascanrules.codeinjectionplugin.name=Injection de Code c\u00f4t\u00e9 serveur
ascanrules.codeinjectionplugin.name.asp=Injection de Code c\u00f4t\u00e9 serveur - Injection de Code ASP
ascanrules.codeinjectionplugin.name.php=Injection de Code c\u00f4t\u00e9 serveur - Injection de Code PHP
ascanrules.codeinjectionplugin.desc=Une injection de code peut \u00eatre possible en incluant un code sur mesure qui sera \u00e9valu\u00e9 par le moteur de script
ascanrules.codeinjectionplugin.soln=Ne vous fiez pas aux entr\u00e9es du client, m\u00eame si une validation est en place c\u00f4t\u00e9 client. \nEn g\u00e9n\u00e9ral, v\u00e9rifier le type de toutes les donn\u00e9es du c\u00f4t\u00e9 serveur et \u00e9chapper toutes les donn\u00e9es re\u00e7ues du client.  \u00c9vitez d'utiliser des fonctions eval() combin\u00e9es avec des donn\u00e9es d'entr\u00e9e de l'utilisateur.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html\nhttps\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection')

ascanrules.testdirectorybrowsing.name=R\u00e9pertoire de navigation
ascanrules.testdirectorybrowsing.desc=Il est possible d'afficher la liste de r\u00e9pertoires.  Cette liste peut r\u00e9v\u00e9ler des scripts cach\u00e9s, des fichiers d'inclusion, des sauvegardes de fichiers source etc. pouvant donner acc\u00e8s \u00e0 des informations sensibles.
ascanrules.testdirectorybrowsing.soln=D\u00e9sactiver la navigation dans les r\u00e9pertoires.  Si la navigation est malgr\u00e9 tout n\u00e9cessaire, assurez-vous que les fichiers r\u00e9pertori\u00e9s n'induisent pas de risques.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\nhttp\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html\n

ascanrules.testinjectioncrlf.name=Injection CRLF
ascanrules.testinjectioncrlf.desc=Le cookie peut \u00eatre renseign\u00e9 par injection CRLF.  Il serait \u00e9galement possible de renseigner des en-t\u00eates de r\u00e9ponse HTTP arbitraires. En outre, la possible manipulation de la r\u00e9ponse \u00e0 l'aide de script intersite peut faire appara\u00eetre une vuln\u00e9rabilit\u00e9 par empoisonnement de cache.
ascanrules.testinjectioncrlf.soln=V\u00e9rifiez soigneusement le  type du param\u00e8tre soumis.  Ne laissez pas passer un CRLF en filtrant les CRLF.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\nhttp\://webappfirewall.com/lib/crlf-injection.txtnull\nhttp\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=Falsification de param\u00e8tre
ascanrules.testparametertamper.desc=La manipulation des param\u00e8tres a provoqu\u00e9 une page d'erreur ou l'affichage d'une trace d'appel Java. Ceci indique un d\u00e9faut de gestion des exceptions et ouvre des potentialit\u00e9s pour d'autres exploits.
ascanrules.testparametertamper.soln=Identifiez la cause de l'erreur et corrigez-la.  Ne pas faite confiance aux entr\u00e9es c\u00f4t\u00e9 client et appliquez un contr\u00f4le serr\u00e9 du c\u00f4t\u00e9 serveur.  En outre, interceptez proprement les exceptions.  Utilisez une page d'erreur g\u00e9n\u00e9rique 500 pour signaler les erreurs internes du serveur.

ascanrules.testpathtraversal.name=Travers\u00e9e de chemin

ascanrules.testremotefileinclude.name=Inclusion de fichiers distants

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=Certains param\u00e8tres peuvent conduire \u00e0 ex\u00e9cuter des commandes Server Side Include. Cela peut permettre la connexion \u00e0 des bases de donn\u00e9es ou l'ex\u00e9cution de code arbitraire.
ascanrules.testserversideinclude.soln=Ne pas faite confiance aux entr\u00e9es c\u00f4t\u00e9 client et appliquez un contr\u00f4le serr\u00e9 du c\u00f4t\u00e9 serveur.  D\u00e9sactivez la fonction Server Side Include. \n
Refer=Vers la manuel pour d\u00e9sactiver la fonction Server Side Include.\n\nUtilisez les moindres privil\u00e8ges pour ex\u00e9cuter le serveur web ou applicatif.\n\nPour Apache, d\u00e9sactivez ce qui suit\:\n\nOptions Indexes FollowSymLinks Includes\n\nAddType application/x-httpd-cgi .cgi\n\nAddType text/x-server-parsed-html .html
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

