#X-Generator: crowdin.com
# ascanalphaAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=Aktif Tarama Kurallar\u0131 - alfa

ascanalpha.examplefile.name=Bir dosyadan veri y\u00fckler bir \u00f6rnek aktif tarama kural\u0131
ascanalpha.examplefile.desc=Burada g\u00fcvenlik a\u00e7\u0131\u011f\u0131 hakk\u0131nda daha fazla bilgi ekle
ascanalpha.examplefile.other=Bu, di\u011fer b\u00f6l\u00fcmlerin herhangi bir uygun does not bilgi i\u00e7indir
ascanalpha.examplefile.soln=Sorunu \u00e7\u00f6zmek i\u00e7in nas\u0131l genel bir a\u00e7\u0131klama
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.sourcecodedisclosure.desc=Ge\u00e7erli sayfan\u0131n kaynak kodu web sunucusu taraf\u0131ndan if\u015fa edildi
ascanalpha.sourcecodedisclosure.lfibased.name=Kaynak Kod A\u00e7\u0131klama - Dosya Eklenmesi
ascanalpha.sourcecodedisclosure.lfibased.soln=Kullan\u0131c\u0131 taraf\u0131ndan belirtilen keyfi dosyalar\u0131 \u00e7\u0131kt\u0131 dahil edilmez emin olun
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=Kaynak kodu dosya i\u00e7in \u00e7\u0131k\u0131\u015f [ {0} ] rastgele parametrenin bundan yeterince farkl\u0131d\u0131r [ {1} ], en [ {2} %], [bir e\u015fik ile kar\u015f\u0131la\u015ft\u0131r\u0131ld\u0131\u011f\u0131nda {3} %]
ascanalpha.sourcecodedisclosure.lfibased.evidence=

ascanalpha.sourcecodedisclosure.gitbased.name=Kaynak Kod A\u00e7\u0131klama - Git 
ascanalpha.sourcecodedisclosure.gitbased.soln=Git meta dosyalar\u0131 web sunucusu veya uygulama sunucusu da\u011f\u0131t\u0131lm\u0131\u015f oldu\u011fundan emin olun
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=
ascanalpha.sourcecodedisclosure.gitbased.evidence=[kaynak kodu {0} kullanarak] ekstre edildi [ {1} ]

ascanalpha.elinjection.name=\u0130fade Dil Enjeksiyon
ascanalpha.elinjection.desc=Yaz\u0131l\u0131m, bir \u00fcst bile\u015fenden d\u0131\u015far\u0131dan etkilenmi\u015f giri\u015fini kullanarak Java Server Page (JSP) bir ifade dili (EL) deyimi tamam\u0131n\u0131 veya bir k\u0131sm\u0131n\u0131 olu\u015fturur, ancak n\u00f6tralize veya yanl\u0131\u015f \u00f6nce ama\u00e7lanan EL deyimi de\u011fi\u015ftirebilir \u00f6zel unsurlar\u0131 n\u00f6tralize de\u011fil Bu y\u00fcr\u00fct\u00fcl\u00fcr. Bahar 3.0.5 belirli s\u00fcr\u00fcmlerinde ve \u00f6nceki etkin EL enjeksiyona herhangi bir uygulama maruz \u0130fade Dil etiketleri iki kez de\u011ferlendirilecek hangi bir g\u00fcvenlik a\u00e7\u0131\u011f\u0131 (CVE-2011-2730) vard\u0131. Ancak, hatta daha sonraki s\u00fcr\u00fcmleri i\u00e7in, bu zay\u0131fl\u0131k konfig\u00fcrasyonuna ba\u011fl\u0131 hala m\u00fcmk\u00fcnd\u00fcr.
ascanalpha.elinjection.soln=G\u00fcvenilmeyen girdi kar\u015f\u0131 veri do\u011frulama en iyi uygulamalar\u0131 ger\u00e7ekle\u015ftirmek ve hi\u00e7bir meta de\u011ferlendirilmesinden \u00f6nce kullan\u0131c\u0131 i\u00e7eri\u011finde terc\u00fcman taraf\u0131ndan bulunan, b\u00f6ylece veriler, EL katmanda geldi\u011finde o \u00e7\u0131k\u0131\u015f kodlama uygulan\u0131r sa\u011flamak. alg\u0131lamak i\u00e7in en belirgin desenler $ {ve \# {i\u00e7erir, ancak kodlamak veya bu verileri par\u00e7alara m\u00fcmk\u00fcn olabilir.
ascanalpha.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection http\://cwe.mitre.org/data/definitions/917.html

ascanalpha.cookieslack.name=\u00c7erez Gev\u015fek Dedekt\u00f6r
ascanalpha.cookieslack.desc=Tekrarlanan GET istekleri\: oturumu stabilize \u00f6zg\u00fcn taban GET kar\u015f\u0131 cevaplar\u0131 kar\u015f\u0131la\u015ft\u0131rmak i\u00e7in t\u00fcm \u00e7erezleri normal istek ard\u0131ndan, her seferinde farkl\u0131 bir \u00e7erez b\u0131rak\u0131n. Bu \u00e7erez tabanl\u0131 kimlik do\u011frulama / nitelikleri asl\u0131nda zorunlu olmayan alanlar\u0131 ortaya \u00e7\u0131karabilir.
ascanalpha.cookieslack.solution=Na
ascanalpha.cookieslack.otherinfo.intro=Uygulama mant\u0131\u011f\u0131 kusurlar\u0131n\u0131 ortaya \u00e7\u0131karabilir etkileri beklenen yoktur \u00c7erezler. \u00c7erez belirteci (ler) \u00fczerinden kimlik asl\u0131nda zorlanmaz nerede k\u00f6t\u00fc durumda, bu ortaya \u00e7\u0131karabilir.\n
ascanalpha.cookieslack.session.warning=NOT\: Ad\u0131ndan bu \u00e7erez \u00f6nemli olabilir, ancak g\u00f6r\u00fcn\u00fcr b\u0131rakarak hi\u00e7bir etkisi \u00c7\u00fcnk\u00fc\: [ {0} ] \n
ascanalpha.cookieslack.affect.response.yes=Bu \u00e7erezler yan\u0131t\u0131 etkilenen\: 
ascanalpha.cookieslack.affect.response.no=Bu \u00e7erezler yan\u0131t\u0131 etkileyen ETMEM\u0130\u015eT\u0130R\: 
ascanalpha.cookieslack.session.destroyed=Bu \u00e7erezi Damlama oturumu ge\u00e7ersiz gibi g\u00f6r\u00fcn\u00fcyor\: [ {0} ] t\u00fcm orijinal tan\u0131mlama ile bir takip ile ilgili istek hala orijinal iste\u011fi farkl\u0131 bir tepki vard\u0131. \n
ascanalpha.cookieslack.separator=,
ascanalpha.cookieslack.endline=\n

ascanalpha.httpsashttpscanner.name=HTTP \u00fczerinden Mevcut HTTPS \u0130\u00e7eri\u011fi
ascanalpha.httpsashttpscanner.desc=Ba\u015flang\u0131\u00e7ta HTTPS \u00fczerinden eri\u015filen \u0130\u00e7erik (\u00f6rn\: SSL / TLS \u015fifreleme kullanarak) ayn\u0131 zamanda HTTP (\u015fifreleme olmadan) eri\u015filebilir. 
ascanalpha.httpsashttpscanner.soln=Vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, HTTPS \u00fczerinden sadece hizmet t\u00fcr i\u00e7erik i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun. HTTP S\u0131k\u0131 Ula\u015f\u0131m G\u00fcvenli\u011fi uygulama d\u00fc\u015f\u00fcn\u00fcn.
ascanalpha.httpsashttpscanner.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security https\://www.owasp.org/index.php/List_of_useful_HTTP_headers http\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security http\://caniuse.com / stricttransportsecurity http\://tools.ietf.org/html/rfc6797

ascanalpha.sqlinjection.sqlite.name=SQL Injection - SQLite
ascanalpha.sqlinjection.desc=SQL injection m\u00fcmk\u00fcn olabilir
ascanalpha.sqlinjection.soln=Yerinde istemci taraf\u0131nda do\u011frulama olsa bile, istemci taraf\u0131nda giri\u015fi g\u00fcvenmeyin.  \nGenel olarak, tip onay sunucu taraf\u0131nda t\u00fcm veriler. Uygulama JDBC kullan\u0131yorsa, ge\u00e7ti parametreleri ile PreparedStatement veya CallableStatement kullanmak '?' Uygulama ASP kullan\u0131yorsa, ADO Command g\u00fc\u00e7l\u00fc tip kontrol ve parametreli sorgu ile Objects kullan\u0131n. Veritaban\u0131 Stored Procedures kullan\u0131labilir, bunlar\u0131 kullan\u0131n. Do * de\u011fil * birle\u015ftirdi\u011finiz sakl\u0131 yordam sorgular\u0131 i\u00e7ine dizeleri veya 'exec' exec hemen 'veya e\u015fde\u011fer i\u015flevini kullanmak\! Basit dize birle\u015ftirme kullanarak dinamik SQL sorgular\u0131 olu\u015fturmak etmeyin. Istemciden al\u0131nan t\u00fcm verileri ka\u00e7\u0131\u015f. Izin verilen karakter bir 'beyaz liste' ya da kullan\u0131c\u0131 giri\u015fi izin verilmeyen bir karakter 'kara liste' Uygula. M\u00fcmk\u00fcn olan en az ayr\u0131cal\u0131kl\u0131 veritaban\u0131 kullan\u0131c\u0131 kullanarak en az ayr\u0131cal\u0131k ayr\u0131cal\u0131k uygulay\u0131n. \u00d6zellikle, 'sa' veya 'db sahibi' veritaban\u0131 kullan\u0131c\u0131lar\u0131 kullanmaktan ka\u00e7\u0131n\u0131n. Bu SQL enjeksiyon ortadan kald\u0131rmak, ancak etkisini en aza indirir de\u011fildir. Uygulama i\u00e7in gerekli olan asgari veritaban\u0131 eri\u015fimi verin.
ascanalpha.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.sqlite.alert.timebased.extrainfo=Sorgu s\u00fcresi parametre de\u011ferini kullanarak kontrol edilebilir [ {0} ], istek [almaya neden olan {1} ] milisaniye, parametre de\u011feri [ {2} ], neden olan istek almaya [ {3} ] milisaniye zaman de\u011feri ile orijinal de\u011fi\u015ftirilmemi\u015f sorgusu [ {4} ] [ald\u0131 {5} ] milisaniye.
ascanalpha.sqlinjection.sqlite.alert.errorbased.extrainfo=a\u015fa\u011f\u0131daki bilinen SQLite hata iletisi provoke edildi\: [ {0} ].
ascanalpha.sqlinjection.sqlite.alert.versionnumber.extrainfo=Bir UNION tabanl\u0131 SQL Injection sald\u0131r\u0131s\u0131 kullanarak ve SQLite''n\u0131n dinamik yazarak mekanizmas\u0131n\u0131 s\u00f6m\u00fcrerek, SQLite s\u00fcr\u00fcm\u00fc belirlendi olmak [ {0} ]. Dize tabanl\u0131 enjeksiyon noktalar\u0131 ile tam SQLite s\u00fcr\u00fcm bilgileri elde edilebilir, ancak say\u0131sal enjeksiyon noktalar\u0131 ile, sadece k\u0131smi SQLite s\u00fcr\u00fcm bilgileri elde edilebilir. [SQLite s\u00fcr\u00fcm\u00fc hakk\u0131nda daha fazla bilgi {0} ] http\://www.sqlite.org/changes.html mevcuttur

ascanalpha.proxydisclosure.name=Vekil Bilgilendirme
ascanalpha.proxydisclosure.desc={0} proxy sunucusu (ler) tespit veya parmak izleri bulundu. Bu bilgiler belirlemek i\u00e7in potansiyel bir sald\u0131rgan\u0131n yard\u0131mc\u0131 hedeflerin bir listesi uygulamas\u0131 kar\u015f\u0131 bir sald\u0131r\u0131 i\u00e7in -.\n - Potansiyel g\u00fcvenlik a\u00e7\u0131klar\u0131 uygulamay\u0131 hizmet proxy sunucular\u0131 \u00fczerinde.\n - Uygulama kar\u015f\u0131 sald\u0131r\u0131lar\u0131 neden olabilecek proxy tabanl\u0131 bile\u015fenlerin varl\u0131\u011f\u0131 veya yoklu\u011fu tespit \u00f6nlenebilir veya hafifletilebilir i\u00e7in. \n    
ascanalpha.proxydisclosure.soln=Proxy sunucular\u0131 \u00fczerinde '\u0130ZLEME' y\u00f6ntemi yan\u0131 s\u0131ra k\u00f6kenli web / uygulama sunucusu devre d\u0131\u015f\u0131 b\u0131rak\u0131n. Bu t\u00fcr 'CORS' (\u00c7apraz K\u00f6keni Kaynak Payla\u015f\u0131m\u0131) gibi di\u011fer ama\u00e7lar i\u00e7in gerekli de\u011filse, proxy sunucular \u00fczerinde 'OPTIONS' y\u00f6ntemi yan\u0131 s\u0131ra k\u00f6kenli web / uygulama sunucusu devre d\u0131\u015f\u0131 b\u0131rak\u0131n. \u00d6nlemek i\u00e7in, \u00f6zel hata sayfalar\u0131 ile web ve uygulama sunucular\u0131 yap\u0131land\u0131rmak 'fingerprintable' \u00fcr\u00fcne \u00f6zel hata sayfalar\u0131 gibi varolmayan sayfalar i\u00e7in 'TRACK' istekleri gibi, HTTP hatalar\u0131 durumunda kullan\u0131c\u0131ya s\u0131zd\u0131r\u0131lm\u0131\u015f olmas\u0131. 'Sunucu' ve 'X-Powered-By' HTTP yan\u0131t ba\u015fl\u0131klar\u0131 teknoloji ve s\u00fcr\u00fcm bilgilerin a\u00e7\u0131klanmas\u0131n\u0131 \u00f6nlemek i\u00e7in t\u00fcm vekiller, uygulama sunucular\u0131 ve web sunucular\u0131 yap\u0131land\u0131r\u0131n.\n
ascanalpha.proxydisclosure.refs=???
ascanalpha.proxydisclosure.attack='Max-Forvetler' ba\u015fl\u0131\u011f\u0131 ile TRACE, OPTIONS y\u00f6ntemleri. PAR\u00c7A y\u00f6ntemi.
ascanalpha.proxydisclosure.extrainfo.unknown=Bilinmeyen
ascanalpha.proxydisclosure.extrainfo.proxyserver.header=TRACE OPS\u0130YON ve \u0130Z y\u00f6ntemleri kullanarak a\u015fa\u011f\u0131daki proxy sunucular\u0131n\u0131 OWASP ZAP ve uygulama / web sunucusu aras\u0131nda tespit edilmi\u015ftir\: 
ascanalpha.proxydisclosure.extrainfo.proxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.webserver.header=a\u015fa\u011f\u0131daki web / uygulama sunucusu tespit edilmi\u015ftir\: 
ascanalpha.proxydisclosure.extrainfo.webserver=- {0}
ascanalpha.proxydisclosure.extrainfo.silentproxyserver.header=A\u015fa\u011f\u0131daki 'sessiz' vekil sunucular belirlenmi\u015ftir. Nedeniyle davran\u0131\u015f\u0131, bu proxy sunucular bulundu\u011fu a\u011f topolojisinde hangi noktada bilinmemektedir\:
ascanalpha.proxydisclosure.extrainfo.silentproxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.traceenabled='\u0130Z' y\u00f6ntemi proxy sunucular\u0131 bir veya daha fazla etkin veya men\u015fe sunucu \u00fczerinde oldu\u011funu. Bu y\u00f6ntem, kullan\u0131c\u0131 arac\u0131s\u0131 geri web taray\u0131c\u0131s\u0131 ve vekiller gelen sunulan t\u00fcm bilgileri s\u0131zd\u0131r\u0131yor. Bu 'Cross Site izleme' sald\u0131r\u0131lar\u0131 kolayla\u015ft\u0131rabilir. 

ascanalpha.relativepathconfusion.name=G\u00f6reli yolu Kar\u0131\u015f\u0131kl\u0131k
ascanalpha.relativepathconfusion.desc=Web sunucusu URL i\u00e7in do\u011fru "g\u00f6reli yolu" hakk\u0131nda kar\u0131\u015f\u0131kl\u0131\u011fa neden olabilecek bir \u015fekilde belirsiz URL'ler yan\u0131tlar\u0131 hizmet i\u00e7in yap\u0131land\u0131r\u0131ld\u0131. Kaynaklar (CSS, resimler, vs) da olduk\u00e7a mutlak URL'ler daha g\u00f6reli kullanarak sayfa yan\u0131t belirtilir. Web taray\u0131c\u0131s\u0131 bir m\u00fcsamahakar bir \u015fekilde "cross-content" yan\u0131t\u0131n\u0131 ayr\u0131\u015ft\u0131r\u0131r, ya e\u011fer bir sald\u0131r\u0131, bu t\u00fcr \u00e7er\u00e7eve gibi teknikler kullan\u0131larak, permissively "cross-content" yan\u0131t\u0131n\u0131 ayr\u0131\u015ft\u0131rma i\u00e7ine kand\u0131rd\u0131n olabilir, daha sonra web taray\u0131c\u0131 i\u00e7ine aptal olabilir Bir XSS a\u00e7\u0131\u011f\u0131 yol a\u00e7an, CSS (ya da di\u011fer i\u00e7erik t\u00fcrleri) olarak HTML yorumlamak.
ascanalpha.relativepathconfusion.soln=Web sunucular\u0131 ve \u00e7er\u00e7eveler gibi URL'lerin g\u00f6reli yol yanl\u0131\u015f yorumlanm\u0131\u015f istemci taraf\u0131nda veya sunucu taraf\u0131nda ya da \u00fczerinde bile\u015fenleri taraf\u0131ndan olabilir b\u00f6yle bir \u015fekilde belirsiz URL'ler yan\u0131tlar\u0131 de\u011fil hizmet i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f olmas\u0131 g\u00fcncelle\u015ftirilmesi gerekmektedir. Uygulama i\u00e7inde, "do\u011fru kullan\u0131m\u0131 <base> HTTP yan\u0131t "HTML etiketi a\u00e7\u0131k\u00e7a Belgedeki t\u00fcm g\u00f6reli URL'ler i\u00e7in temel URL belirleyecektir. Zor sald\u0131rgan yan\u0131t\u0131n\u0131n i\u00e7erik t\u00fcr\u00fcn\u00fc yanl\u0131\u015f yorumlamak web taray\u0131c\u0131s\u0131n\u0131 zorlamak i\u00e7in yapmak "Content-Type" HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131n\u0131 kullan\u0131n. "X-Content-Type-Se\u00e7enekler\: nosniff" kullan\u0131n HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131 yan\u0131t i\u00e7erik t\u00fcr\u00fc "koklama" dan web taray\u0131c\u0131s\u0131n\u0131 \u00f6nlemek i\u00e7in. Gibi modern bir DOCTYPE kullan\u0131n "<\! DOCTYPE html>" Bu web taray\u0131c\u0131s\u0131 taraf\u0131ndan g\u00f6z ard\u0131 ediliyor i\u00e7erik t\u00fcr\u00fc sonu\u00e7lan\u0131r, \u00e7\u00fcnk\u00fc "Quirks Mode" se\u00e7ene\u011fini kullanarak web taray\u0131c\u0131s\u0131nda i\u015flenmi\u015f sayfay\u0131 \u00f6nlemek i\u00e7in. \u00c7er\u00e7eveleme sald\u0131r\u0131lar\u0131 kullanarak web taray\u0131c\u0131n\u0131zda etkinle\u015ftirilmesine olmaktan Quirks Mode \u00f6nlemek i\u00e7in "X-Frame-Options" HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131n\u0131 belirtin. 
ascanalpha.relativepathconfusion.refs=http\://www.thespanner.co.uk/2014/03/21/rpo/\nhttps\://hsivonen.fi/doctype/\nhttp\://www.w3schools.com/tags/tag_base.asp
ascanalpha.relativepathconfusion.extrainfo.morethanonebasetag=Birden fazla <base> etiketi HTML belirtildi <head> ge\u00e7erli de\u011fil ki, g\u00f6reli URL'ler i\u00e7in konumunu tan\u0131mlamak i\u00e7in etiket.
ascanalpha.relativepathconfusion.extrainfo.nobasetag=Hay\u0131r <base> etiketi HTML belirtildi <head> g\u00f6reli URL'ler i\u00e7in konumunu tan\u0131mlamak i\u00e7in etiket.
ascanalpha.relativepathconfusion.extrainfo.contenttypeenabled=A \u0130\u00e7erik T\u00fcr\u00fc " {0} "belirtildi. Web taray\u0131c\u0131s\u0131 s\u0131k\u0131 ayr\u0131\u015ft\u0131rma kurallar\u0131 istihdam ise, bu ba\u015far\u0131l\u0131 \u00e7apraz i\u00e7erik sald\u0131r\u0131lar\u0131 \u00f6nlemek olacakt\u0131r. Web taray\u0131c\u0131s\u0131nda Quirks modu s\u0131k\u0131 ayr\u0131\u015ft\u0131rma devre d\u0131\u015f\u0131 olacakt\u0131r.  
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly=Quirks modu a\u00e7\u0131k <meta http-e\u015fde\u011fer \= "\u00fczerinden etkindir {0} ", belirtilen i\u00e7erik t\u00fcr\u00fc bypass edilmesini sa\u011flayan.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly=Quirks modu dolayl\u0131 KAMU kimli\u011fi ile eski bir DOCTYPE kullan\u0131m\u0131 yoluyla etkindir " {0} ", belirtilen i\u00e7erik t\u00fcr\u00fc baz\u0131 web taray\u0131c\u0131lar\u0131nda bypass sa\u011flayan.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype=Quirks modu \u00f6rt\u00fck belirtilen \u0130\u00e7erik T\u00fcr\u00fc bypass sa\u011flayan bir DOCTYPE yoklu\u011funda yoluyla etkindir.
ascanalpha.relativepathconfusion.extrainfo.nocontenttype=Quirks modu web taray\u0131c\u0131s\u0131nda g\u00fcvenlik a\u00e7\u0131\u011f\u0131ndan yararlanabilmesi i\u00e7in gerekli de\u011fildir, b\u00f6ylece \u0130\u00e7erik Yok Tipi belirtildi. 
ascanalpha.relativepathconfusion.extrainfo.framingallowed=Hay\u0131r X-Frame-Options ba\u015fl\u0131\u011f\u0131 belirtilirken, bu y\u00fczden sayfa \u00e7er\u00e7eveli olabilir ve bu belirli \u0130\u00e7erik T\u00fcr\u00fc bypass sa\u011flayan, Quirks Modu'nu etkinle\u015ftirmek i\u00e7in kullan\u0131labilir.

