#X-Generator: crowdin.com
# ascanalphaAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=\u0938\u0915\u094d\u0930\u093f\u092f \u0938\u094d\u0915\u0948\u0928 \u0928\u093f\u092f\u092e - \u0905\u0932\u094d\u092b\u093e

ascanalpha.examplefile.name=\u090f\u0915 \u0909\u0926\u093e\u0939\u0930\u0923 \u0938\u0915\u094d\u0930\u093f\u092f \u0938\u094d\u0915\u0948\u0928 \u0928\u093f\u092f\u092e \u091c\u094b \u0921\u0947\u091f\u093e \u0915\u094b \u0915\u093f\u0938\u0940 \u092b\u093c\u093e\u0907\u0932 \u0938\u0947 \u0932\u094b\u0921 \u0915\u0930\u0924\u093e
ascanalpha.examplefile.desc=\u092f\u0939\u093e\u0901 \u0938\u0941\u0930\u0915\u094d\u0937\u093e\u091b\u093f\u0926\u094d\u0930 \u0915\u0947 \u092c\u093e\u0930\u0947 \u092e\u0947\u0902 \u0905\u0927\u093f\u0915 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u091c\u094b\u0921\u093c\u0947\u0902
ascanalpha.examplefile.other=\u092f\u0939 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0939\u0948 \u0915\u093f \u0915\u093f\u0938\u0940 \u092d\u0940 \u0905\u0928\u094d\u092f \u0905\u0928\u0941\u092d\u093e\u0917\u094b\u0902 \u092e\u0947\u0902 \u092b\u093c\u093f\u091f \u0928\u0939\u0940\u0902 \u0939\u094b\u0924\u093e \u0915\u0947 \u0932\u093f\u090f \u0939\u0948
ascanalpha.examplefile.soln=\u0915\u0948\u0938\u0947 \u0907\u0938 \u0938\u092e\u0938\u094d\u092f\u093e \u0915\u094b \u0939\u0932 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u090f\u0915 \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u0935\u0930\u094d\u0923\u0928
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.sourcecodedisclosure.desc=\u0935\u0930\u094d\u0924\u092e\u093e\u0928 \u092a\u0943\u0937\u094d\u0920 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u092c\u0924\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e
ascanalpha.sourcecodedisclosure.lfibased.name=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - \u092b\u093c\u093e\u0907\u0932 \u0938\u092e\u093e\u0935\u0947\u0936
ascanalpha.sourcecodedisclosure.lfibased.soln=\u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u092e\u0928\u092e\u093e\u0928\u0947 \u0922\u0902\u0917 \u0938\u0947 \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0906\u0909\u091f\u092a\u0941\u091f \u092e\u0947\u0902 \u0936\u093e\u092e\u093f\u0932 \u0928\u0939\u0940\u0902 \u0939\u0948\u0902
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092b\u093c\u093e\u0907\u0932 \u0928\u093e\u092e [{0}] \u0915\u0947 \u0932\u093f\u090f \u0906\u0909\u091f\u092a\u0941\u091f \u092a\u0930\u094d\u092f\u093e\u092a\u094d\u0924 \u0930\u0942\u092a \u0938\u0947 \u0905\u0932\u0917 \u0939\u0948 \u0915\u093f [{3}%] \u0915\u0940 \u090f\u0915 \u0938\u0940\u092e\u093e \u0915\u0947 \u0932\u093f\u090f \u0915\u0940 \u0924\u0941\u0932\u0928\u093e \u092e\u0947\u0902 \u092f\u093e\u0926\u0943\u091a\u094d\u091b\u093f\u0915 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u093e [{1}], [{2}%], \u0938\u0947
ascanalpha.sourcecodedisclosure.lfibased.evidence=

ascanalpha.sourcecodedisclosure.gitbased.name=\u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 - Git 
ascanalpha.sourcecodedisclosure.gitbased.soln=\u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f Git \u092e\u0947\u091f\u093e\u0921\u0947\u091f\u093e \u092b\u093c\u093e\u0907\u0932\u0947\u0902 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u092f\u093e \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0932\u093f\u090f \u0924\u0948\u0928\u093e\u0924 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=
ascanalpha.sourcecodedisclosure.gitbased.evidence=[{0}] \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0930\u094b\u0924 \u0915\u094b\u0921 [{1}] \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0928\u093f\u0915\u093e\u0932\u093e \u0917\u092f\u093e \u0925\u093e

ascanalpha.elinjection.name=\u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928
ascanalpha.elinjection.desc=\u0938\u0949\u092b\u094d\u091f\u0935\u0947\u092f\u0930 constructs \u0938\u092d\u0940 \u092f\u093e \u090f\u0915 \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e (EL) \u0915\u0925\u0928 \u092e\u0947\u0902 \u090f\u0915 \u091c\u093e\u0935\u093e \u0938\u0930\u094d\u0935\u0930 \u092a\u0947\u091c (\u092c\u093e\u0939\u094d\u092f \u0930\u0942\u092a \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924 \u0907\u0928\u092a\u0941\u091f \u0938\u0947 \u090f\u0915 \u0905\u092a\u0938\u094d\u091f\u094d\u0930\u0940\u092e \u0918\u091f\u0915 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 JSP) \u0915\u093e \u0939\u093f\u0938\u094d\u0938\u093e \u0939\u0948, \u0932\u0947\u0915\u093f\u0928 \u092f\u0939 \u092c\u0947\u0905\u0938\u0930 \u0928\u0939\u0940\u0902 \u0939\u0948 \u092f\u093e \u0917\u093c\u0932\u0924 \u0922\u0902\u0917 \u0938\u0947 neutralizes \u0935\u093f\u0936\u0947\u0937 \u0924\u0924\u094d\u0935\u094b\u0902 \u0939\u0948 \u0915\u093f \u0905\u092d\u0940\u0937\u094d\u091f EL \u0915\u0925\u0928 \u0915\u094b \u0938\u0902\u0936\u094b\u0927\u093f\u0924 \u0938\u0915\u0924\u093e \u0939\u0948 \u0907\u0938\u0938\u0947 \u092a\u0939\u0932\u0947 \u0915\u093f \u092f\u0939 \u092e\u093e\u0930 \u0921\u093e\u0932\u093e \u0939\u0948\u0964 \u0935\u0938\u0902\u0924 3.0.5 \u0915\u0947 \u0915\u0941\u091b \u0938\u0902\u0938\u094d\u0915\u0930\u0923\u094b\u0902 \u092e\u0947\u0902 \u0914\u0930 \u092a\u0939\u0932\u0947, \u091c\u094b \u092a\u094d\u0930\u092d\u093e\u0935\u0940 \u0930\u0942\u092a \u0938\u0947 \u090f\u0932 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u093f\u0938\u0940 \u092d\u0940 \u0906\u0935\u0947\u0926\u0928 \u0915\u094b \u0909\u091c\u093e\u0917\u0930 \u091c\u094b \u0905\u092d\u093f\u0935\u094d\u092f\u0915\u094d\u0924\u093f \u092d\u093e\u0937\u093e \u092e\u0947\u0902 \u091f\u0948\u0917 \u0939\u094b\u0924\u093e \u091c\u093e \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u093f\u0924 \u0915\u093f\u092f\u093e \u0926\u094b \u092c\u093e\u0930, \u090f\u0915 \u092d\u0947\u0926\u094d\u092f\u0924\u093e (CVE-2011-2730) \u0925\u0940\u0964 \u0939\u093e\u0932\u093e\u0902\u0915\u093f, \u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u092c\u093e\u0926 \u0915\u0947 \u0938\u0902\u0938\u094d\u0915\u0930\u0923\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f, \u0907\u0938 \u0915\u092e\u091c\u094b\u0930\u0940 \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930\u0947\u0936\u0928 \u0915\u0947 \u0906\u0927\u093e\u0930 \u092a\u0930 \u0905\u092d\u0940 \u092d\u0940 \u0938\u0902\u092d\u0935 \u0939\u0948\u0964
ascanalpha.elinjection.soln=\u092a\u094d\u0930\u0926\u0930\u094d\u0936\u0928 \u0921\u0947\u091f\u093e \u092e\u093e\u0928\u094d\u092f\u0924\u093e \u091c\u092c EL \u092a\u0930\u0924 \u092a\u0930, \u0921\u0947\u091f\u093e \u0906\u0924\u093e \u0939\u0948 \u0907\u0924\u0928\u093e \u0939\u0948 \u0915\u093f \u0915\u094b\u0908 metacharacter \u092e\u0942\u0932\u094d\u092f\u093e\u0902\u0915\u0928 \u0938\u0947 \u092a\u0939\u0932\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0915\u0947 \u092d\u0940\u0924\u0930 \u0935\u094d\u092f\u093e\u0916\u094d\u092f\u093e\u0924\u093e \u0926\u094d\u0935\u093e\u0930\u093e \u092a\u093e\u092f\u093e \u0939\u0948 \u0938\u092c\u0938\u0947 \u0905\u091a\u094d\u091b\u093e \u0905\u092d\u094d\u092f\u093e\u0938 \u0915\u0947 \u0916\u093f\u0932\u093e\u092b \u0905\u0935\u093f\u0936\u094d\u0935\u0938\u094d\u0924 \u0907\u0928\u092a\u0941\u091f \u0914\u0930 \u0906\u0909\u091f\u092a\u0941\u091f \u0909\u0938 \u090f\u0928\u094d\u0915\u094b\u0921\u093f\u0902\u0917 \u0915\u094b \u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0932\u093e\u0917\u0942 \u0915\u093f\u092f\u093e \u091c\u093e\u0924\u093e \u0939\u0948\u0964 \u0938\u092c\u0938\u0947 \u0938\u094d\u092a\u0937\u094d\u091f \u092a\u0948\u091f\u0930\u094d\u0928 \u0915\u093e \u092a\u0924\u093e \u0932\u0917\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f $ \u092e\u0947\u0902 \u0936\u093e\u092e\u093f\u0932 \u0939\u0948\u0902 {\u0914\u0930 \#{, \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0947 \u0938\u093e\u0902\u0915\u0947\u0924\u093f\u0915 \u0936\u092c\u094d\u0926\u094b\u0902 \u092e\u0947\u0902 \u092c\u0926\u0932\u0928\u093e \u092f\u093e \u0907\u0938 \u0921\u0947\u091f\u093e \u091f\u0941\u0915\u0921\u093c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanalpha.elinjection.refs=' http\://cwe.mitre.org/data/definitions/917.html https\://www.owasp.org/index.php/Expression_Language_Injection

ascanalpha.cookieslack.name=\u0915\u0941\u0915\u0940 \u0928\u093f\u0930\u094d\u092c\u0932 \u0935\u0947\u0915\u094d\u0937\u0915
ascanalpha.cookieslack.desc=\u0926\u094b\u0939\u0930\u093e\u092f\u093e \u0905\u0928\u0941\u0930\u094b\u0927\u094b\u0902\: \u0939\u0930 \u092c\u093e\u0930, \u090f\u0915 \u0905\u0932\u0917 \u0915\u0941\u0915\u0940 \u0921\u094d\u0930\u0949\u092a \u0938\u0924\u094d\u0930 \u0915\u094b \u0938\u094d\u0925\u093f\u0930 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u092e\u0942\u0932 \u0906\u0927\u093e\u0930\u092d\u0942\u0924 \u092a\u093e\u0928\u0947 \u0915\u0947 \u0916\u093f\u0932\u093e\u092b \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e\u0913\u0902 \u0915\u0940 \u0924\u0941\u0932\u0928\u093e \u0938\u092d\u0940 \u0915\u0941\u0915\u0940\u091c\u093c \u0915\u0947 \u0938\u093e\u0925 \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u0905\u0928\u0941\u0930\u094b\u0927 \u0926\u094d\u0935\u093e\u0930\u093e \u092a\u0940\u091b\u093e \u0915\u093f\u092f\u093e\u0964 \u092f\u0939 \u0915\u094d\u0937\u0947\u0924\u094d\u0930\u094b\u0902 \u091c\u0939\u093e\u0902 \u0915\u0941\u0915\u0940 \u0906\u0927\u093e\u0930\u093f\u0924 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923/\u0935\u093f\u0936\u0947\u0937\u0924\u093e\u090f\u0901 \u0935\u093e\u0938\u094d\u0924\u0935 \u092e\u0947\u0902 \u0932\u093e\u0917\u0942 \u0928\u0939\u0940\u0902 \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902 \u092a\u094d\u0930\u0915\u091f \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964
ascanalpha.cookieslack.solution=N.a.
ascanalpha.cookieslack.otherinfo.intro=\u0915\u0941\u0915\u0940\u091c\u093c \u0939\u0948 \u0915\u093f \u0905\u092a\u0947\u0915\u094d\u0937\u093f\u0924 \u092a\u094d\u0930\u092d\u093e\u0935 \u0928\u0939\u0940\u0902 \u0939\u0948 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0924\u0930\u094d\u0915 \u092e\u0947\u0902 \u0916\u093e\u092e\u093f\u092f\u093e\u0902 \u092a\u094d\u0930\u0915\u091f \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964 \u0938\u092c\u0938\u0947 \u0916\u0930\u093e\u092c \u0938\u094d\u0925\u093f\u0924\u093f \u092e\u0947\u0902, \u092f\u0939 \u092a\u094d\u0930\u0915\u091f \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902 \u091c\u0939\u093e\u0901 \u092a\u094d\u0930\u092e\u093e\u0923\u0940\u0915\u0930\u0923 \u0915\u0941\u0915\u0940 token(s) \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0935\u093e\u0938\u094d\u0924\u0935 \u092e\u0947\u0902 \u0932\u093e\u0917\u0942 \u0928\u0939\u0940\u0902 \u0939\u0948\u0964 \n
ascanalpha.cookieslack.session.warning=\u0928\u094b\u091f\: \u0915\u094d\u092f\u094b\u0902\u0915\u093f \u0907\u0938\u0915\u093e \u0928\u093e\u092e \u0907\u0938 \u0915\u0941\u0915\u0940 \u092e\u0939\u0924\u094d\u0935\u092a\u0942\u0930\u094d\u0923 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0947 \u091b\u094b\u0921\u093c\u0928\u0947 \u0915\u094b \u0915\u094b\u0908 \u092a\u094d\u0930\u092d\u093e\u0935 \u0928\u0939\u0940\u0902 \u0926\u093f\u0916\u093e\u0908 \u0926\u0947\u0924\u093e \u0939\u0948\: [{0}]
ascanalpha.cookieslack.affect.response.yes=\u0907\u0928 \u0915\u0941\u0915\u0940\u091c\u093c \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924\: 
ascanalpha.cookieslack.affect.response.no=\u0907\u0928 \u0915\u0941\u0915\u0940\u091c\u093c \u0915\u0940 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u0915\u094b \u092a\u094d\u0930\u092d\u093e\u0935\u093f\u0924 \u0928\u0939\u0940\u0902 \u0915\u093f\u092f\u093e \u0925\u093e\: 
ascanalpha.cookieslack.session.destroyed=\u091b\u094b\u0921\u093c\u0928\u0947 \u0915\u0947 \u0907\u0938 \u0915\u0941\u0915\u0940 \u0938\u0924\u094d\u0930 invalidated \u0939\u0948 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u092a\u094d\u0930\u0915\u091f \u0939\u094b\u0924\u093e \u0939\u0948\: [{0}] A \u092a\u0930 \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0947 \u0938\u093e\u0925 \u0938\u092d\u0940 \u092e\u0942\u0932 \u0915\u0941\u0915\u0940\u091c\u093c \u0905\u092d\u0940 \u092d\u0940 \u092e\u0942\u0932 \u0905\u0928\u0941\u0930\u094b\u0927 \u0938\u0947 \u090f\u0915 \u0905\u0932\u0917 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u0925\u0940\u0964
ascanalpha.cookieslack.separator=,
ascanalpha.cookieslack.endline=\ 

ascanalpha.httpsashttpscanner.name=HTTPS HTTP \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0909\u092a\u0932\u092c\u094d\u0927 \u0938\u093e\u092e\u0917\u094d\u0930\u0940
ascanalpha.httpsashttpscanner.desc=\u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u091c\u094b \u0936\u0941\u0930\u0942 \u092e\u0947\u0902 HTTPS \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u092a\u0939\u0941\u0901\u091a\u093e \u0925\u093e (\u092f\u093e\u0928\u0940\: SSL/TLS \u090f\u0928\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u0936\u0928 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947) \u092d\u0940 (\u090f\u0928\u094d\u0915\u094d\u0930\u093f\u092a\u094d\u0936\u0928 \u0915\u0947 \u092c\u093f\u0928\u093e) HTTP \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u092a\u0939\u0941\u0901\u091a\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0939\u0948\u0964 
ascanalpha.httpsashttpscanner.soln=\u0938\u0941\u0928\u093f\u0936\u094d\u091a\u093f\u0924 \u0915\u0930\u0947\u0902 \u0915\u093f \u0906\u092a\u0915\u0947 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930, \u0938\u0930\u094d\u0935\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917, \u0932\u094b\u0921 balancer, \u0906\u0926\u093f \u0915\u0947\u0935\u0932 HTTPS \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0910\u0938\u0940 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0915\u0940 \u0938\u0947\u0935\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964 HTTP \u0938\u094d\u091f\u094d\u0930\u093f\u0915\u094d\u091f \u091f\u094d\u0930\u093e\u0902\u0938\u092a\u094b\u0930\u094d\u091f \u0938\u0941\u0930\u0915\u094d\u0937\u093e \u0915\u094b \u0932\u093e\u0917\u0942 \u0915\u0930\u0928\u0947 \u092a\u0930 \u0935\u093f\u091a\u093e\u0930 \u0915\u0930\u0947\u0902\u0964
ascanalpha.httpsashttpscanner.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security https\://www.owasp.org/index.php/List_of_useful_HTTP_headers http\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security http\://caniuse.com/stricttransportsecurity http\://tools.ietf.org/html/rfc6797

ascanalpha.sqlinjection.sqlite.name=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 - SQLite
ascanalpha.sqlinjection.desc=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0938\u0902\u092d\u0935 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948\u0964
ascanalpha.sqlinjection.soln=\u092f\u0939\u093e\u0902 \u0924\u0915 \u0915\u093f \u0905\u0917\u0930 \u0935\u0939\u093e\u0901 \u0939\u0948 \u091c\u0917\u0939 \u092e\u0947\u0902 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0938\u0924\u094d\u092f\u093e\u092a\u0928 \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921 \u0907\u0928\u092a\u0941\u091f, \u092a\u0930 \u0935\u093f\u0936\u094d\u0935\u093e\u0938 \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0947\u0964   \u0938\u093e\u092e\u093e\u0928\u094d\u092f \u092e\u0947\u0902, \u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092a\u0930 \u0938\u092d\u0940 \u0921\u0947\u091f\u093e \u0915\u0940 \u091c\u093e\u0901\u091a \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f JDBC \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, PreparedStatement \u092f\u093e CallableStatement, \u092a\u093e\u0930\u093f\u0924 \u0915\u0930 \u0926\u093f\u092f\u093e \u0917\u092f\u093e \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u0915\u0947 \u0938\u093e\u0925 \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902 '?' \u092f\u0926\u093f ASP \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0924\u093e \u0939\u0948, \u092e\u091c\u092c\u0942\u0924 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u091c\u093e\u0901\u091a \u0914\u0930 \u0905\u0928\u094d\u092f \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u0915\u0947 \u0938\u093e\u0925 ADO \u0906\u0926\u0947\u0936 \u0911\u092c\u094d\u091c\u0947\u0915\u094d\u091f \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u092f\u0926\u093f \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f\u092f\u093e\u0901 \u0909\u092a\u092f\u094b\u0917 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u0909\u0928\u094d\u0939\u0947\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u0915\u0930 * \u0928 * \u0938\u0902\u0917\u094d\u0930\u0939\u0940\u0924 \u0915\u093e\u0930\u094d\u092f\u0935\u093f\u0927\u093f \u092e\u0947\u0902 \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092e\u0947\u0902 \u0924\u093e\u0930 \u091c\u094b\u0921\u093c\u0928\u093e, \u092f\u093e 'exec', '\u0924\u0924\u094d\u0915\u093e\u0932 exec' \u092f\u093e \u0938\u092e\u0924\u0941\u0932\u094d\u092f \u0915\u093e\u0930\u094d\u092f\u0915\u094d\u0937\u092e\u0924\u093e \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\! \u0938\u0930\u0932 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917 \u0915\u0921\u093c\u0940 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0921\u093e\u092f\u0928\u0947\u092e\u093f\u0915 SQL \u0915\u094d\u0935\u0947\u0930\u0940\u091c\u093c \u092c\u0928\u093e\u0928\u093e \u0928\u0939\u0940\u0902\u0964 \u0938\u092d\u0940 \u0917\u094d\u0930\u093e\u0939\u0915 \u0938\u0947 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u093e\u091f\u093e \u0938\u0947 \u092c\u091a\u0964 \u090f\u0915 '\u0936\u094d\u0935\u0947\u0924 \u0938\u0942\u091a\u0940', \u092f\u093e \u090f\u0915 '\u092c\u094d\u0932\u0948\u0915\u0932\u093f\u0938\u094d\u091f' \u0905\u0928\u0941\u092e\u0924\u093f \u0928\u0939\u0940\u0902 \u0935\u0930\u094d\u0923 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0907\u0928\u092a\u0941\u091f \u092e\u0947\u0902 \u0938\u094d\u0935\u0940\u0915\u0943\u0924 \u0935\u0930\u094d\u0923\u094b\u0902 \u0915\u0947 \u0932\u093e\u0917\u0942 \u0939\u094b\u0924\u0947 \u0939\u0948\u0902\u0964 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0915\u0947 \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u0938\u0947 \u0915\u092e \u0935\u093f\u0936\u0947\u0937\u093e\u0927\u093f\u0915\u093e\u0930 \u092a\u094d\u0930\u093e\u092a\u094d\u0924 \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u0902\u092d\u0935 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0915\u0947 \u0932\u093e\u0917\u0942 \u0915\u0930\u0947\u0902\u0964 \u0935\u093f\u0936\u0947\u0937 \u0930\u0942\u092a \u0938\u0947, '\u0938\u093e' \u092f\u093e 'db-\u0938\u094d\u0935\u093e\u092e\u0940' \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e\u0913\u0902 \u0915\u0947 \u0909\u092a\u092f\u094b\u0917 \u0938\u0947 \u092c\u091a\u0947\u0902\u0964 \u0907\u0938 SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u094b \u0916\u0924\u094d\u092e \u0928\u0939\u0940\u0902 \u0915\u0930\u0924\u0940 \u0939\u0948, \u0932\u0947\u0915\u093f\u0928 \u0907\u0938\u0915\u0947 \u092a\u094d\u0930\u092d\u093e\u0935 \u0915\u094b \u0915\u092e \u0915\u0930\u0924\u093e \u0939\u0948\u0964 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0932\u093f\u090f \u091c\u0930\u0942\u0930\u0940 \u0939\u0948 \u0915\u093f \u0915\u092e \u0938\u0947 \u0915\u092e \u0921\u0947\u091f\u093e\u092c\u0947\u0938 \u0924\u0915 \u092a\u0939\u0941\u0901\u091a \u092a\u094d\u0930\u0926\u093e\u0928 \u0915\u0930\u0924\u0947 \u0939\u0948\u0902\u0964
ascanalpha.sqlinjection.refs=' https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet https\://www.owasp.org/index.php/Top_10_2010-A1
ascanalpha.sqlinjection.sqlite.alert.timebased.extrainfo=\u0915\u094d\u0935\u0947\u0930\u0940 \u0938\u092e\u092f \u091a\u0932\u093e\u092f\u093e \u0939\u0941\u0906 \u0939\u0948 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 [{0}], \u091c\u094b [{1}] \u092e\u093f\u0938\u0947 \u0932\u0947 \u0932\u094b \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0947 \u0915\u093e\u0930\u0923, \u092a\u094d\u0930\u092f\u094b\u0917 \u092a\u0948\u0930\u093e\u092e\u0940\u091f\u0930 \u092e\u093e\u0928 [{2}], \u091c\u094b \u091c\u092c \u092e\u0942\u0932\u094d\u092f [{4}] \u0915\u0947 \u0938\u093e\u0925 \u0915\u094d\u0935\u0947\u0930\u0940 \u092e\u0942\u0932 unmodified [{3}] \u092e\u093f\u0938\u0947, \u0932\u0947 \u0932\u094b \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0947 \u0915\u093e\u0930\u0923 [{5}] \u092e\u093f\u0932\u0940\u0938\u0947\u0915\u0902\u0921 \u0932\u093f\u092f\u093e\u0964
ascanalpha.sqlinjection.sqlite.alert.errorbased.extrainfo=\u0928\u093f\u092e\u094d\u0928\u0932\u093f\u0916\u093f\u0924 SQLite \u0924\u094d\u0930\u0941\u091f\u093f \u0938\u0902\u0926\u0947\u0936 \u091c\u094d\u091e\u093e\u0924 \u0909\u0915\u0938\u093e\u092f\u093e \u0917\u092f\u093e \u0925\u093e\: [{0}]\u0964
ascanalpha.sqlinjection.sqlite.alert.versionnumber.extrainfo=SQL \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0939\u092e\u0932\u093e \u0906\u0927\u093e\u0930\u093f\u0924 \u090f\u0915 \u0938\u0902\u0918 \u0915\u093e \u0909\u092a\u092f\u094b\u0917, \u0914\u0930 SQLite \u0915\u0947 \u0917\u0924\u093f\u0936\u0940\u0932 \u091f\u093e\u0907\u092a\u093f\u0902\u0917 \u0924\u0902\u0924\u094d\u0930 \u0915\u093e \u0936\u094b\u0937\u0923 \u0915\u0930\u0915\u0947, SQLite \u0938\u0902\u0938\u094d\u0915\u0930\u0923 [{0}] \u0939\u094b\u0928\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u093f\u0924 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u0938\u094d\u091f\u094d\u0930\u093f\u0902\u0917-\u0906\u0927\u093e\u0930\u093f\u0924 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0915\u0939\u0924\u0947 \u0939\u0948\u0902, \u0915\u0947 \u0938\u093e\u0925 \u092a\u0942\u0930\u094d\u0923 SQLite \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0928\u093f\u0915\u093e\u0932\u0947 \u091c\u093e \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u0932\u0947\u0915\u093f\u0928 \u0938\u0902\u0916\u094d\u092f\u093e\u0924\u094d\u092e\u0915 \u0907\u0902\u091c\u0947\u0915\u094d\u0936\u0928 \u0905\u0902\u0915\u094b\u0902 \u0915\u0947 \u0938\u093e\u0925, \u0915\u0947\u0935\u0932 \u0906\u0902\u0936\u093f\u0915 SQLite \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0928\u093f\u0915\u093e\u0932\u093e \u091c\u093e \u0938\u0915\u0924\u093e\u0964 SQLite \u0938\u0902\u0938\u094d\u0915\u0930\u0923 [{0}] \u092a\u0930 \u0905\u0927\u093f\u0915 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u092a\u0930, http\://www.sqlite.org/changes.html \u0909\u092a\u0932\u092c\u094d\u0927 \u0939\u0948

ascanalpha.proxydisclosure.name=\u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923
ascanalpha.proxydisclosure.desc={0} \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930 (s) \u0915\u093e \u092a\u0924\u093e \u092f\u093e \u0909\u0902\u0917\u0932\u093f\u092f\u094b\u0902 \u0915\u0947 \u0928\u093f\u0936\u093e\u0928 \u0925\u0947\u0964 \u0907\u0938 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0915\u094b \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f - \u0906\u0935\u0947\u0926\u0928 \u0915\u0947 \u0916\u093f\u0932\u093e\u092b \u090f\u0915 \u0939\u092e\u0932\u0947 \u0915\u0947 \u0932\u093f\u090f \u0932\u0915\u094d\u0937\u094d\u092f\u094b\u0902 \u0915\u0940 \u090f\u0915 \u0938\u0942\u091a\u0940 \u090f\u0915 \u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0939\u092e\u0932\u093e\u0935\u0930 \u092e\u0947\u0902 \u092e\u0926\u0926 \u0915\u0930\u0924\u093e \u0939\u0948\u0964 -\u0938\u0902\u092d\u093e\u0935\u093f\u0924 \u0915\u092e\u091c\u094b\u0930\u093f\u092f\u094b\u0902 \u0915\u093f \u0938\u0947\u0935\u093e \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930\u094b\u0902 \u092a\u0930\u0964 -\u0915\u093f\u0938\u0940 \u092d\u0940 \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940-\u0906\u0927\u093e\u0930\u093f\u0924 \u0918\u091f\u0915 \u0939\u0948 \u0915\u093f \u092a\u093e\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f, \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u0916\u093f\u0932\u093e\u092b \u0939\u092e\u0932\u094b\u0902 \u0915\u093e \u0915\u093e\u0930\u0923 \u0939\u094b \u0938\u0915\u0924\u093e \u0939\u0948 \u0915\u0947 \u0905\u092d\u093e\u0935 \u092f\u093e \u0909\u092a\u0938\u094d\u0925\u093f\u0924\u093f \u0915\u094b \u0930\u094b\u0915\u093e, \u092f\u093e \u0936\u092e\u0928\u0964
ascanalpha.proxydisclosure.soln=\u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930, \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0905\u091a\u094d\u091b\u0940 \u0924\u0930\u0939 \u0938\u0947 \u092e\u0942\u0932 \u0935\u0947\u092c/\u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 '\u091f\u094d\u0930\u0947\u0938' \u092a\u0926\u094d\u0927\u0924\u093f \u0905\u0915\u094d\u0937\u092e \u0915\u0930\u0947\u0902\u0964 \u0907\u0938\u0947 'CORS' (\u0915\u094d\u0930\u0949\u0938 \u0909\u0924\u094d\u092a\u0924\u094d\u0924\u093f \u0938\u0902\u0938\u093e\u0927\u0928 \u0936\u0947\u092f\u0930\u093f\u0902\u0917) \u091c\u0948\u0938\u0947 \u0905\u0928\u094d\u092f \u092a\u094d\u0930\u092f\u094b\u091c\u0928\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f \u0906\u0935\u0936\u094d\u092f\u0915 \u0928\u0939\u0940\u0902 \u0939\u0948 \u092f\u0926\u093f \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930, \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0905\u091a\u094d\u091b\u0940 \u0924\u0930\u0939 \u0938\u0947 \u092e\u0942\u0932 \u0935\u0947\u092c/\u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0938\u0930\u094d\u0935\u0930, \u092a\u0930 '\u0935\u093f\u0915\u0932\u094d\u092a' \u092a\u0926\u094d\u0927\u0924\u093f \u0905\u0915\u094d\u0937\u092e \u0915\u0930\u0947\u0902\u0964 'Fingerprintable' \u0909\u0924\u094d\u092a\u093e\u0926-\u0935\u093f\u0936\u093f\u0937\u094d\u091f \u0924\u094d\u0930\u0941\u091f\u093f \u092a\u0943\u0937\u094d\u0920\u094b\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u0938\u094d\u0925\u093f\u0924\u093f HTTP \u0924\u094d\u0930\u0941\u091f\u093f\u092f\u094b\u0902, '\u091f\u094d\u0930\u0948\u0915' \u0917\u0948\u0930 \u0935\u093f\u0926\u094d\u092f\u092e\u093e\u0928 \u092a\u0943\u0937\u094d\u0920\u094b\u0902 \u0915\u0947 \u0932\u093f\u090f \u0905\u0928\u0941\u0930\u094b\u0927 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u0932\u0940\u0915 \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0938\u0947 \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0938\u094d\u091f\u092e \u0924\u094d\u0930\u0941\u091f\u093f \u092a\u0943\u0937\u094d\u0920\u094b\u0902, \u0915\u0947 \u0938\u093e\u0925 \u0935\u0947\u092c \u0914\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0938\u0930\u094d\u0935\u0930 \u0915\u094b \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u0930\u0947\u0902\u0964 \u0938\u092d\u0940 \u092a\u0930\u0926\u0947 \u0915\u0947 \u092a\u0940\u091b\u0947, \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0938\u0930\u094d\u0935\u0930, \u0914\u0930 \u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 '\u0938\u0930\u094d\u0935\u0930' \u0914\u0930 'X--\u0926\u094d\u0935\u093e\u0930\u093e \u0938\u0902\u091a\u093e\u0932\u093f\u0924' HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u092e\u0947\u0902 \u092a\u094d\u0930\u094c\u0926\u094d\u092f\u094b\u0917\u093f\u0915\u0940 \u0914\u0930 \u0938\u0902\u0938\u094d\u0915\u0930\u0923 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0915\u0947 \u092a\u094d\u0930\u0915\u091f\u0940\u0915\u0930\u0923 \u0915\u094b \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u0930\u0947\u0902 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916\u0964
ascanalpha.proxydisclosure.refs=???
ascanalpha.proxydisclosure.attack=\u091f\u094d\u0930\u0947\u0938, \u0935\u093f\u0915\u0932\u094d\u092a \u0924\u0930\u0940\u0915\u094b\u0902 'Max-\u0905\u0917\u094d\u0930\u0947\u0937\u0923\u094b\u0902' \u0936\u0940\u0930\u094d\u0937\u0915 \u0915\u0947 \u0938\u093e\u0925\u0964 \u0935\u093f\u0927\u093f \u0915\u094b \u091f\u094d\u0930\u0948\u0915\u0964
ascanalpha.proxydisclosure.extrainfo.unknown=\u0905\u091c\u094d\u091e\u093e\u0924
ascanalpha.proxydisclosure.extrainfo.proxyserver.header=\u091f\u094d\u0930\u0947\u0938, \u0935\u093f\u0915\u0932\u094d\u092a, \u0914\u0930 \u091f\u094d\u0930\u0948\u0915 \u0935\u093f\u0927\u093f\u092f\u094b\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930, \u0928\u093f\u092e\u094d\u0928 \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930 OWASP \u091c\u0948\u092a \u0914\u0930 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917/\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0915\u0947 \u092c\u0940\u091a \u092a\u0939\u091a\u093e\u0928 \u0915\u0940 \u0917\u0908 \u0939\u0948\: 
ascanalpha.proxydisclosure.extrainfo.proxyserver=-{0}
ascanalpha.proxydisclosure.extrainfo.webserver.header=\u0928\u093f\u092e\u094d\u0928\u0932\u093f\u0916\u093f\u0924 \u0935\u0947\u092c/\u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0938\u0930\u094d\u0935\u0930 \u0915\u0940 \u092a\u0939\u091a\u093e\u0928 \u0915\u0940 \u0917\u0908 \u0939\u0948\: 
ascanalpha.proxydisclosure.extrainfo.webserver=-{0}
ascanalpha.proxydisclosure.extrainfo.silentproxyserver.header=\u0928\u093f\u092e\u094d\u0928\u0932\u093f\u0916\u093f\u0924 '\u092e\u0942\u0915' \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930\u094b\u0902 \u0915\u0940 \u092a\u0939\u091a\u093e\u0928 \u0915\u0940 \u0917\u0908\u0964 \u0909\u0928\u0915\u0947 \u0935\u094d\u092f\u0935\u0939\u093e\u0930 \u0915\u0947 \u0915\u093e\u0930\u0923, \u092f\u0939 \u091c\u094d\u091e\u093e\u0924 \u0928\u0939\u0940\u0902 \u0939\u0948 \u0907\u0928 \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u091c\u094b \u092c\u093e\u0924 \u0928\u0947\u091f\u0935\u0930\u094d\u0915 \u091f\u094b\u092a\u094b\u0932\u0949\u091c\u0940 \u092e\u0947\u0902 \u0930\u0939\u0924\u0947 \u0939\u0948\u0902\:
ascanalpha.proxydisclosure.extrainfo.silentproxyserver=-{0}
ascanalpha.proxydisclosure.extrainfo.traceenabled='\u091f\u094d\u0930\u0947\u0938' \u0935\u093f\u0927\u093f \u092a\u094d\u0930\u0949\u0915\u094d\u0938\u0940 \u0938\u0930\u094d\u0935\u0930 \u0938\u0947 \u090f\u0915 \u092f\u093e \u0905\u0927\u093f\u0915, \u092f\u093e \u092e\u0942\u0932 \u0938\u0930\u094d\u0935\u0930 \u092a\u0930 \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964 \u0907\u0938 \u0935\u093f\u0927\u093f \u0915\u094b \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0938\u0947 \u0926\u093e\u0916\u093f\u0932 \u0915\u0940 \u0917\u0908 \u0938\u092d\u0940 \u091c\u093e\u0928\u0915\u093e\u0930\u0940 \u0932\u0940\u0915 \u0914\u0930 \u092a\u0930\u0926\u0947 \u0915\u0947 \u092a\u0940\u091b\u0947 \u0909\u092a\u092f\u094b\u0917\u0915\u0930\u094d\u0924\u093e \u090f\u091c\u0947\u0902\u091f \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0935\u093e\u092a\u0938\u0964 \u092f\u0939 '\u0915\u094d\u0930\u0949\u0938 \u0938\u093e\u0907\u091f \u0905\u0928\u0941\u0930\u0947\u0916\u0923' \u0939\u092e\u0932\u094b\u0902 \u0915\u0940 \u0938\u0941\u0935\u093f\u0927\u093e \u0915\u0930 \u0938\u0915\u0924\u0947 \u0939\u0948\u0902\u0964 

ascanalpha.relativepathconfusion.name=\u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930 \u092a\u0925 \u092d\u094d\u0930\u092e
ascanalpha.relativepathconfusion.desc=\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 URL \u0915\u0947 \u0932\u093f\u090f \u0938\u0939\u0940 "\u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930"\u092a\u0925 \u0915\u0947 \u092c\u093e\u0930\u0947 \u092e\u0947\u0902 \u092d\u094d\u0930\u092e \u0915\u0940 \u0938\u094d\u0925\u093f\u0924\u093f \u0915\u0947 \u0932\u093f\u090f \u0928\u0947\u0924\u0943\u0924\u094d\u0935 \u0915\u0940 \u0938\u0902\u092d\u093e\u0935\u0928\u093e \u0939\u0948 \u090f\u0915 \u0924\u0930\u0940\u0915\u0947 \u0938\u0947 \u0905\u0938\u094d\u092a\u0937\u094d\u091f \u092f\u0942\u0906\u0930\u090f\u0932 \u0915\u0947 \u0932\u093f\u090f \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e\u0913\u0902 \u0915\u0940 \u0938\u0947\u0935\u093e \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964 \u0938\u0902\u0938\u093e\u0927\u0928 (\u0938\u0940\u090f\u0938\u090f\u0938, \u091b\u0935\u093f\u092f\u093e\u0901, \u0906\u0926\u093f) \u092d\u0940 \u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930, \u092c\u091c\u093e\u092f \u0928\u093f\u0930\u092a\u0947\u0915\u094d\u0937 Url \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u092a\u0943\u0937\u094d\u0920 \u092a\u094d\u0930\u0924\u094d\u092f\u0941\u0924\u094d\u0924\u0930 \u092e\u0947\u0902 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u0930 \u0930\u0939\u0947 \u0939\u0948\u0902\u0964 \u092f\u0926\u093f \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092e\u0947\u0902 \u090f\u0915 \u0938\u094d\u0935\u0924\u0902\u0924\u094d\u0930 \u0924\u0930\u0940\u0915\u0947 \u0938\u0947 "\u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u092e\u0917\u094d\u0930\u0940" \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e parses, \u092f\u093e permissively "\u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u092e\u0917\u094d\u0930\u0940" \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u092b\u094d\u0930\u0947\u092e\u0928, \u091c\u0948\u0938\u0947 \u0924\u0915\u0928\u0940\u0915\u094b\u0902 \u0915\u093e \u092a\u094d\u0930\u092f\u094b\u0917, \u092a\u093e\u0930\u094d\u0938\u093f\u0902\u0917 \u092e\u0947\u0902 \u092c\u0930\u0917\u0932\u093e\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u0947 \u0939\u0948\u0902 \u090f\u0915 \u0939\u092e\u0932\u0947 \u092e\u0947\u0902, \u0924\u092c \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0938\u0940\u090f\u0938\u090f\u0938 (\u092f\u093e \u0905\u0928\u094d\u092f \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930), \u090f\u0915 XSS \u091c\u094b\u0916\u093f\u092e \u0915\u0947 \u0932\u093f\u090f \u0905\u0917\u094d\u0930\u0923\u0940 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 HTML \u0915\u0940 \u0935\u094d\u092f\u093e\u0916\u094d\u092f\u093e \u092e\u0947\u0902 \u092e\u0942\u0930\u094d\u0916 \u0939\u094b \u0938\u0915\u0924\u093e\u0964
ascanalpha.relativepathconfusion.soln=\u0935\u0947\u092c \u0938\u0930\u094d\u0935\u0930 \u0914\u0930 \u091a\u094c\u0916\u091f\u0947 \u092e\u0947\u0902 \u0910\u0938\u0947 \u092f\u0942\u0906\u0930\u090f\u0932 \u0915\u0947 \u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930 \u092a\u0925 \u092f\u093e \u0924\u094b \u0915\u094d\u0932\u093e\u0907\u0902\u091f \u0938\u093e\u0907\u0921, \u092f\u093e \u0938\u0930\u094d\u0935\u0930 \u0938\u093e\u0907\u0921 \u092a\u0930 \u0918\u091f\u0915 \u0926\u094d\u0935\u093e\u0930\u093e \u0917\u0932\u0924 \u0935\u094d\u092f\u093e\u0916\u094d\u092f\u093e \u0915\u0940 \u091c\u093e \u0938\u0915\u0924\u093e \u0939\u0948 \u0915\u093f \u0907\u0938 \u0924\u0930\u0939 \u0905\u0938\u094d\u092a\u0937\u094d\u091f \u092f\u0942\u0906\u0930\u090f\u0932 \u0915\u0947 \u0932\u093f\u090f \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e\u0913\u0902 \u0915\u0940 \u0938\u0947\u0935\u093e \u0928\u0939\u0940\u0902 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0915\u0949\u0928\u094d\u092b\u093c\u093f\u0917\u0930 \u0915\u093f\u092f\u093e \u091c\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0928\u0935\u0940\u0928\u0940\u0915\u0943\u0924 \u0915\u093f\u092f\u093e \u091c\u093e\u0928\u093e \u091a\u093e\u0939\u093f\u090f\u0964 \u0905\u0928\u0941\u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u092d\u0940\u0924\u0930, HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u092e\u0947\u0902 "<base>" HTML \u091f\u0948\u0917 \u0915\u0947 \u0938\u0939\u0940 \u0909\u092a\u092f\u094b\u0917 \u0905\u0938\u0902\u0926\u093f\u0917\u094d\u0927 \u0930\u0942\u092a \u0938\u0947 \u0926\u0938\u094d\u0924\u093e\u0935\u0947\u091c\u093c \u092e\u0947\u0902 \u0938\u092d\u0940 \u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930 \u092f\u0942\u0906\u0930\u090f\u0932 \u0915\u0947 \u0932\u093f\u090f \u0906\u0927\u093e\u0930 URL \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u0930\u0947\u0917\u093e\u0964 \u092f\u0939 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u092a\u094d\u0930\u0924\u093f\u0915\u094d\u0930\u093f\u092f\u093e \u0915\u0940 \u0917\u0932\u0924 \u0935\u094d\u092f\u093e\u0916\u094d\u092f\u093e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u092c\u0932 \u0939\u092e\u0932\u093e\u0935\u0930 \u0915\u0947 \u0932\u093f\u090f \u0915\u0920\u093f\u0928 \u092c\u0928\u093e\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f "\u0938\u093e\u092e\u0917\u094d\u0930\u0940-\u092a\u094d\u0930\u0915\u093e\u0930" HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0947\u0902\u0964 \u0915\u093e \u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0930\u0947\u0902 "\u090f\u0915\u094d\u0938-\u0938\u093e\u092e\u0917\u094d\u0930\u0940-\u092a\u094d\u0930\u0915\u093e\u0930-\u0935\u093f\u0915\u0932\u094d\u092a\: nosniff" "\u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u0915\u0947 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0938\u0947 \u0938\u0942\u0901\u0918\u0928\u0947" \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u094b \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916\u0964 \u0907\u0938 \u0924\u0930\u0939 \u0915\u0947 \u0930\u0942\u092a \u092e\u0947\u0902 \u090f\u0915 \u0906\u0927\u0941\u0928\u093f\u0915 DOCTYPE \u0915\u093e \u0909\u092a\u092f\u094b\u0917 "<\! doctype html >" \u092a\u0943\u0937\u094d\u0920 \u0938\u0947 "Quirks \u092e\u094b\u0921", \u0915\u0947 \u092c\u093e\u0926 \u0938\u0947 \u092f\u0939 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0947 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0915\u0947 \u0926\u094d\u0935\u093e\u0930\u093e \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u0930 \u0926\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u092e\u0947\u0902 \u092a\u0930\u093f\u0923\u093e\u092e \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092e\u0947\u0902 \u0930\u0947\u0902\u0921\u0930 \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f\u0964 Quirks \u092e\u094b\u0921 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092b\u094d\u0930\u0947\u092e\u0928 \u0939\u092e\u0932\u094b\u0902 \u0915\u093e \u0909\u092a\u092f\u094b\u0917 \u0915\u0930\u0928\u0947 \u092e\u0947\u0902 \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u091c\u093e \u0930\u0939\u093e \u0938\u0947 \u0930\u094b\u0915\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f "X-\u092b\u094d\u0930\u0947\u092e-\u0935\u093f\u0915\u0932\u094d\u092a" HTTP \u092a\u094d\u0930\u0924\u093f\u0938\u093e\u0926 \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u0930\u0947\u0902\u0964 
ascanalpha.relativepathconfusion.refs=http\://www.thespanner.co.uk/2014/03/21/rpo/ https\://hsivonen.fi/doctype/ http\://www.w3schools.com/tags/tag_base.asp
ascanalpha.relativepathconfusion.extrainfo.morethanonebasetag=\u090f\u0915 \u0938\u0947 \u0905\u0927\u093f\u0915 <base>\u091f\u0948\u0917 \u091c\u094b \u092e\u093e\u0928\u094d\u092f \u0928\u0939\u0940\u0902 \u0939\u0948 \u0938\u093e\u092a\u0947\u0915\u094d\u0937 \u092f\u0942\u0906\u0930\u090f\u0932\u094b\u0902, \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0925\u093e\u0928 \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f HTML <head>\u091f\u0948\u0917 \u092e\u0947\u0902 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964
ascanalpha.relativepathconfusion.extrainfo.nobasetag=\u0930\u093f\u0936\u094d\u0924\u0947\u0926\u093e\u0930 \u092f\u0942\u0906\u0930\u090f\u0932 \u0915\u0947 \u0932\u093f\u090f \u0938\u094d\u0925\u093e\u0928 \u0928\u093f\u0930\u094d\u0927\u093e\u0930\u093f\u0924 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f HTML <head>\u091f\u0948\u0917 \u092e\u0947\u0902 \u0915\u094b\u0908 <base>\u091f\u0948\u0917 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0928\u0939\u0940\u0902 \u0925\u093e\u0964
ascanalpha.relativepathconfusion.extrainfo.contenttypeenabled="{0}" \u0915\u0947 \u090f\u0915 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e\u0964 \u092f\u0926\u093f \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u0938\u0916\u094d\u0924 \u092a\u093e\u0930\u094d\u0938\u093f\u0902\u0917 \u0928\u093f\u092f\u092e \u0915\u093e\u092e \u0915\u0930\u0924\u0947 \u0939\u0948, \u0907\u0938 \u0938\u092b\u0932 \u0939\u094b\u0928\u0947 \u0938\u0947 \u0915\u094d\u0930\u0949\u0938-\u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u0915\u0947 \u0939\u092e\u0932\u094b\u0902 \u0915\u094b \u0930\u094b\u0915\u0928\u0947 \u091c\u093e\u090f\u0917\u093e\u0964 Quirks \u092e\u094b\u0921 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092e\u0947\u0902 \u0938\u0916\u094d\u0924 \u092a\u093e\u0930\u094d\u0938\u093f\u0902\u0917 \u0905\u0915\u094d\u0937\u092e \u0939\u094b\u0924\u093e\u0964  
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly=Quirks \u092e\u094b\u0921 \u0938\u094d\u092a\u0937\u094d\u091f \u0930\u0942\u092a \u0938\u0947 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u0915\u094d\u0937\u092e \u0939\u0948 < \u092e\u0947\u091f\u093e http-equiv \= "{0}", \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u0930 \u0938\u0915\u0924\u093e \u0915\u0947 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f\u0964
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly=Quirks \u092e\u094b\u0921 \u0909\u0932\u091d\u093e\u0935 \u0938\u093e\u0930\u094d\u0935\u091c\u0928\u093f\u0915 \u0906\u0908\u0921\u0940 "{0}", \u0915\u0947 \u0938\u093e\u0925 \u090f\u0915 \u092a\u0941\u0930\u093e\u0928\u0947 DOCTYPE \u0915\u0941\u091b \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930\u094d\u0938 \u092e\u0947\u0902 \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u0930 \u0938\u0915\u0924\u093e \u0915\u0947 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0915\u0947 \u092a\u094d\u0930\u092f\u094b\u0917 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype=Quirks \u092e\u094b\u0921 \u0909\u0932\u091d\u093e\u0935 \u090f\u0915 DOCTYPE, \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u0930 \u0938\u0915\u0924\u093e \u0915\u0947 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0915\u0947 \u0905\u092d\u093e\u0935 \u0915\u0947 \u092e\u093e\u0927\u094d\u092f\u092e \u0938\u0947 \u0938\u0915\u094d\u0937\u092e \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0939\u0948\u0964
ascanalpha.relativepathconfusion.extrainfo.nocontenttype=\u0915\u094b\u0908 \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0915\u093f\u092f\u093e \u0917\u092f\u093e \u0925\u093e, \u0924\u094b Quirks \u092e\u094b\u0921 \u0935\u0947\u092c \u092c\u094d\u0930\u093e\u0909\u091c\u093c\u0930 \u092e\u0947\u0902 \u091c\u094b\u0916\u093f\u092e \u0936\u094b\u0937\u0923 \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0906\u0935\u0936\u094d\u092f\u0915 \u0928\u0939\u0940\u0902 \u0939\u0948\u0964 
ascanalpha.relativepathconfusion.extrainfo.framingallowed=\u0915\u094b\u0908 X-\u092b\u094d\u0930\u0947\u092e-\u0935\u093f\u0915\u0932\u094d\u092a \u0936\u0940\u0930\u094d\u0937 \u0932\u0947\u0916, \u0924\u094b \u092a\u0943\u0937\u094d\u0920 \u0924\u0948\u092f\u093e\u0930 \u0915\u093f\u090f \u091c\u093e \u0938\u0915\u0924\u0947 \u0939\u0948\u0902, \u0914\u0930 \u092f\u0939 Quirks \u092e\u094b\u0921, \u0928\u091c\u0930\u0905\u0902\u0926\u093e\u091c \u0915\u0930 \u0938\u0915\u0924\u093e \u0915\u0947 \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0938\u093e\u092e\u0917\u094d\u0930\u0940 \u092a\u094d\u0930\u0915\u093e\u0930 \u0915\u0940 \u0905\u0928\u0941\u092e\u0924\u093f \u0915\u094b \u0938\u0915\u094d\u0937\u092e \u0915\u0930\u0928\u0947 \u0915\u0947 \u0932\u093f\u090f \u0907\u0938\u094d\u0924\u0947\u092e\u093e\u0932 \u0915\u093f\u092f\u093e \u091c\u093e \u0938\u0915\u0924\u093e \u0928\u093f\u0930\u094d\u0926\u093f\u0937\u094d\u091f \u0928\u0939\u0940\u0902 \u0925\u093e\u0964

