#X-Generator: crowdin.com
# ascanalphaAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3 \u30eb\u30fc\u30eb - \u30a2\u30eb\u30d5\u30a1

ascanalpha.examplefile.name=\u30c7\u30fc\u30bf\u3092\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30ed\u30fc\u30c9\u3059\u308b\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306e\u30b5\u30f3\u30d7\u30eb\u3067\u3059\u3002
ascanalpha.examplefile.desc=\u3053\u3053\u306b\u8a73\u7d30\u306a\u8106\u5f31\u6027\u306e\u60c5\u5831\u3092\u8ffd\u8a18\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.examplefile.other=\u3053\u306e\u9805\u76ee\u306b\u306f\u3001\u4ed6\u306e\u3044\u305a\u308c\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u306b\u3082\u5c5e\u3055\u306a\u3044\u60c5\u5831\u3092\u8a18\u8f09\u3057\u307e\u3059\u3002
ascanalpha.examplefile.soln=\u554f\u984c\u3092\u89e3\u6c7a\u3059\u308b\u65b9\u6cd5\u306e\u4e00\u822c\u7684\u306a\u8aac\u660e\u3092\u8a18\u8f09\u3057\u307e\u3059\u3002
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.sourcecodedisclosure.desc=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304cWeb\u30b5\u30fc\u30d0\u304b\u3089\u53c2\u7167\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.sourcecodedisclosure.lfibased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - \u30d5\u30a1\u30a4\u30eb\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3
ascanalpha.sourcecodedisclosure.lfibased.soln=\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u6307\u5b9a\u3055\u308c\u305f\u4efb\u610f\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u51fa\u529b\u306b\u542b\u307e\u308c\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u540d [{0}] \u306e\u51fa\u529b\u304c\u3001\u30e9\u30f3\u30c0\u30e0\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{1}] \u3092\u4e0e\u3048\u305f\u969b\u306b [{2}%] \u7570\u306a\u3063\u3066\u304a\u308a\u3001\n \u3057\u304d\u3044\u5024 [{3}%] \u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
ascanalpha.sourcecodedisclosure.lfibased.evidence=

ascanalpha.sourcecodedisclosure.gitbased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - Git
ascanalpha.sourcecodedisclosure.gitbased.soln=Git \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304c Web \u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3092\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=
ascanalpha.sourcecodedisclosure.gitbased.evidence=[{1}] \u3092\u4f7f\u7528\u3057\u3066 [{0}] \u306e\u30bd\u30fc\u30b9 \u30b3\u30fc\u30c9\u304c\u62bd\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

ascanalpha.elinjection.name=EL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanalpha.elinjection.desc=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c Java Server Page (JSP) \u306e Expression Language Statement (EL\u5f0f) \u3067\u69cb\u6210\u3055\u308c\u3001\u5916\u90e8\u304b\u3089\u306e\u5165\u529b\u3092\u4e0a\u6d41\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u53d7\u3051\u53d6\u308b\u969b\u3001\u5165\u529b\u5024\u304c\u9069\u5207\u306b\u7121\u5bb3\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u7279\u5b9a\u306e\u8981\u7d20\u3092\u57cb\u3081\u8fbc\u3080\u3053\u3068\u3067\u5b9f\u884c\u524d\u306eEL\u5f0f\u3092\u66f8\u304d\u63db\u3048\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\n\nSprint 3.0.5 \u3088\u308a\u4ee5\u524d\u306e\u7279\u5b9a\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u306f\u8106\u5f31\u6027(CVE-2011-2730)\u304c\u5b58\u5728\u3057\u3001EL\u5f0f\u304c2\u5ea6\u8a55\u4fa1\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306bEL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u5f15\u304d\u8d77\u3053\u3055\u308c\u307e\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Spring \u306b\u304a\u3044\u3066\u3082\u8a2d\u5b9a\u6b21\u7b2c\u3067\u6709\u52b9\u3068\u306a\u308a\u307e\u3059\u3002
ascanalpha.elinjection.soln=\u4fe1\u983c\u3067\u304d\u306a\u3044\u5165\u529b\u30c7\u30fc\u30bf\u306b\u5bfe\u3057\u3066\u3001\u59a5\u5f53\u306a\u30d0\u30ea\u30c7\u30fc\u30b7\u30e7\u30f3\u3092\u884c\u3063\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u5165\u529b\u30c7\u30fc\u30bf\u304cEL\u5f0f\u306e\u4e00\u90e8\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u308b\u524d\u306b\u30a8\u30f3\u30b3\u30fc\u30c9\u3092\u884c\u3063\u3066\u4e0b\u3055\u3044\u3002\u3053\u308c\u3089\u306b\u3088\u3063\u3066\u3001\u30a4\u30f3\u30bf\u30d7\u30ea\u30bf\u306b\u3088\u3063\u3066\u8a55\u4fa1\u3055\u308c\u308b\u524d\u306b\u3001\u30e6\u30fc\u30b6\u5165\u529b\u5024\u306b\u30e1\u30bf\u6587\u5b57\u304c\u542b\u307e\u308c\u306a\u3044\u72b6\u614b\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u6700\u3082\u5358\u7d14\u306a\u691c\u51fa\u30d1\u30bf\u30fc\u30f3\u306f\u3001 ${ \u3068 \#{ \u3067\u3059\u3002\u305f\u3060\u3057\u3001\u3053\u308c\u3089\u306e\u30c7\u30fc\u30bf\u306f\u30a8\u30f3\u30b3\u30fc\u30c9\u307e\u305f\u306f\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection\nhttp\://cwe.mitre.org/data/definitions/917.html

ascanalpha.cookieslack.name=Cookie Slack Detector
ascanalpha.cookieslack.desc=Repeated GET requests\: drop a different cookie each time, followed by normal request with all cookies to stabilize session, compare responses against original baseline GET. This can reveal areas where cookie based authentication/attributes are not actually enforced.
ascanalpha.cookieslack.solution=N.a.
ascanalpha.cookieslack.otherinfo.intro=Cookies that don't have expected effects can reveal flaws in application logic. In the worst case, this can reveal where authentication via cookie token(s) is not actually enforced.\n
ascanalpha.cookieslack.session.warning=NOTE\: Because of its name this cookie may be important, but dropping it appears to have no effect\: [{0}] \n
ascanalpha.cookieslack.affect.response.yes=These cookies affected the response\: 
ascanalpha.cookieslack.affect.response.no=These cookies did NOT affect the response\: 
ascanalpha.cookieslack.session.destroyed=Dropping this cookie appears to have invalidated the session\: [{0}] A follow-on request with all original cookies still had a different response than the original request. \n
ascanalpha.cookieslack.separator=,
ascanalpha.cookieslack.endline=\n

ascanalpha.httpsashttpscanner.name=HTTPS Content Available via HTTP
ascanalpha.httpsashttpscanner.desc=Content which was initially accessed via HTTPS (i.e.\: using SSL/TLS encryption) is also accessible via HTTP (without encryption). 
ascanalpha.httpsashttpscanner.soln=Ensure that your web server, application server, load balancer, etc. is configured to only serve such content via HTTPS. Consider implementing HTTP Strict Transport Security.
ascanalpha.httpsashttpscanner.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers\nhttp\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttp\://caniuse.com/stricttransportsecurity\nhttp\://tools.ietf.org/html/rfc6797

ascanalpha.sqlinjection.sqlite.name=SQL Injection - SQLite
ascanalpha.sqlinjection.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027
ascanalpha.sqlinjection.soln=Do not trust client side input, even if there is client side validation in place. \nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply a 'whitelist' of allowed characters, or a 'blacklist' of disallowed characters in user input.\nApply the privilege of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanalpha.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.sqlite.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, parameter value [{2}], which caused the request to take [{3}] milliseconds, when the original unmodified query with value [{4}] took [{5}] milliseconds.
ascanalpha.sqlinjection.sqlite.alert.errorbased.extrainfo=The following known SQLite error message was provoked\: [{0}].
ascanalpha.sqlinjection.sqlite.alert.versionnumber.extrainfo=Using a UNION based SQL Injection attack, and by exploiting SQLite''s dynamic typing mechanism, the SQLite version was determined to be [{0}].\nWith string-based injection points, full SQLite version information can be extracted, but with numeric injection points, only partial SQLite version information can be extracted.\nMore information on SQLite version [{0}] is available at http\://www.sqlite.org/changes.html

