pscanbeta.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanbeta.inpagebanner.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0432 \u0440\u044f\u0434\u043e\u043a \u0431\u0430\u043d\u0435\u0440\u0430 \u0432\u0435\u0440\u0441\u0456\u0457 \u0443 \u0432\u043c\u0456\u0441\u0442\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456. \u0422\u0430\u043a\u0456 \u0432\u0438\u0442\u043e\u043a\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0443\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u0456 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438, \u0449\u043e \u0432\u043f\u043b\u0438\u0432\u0430\u044e\u0442\u044c \u043d\u0430 \u043f\u0440\u043e\u0434\u0443\u043a\u0442 \u0442\u0430 \u0432\u0435\u0440\u0441\u0456\u044e, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f.
pscanbeta.inpagebanner.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043d\u0430 \u0431\u0430\u043d\u0435\u0440\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438
pscanbeta.inpagebanner.other = \u0406\u0441\u043d\u0443\u0454 \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043d\u044f \u0443 \u043f\u043e\u0448\u0443\u043a\u0443 \u0441\u0442\u043e\u0441\u0443\u0454\u0442\u044c\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445, \u0430 \u043d\u0435 \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u0432 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.
pscanbeta.inpagebanner.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/
pscanbeta.inpagebanner.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0442\u0430\u043a\u0438\u043c \u0434\u0436\u0435\u0440\u0435\u043b\u0430\u043c \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434\:\n\u0423 Tomcat \u0446\u0435 \u0440\u043e\u0431\u0438\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abserver\u00bb \u0456 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043e\u043a.\n\u0423 Apache \u0446\u0435 \u0440\u043e\u0431\u0438\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abServerSignature\u00bb \u0456 \u00abServerTokens\u00bb.

pscanbeta.jsfunction.desc = \u0421\u0445\u043e\u0436\u0435, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0430 \u0444\u0443\u043d\u043a\u0446\u0456\u044f JS, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0441\u0430\u0439\u0442 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c.
pscanbeta.jsfunction.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 JS
pscanbeta.jsfunction.refs = https\://angular.io/guide/security
pscanbeta.jsfunction.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0434\u043e\u0432\u0456\u0434\u043a\u043e\u0432\u0456 \u043c\u0430\u0442\u0435\u0440\u0456\u0430\u043b\u0438 \u0449\u043e\u0434\u043e \u043f\u043e\u0440\u0430\u0434 \u043f\u0440\u043e \u0431\u0435\u0437\u043f\u0435\u043a\u0443 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0446\u0438\u0445 \u0444\u0443\u043d\u043a\u0446\u0456\u0439.

pscanbeta.jso.desc = \u0417\u0434\u0430\u0454\u0442\u044c\u0441\u044f, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f Java Serialization. \u042f\u043a\u0449\u043e \u0432\u043e\u043d\u0430 \u043d\u0435 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0430 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u043e \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0439 \u043e\u0431'\u0454\u043a\u0442. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e "\u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443". \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043c\u0430\u0433\u0456\u0447\u043d\u0443 \u043f\u043e\u0441\u043b\u0456\u0434\u043e\u0432\u043d\u0456\u0441\u0442\u044c, \u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0454 JSO (Base64\: rO0AB, Raw\: 0xac, 0xed, 0x00, 0x05).
pscanbeta.jso.name = \u041e\u0431\u2019\u0454\u043a\u0442 \u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 Java
pscanbeta.jso.refs = https\://www.oracle.com/java/technologies/javase/seccodeguide.html\#8
pscanbeta.jso.soln = \u0414\u0435\u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437\u0430 \u0441\u0432\u043e\u0454\u044e \u0441\u0443\u0442\u0442\u044e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0430, \u0456 \u0457\u0457 \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.

pscanbeta.name = Passive Scan Rules - beta.

pscanbeta.nonstorable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0435\u0433\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438. \u042f\u043a\u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0447\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0457\u0457 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u043f\u043e\u043a\u0440\u0430\u0449\u0438\u0442\u0438 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u0456\u0441\u0442\u044c.
pscanbeta.nonstorable.name = \u0412\u043c\u0456\u0441\u0442, \u0449\u043e \u043d\u0435 \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0454 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e
pscanbeta.nonstorable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.nonstorable.soln = The content may be marked as storable by ensuring that the following conditions are satisfied\:\nThe request method must be understood by the cache and defined as being cacheable ("GET", "HEAD", and "POST" are currently defined as cacheable)\nThe response status code must be understood by the cache (one of the 1XX, 2XX, 3XX, 4XX, or 5XX response classes are generally understood)\nThe "no-store" cache directive must not appear in the request or response header fields\nFor caching by "shared" caches such as "proxy" caches, the "private" response directive must not appear in the response\nFor caching by "shared" caches such as "proxy" caches, the "Authorization" header field must not appear in the request, unless the response explicitly allows it (using one of the "must-revalidate", "public", or "s-maxage" Cache-Control response directives)\nIn addition to the conditions above, at least one of the following conditions must also be satisfied by the response\:\nIt must contain an "Expires" header field\nIt must contain a "max-age" response directive\nFor "shared" caches such as "proxy" caches, it must contain a "s-maxage" response directive\nIt must contain a "Cache Control Extension" that allows it to be cached\nIt must have a status code that is defined as cacheable by default (200, 203, 204, 206, 300, 301, 404, 405, 410, 414, 501).

pscanbeta.payloader.desc = \u0417\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0443 \u043f\u0440\u0430\u0432\u0438\u043b\u0430\u0445 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f.
pscanbeta.payloader.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0432\u0435\u0440\u0441\u0456\u044f \u041a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0456 \u043a\u043e\u0440\u0438\u0441\u043d\u0456 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f

pscanbeta.permissionspolicymissing.deprecated.desc = The header has now been renamed to Permissions-Policy.
pscanbeta.permissionspolicymissing.deprecated.name = \u0417\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u043d\u0430\u0431\u0456\u0440 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0439
pscanbeta.permissionspolicymissing.deprecated.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://scotthelme.co.uk/goodbye-feature-policy-and-hello-permissions-policy/
pscanbeta.permissionspolicymissing.deprecated.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Permissions-Policy \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Feature-Policy.
pscanbeta.permissionspolicymissing.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 - \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0444\u0443\u043d\u043a\u0446\u0456\u0439 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0430\u0431\u043e \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u0426\u044f \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456\u0441\u0442\u044c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432, \u043e\u0431\u043c\u0435\u0436\u0443\u044e\u0447\u0438 \u0430\u0431\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u044e\u0447\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0456\u0432 \u043e\u0431\u043c\u0435\u0436\u0443\u0432\u0430\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u043e\u044e, \u0442\u0430\u043a\u0456 \u044f\u043a \u043a\u0430\u043c\u0435\u0440\u0430, \u043c\u0456\u043a\u0440\u043e\u0444\u043e\u043d, \u043c\u0456\u0441\u0446\u0435\u0437\u043d\u0430\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f, \u043f\u043e\u0432\u043d\u043e\u0435\u043a\u0440\u0430\u043d\u043d\u0438\u0439 \u0440\u0435\u0436\u0438\u043c \u0442\u043e\u0449\u043e.
pscanbeta.permissionspolicymissing.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e
pscanbeta.permissionspolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://developer.chrome.com/blog/feature-policy/\nhttps\://scotthelme.co.uk/a-new-security-header-feature-policy/\nhttps\://w3c.github.io/webappsec-feature-policy/\nhttps\://www.smashingmagazine.com/2018/12/feature-policy/
pscanbeta.permissionspolicymissing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u00ab\u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432\u00bb.

pscanbeta.servletparameterpollution.desc = \u041d\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0430 \u0434\u0456\u044f \u0444\u043e\u0440\u043c\u0438\: \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0430\u0442\u0430\u043a\u0430 \u0456\u0437 \u043f\u0435\u0440\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 HTTP. \u0426\u0435 \u0432\u0456\u0434\u043e\u043c\u0430 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0437 Java Servlets, \u0430\u043b\u0435 \u0456\u043d\u0448\u0456 \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c\u0438.
pscanbeta.servletparameterpollution.name = \u041f\u0435\u0440\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 HTTP
pscanbeta.servletparameterpollution.refs = https\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf
pscanbeta.servletparameterpollution.soln = \u0423\u0441\u0456 \u0444\u043e\u0440\u043c\u0438 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 URL \u0434\u0456\u0457.

pscanbeta.site-isolation.coep.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy \u2014 \u0446\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u044f\u043a\u0438\u0439 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0430\u0454 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044e \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u043e\u043c \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432 \u0456\u0437 \u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u0438\u043c \u0434\u0436\u0435\u0440\u0435\u043b\u043e\u043c, \u044f\u043a\u0456 \u044f\u0432\u043d\u043e \u043d\u0435 \u043d\u0430\u0434\u0430\u044e\u0442\u044c \u0434\u043e\u0437\u0432\u0456\u043b \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0443 (\u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e CORP \u0430\u0431\u043e CORS).
pscanbeta.site-isolation.coep.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430/\u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy \u0456 \u0449\u043e \u0432\u0456\u043d \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Embedder-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u00abrequire-corp\u00bb \u0434\u043b\u044f \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u0439 \u0456\u0437 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c\u0438 \u0442\u0430 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy).
pscanbeta.site-isolation.coop.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy - \u0446\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u044f\u043a\u0438\u0439 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0441\u0430\u0439\u0442\u0443 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438, \u0447\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c \u0456\u043d\u0448\u0456 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u0456 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0438 \u0442\u043e\u0439 \u0441\u0430\u043c\u0438\u0439 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443. \u0421\u043f\u0456\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043e\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443 \u0437 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u043c\u0438 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430\u043c\u0438 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0434\u0430\u043d\u0438\u0445.
pscanbeta.site-isolation.coop.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0434\u0430\u0442\u043e\u043a/\u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy \u0456 \u0449\u043e \u0432\u0456\u043d \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Opener-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "same-origin" \u0434\u043b\u044f \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n'same-origin-allow-popups' \u0432\u0432\u0430\u0436\u0430\u0454\u0442\u044c\u0441\u044f \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u043c \u0456 \u0439\u043e\u0433\u043e \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.\n\u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c \u0456 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy).
pscanbeta.site-isolation.corp.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy - \u0446\u0435 \u043f\u043e\u0433\u043e\u0434\u0436\u0435\u043d\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a, \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u0434\u043b\u044f \u043f\u0440\u043e\u0442\u0438\u0434\u0456\u0457 \u0430\u0442\u0430\u043a\u0430\u043c \u0456\u0437 \u043f\u043e\u0431\u0456\u0447\u043d\u0438\u0445 \u043a\u0430\u043d\u0430\u043b\u0456\u0432, \u0442\u0430\u043a\u0438\u043c \u044f\u043a Spectre. \u0420\u0435\u0441\u0443\u0440\u0441 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u044f\u043a \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0434\u043b\u044f \u0441\u043f\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043c\u0456\u0436 \u0440\u0456\u0437\u043d\u0438\u043c\u0438 \u0434\u0436\u0435\u0440\u0435\u043b\u0430\u043c\u0438.
pscanbeta.site-isolation.corp.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy
pscanbeta.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Cross-Origin_Resource_Policy
pscanbeta.site-isolation.corp.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0434\u0430\u0442\u043e\u043a/\u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy \u0456 \u0449\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Resource-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "same-origin" \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0432\u0435\u0431\u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a.\n'same-site' \u0432\u0432\u0430\u0436\u0430\u0454\u0442\u044c\u0441\u044f \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u043c \u0456 \u0439\u043e\u0433\u043e \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.\n\u042f\u043a\u0449\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0438 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0441\u043f\u0456\u043b\u044c\u043d\u0438\u043c\u0438, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043d\u0430 "cross-origin".\n\u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c \u0456 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy).
pscanbeta.site-isolation.name = \u041d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043d\u044f \u0456\u0437\u043e\u043b\u044f\u0446\u0456\u044f \u0441\u0430\u0439\u0442\u0443 \u0432\u0456\u0434 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 Spectre

pscanbeta.sourcecodedisclosure.desc = Application Source Code was disclosed by the web server.
pscanbeta.sourcecodedisclosure.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443
pscanbeta.sourcecodedisclosure.refs = https\://www.wsj.com/articles/BL-CIOB-2999
pscanbeta.sourcecodedisclosure.soln = Ensure that application Source Code is not available with alternative extensions, and ensure that source code is not present within other files or data deployed to the web server, or served by the web server.

pscanbeta.sri-integrity.desc = The integrity attribute is missing on a script or link tag served by an external server. The integrity tag prevents an attacker who have gained access to this server from injecting a malicious content.
pscanbeta.sri-integrity.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u043f\u0456\u0434\u0440\u0435\u0441\u0443\u0440\u0441\u0443
pscanbeta.sri-integrity.otherinfo = \u0411\u0443\u043b\u043e \u043e\u0431\u0447\u0438\u0441\u043b\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0445\u0435\u0448 (\u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f base64 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0443 \u0445\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f\: SHA-384) \u0434\u043b\u044f \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e, \u043f\u0440\u043e \u044f\u043a\u0438\u0439 \u0439\u0434\u0435\u0442\u044c\u0441\u044f {0}
pscanbeta.sri-integrity.refs = https\://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity
pscanbeta.sri-integrity.soln = \u041d\u0430\u0434\u0430\u0442\u0438 \u0442\u0435\u0433\u0443 \u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456.

pscanbeta.storabilitycacheability.name = \u041a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443

pscanbeta.storablecacheable.desc = The response contents are storable by caching components such as proxy servers, and may be retrieved directly from the cache, rather than from the origin server by the caching servers, in response to similar requests from other users. If the response data is sensitive, personal or user-specific, this may result in sensitive information being leaked. In some cases, this may even result in a user gaining complete control of the session of another user, depending on the configuration of the caching components in use in their environment. This is primarily an issue where "shared" caching servers such as "proxy" caches are configured on the local network. This configuration is typically found in corporate or educational environments, for instance.
pscanbeta.storablecacheable.name = \u0412\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0442\u0430 \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438
pscanbeta.storablecacheable.otherinfo.liberallifetimeheuristic = \u0417\u0430 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u043e\u0441\u0442\u0456 \u0447\u0456\u0442\u043a\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e\u0457 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0434\u0456\u0457 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u043e \u043f\u0440\u0438\u043f\u0443\u0449\u0435\u043d\u043e \u0432\u0456\u043b\u044c\u043d\u0443 \u0435\u0432\u0440\u0438\u0441\u0442\u0438\u043a\u0443 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0436\u0438\u0442\u0442\u044f 1 \u0440\u0456\u043a. \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e rfc7234.
pscanbeta.storablecacheable.otherinfo.staleretrievenotblocked = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0454 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u043e\u044e, \u0430 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0435 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0447\u0438 \u0431\u043b\u043e\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "must-revalidate", "proxy-revalidate", "s-maxage" \u0430\u0431\u043e "max-age", \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 "Cache-Control".
pscanbeta.storablecacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.storablecacheable.soln = Validate that the response does not contain sensitive, personal or user-specific information. If it does, consider the use of the following HTTP response headers, to limit, or prevent the content being stored and retrieved from the cache by another user\:\nCache-Control\: no-cache, no-store, must-revalidate, private\nPragma\: no-cache\nExpires\: 0\nThis configuration directs both HTTP 1.0 and HTTP 1.1 compliant caching servers to not store the response, and to not retrieve the response (without validation) from the cache, in response to a similar request.

pscanbeta.storablenoncacheable.desc = The response contents are storable by caching components such as proxy servers, but will not be retrieved directly from the cache, without validating the request upstream, in response to similar requests from other users.
pscanbeta.storablenoncacheable.name = \u0412\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438, \u0430\u043b\u0435 \u043d\u0435 \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438
pscanbeta.storablenoncacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
