pscanbeta.desc = Reglas de escaneo pasivas en estado Beta

pscanbeta.inpagebanner.desc = El servidor devolvi\u00f3 una cadena mostr\u00f3 el banner con la versi\u00f3n en el contenido de la respuesta. Estas filtraciones de informaci\u00f3n pueden permitir a los atacantes centrarse en problemas espec\u00edficos que afecten al producto y la versi\u00f3n en uso.
pscanbeta.inpagebanner.name = Fuga de informaci\u00f3n en el Banner de la P\u00e1gina
pscanbeta.inpagebanner.other = Existe la posibilidad de que lo encontrado est\u00e9 en un valor en los headers, en lugar de en la cadena que coincide en el cuerpo de la respuesta.
pscanbeta.inpagebanner.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/
pscanbeta.inpagebanner.soln = Configura el servidor para evitar este tipo de fugas de informaci\u00f3n. Por ejemplo\:\nEn Tomcat, esto se hace mediante la directiva "server" y la implementaci\u00f3n de p\u00e1ginas de error personalizadas.\nEn Apache, esto se hace mediante las directivas "ServerSignature" y "ServerTokens".

pscanbeta.jsfunction.desc = Parece que se est\u00e1 utilizando una funci\u00f3n JS peligrosa que podr\u00eda hacer que el sitio sea vulnerable.
pscanbeta.jsfunction.name = Funciones Peligrosas JS
pscanbeta.jsfunction.refs = https\://angular.io/guide/security
pscanbeta.jsfunction.soln = Consulta las referencias para obtener consejos de seguridad sobre el uso de estas funciones.

pscanbeta.jso.desc = Parece que se est\u00e1 utilizando serializaci\u00f3n de Java. Si no se valida correctamente, un atacante puede enviar un objeto especialmente dise\u00f1ado. Esto es muy peligroso ya que puede provocar "ejecuci\u00f3n remota de c\u00f3digo". Se ha detectado una secuencia m\u00e1gica que identifica JSO (Base64\: rO0AB, Raw\: 0xac, 0xed, 0x00, 0x05).
pscanbeta.jso.name = Objeto de serializaci\u00f3n de Java
pscanbeta.jso.refs = https\://www.oracle.com/java/technologies/javase/seccodeguide.html\#8
pscanbeta.jso.soln = La deserializaci\u00f3n de datos que no son de confianza es intr\u00ednsecamente peligrosa y debe evitarse.

pscanbeta.name = Reglas de Escaneo Pasivas - beta.

pscanbeta.nonstorable.desc = El contenido de la respuesta no se puede almacenar en cach\u00e9 mediante componentes como servidores proxy. Si la respuesta no contiene informaci\u00f3n confidencial, personal o espec\u00edfica del usuario, puede ser una ventaja almacenarla y guardarla en cach\u00e9 para mejorar el rendimiento.
pscanbeta.nonstorable.name = Contenido No-Almacenable
pscanbeta.nonstorable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.nonstorable.soln = El contenido puede marcarse como almacenable asegur\u00e1ndose de que se cumplan las siguientes condiciones\:\nLa cach\u00e9 debe comprender el m\u00e9todo de solicitud y definirlo como almacenable en cach\u00e9 ("GET", "HEAD" y "POST" est\u00e1n definidos actualmente como almacenables en cach\u00e9)\nEl c\u00f3digo de estado de respuesta debe ser comprendido por la cach\u00e9 (una de las clases de respuesta 1XX, 2XX, 3XX, 4XX o 5XX se entienden generalmente)\nLa directiva de cach\u00e9 "no-store" no debe aparecer en los campos de encabezado de solicitud o respuesta\nPara el almacenamiento en cach\u00e9 mediante cach\u00e9s "compartidas", como los cach\u00e9s "proxy", la directiva de respuesta "private" no debe aparecer en la respuesta\nPara el almacenamiento en cach\u00e9 mediante cach\u00e9s "compartidas", como los cach\u00e9s "proxy", el campo de encabezado "Authorization" no debe aparecer en la solicitud, a menos que la respuesta lo permita expl\u00edcitamente (utilizando una de las directivas de respuesta "must-revalidate", "public" o "s-maxage" de Cache-Control)\nAdem\u00e1s de las condiciones anteriores, se debe cumplir al menos una de las siguientes condiciones\: Tambi\u00e9n debe cumplirse con la respuesta\:\nDebe contener un campo de encabezado "Expires"\nDebe contener una directiva de respuesta "max-age"\nPara cach\u00e9s "compartidas", como cach\u00e9s "proxy", debe contener una directiva de respuesta "s-maxage"\nDebe contener una "Extensi\u00f3n de control de cach\u00e9" que permita almacenarlo en cach\u00e9\nDebe tener un c\u00f3digo de estado que est\u00e9 definido como almacenable en cach\u00e9 de manera predeterminada (200, 203, 204, 206, 300, 301, 404, 405, 410, 414, 501).

pscanbeta.payloader.desc = Proporciona soporte para los payloads personalizados en las reglas de escaneo.
pscanbeta.payloader.name = Reglas de Escaneo Pasivo Beta Cargas Personalizadas

pscanbeta.permissionspolicymissing.deprecated.desc = El encabezado ha sido renombrado a Permissions-Policy.
pscanbeta.permissionspolicymissing.deprecated.name = Conjunto de encabezados de pol\u00edticas de caracter\u00edsticas obsoletas
pscanbeta.permissionspolicymissing.deprecated.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://scotthelme.co.uk/goodbye-feature-policy-and-hello-permissions-policy/
pscanbeta.permissionspolicymissing.deprecated.soln = Aseg\u00farese de que su servidor web, servidor de aplicaciones, equilibrador de carga, etc. est\u00e1 configurado para establecer la cabecera Permissions-Policy en lugar de la cabecera Feature-Policy.
pscanbeta.permissionspolicymissing.desc = El encabezado de la pol\u00edtica de permisos es una capa adicional de seguridad que ayuda a restringir el acceso no autorizado o el uso de las caracter\u00edsticas del navegador/cliente por parte de los recursos web. Esta pol\u00edtica asegura la privacidad del usuario limitando o especificando las caracter\u00edsticas de los navegadores que pueden ser utilizadas por los recursos web. La pol\u00edtica de permisos proporciona un conjunto de cabeceras HTTP est\u00e1ndar que permiten a los propietarios de sitios web limitar qu\u00e9 funciones de los navegadores pueden ser utilizadas por la p\u00e1gina, como la c\u00e1mara, el micr\u00f3fono, la ubicaci\u00f3n, la pantalla completa, etc.
pscanbeta.permissionspolicymissing.name = Encabezado de pol\u00edtica de permisos no establecido
pscanbeta.permissionspolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://developer.chrome.com/blog/feature-policy/\nhttps\://scotthelme.co.uk/a-new-security-header-feature-policy/\nhttps\://w3c.github.io/webappsec-feature-policy/\nhttps\://www.smashingmagazine.com/2018/12/feature-policy/
pscanbeta.permissionspolicymissing.soln = Aseg\u00farate de que tu servidor web, servidor de aplicaciones, balanceador de carga, etc. est\u00e9n configurados para establecer el encabezado de Pol\u00edtica de Permisos.

pscanbeta.servletparameterpollution.desc = Acci\u00f3n de forma no especificada\: Ataque de anulaci\u00f3n de par\u00e1metros HTTP potencialmente posible. Este es un problema conocido con Java Servlets, pero otras plataformas tambi\u00e9n pueden ser vulnerables.
pscanbeta.servletparameterpollution.name = Anulaci\u00f3n de par\u00e1metros HTTP
pscanbeta.servletparameterpollution.refs = https\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf
pscanbeta.servletparameterpollution.soln = Todos los formularios deben especificar la URL de la acci\u00f3n.

pscanbeta.site-isolation.coep.desc = La cabecera Cross-Origin-Embedder-Policy es una cabecera de respuesta que impide que un documento cargue cualquier recurso cross-origin que no conceda expl\u00edcitamente permiso al documento (usando CORP o CORS).
pscanbeta.site-isolation.coep.name = Falta el encabezado Cross-Origin-Embedder-Policy o no es v\u00e1lido
pscanbeta.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.soln = Aseg\u00farese de que la aplicaci\u00f3n/servidor web establece el encabezado Cross-Origin-Embedder-Policy adecuadamente, y que establece el encabezado Cross-Origin-Embedder-Policy en 'require-corp' para los documentos.\nSi es posible, aseg\u00farese de que el usuario final utiliza un navegador web moderno y compatible con los est\u00e1ndares que admita el encabezado Cross-Origin-Embedder-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy).
pscanbeta.site-isolation.coop.desc = La cabecera Cross-Origin-Opener-Policy es una cabecera de respuesta que permite a un sitio controlar si otros documentos incluidos comparten el mismo contexto de navegaci\u00f3n. Compartir el mismo contexto de navegaci\u00f3n con documentos que no son de confianza puede provocar una fuga de datos.
pscanbeta.site-isolation.coop.name = Falta el encabezado Cross-Origin-Opener-Policy o no es v\u00e1lido
pscanbeta.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.soln = Aseg\u00farese de que la aplicaci\u00f3n/servidor web establece la cabecera Cross-Origin-Opener-Policy adecuadamente, y que establece la cabecera Cross-Origin-Opener-Policy en 'same-origin' para los documentos.\n "same-origin-allow-popups" se considera menos seguro y debe evitarse.\nSi es posible, aseg\u00farese de que el usuario final utiliza un navegador web moderno y conforme con los est\u00e1ndares que admita el encabezado Cross-Origin-Opener-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy).
pscanbeta.site-isolation.corp.desc = El encabezado Cross-Origin-Resource-Policy es un encabezado opt-in dise\u00f1ado para contrarrestar ataques de canales laterales como Spectre. Los recursos deben configurarse espec\u00edficamente como compartibles entre diferentes or\u00edgenes.
pscanbeta.site-isolation.corp.name = Falta el encabezado Cross-Origin-Resource-Policy o no es v\u00e1lido
pscanbeta.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Cross-Origin_Resource_Policy
pscanbeta.site-isolation.corp.soln = Aseg\u00farese de que la aplicaci\u00f3n/servidor web establece el encabezado Cross-Origin-Resource-Policy adecuadamente, y que establece el encabezado Cross-Origin-Resource-Policy en 'same-origin' para todas las p\u00e1ginas web.\n'same-site' se considera menos seguro y debe evitarse.Si es necesario compartir recursos, defina el encabezado como "cross-origin". Si es posible, aseg\u00farese de que el usuario final utiliza un navegador web moderno y compatible con los est\u00e1ndares que admita el encabezado Cross-Origin-Resource-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy).
pscanbeta.site-isolation.name = Aislamiento insuficiente del sitio contra la vulnerabilidad Spectre

pscanbeta.sourcecodedisclosure.desc = El c\u00f3digo fuente de la aplicaci\u00f3n fue revelado por el servidor web.
pscanbeta.sourcecodedisclosure.name = Revelaci\u00f3n de c\u00f3digo fuente
pscanbeta.sourcecodedisclosure.refs = https\://www.wsj.com/articles/BL-CIOB-2999
pscanbeta.sourcecodedisclosure.soln = Aseg\u00farese de que el C\u00f3digo Fuente de la aplicaci\u00f3n no est\u00e1 disponible con extensiones alternativas, y aseg\u00farese de que el c\u00f3digo fuente no est\u00e1 presente dentro de otros archivos o datos desplegados en el servidor web, o servidos por el servidor web.

pscanbeta.sri-integrity.desc = Falta el atributo de integridad en una etiqueta de script o enlace servida por un servidor externo. La etiqueta de integridad evita que un atacante que haya obtenido acceso a este servidor inyecte un contenido malicioso.
pscanbeta.sri-integrity.name = Falta atributo de integridad de recursos secundarios
pscanbeta.sri-integrity.otherinfo = El siguiente hash fue calculado (usando codificaci\u00f3n base64 de la salida del algoritmo hash\: SHA-384) para el script en cuesti\u00f3n {0}
pscanbeta.sri-integrity.refs = https\://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity
pscanbeta.sri-integrity.soln = Proporcionar un atributo de integridad v\u00e1lido a la etiqueta.

pscanbeta.storabilitycacheability.name = Capacidad de Almacenamiento en Cach\u00e9 de Contenido

pscanbeta.storablecacheable.desc = Los componentes de almacenamiento en cach\u00e9, como los servidores proxy, pueden almacenar el contenido de las respuestas y estos pueden recuperarlo directamente de la cach\u00e9, en lugar de recuperarlo del servidor de origen, en respuesta a solicitudes similares de otros usuarios. Si los datos de respuesta son confidenciales, personales o espec\u00edficos del usuario, esto puede provocar que se filtre informaci\u00f3n confidencial. En algunos casos, esto puede incluso provocar que un usuario obtenga el control total de la sesi\u00f3n de otro usuario, seg\u00fan la configuraci\u00f3n de los componentes de almacenamiento en cach\u00e9 que se utilicen en su entorno. Este es principalmente un problema en los casos en que se configuran servidores de almacenamiento en cach\u00e9 "compartidos", como los "proxy" cache, en la red local. Esta configuraci\u00f3n se encuentra normalmente en entornos corporativos o educativos, por ejemplo.
pscanbeta.storablecacheable.name = Contenido Cacheable y Almacenable
pscanbeta.storablecacheable.otherinfo.liberallifetimeheuristic = En ausencia de una directiva de duraci\u00f3n de almacenamiento en cach\u00e9 expl\u00edcitamente especificada en la respuesta, se asumi\u00f3 una heur\u00edstica de duraci\u00f3n liberal de 1 a\u00f1o. Esto est\u00e1 permitido por rfc7234.
pscanbeta.storablecacheable.otherinfo.staleretrievenotblocked = La respuesta est\u00e1 obsoleta, y las respuestas obsoletas no est\u00e1n configuradas para ser revalidadas o bloqueadas, mediante las directivas de respuesta 'Cache-Control' 'must-revalidate', 'proxy-revalidate', 's-maxage' o 'max-age'.
pscanbeta.storablecacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.storablecacheable.soln = Valida que la respuesta no contenga informaci\u00f3n confidencial, personal o espec\u00edfica del usuario. Si es as\u00ed, considere el uso de los siguientes encabezados de respuesta HTTP para limitar o evitar que otro usuario almacene y recupere el contenido de la memoria cach\u00e9\:\nCache-Control\: no-cache, no-store, must-revalidate, private\nPragma\: no-cache\nExpires\: 0\nEsta configuraci\u00f3n indica a los servidores de almacenamiento en cach\u00e9 compatibles con HTTP 1.0 y HTTP 1.1 que no almacenen la respuesta ni la recuperen (sin validaci\u00f3n) de la memoria cach\u00e9 en respuesta a una solicitud similar.

pscanbeta.storablenoncacheable.desc = El contenido de la respuesta se puede almacenar mediante componentes de almacenamiento en cach\u00e9, como servidores proxy, pero no se recuperar\u00e1 directamente del cach\u00e9, sin validar la solicitud en sentido ascendente, en respuesta a solicitudes similares de otros usuarios.
pscanbeta.storablenoncacheable.name = Contenido Almacenable pero No-Cacheable
pscanbeta.storablenoncacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
