#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=\u09a8\u09bf\u09b7\u09cd\u0995\u09cd\u09b0\u09c0\u09df\u09ad\u09be\u09ac\u09c7 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09b0 \u09a8\u09bf\u09df\u09ae-\u09ac\u09c7\u099f\u09be 

pscanbeta.authenticationcredentialscaptured.name=\u0985\u09a8\u09c1\u09ae\u09cb\u09a6\u09a8\u09c7\u09b0 \u09aa\u09b0\u09bf\u099a\u09df\u09aa\u09a4\u09cd\u09b0 \u09ac\u09a8\u09cd\u09a6\u09bf\u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7\u0964
pscanbeta.authenticationcredentialscaptured.desc=\u098f\u0995\u099f\u09bf \u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a8 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09be \u09b9\u099a\u09cd\u099b\u09c7\u0964\u098f\u099f\u09c0 \u098f\u0995\u099c\u09a8 \u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0\u0995\u09c7 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09be\u09b0\u09c0\u09b0 \u0986\u0987\u09a1\u09bf ,\u0997\u09cb\u09aa\u09a8\u09b8\u0982\u0995\u09c7\u09a4 \u09a6\u09bf\u09df\u09c7 \u09a8\u09c7\u099f\u0993\u09df\u09be\u09b0\u09cd\u0995 \u098f \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09a6\u09c7\u09df\u0964\u09aa\u09cd\u09b0\u09be\u09a5\u09ae\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0 \u09a8\u09c7\u099f\u0993\u09df\u09be\u09b0\u09cd\u0995 \u099f\u09cd\u09b0\u09be\u09ab\u09bf\u0995\u09c7\n\u099a\u09cb\u0996 \u09b0\u09be\u0996\u09c7 \u098f\u0995\u099f\u09bf \u09aa\u09cd\u09b0\u09be\u09a5\u09ae\u09bf\u0995 \u09b6\u09a8\u09be\u0995\u09cd\u09a4 \u0985\u09a8\u09c1\u09b0\u09cb\u09a7 \u09aa\u09be\u0993\u09df\u09be\u09b0 \u0986\u0997 \u09aa\u09b0\u09cd\u09af\u09a8\u09cd\u09a4 \u098f\u09ac\u0982 \u098f\u09b0\u09aa\u09b0 \u09ac\u09c7\u099c64 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0 \u09a8\u09be\u09ae \u0993 \u0997\u09cb\u09aa\u09a8 \u09b8\u0982\u0995\u09c7\u09a4 \u09ad\u09c7\u0999\u09cd\u0997\u09c7 \u09ab\u09c7\u09b2\u09c7\u0964 \u09aa\u09b0\u09bf\u09aa\u0995\u09cd\u0995\u09ad\u09be\u09ac\u09c7 \u09b6\u09a8\u09be\u0995\u09cd\u09a4 \u0995\u09b0\u09a4\u09c7 \u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0 \u09b8\u09ae\u09cd\u09ad\u09ac\u09a4 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0 \u09a8\u09be\u09ae \u0993 \u0997\u09cb\u09aa\u09a8 \u09b8\u0982\u0995\u09c7\u09a4 \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09b9\u09df,\u09af\u09a6\u09bf \u09b9\u09cd\u09af\u09be\u09b6(nonce \u09b8\u09b9) \u09b8\u09ab\u09b2\u09ad\u09be\u09ac\u09c7 \u0995\u09b0\u09cd\u0995\u09b6 \u0995\u09b0\u09be \u09b9\u09df \u0985\u09a5\u09ac\u09be \u09af\u09a6\u09bf \u09ae\u09cd\u09af\u09be\u09a8-\u0987\u09a8-\u09a6\u09cd\u09af-\u09ae\u09bf\u09a1\u09bf\u09b2 \u0986\u0995\u09cd\u09b0\u09ae\u09a3\u099f\u09bf \u09ae\u09be\u0989\u09a8\u09cd\u099f \u0995\u09b0\u09be \u09b9\u09af\u09bc\u0964
pscanbeta.authenticationcredentialscaptured.soln=HTTPS \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8, \u098f\u09ac\u0982 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8  \u09af\u09be \u098f\u0995\u099f\u09bf \u0987\u0989\u09a8\u09bf\u0995-\u098f\u09a8\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f\u09c7\u09a1 \u09ab\u09cd\u09af\u09be\u09b6\u09a8 \u0987\u0989\u099c\u09be\u09b0 \u0986\u0987\u09a1\u09bf \u09ac\u09be \u09aa\u09be\u09b8\u0993\u09af\u09bc\u09be\u09b0\u09cd\u09a1 \u09aa\u09cd\u09b0\u09c7\u09b0\u09a3 \u0995\u09b0\u09c7 \u09a8\u09be . 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication\n
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}][{1}] \u0985\u09b8\u09c1\u09b0\u0995\u09cd\u09b7\u09bf\u09a4 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be [{2}] \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0 \u09a8\u09be\u09ae [{3}] \u098f\u09ac\u0982 \u09aa\u09be\u09b8\u0993\u09df\u09be\u09b0\u09cd\u09a1 \u09aa\u09cd\u09b0\u0995\u09be\u09b6 [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=\u0985\u09b8\u09c1\u09b0\u0995\u09cd\u09b7\u09bf\u09a4 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0  \u09a8\u09be\u09ae \u098f\u09ac\u0982  \u0985\u09a4\u09bf\u09b0\u09bf\u0995\u09cd\u09a4 \u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6\u0964
pscanbeta.authenticationcredentialscaptured.alert.attack=\u09a8\u09c7\u099f\u0993\u09af\u09bc\u09be\u09b0\u09cd\u0995 \u0986\u0995\u09cd\u09b0\u09ae\u09a3\u0995\u09be\u09b0\u09c0\u09b0\u09be \u0986\u09a1\u09bc\u09bf \u09aa\u09c7\u09a4\u09c7 \u09b6\u09cb\u09a8\u09c7 \u098f\u0995\u099f\u09bf \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09b8\u09ae\u09cd\u09aa\u09a8\u09cd\u09a8 \u09a8\u09be \u09b9\u0993\u09af\u09bc\u09be \u09aa\u09b0\u09cd\u09af\u09a8\u09cd\u09a4\u0964

pscanbeta.charsetmismatch.name=\u09ac\u09b0\u09cd\u09a3\u09ae\u09be\u09b2\u09be \u09ae\u09bf\u09b2 \u09a8\u09c7\u0987
pscanbeta.charsetmismatch.variant.no_mismatch_metacontenttype_missing=(\u09ae\u09c7\u099f\u09be \u09a8\u09bf\u0996\u09cb\u0981\u099c \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1\u09b0 \u09a7\u09b0\u09a8 \u09ac\u09b0\u09cd\u09a3\u09ae\u09be\u09b2\u09be)
pscanbeta.charsetmismatch.variant.header_metacontentype_mismatch=(\u09b9\u09c7\u09a1\u09be\u09b0 \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1-\u099f\u09be\u0987\u09aa \u0985\u0995\u09cd\u09b7\u09b0)
pscanbeta.charsetmismatch.variant.header_metacharset_mismatch=(\u09b9\u09c7\u09a1\u09be\u09b0 \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be)
pscanbeta.charsetmismatch.variant.metacontenttype_metacharset_mismatch=(\u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be  \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1-\u099f\u09be\u0987\u09aa \u0985\u0995\u09cd\u09b7\u09b0)
pscanbeta.charsetmismatch.desc=\u098f\u0987 \u099a\u09c7\u0995 \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09b8\u09a8\u09be\u0995\u09cd\u09a4 \u0995\u09b0\u09c7 \u09af\u09c7\u0996\u09be\u09a8\u09c7 HTTP \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1-\u099f\u09be\u0987\u09aa \u09b9\u09cd\u09af\u09be\u09a8\u09cd\u09a1\u09be\u09b0\u09cd\u09b8 \u0985\u0995\u09cd\u09b7\u09b0 \u09a5\u09c7\u0995\u09c7 \u09ac\u09b0\u09cd\u09a3\u09ae\u09be\u09b2\u09be \u09aa\u09c3\u09a5\u0995 \u0995\u09b0\u09c7 \u098f\u0995\u099f\u09bf \u09ac\u09b0\u09cd\u09a3\u099a\u09bf\u09b9\u09cd\u09a8 \u0998\u09cb\u09b7\u09a3\u09be \u0995\u09b0\u09c7 \u09af\u09be \u098f\u0987\u099a\u099f\u09bf\u098f\u09ae\u098f\u09b2 \u09ac\u09be \u098f\u0995\u09cd\u09b8\u098f\u09ae\u098f\u09b2 \u09b6\u09b0\u09c0\u09b0 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b8\u0982\u099c\u09cd\u099e\u09be\u09af\u09bc\u09bf\u09a4\u0964\u09af\u0996\u09a8 HTTP \u09b6\u09bf\u09b0\u09cb\u09b2\u09c7\u0996 \u098f\u09ac\u0982 \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1\u09b0 \u09b6\u09b0\u09c0\u09b0\u09c7\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u098f\u0995\u099f\u09bf \u09ac\u09b0\u09cd\u09a3\u099a\u09bf\u09b9\u09cd\u09a8  \u09b9\u09be\u09b0\u09be\u09df \u09a4\u0996\u09a8  \u0993\u09af\u09bc\u09c7\u09ac \u09ac\u09cd\u09b0\u09be\u0989\u099c\u09be\u09b0\u0997\u09c1\u09b2\u09bf \u098f\u0995\u099f\u09bf \u0985\u09ac\u09be\u099e\u09cd\u099b\u09bf\u09a4 \u09b8\u09be\u09ae\u0997\u09cd\u09b0\u09c0-\u09b8\u09cd\u09a8\u09bf\u0982\u09af\u09bc\u09c7\u09b0 \u09ae\u09cb\u09a1\u09c7 \u09ac\u09be\u09a7\u09cd\u09af \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1  \u098f\u09b0 \u09b8\u09a0\u09bf\u0995 \u0985\u0995\u09cd\u09b7\u09b0 \u09b8\u09c7\u099f \u09a8\u09bf\u09b0\u09cd\u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 
pscanbeta.charsetmismatch.soln=Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u099f\u09cd\u09af\u09be\u0997 \u098f\u0987\u099a\u099f\u09bf\u098f\u09ae\u098f\u09b2 \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u0985\u09a5\u09ac\u09be \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be \u098f\u0995\u09cd\u09b8\u098f\u09ae\u098f\u09b2 \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7  \u09b8\u0995\u09b2 \u09b2\u09c7\u0996\u09be\u09b0 \u09ac\u09b8\u09cd\u09a4\u09c1\u0995\u09c7 UTF-8 \u09ac\u09be\u09a7\u09cd\u09af \u0995\u09b0\u09c7\u0964
pscanbeta.charsetmismatch.exploit=\u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0 \u09a4\u09be\u09a6\u09c7\u09b0 \u09aa\u099b\u09a8\u09cd\u09a6 \u09b8\u0999\u09cd\u0995\u09c7\u09a4\u09be\u09af\u09bc\u09a8 \u0995\u09b0\u09c7 \u09ac\u09cd\u09af\u09be\u0996\u09cd\u09af\u09be \u0995\u09b0\u09a4\u09c7 \u098f\u0987 \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09b0 \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1 \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 \u09af\u09c7\u09ae\u09a8, \u09af\u09a6\u09bf \u0986\u0995\u09cd\u09b0\u09ae\u09a8\u0995\u09be\u09b0\u09c0/\u09a6\u09c7\u09b0 \u09aa\u09cd\u09b0\u09a5\u09ae \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09b0 \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1 \u09a8\u09bf\u09af\u09bc\u09a8\u09cd\u09a4\u09cd\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8,   UTF-7 \u098f\u09a8\u0995\u09cb\u09a1 \u0995\u09b0\u09be \u09aa\u09be\u09a0 \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7  \u09a4\u09be\u09b0\u09be  \u0989\u09a6\u09cd\u09ac\u09c1\u09a6\u09cd\u09a7 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u098f\u09ac\u0982  \u0995\u09bf\u099b\u09c1 \u09ac\u09cd\u09b0\u09be\u0989\u099c\u09be\u09b0 \u09af\u09c7  \u09a8\u09bf\u09aa\u09c1\u09a8\u09ad\u09be\u09ac\u09c7 \u099f\u09c7\u0995\u09cd\u09b8\u099f \u09ac\u09cd\u09af\u09be\u0996\u09cd\u09af\u09be \u0995\u09b0\u09a4\u09c7\u0964
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing=\u0985\u0995\u09cd\u09b7\u09b0\u099f\u09bf \u0995\u09c7\u09ac\u09b2\u09ae\u09be\u09a4\u09cd\u09b0 \u09ae\u09c7\u099f\u09be \u0985\u0995\u09cd\u09b7\u09b0\u09c7\u09b0 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b8\u0982\u099c\u09cd\u099e\u09be\u09af\u09bc\u09bf\u09a4 \u0995\u09b0\u09be \u09b9\u09af\u09bc, \u09aa\u09c1\u09b0\u09cb\u09a8\u09cb \u0995\u09cd\u09b2\u09be\u09af\u09bc\u09c7\u09a8\u09cd\u099f\u0997\u09c1\u09b2\u09bf \u09af\u09be \u09ae\u09c7\u099f\u09be \u0995\u09a8\u099f\u09c7\u09a8\u09cd\u099f-\u099f\u09be\u0987\u09ae \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ac\u09b0\u09cd\u09a3\u09bf\u09a4 \u0985\u0995\u09cd\u09b7\u09b0\u09c7\u09b0 \u09b8\u09c7\u099f\u099f\u09bf \u09b8\u09a0\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8  \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u09a8\u09be\u0964
pscanbeta.charsetmismatch.extrainfo.html.header_metacontentype_mismatch=HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 META \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1  \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u098f\u0995\u099f\u09bf \u09ac\u09b0\u09cd\u09a3\u099a\u09bf\u09b9\u09cd\u09a8 \u09ac\u09bf\u099c\u09a1\u09bc\u09bf\u09a4 \u099b\u09bf\u09b2 - \u099f\u09be\u0987\u09aa \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a3\u09be\u09df \u098f\u09ac\u0982 \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf \u0964
pscanbeta.charsetmismatch.extrainfo.html.header_metacharset_mismatch=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be\u09b0 \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf\u0964
pscanbeta.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1  \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf\u0964
pscanbeta.charsetmismatch.extrainfo.xml=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u098f\u0995\u09cd\u09b8\u098f\u09ae\u098f\u09b2 \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf

pscanbeta.cookielooselyscoped.name=\u09b8\u09cd\u09ac\u09be\u09a7\u09c0\u09a8\u09ad\u09be\u09ac\u09c7 \u0995\u09c1\u0995\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df
pscanbeta.cookielooselyscoped.desc=\u0995\u09c1\u0995\u09bf\u099c \u09a1\u09cb\u09ae\u09c7\u09a8 \u09ac\u09be \u09aa\u09a5 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4  \u0995\u09b0\u09be \u09af\u09c7\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 \u0964 \u098f\u0987 \u099a\u09c7\u0995 \u09b6\u09c1\u09a7\u09c1\u09ae\u09be\u09a4\u09cd\u09b0 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ac\u09cd\u09af\u09aa\u09cd\u09a4\u09bf\u09b0  \u09b8\u0999\u09cd\u0997\u09c7 \u09b8\u0982\u09b6\u09cd\u09b2\u09bf\u09b7\u09cd\u099f\u0964 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4\u09bf \u0986\u09ac\u09c7\u09a6\u09a8 \u0995\u09b0\u09be \u09b9\u09df \u098f\u0995\u099f\u09bf \u0995\u09c1\u0995\u09bf \u09a8\u09bf\u09b0\u09cd\u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 \u09af\u09be  \u09a1\u09cb\u09ae\u09c7\u09a8\u09c7 \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u0989\u09a6\u09be\u09b9\u09b0\u09a3\u09b8\u09cd\u09ac\u09b0\u09c2\u09aa, \u098f\u0995\u099f\u09bf \u0995\u09c1\u0995\u09bf \u0995\u09a0\u09cb\u09b0\u09ad\u09be\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u09b8\u09be\u09ac\u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7  \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u0995\u09b0\u09be  \u09af\u09be\u09ac\u09c7 \u09af\u09c7\u09ae\u09a8 www.nottrusted.com \u0985\u09a5\u09ac\u09be \u09b8\u09cd\u09ac\u09be\u09ad\u09be\u09ac\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u09af\u09c7\u09ae\u09a8 nottrusted.com \u0964\u09aa\u09b0\u09c7\u09b0\u099f\u09bf\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 nottrusted.com \u098f\u09b0 \u0995\u09cb\u09a8\u09cb  \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u09a7\u09c0\u09b0\u09c7 \u09a7\u09c0\u09b0\u09c7 \u0995\u09c1\u0995\u09bf\u0997\u09c1\u09b2\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4\u09bf\u0995\u09b0\u09be\u09a8\u09cb \u09b8\u09be\u09a7\u09be\u09b0\u09a8  \u09ae\u09c7\u0997\u09be-\u0985\u09cd\u09af\u09be\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8\u09c7 \u09af\u09c7\u09ae\u09a8 google.com \u098f\u09ac\u0982 live.com l \u0995\u09c1\u0995\u09bf\u099c \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df \u098f\u0995\u099f\u09bf \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u098f \u09af\u09c7\u09ae\u09a8 like.foo.bar \u09af\u09be \u09b6\u09c1\u09a7\u09c1\u09ae\u09be\u09a4\u09cd\u09b0 \u09ac\u09cd\u09b0\u09be\u0989\u099c\u09be\u09b0 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u0986\u09a6\u09be\u09a8 \u09aa\u09cd\u09b0\u09a6\u09be\u09a8 \u09b9\u09df\u0964\u09af\u09be\u0987 \u09b9\u09cb\u0995,\u0995\u09c1\u0995\u09bf \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995\u098f\u09b0 \u09ae\u09a4\u09cb \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df \u09af\u09be \u09b9\u09df\u09a4\u09cb \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995 \u0995\u09c7\u0987 \u09a6\u09c7\u09df\u09be \u0985\u09a5\u09ac\u09be \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995\u09c7\u09b0 \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u0995\u09c7\u0964
pscanbeta.cookielooselyscoped.soln=\u09b8\u09ac\u09b8\u09ae\u09af\u09bc \u0995\u09c1\u0995\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df \u098f\u0995\u099f\u09bf FQDN (\u09aa\u09c1\u09b0\u09cb\u09aa\u09c1\u09b0\u09bf \u09af\u09cb\u0997\u09cd\u09af \u09a1\u09cb\u09ae\u09c7\u09a8 \u09a8\u09be\u09ae) \u098f
pscanbeta.cookielooselyscoped.refs=https\://tools.ietf.org/html/rfc6265\#section-4.1 https\://www.owasp.org/index.php/Testing_for_cookies_attributes _(OTG-SESS-002) http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=\u09a4\u09c1\u09b2\u09a8\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u09ae\u09c2\u09b2 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u099f\u09be \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09c3\u09a4 \u09b9\u09df\u09c7\u099b\u09bf\u09b2 {0}{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0\u0981}\n

pscanbeta.informationdisclosuredebugerrors.name=\u09a4\u09cd\u09b0\u09c1\u099f\u09bf\u09af\u09c1\u0995\u09cd\u09a4 \u09ac\u09be\u09b0\u09cd\u09a4\u09be\u09df \u09ad\u09c1\u09b2 \u0996\u09c1\u099c\u09a4\u09c7-\u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09df\u0964
pscanbeta.informationdisclosuredebugerrors.desc=\u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be\u09df \u09b8\u09be\u09a7\u09be\u09b0\u09a3 \u09a4\u09cd\u09b0\u09c1\u099f\u09bf \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09a8\u09bf\u09df\u09c7 \u09b9\u09be\u099c\u09bf\u09b0  \u09b9\u09df  \u09af\u09be \u0985\u09cd\u09af\u09be\u09aa\u09be\u099a\u09bf\u098f\u09b0 \u09ae\u09a4\u09cb \u09aa\u09cd\u09b2\u09cd\u09af\u09be\u099f\u09ab\u09b0\u09cd\u09ae \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ab\u09bf\u09b0\u09c7 \u0986\u09b8\u09c7 \u09af\u09c7\u09ae\u09a8  ASP.NET \u098f\u09ac\u0982 \u0993\u09af\u09bc\u09c7\u09ac \u09b8\u09be\u09b0\u09cd\u09ad\u09be\u09b0 ,\u0986\u0987\u0986\u0987\u098f\u09b8\u0964
pscanbeta.informationdisclosuredebugerrors.soln=\u0989\u09a4\u09cd\u09aa\u09be\u09a6\u09a8 \u0995\u09b0\u09be\u09b0 \u0986\u0997\u09c7  \u09a1\u09bf\u09ac\u09be\u0997\u09bf\u0982 \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09a8\u09bf\u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09df \u0995\u09b0\u09c1\u09a8\u0964

pscanbeta.informationdisclosureinurl.name=\u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09af\u09bc-\u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af url \u098f 
pscanbeta.informationdisclosureinurl.desc=Url \u098f\u09a7\u09be\u09b0\u09a8\u0995\u09c3\u09a4 \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u09ab\u09be\u09b8 \u0995\u09b0\u09a4\u09c7 \u0985\u09a8\u09c1\u09b0\u09cb\u09a7\u099f\u09bf \u0995\u09b0\u09be \u09b9\u09df \u0964\u098f\u099f\u09bf PCI \u098f\u09ac\u0982  \u09b8\u09be\u0982\u0997\u09a0\u09a8\u09bf\u0995 \u09b8\u09ae\u09cd\u09ae\u09a4\u09bf \u09a8\u09c0\u09a4\u09bf \u09b2\u0999\u09cd\u0998\u09a8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u0986\u09aa\u09a8\u09bf \u09b8\u09cd\u099f\u09cd\u09b0\u09bf\u0982 \u09a4\u09be\u09b2\u09bf\u0995\u09be \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u0985\u09a5\u09ac\u09be \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ae\u09be\u09a8 \u09ae\u09c1\u099b\u09c7 \u09ab\u09c7\u09b2\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964
pscanbeta.informationdisclosureinurl.otherinfo.sensitiveinfo=Url-\u099f\u09bf \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u09b8\u09cd\u09aa\u09b0\u09cd\u09b6\u0995\u09be\u09a4\u09b0 \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanbeta.informationdisclosureinurl.otherinfo.cc=Url-\u099f\u09bf \u0995\u09cd\u09b0\u09c7\u09a1\u09bf\u099f \u0995\u09be\u09b0\u09cd\u09a1\u09c7\u09b0 \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 \u09a6\u09c7\u0996\u09be \u09af\u09be\u09df\u0964
pscanbeta.informationdisclosureinurl.otherinfo.email=Url-\u099f\u09bf \u0987-\u09ae\u09c7\u0987\u09b2 \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanbeta.informationdisclosureinurl.otherinfo.ssn=Url-\u099f\u09bf  \u09ae\u09a8\u09c7 \u09b9\u09af\u09bc \u0986\u09ae\u09be\u09a6\u09c7\u09b0 \u09b8\u09be\u09ae\u09be\u099c\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be\u09b0 \u09b8\u0982\u0996\u09cd\u09af\u09be\u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7
pscanbeta.informationdisclosureinurl.soln=URIs \u098f \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u098f\u09b0\u09bf\u0993\u09a8\u09be\u0964

pscanbeta.informationdisclosurereferrerscanner.name=\u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09af\u09bc-\u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae\u09c7
pscanbeta.informationdisclosurereferrerscanner.desc=HTTP \u09b6\u09bf\u09b0\u09cb\u09b2\u09c7\u0996\u099f\u09bf \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u09b8\u09cd\u09aa\u09b0\u09cd\u09b6\u0995\u09be\u09a4\u09b0 \u09aa\u09cd\u09af\u09be\u09b0\u09be\u09ae\u09bf\u099f\u09be\u09b0 \u0986\u09b0\u09c7\u0995\u099f\u09bf \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ab\u09be\u0981\u09b8 \u0995\u09b0\u09c7 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 \u09aa\u09bf\u09b8\u09bf\u0986\u0987 \u0993 \u0985\u09a8\u09cd\u09af\u09a4\u09ae \u09b8\u09be\u0982\u0997\u09a0\u09a8\u09bf\u0995 \u0995\u09ae\u09aa\u09cd\u09b2\u09be\u09af\u09bc\u09c7\u09a8\u09cd\u09b8 \u09a8\u09c0\u09a4\u09bf \u09ad\u0999\u09cd\u0997 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964\u0964 \u0986\u09aa\u09a8\u09bf \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ae\u09be\u09a8 \u09af\u09cb\u0997 \u09ac\u09be \u0985\u09aa\u09b8\u09be\u09b0\u09a3 \u0995\u09b0\u09c7  \u098f\u0987 \u099a\u09c7\u0995 \u099c\u09a8\u09cd\u09af \u09b8\u09cd\u099f\u09cd\u09b0\u09bf\u0982 \u09a4\u09be\u09b2\u09bf\u0995\u09be \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u0964
pscanbeta.informationdisclosurereferrerscanner.otherinfo.sensitiveinfo=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanbeta.informationdisclosurereferrerscanner.otherinfo.cc=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u0995\u09cd\u09b0\u09c7\u09a1\u09bf\u099f \u0995\u09be\u09b0\u09cd\u09a1  \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanbeta.informationdisclosurereferrerscanner.otherinfo.email=\u0987-\u09ae\u09c7\u0987\u09b2 \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0\u09c7\u09b0  \u09ae\u09be\u09a0\u09c7 \u09b0\u09af\u09bc\u09c7\u099b\u09c7\u0964
pscanbeta.informationdisclosurereferrerscanner.otherinfo.ssn=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u0986\u09ae\u09be\u09a6\u09c7\u09b0 \u09b8\u09be\u09ae\u09be\u099c\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be\u09b0  \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanbeta.informationdisclosurereferrerscanner.soln=URIs \u098f \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u098f\u09b0\u09bf\u0993\u09a8\u09be\u0964

pscanbeta.informationdisclosuresuspiciouscomments.name=\u09b8\u09a8\u09cd\u09a6\u09c7\u09b9\u099c\u09a8\u0995 \u09ae\u09a8\u09cd\u09a4\u09ac\u09cd\u09af\u09c7- \u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09af\u09bc
pscanbeta.informationdisclosuresuspiciouscomments.desc=\u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09b8\u09a8\u09cd\u09a6\u09c7\u09b9\u099c\u09a8\u0995 \u09ae\u09a8\u09cd\u09a4\u09ac\u09cd\u09af \u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7\u099b\u09c7, \u09af\u09be \u098f\u0995\u099c\u09a8 \u0986\u0995\u09cd\u09b0\u09ae\u09a3\u0995\u09be\u09b0\u09c0\u0995\u09c7 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 
pscanbeta.informationdisclosuresuspiciouscomments.soln=\ \u09b8\u09ac \u09ae\u09a8\u09cd\u09a4\u09ac\u09cd\u09af \u09b8\u09b0\u09be\u09a8 \u09af\u09be \u098f\u09ae\u09a8 \u09a4\u09a5\u09cd\u09af \u09a6\u09c7\u09df \u09af\u09c7 \u098f\u099f\u09be \u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0\u0995\u09c7 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u098f\u09ac\u0982 \u09af\u09c7\u0995\u09cb\u09a8\u09cb \u099a\u09bf\u09a8\u09cd\u09b9\u09bf\u09a4 \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u09a0\u09bf\u0995 \u0995\u09b0\u09a4\u09c7\u09aa\u09be\u09b0\u09c7 \u09af\u09be \u09a4\u09be\u09b0\u09be \u09b0\u09c7\u09ab\u09be\u09b0 \u0995\u09b0\u09c7\u0964

pscanbeta.insecureauthentication.name=\u09a6\u09c1\u09b0\u09cd\u09ac\u09b2 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a3 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf
pscanbeta.insecureauthentication.desc=\u098f\u0995\u099f\u09bf \u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u09b8\u0982\u09af\u09cb\u0997\u09c7 HTTP \u09aa\u09cd\u09b0\u09be\u09a5\u09ae\u09bf\u0995 \u0985\u09a5\u09ac\u09be \u09aa\u09b0\u09bf\u09aa\u0995\u09cd\u0995 \u09b8\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a8 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09c3\u09a4 \u09b9\u09df\u09c7\u099b\u09bf\u09b2\u0964\u09aa\u09b0\u09bf\u099a\u09df \u09aa\u09a4\u09cd\u09b0\u0997\u09c1\u09b2\u09cb \u0995\u09c7\u0989 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u098f\u09ac\u0982 \u09aa\u09a1\u09bc\u09a4\u09c7  \u09aa\u09be\u09b0\u09ac\u09c7 \u098f\u0987 \u09a8\u09c7\u099f\u0993\u09df\u09be\u09b0\u09cd\u0995 \u098f \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u09a8\u09bf\u09df\u09c7\u0964
pscanbeta.insecureauthentication.soln=\ \u09b8\u0982\u09af\u09cb\u0997 \u09b0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09cb \u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u0985\u09a5\u09ac\u09be \u09b6\u0995\u09cd\u09a4\u09bf\u09b6\u09be\u09b2\u09c0 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a8 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=\u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6 JSF ViewState
pscanbeta.insecurejsfviewstate.desc=\u098f\u0987 URL \u099f\u09bf\u09b0 \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09df\u09be \u098f\u0995\u099f\u09bf viewstate \u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7 \u09af\u09be\u09b0 \u0995\u09cb\u09a8\u09cb \u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f\u09cb\u0997\u09cd\u09b0\u09be\u09ab\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be \u09a8\u09c7\u0987\u0964
pscanbeta.insecurejsfviewstate.soln=Viewstate \u0995\u09c7 \u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u0995\u09b0\u09cb Maac  \u098f\u09b0\u09b8\u09be\u09a5\u09c7 \u09af\u09be \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f\u0964
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] \u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6\u0964

pscanbeta.noanticsrftokens.name=\u0985\u09cd\u09af\u09be\u09a8\u09cd\u099f\u09bf-CSRF \u09a8\u09bf\u09a6\u09b0\u09cd\u09b6\u09a8\u09c7\u09b0 \u0985\u09ad\u09be\u09ac
pscanbeta.noanticsrftokens.desc=\u098f\u0995\u099f\u09bf \u098f\u0987\u099a\u099f\u09bf\u098f\u09ae\u098f\u09b2 \u09b8\u09be\u09ac\u09ae\u09bf\u09b6\u09a8 \u09ab\u09b0\u09ae\u09c7 \u0995\u09cb\u09a8 \u098f\u09a8\u09cd\u099f\u09bf-CSRF \u09aa\u09be\u0993\u09df\u09be \u09af\u09be\u09df \u09a8\u09bf\u0964
pscanbeta.noanticsrftokens.alert.extrainfo=\ \u09a8\u09bf\u099a\u09c7\u09b0 HTML \u09ab\u09b0\u09cd\u09ae\u09c7 \u0995\u09cb\u09a8\u09cb  \u098f\u09a8\u09cd\u099f\u09bf-CSRF \u099f\u09cb\u0995\u09c7\u09a8 \u09aa\u09be\u0993\u09df\u09be \u09af\u09be\u09df\u09a8\u09bf\u0964
pscanbeta.noanticsrftokens.extrainfo.annotation=\u098f\u099f\u09bf \u09b8\u09a4\u09b0\u09cd\u0995\u09c0\u0995\u09b0\u09a8\u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09af\u09be\u09b0 \u09ab\u09b0\u09cd\u09ae\u09c7 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be \u0987\u0999\u09cd\u0997\u09bf\u09a4 \u0986\u099b\u09c7 \u09af\u09be \u0987\u0999\u09cd\u0997\u09bf\u09a4 \u09a6\u09c7\u09af\u09bc \u09af\u09c7 \u098f\u099f\u09be\u09b0 \u0995\u09cb\u09a8\u09cb \u098f\u09a8\u09cd\u099f\u09bf-CSRF \u099f\u09cb\u0995\u09c7\u09a8\u09c7\u09b0 \u09a6\u09b0\u0995\u09be\u09b0 \u09a8\u09c7\u0987\u0964\u099f\u09bf\u0995\u09be\u099f\u09bf \u09b8\u09a0\u09bf\u0995 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u098f\u099f\u09bf \u09a8\u09bf\u099c\u09c7 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09be \u0989\u099a\u09bf\u09a4\u0964

pscanbeta.servletparameterpollutionscanner.name=HTTP \u09aa\u09cd\u09af\u09be\u09b0\u09be\u09ae\u09bf\u099f\u09be\u09b0 \u0993\u09ad\u09be\u09b0\u09b0\u09be\u0987\u09a1
pscanbeta.servletparameterpollutionscanner.desc=\u0985\u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ab\u09b0\u09cd\u09ae \u0995\u09b0\u09cd\u09ae\:HTTP \u09aa\u09cd\u09af\u09be\u09b0\u09be\u09ae\u09bf\u099f\u09be\u09b0 \u09b9\u09be\u09ae\u09b2\u09be\u09b0 \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af\u09a4\u09be \u0985\u0997\u09cd\u09b0\u09be\u09b9\u09cd\u09af \u0995\u09b0\u09be \u09b9\u09ac\u09cb\u0964\u098f\u099f\u09bf \u099c\u09be\u09ad\u09be\u09b0 \u098f\u0995\u099f\u09bf \u09aa\u09b0\u09bf\u099a\u09bf\u09a4 \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u0995\u09bf\u09a8\u09cd\u09a4\u09c1\n\u0985\u09a8\u09cd\u09af\u09be\u09a8\u09cd\u09af \u09aa\u09cd\u09b2\u09cd\u09af\u09be\u099f\u09ab\u09b0\u09cd\u09ae\u0993 \u099d\u09c1\u0981\u0995\u09bf\u09aa\u09c2\u09b0\u09cd\u09a3 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964
pscanbeta.servletparameterpollutionscanner.soln=\u09b8\u09ac \u09ab\u09b0\u09cd\u09ae\u0995\u09c7 \u0985\u09ac\u09b6\u09cd\u09af\u0987 URL action \u0989\u09b2\u09cd\u09b2\u09c7\u0996 \u0995\u09b0\u09a4\u09c7 \u09b9\u09ac\u09c7\u0964
pscanbeta.servletparameterpollutionscanner.refs=http\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf

pscanbeta.viewstatescanner.name=Viewstate \u09b8\u09cd\u0995\u09cd\u09af\u09be\u09a8\u09be\u09b0
pscanbeta.viewstatescanner.soln=\u09b8\u09b0\u09ac\u09b0\u09be\u09b9\u0995\u09c3\u09a4 \u09a4\u09a5\u09cd\u09af\u09c7\u09b0 \u0997\u09cb\u09aa\u09a8\u09c0\u09af\u09bc\u09a4\u09be \u09ac\u099c\u09be\u09af\u09bc \u0986\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09af\u09be\u099a\u09be\u0987 \u0995\u09b0\u09c1\u09a8\u0964
pscanbeta.viewstatescanner.oldver.name=\u09aa\u09c1\u09b0\u09a8\u09cb Asp.Net \u09b8\u0982\u09b8\u09cd\u0995\u09b0\u09a3 \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09be \u09b9\u099a\u09cd\u099b\u09c7
pscanbeta.viewstatescanner.oldver.desc=*** \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995 ***\n\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 \u09b8\u0982\u09b8\u09cd\u0995\u09b0\u09a3 1.0 \u09ac\u09be 1.1 \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanbeta.viewstatescanner.oldver.soln=\u09ac\u09cd\u09af\u09ac\u09b9\u09c3\u09a4 \u09ab\u09cd\u09b0\u09c7\u09ae\u0993\u09df\u09be\u09b0\u09cd\u0995 \u098f\u0996\u09a8\u0993 \u09ae\u09be\u0987\u0995\u09cd\u09b0\u09cb\u09b8\u09ab\u099f \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b8\u09ae\u09b0\u09cd\u09a5\u09bf\u09a4 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u09b9\u09df\u09c7 \u09a8\u09bf\u09a8\u0964
pscanbeta.viewstatescanner.nomac.unsure.name=MAC \u09b8\u09cd\u09ac\u09be\u0995\u09cd\u09b7\u09b0 \u099b\u09be\u09a1\u09bc\u09be Viewstate (\u0985\u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4)\u0964
pscanbeta.viewstatescanner.nomac.unsure.desc=*** \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995 ***\n\u0995\u09cb\u09a8\u0993 MAC \u099b\u09be\u09a1\u09bc\u09be\u0987 \u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanbeta.viewstatescanner.nomac.unsure.soln=\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u09c7\u09b0 \u09b8\u09ac \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09df MAC \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09c1\u09a8\u0964
pscanbeta.viewstatescanner.nomac.unsure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.nomac.sure.name=MAC \u09b8\u09cd\u09ac\u09be\u0995\u09cd\u09b7\u09b0 \u099b\u09be\u09a1\u09bc\u09be Viewstate (\u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4)\u0964
pscanbeta.viewstatescanner.nomac.sure.desc=*** \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995 ***\n\u0995\u09cb\u09a8\u0993 \u09ae\u09cd\u09af\u09be\u0995 \u099b\u09be\u09a1\u09bc\u09be\u0987 \u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanbeta.viewstatescanner.nomac.sure.soln=\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u09c7\u09b0 \u09b8\u09ac \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09df MAC \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09c1\u09a8\u0964
pscanbeta.viewstatescanner.nomac.sure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.split.name=\n\u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u09ad\u09be\u0997 \u09a6\u09c7\u0996\u09c1\u09a8
pscanbeta.viewstatescanner.split.desc=*** \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995 ***\n\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u098f\u09ac\u0982 \u098f\u09b0 \u09ae\u09c2\u09b2\u09cd\u09af \u09ac\u09bf\u09ad\u09bf\u09a8\u09cd\u09a8 \u0985\u0982\u09b6\u09c7 \u09ac\u09bf\u09ad\u0995\u09cd\u09a4\u0964
pscanbeta.viewstatescanner.split.soln=\u0995\u09cb\u09a8\u09cb\u099f\u09bf\u0987 \u09a8\u09be - \u09af\u09be\u09b0\u09be \u09b8\u09be\u09b0\u09cd\u09ad\u09be\u09b0 \u09aa\u09b0\u09bf\u099a\u09be\u09b2\u09a8\u09be \u0995\u09b0\u09c7\u09a8 \u09a4\u09be\u09b0\u09be \u09ae\u09a8\u09c7 \u09b9\u09df \u09b8\u09be\u09b0\u09cd\u09ad\u09be\u09b0 \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0\u09c7\u09b6\u09a8 \u099f\u09bf\u0989\u09a8 \u0995\u09b0\u09c7\u099b\u09c7\u09a8 \u09af\u09c7\u09b9\u09c7\u09a4\u09c1 \u098f\u099f\u09bf \u09a1\u09bf\u09ab\u09b2\u09cd\u099f \u09b8\u09c7\u099f\u09bf\u0982 \u09a8\u09af\u09bc\u0964
pscanbeta.viewstatescanner.content.email.name=Viewstate \u09a4\u09c7 \u09aa\u09be\u0993\u09df\u09be \u0987-\u09ae\u09c7\u0987\u09b2 \u09b8\u09ae\u09c2\u09b9
pscanbeta.viewstatescanner.content.email.desc=\u09a8\u09bf\u099a\u09c7\u09b0 \u0987\u09ae\u09c7\u0987\u09b2\u0997\u09c1\u09b2\u09cb viewstate field \u09a4\u09c7 \u09a7\u09be\u09b0\u09be\u09ac\u09be\u09b9\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u09b8\u09be\u0981\u099c\u09be\u09a8\u09cb \u09b9\u09bf\u09b8\u09c7\u09ac\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u0997\u09c7\u099b\u09c7\:
pscanbeta.viewstatescanner.content.email.pattern.source=\u0987\u09ae\u09c7\u0987\u09b2 \u09a8\u09ae\u09c1\u09a8\u09be- http\://www.regular-expressions.info/regexbuddy/email.html
pscanbeta.viewstatescanner.content.ip.name=Viewstate \u09a4\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u0986\u0987\u09aa\u09bf \u0985\u09cd\u09af\u09be\u09a1\u09cd\u09b0\u09c7\u09b8\u09b8\u09ae\u09c2\u09b9
pscanbeta.viewstatescanner.content.ip.desc=\u09a8\u09bf\u099a\u09c7\u09b0 IP \u098f\u09a1\u09cd\u09b0\u09c7\u09b8\u0997\u09c1\u09b2\u09cb viewstate field \u09a4\u09c7 \u09a7\u09be\u09b0\u09be\u09ac\u09be\u09b9\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u09b8\u09be\u0981\u099c\u09be\u09a8\u09cb \u09b9\u09bf\u09b8\u09c7\u09ac\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u0997\u09c7\u099b\u09c7\:
pscanbeta.viewstatescanner.content.ip.pattern.source=IP \u09a8\u09ae\u09c1\u09a8\u09be - http\://www.regular-expressions.info/examples.html

