#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Reglas de Escaneo Pasivo - beta

pscanbeta.authenticationcredentialscaptured.name=Credenciales de autenticaci\u00f3n capturadas
pscanbeta.authenticationcredentialscaptured.desc=Mecanismo inseguro de autenticaci\u00f3n en uso.  Esto permite a un atacante obtener los credenciales (ID de usuario y contrase\u00f1a) de un usuario autenticado. Usando el metodo HTTP de autenticaci\u00f3n b\u00e1sica, el atacante simplemente debe vigilar el tr\u00e1fico de la red hasta que se reciba una solicitud de autenticaci\u00f3n b\u00e1sica, y luego descifrar (base64) los credenciales.  Usando el m\u00e9todo HTTP de autenticaci\u00f3n por compendio (hash), el atacante tiene acceso al nombre de usuario y posiblemente la contrase\u00f1a, si el hash (incluyendo la semilla criptogr\u00e1fica) puede ser resuelto o si se monta un ataque Hombre-en-el-Medio (Man-In-The-Middle).     
pscanbeta.authenticationcredentialscaptured.soln=Utilice HTTPS y un mecanismo de autenticaci\u00f3n segura que no transmita el ID de usuario o la contrase\u00f1a sin cifrarlos.  En particular, evite el uso del mecanismo HTTP de autenticaci\u00f3n b\u00e1sica ya que este utiliza un mecanismo de ofuscaci\u00f3n trivial, que se rompe f\u00e1cilmente. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.OWASP.org/index.php/Top_10_2010-a3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29 https\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] utiliza el mecanismo de autenticaci\u00f3n inseguro [{2}], revelando el nombre de usuario [{3}] y contrase\u00f1a [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] utiliza el mecanismo de autenticaci\u00f3n inseguro [{2}], revelando el nombre de usuario [{3}] e informaci\u00f3n adicional [{4}].
pscanbeta.authenticationcredentialscaptured.alert.attack=El atacante fisgonea en la red hasta capturar los credenciales de autenticaci\u00f3n de un usuario.

pscanbeta.charsetmismatch.name=Incompatibilidad de caracteres
pscanbeta.charsetmismatch.variant.no_mismatch_metacontenttype_missing=(Falta el Conjunto de Caracteres de Tipo de Contenido Meta)
pscanbeta.charsetmismatch.variant.header_metacontentype_mismatch=(Encabezado contra Conjunto de Caracteres de Tipo de Contenido Meta)
pscanbeta.charsetmismatch.variant.header_metacharset_mismatch=(Encabezado contra Conjunto de Caracteres Meta)
pscanbeta.charsetmismatch.variant.metacontenttype_metacharset_mismatch=(Conjunto de Caracteres Meta contra Conjunto de Caracteres de Tipo de Contenido Meta)
pscanbeta.charsetmismatch.desc=Esta comprobaci\u00f3n identifica respuestas donde el encabezado de tipo de contenido HTTP declara un conjunto de caracteres diferente del conjunto de caracteres definido por el cuerpo del HTML o XML. Cuando hay un desajuste de conjunto de caracteres entre el encabezado HTTP y el cuerpo de contenido los navegadores web pueden ser forzados en un modo de rastreo de contenido indeseado para determinar el correcto contenido del conjunto de caracteres.
pscanbeta.charsetmismatch.soln=Forzar UTF-8 para todo el contenido de texto tanto en el encabezado HTPP y etiquetas meta en HTML o declaraciones de codificaci\u00f3n en XML.
pscanbeta.charsetmismatch.exploit=Un atacante podr\u00eda manipular contenido en la p\u00e1gina para que sea interpretado en una codificaci\u00f3n de su elecci\u00f3n. Por ejemplo, si un atacante puede controlar contenido en el principio de la p\u00e1gina, ellos podr\u00edan inyectar guiones usando el texto codificado UTF-7 y manipular algunos navegadores para interpretar ese texto.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing=El conjunto de caracteres es definido solo por el conjunto de caracteres META, los clientes m\u00e1s antiguos que esperan que el conjunto de caracteres sea definido por tipo de contenido META podr\u00edan no mostrar correctamente este contenido.
pscanbeta.charsetmismatch.extrainfo.html.header_metacontentype_mismatch=Hubo un desajuste de conjunto de caracteres entre el encabezado HTTP y las declaraciones de codificaci\u00f3n de tipo de contenido META\: [{0}] y [{1}] no coinciden.
pscanbeta.charsetmismatch.extrainfo.html.header_metacharset_mismatch=Hubo un desajuste de conjunto de caracteres entre el encabezado HTTP La declaraci\u00f3n de codificaci\u00f3n del conjunto de caracteres META\: [{0}] y [{1}] no coinciden.
pscanbeta.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch=Hubo un desajuste de conjunto de caracteres entre el conjunto de caracteres META y la declaraci\u00f3n de codificaci\u00f3n del tipo de contenido META\: [{0}] y [{1}] no coinciden.
pscanbeta.charsetmismatch.extrainfo.xml=Hubo un desajuste en el conjunto de caracteres entre el encabezado HTTP y la declaraci\u00f3n de c\u00f3digo XML\: [{0}] y [{1}] no coinciden.

pscanbeta.cookielooselyscoped.name=Amplia gama de Cookies
pscanbeta.cookielooselyscoped.desc=Las Cookies pueden ser delimitadas por dominio o ruta. Esta comprobaci\u00f3n solo se considera con \u00e1mbito de dominio. El \u00e1mbito de dominio aplicado a una cookie determina cuales dominios lo pueden acceder. Por ejemplo, una cookie puede ser delimitada estrictamente a un subdominio por ejemplo, www.nottrusted.com, o libremente delimitada a un dominio padre por ejemplo, nottrusted.com. En el \u00faltimo caso, cualquier subdominio de nottrusted.com puede acceder a la cookie. Las cookies libremente delimitadas son comunes en mega-aplicaciones como google.com y live.com. las cookies establecidas desde un subdominio como app.foo.bar son transmitidas solo al dominio del navegador. Sin embargo, las cookies delimitadas a un dominio de nivel de padre podr\u00eda ser transmitida al padre, o cualquier subdominio del padre.
pscanbeta.cookielooselyscoped.soln=Siempre delimitar las cookies a FQDN (Nombre de Dominio Completamente Calificado).
pscanbeta.cookielooselyscoped.refs=https\://tools.ietf.org/html/rfc6265\#section-4.1\nhttps\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OTG-SESS-002)\nhttp\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=El dominio de origen usado para comparaciones era\:\n{0}\n{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\n

pscanbeta.informationdisclosuredebugerrors.name=Divulgaci\u00f3n de informaci\u00f3n - Mensajes de error de depuraci\u00f3n
pscanbeta.informationdisclosuredebugerrors.desc=La respuesta parec\u00eda contener mensajes de errores comunes devueltos por plataformas como ASP.NET, y los servidores web tales como ISS y Apache. Usted puede configurar la lista de mensajes comunes de depuraci\u00f3n.
pscanbeta.informationdisclosuredebugerrors.soln=Inhabilitar mensajes de depuraci\u00f3n antes de empujar a la producci\u00f3n.

pscanbeta.informationdisclosureinurl.name=Divulgaci\u00f3n de informaci\u00f3n - Informaciones sensibles en URL
pscanbeta.informationdisclosureinurl.desc=La petici\u00f3n aparentaba contener informaci\u00f3n sensible divulgada en el URL. Esto puede violar el PCI y las pol\u00edticas de cumplimiento m\u00e1s organizadas. Usted puede configurar la lista de cadenas para que esta comprobaci\u00f3n agregue o remueva espec\u00edficos valores de su entorno.
pscanbeta.informationdisclosureinurl.otherinfo.sensitiveinfo=El URL contiene informaci\u00f3n potencialmente sensible.
pscanbeta.informationdisclosureinurl.otherinfo.cc=El URL aparente contener informaci\u00f3n de tarjetas de cr\u00e9dito.
pscanbeta.informationdisclosureinurl.otherinfo.email=El URL contiene direcci\u00f3n(es) de correo electr\u00f3nico.
pscanbeta.informationdisclosureinurl.otherinfo.ssn=El URL parece contener N\u00famero(s) de Seguridad Social de Estados Unidos
pscanbeta.informationdisclosureinurl.soln=No pase informaci\u00f3n sensible en URIs.

pscanbeta.informationdisclosurereferrerscanner.name=Divulgaci\u00f3n de Informaci\u00f3n - Informaci\u00f3n sensible en el Encabezado de Referencia HTTP
pscanbeta.informationdisclosurereferrerscanner.desc=El encabezado HTTP podr\u00eda haber filtrado un par\u00e1metro potencialmente sensible a otro dominio. Esto puede violar el PCI y las pol\u00edticas de cumplimientos m\u00e1s organizadas. Puede configurar la lista de cadenas para que esta comprobaci\u00f3n agregue o remueva espec\u00edficos valores de su entorno.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.sensitiveinfo=El URL en el campo de encabezado de referencia HTTP aparenta contener informaci\u00f3n sensible.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.cc=El URL en el campo de encabezado de referencia HTTP aparenta contener informaci\u00f3n de tarjetas de cr\u00e9dito.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.email=EL URLE en el campo de encabezado de referencia HTTP contiene direcci\u00f3n(es) de correo electr\u00f3nico.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.ssn=El URL en el campo de encabezado de referencia aparenta contener n\u00famero(s) de seguridad social de Estados Unidos.
pscanbeta.informationdisclosurereferrerscanner.soln=No pase informaci\u00f3n sensible en URIs.

pscanbeta.informationdisclosuresuspiciouscomments.name=Divulgaci\u00f3n de informaci\u00f3n - Comentarios sospechosos
pscanbeta.informationdisclosuresuspiciouscomments.desc=La respuesta aparenta contener comentarios sospechoso lo que podr\u00eda ayudar al atacante.
pscanbeta.informationdisclosuresuspiciouscomments.soln=Eliminar todos los comentarios que devuelvan informaci\u00f3n que podr\u00eda ayudar a un atacante y arreglar cualquier problema subyacente al que se refieran.

pscanbeta.insecureauthentication.name=M\u00e9todo de autenticaci\u00f3n d\u00e9bil
pscanbeta.insecureauthentication.desc=M\u00e9todo HTTP de autenticaci\u00f3n b\u00e1sica o por compendio (hash) ha sido utilizado sobre una conexi\u00f3n no segura. Las credenciales pueden ser le\u00eddas y luego reutilizadas por alguien con acceso a la red.
pscanbeta.insecureauthentication.soln=Protege la conexi\u00f3n usando el protocolo HTTPS o alg\u00fan mecanismo de autenticaci\u00f3n fuerte
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=JSF ViewState inseguro
pscanbeta.insecurejsfviewstate.desc=La respuesta a la siguiente direcci\u00f3n URL contiene un valor ViewState que no posee ninguna protecci\u00f3n criptogr\u00e1fica.
pscanbeta.insecurejsfviewstate.soln=VIEWSTATE seguro utilizando un MAC espec\u00edfico a tu entorno
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] es inseguro

pscanbeta.noanticsrftokens.name=Ausencia de fichas (tokens) Anti-CSRF
pscanbeta.noanticsrftokens.desc=No se encontraron fichas (tokens) Anti-CSRF en un formulario HTML.
pscanbeta.noanticsrftokens.alert.extrainfo=Ninguna ficha (token) Anti-CSRF {0} fue encontrada en los siguientes formularios HTML\: {1}.  
pscanbeta.noanticsrftokens.extrainfo.annotation=Esta es una alerta informativa, porque el formulario tiene una anotaci\u00f3n de seguridad que indica que no necesita un token anti-CSRF. Esto debe probarse manualmente para asegurar que la anotaci\u00f3n es correcta.

pscanbeta.servletparameterpollutionscanner.name=Anulaci\u00f3n de par\u00e1metro HTTP
pscanbeta.servletparameterpollutionscanner.desc=Forma de acci\u00f3n inespec\u00edfica\: Ataque de anulaci\u00f3n de par\u00e1metro HTTP potencialmente posible. Este es un problema conocido con Servlets de Java pero otras plataformas podr\u00edan ser vulnerables tambi\u00e9n.
pscanbeta.servletparameterpollutionscanner.soln=Todas las formas deben especificar el URL de la acci\u00f3n.
pscanbeta.servletparameterpollutionscanner.refs=http\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf

pscanbeta.viewstatescanner.name=Esc\u00e1ner de Viewstate
pscanbeta.viewstatescanner.soln=Verificar que la informaci\u00f3n dada no es confidencial.
pscanbeta.viewstatescanner.oldver.name=Antigua versi\u00f3n de Asp.Net en uso
pscanbeta.viewstatescanner.oldver.desc=*** EXPERIMENTAL ***\nEste sitio web usa versi\u00f3n 1.0 o 1.1 de ASP.NET.\n\n
pscanbeta.viewstatescanner.oldver.soln=Asegure que el marco comprometido a\u00fan es apoyado por Microsoft.
pscanbeta.viewstatescanner.nomac.unsure.name=Viewstate sin Firma de MAC (Inseguro)
pscanbeta.viewstatescanner.nomac.unsure.desc=*** EXPERIMENTAL ***\nEste sitio web usa Viewstate de ASP.NET pero posiblemente sin ning\u00fan MAC.\n\n
pscanbeta.viewstatescanner.nomac.unsure.soln=Aseg\u00farese que el MAC est\u00e1 establecido para todas las p\u00e1ginas en este sitio web.
pscanbeta.viewstatescanner.nomac.unsure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.nomac.sure.name=Viewstate sin firma de MAC (Seguro)
pscanbeta.viewstatescanner.nomac.sure.desc=*** EXPERIMENTAL ***\nEste sitio web usa Viewstate ASP.NET's pero sin ning\u00fan MAC.\n\n
pscanbeta.viewstatescanner.nomac.sure.soln=Aseg\u00farese que el MAC est\u00e1 establecido para todas las p\u00e1ginas en este sitio web.
pscanbeta.viewstatescanner.nomac.sure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.split.name=Separar el Viewstate en Uso
pscanbeta.viewstatescanner.split.desc=*** EXPERIMENTAL ***\nEste sitio web usa Viewstate ASP.NET's y su valor es separar en varios trozos.\n
pscanbeta.viewstatescanner.split.soln=Ninguno - los chicos corriendo el servidor podr\u00edan haber concertado la configuraci\u00f3n como si este no fuera la configuraci\u00f3n predeterminada.
pscanbeta.viewstatescanner.content.email.name=Se han encontrado correos electr\u00f3nicos en el Viewstate
pscanbeta.viewstatescanner.content.email.desc=Los siguientes correos electr\u00f3nicos fueron encontrados siendo enumerados por serie en el campo de Viewstate\:
pscanbeta.viewstatescanner.content.email.pattern.source=Patr\u00f3n de correo electr\u00f3nico - http\://www.regular-expressions.info/regexbuddy/email.html
pscanbeta.viewstatescanner.content.ip.name=Direcciones IP potenciales encontradas en el Viewstate
pscanbeta.viewstatescanner.content.ip.desc=Las siguientes potenciales direcciones IP fueron encontradas siendo enumeradas por serie en el campo de Viewstate\:
pscanbeta.viewstatescanner.content.ip.pattern.source=Patr\u00f3n de IP - http\://www.regular-expressions.info/examples.html

