#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Pasif Tarama Kurallar\u0131 - beta

pscanbeta.authenticationcredentialscaptured.name=Do\u011frulama Kimlik Bilgileri Yakalanan
pscanbeta.authenticationcredentialscaptured.desc=G\u00fcvensiz do\u011frulama mekanizmas\u0131 kullan\u0131l\u0131yor. Bu kimli\u011fi do\u011frulanm\u0131\u015f kullan\u0131c\u0131 kimli\u011fi ve \u015fifre a\u011f eri\u015fimi bir sald\u0131rgan\u0131n izin verir. Temel kimlik do\u011frulamas\u0131 i\u00e7in, sald\u0131rgan\u0131n yaln\u0131zca kullan\u0131c\u0131 ad\u0131 ve \u015fifre de\u015fifre base64 ard\u0131ndan Temel kimlik do\u011frulamas\u0131 iste\u011fi al\u0131nana kadar a\u011f trafi\u011fini izlemek, ve olmal\u0131d\u0131r. \u00d6zet kimlik do\u011frulamas\u0131 i\u00e7in sald\u0131rgan (bir nonce dahil) karma ba\u015far\u0131yla k\u0131r\u0131k olabilir, e\u011fer, kullan\u0131c\u0131 eri\u015fimi ve muhtemelen de \u015fifre vard\u0131r, ya da bir Man-In-Orta sald\u0131r\u0131 monte edilir ise.     
pscanbeta.authenticationcredentialscaptured.soln=HTTPS kullan\u0131n ve un-\u015fifreli bi\u00e7imde kimli\u011fi veya \u015fifre iletmez g\u00fcvenli bir kimlik do\u011frulama mekanizmas\u0131 kullan\u0131n. Bu \u00f6nemsiz \u015fa\u015f\u0131rtmaca mekanizmas\u0131 kolayca bozuldu \u00e7\u00fcnk\u00fc \u00d6zellikle, Temel Kimlik Do\u011frulama mekanizmas\u0131n\u0131n kullan\u0131m\u0131n\u0131 \u00f6nlemek. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3 \nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[ {0} ] [ {1} ] g\u00fcvensiz kimlik do\u011frulama mekanizmas\u0131 kullan\u0131r [ {2} ], ad\u0131n\u0131 if\u015fa [ {3} ] ve \u015fifre [ {4} ].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[ {0} ] [ {1} ] g\u00fcvensiz kimlik do\u011frulama mekanizmas\u0131 kullan\u0131r [ {2} ], ad\u0131n\u0131 if\u015fa [ {3} ] ve ek bilgiler [ {4} ].
pscanbeta.authenticationcredentialscaptured.alert.attack=bir kimlik do\u011frulama tamamlanana kadar sald\u0131rgan a\u011f \u00fczerinde kulak misafiri.

pscanbeta.charsetmismatch.name=Karakter uyu\u015fmazl\u0131\u011f\u0131
pscanbeta.charsetmismatch.variant.no_mismatch_metacontenttype_missing=(Meta \u0130\u00e7erik T\u00fcr\u00fc Karakter K\u00fcmesi Eksik)
pscanbeta.charsetmismatch.variant.header_metacontentype_mismatch=(Ba\u015fl\u0131\u011fa Kar\u015f\u0131 Meta \u0130\u00e7erik T\u00fcr\u00fc Karakter K\u00fcmesi)
pscanbeta.charsetmismatch.variant.header_metacharset_mismatch=(Ba\u015fl\u0131\u011fa Kar\u015f\u0131 Meta Karakter K\u00fcmesi)
pscanbeta.charsetmismatch.variant.metacontenttype_metacharset_mismatch=(Meta Karakter K\u00fcmesine Kar\u015f\u0131 Meta \u0130\u00e7erik T\u00fcr\u00fc Karakter K\u00fcmesi)
pscanbeta.charsetmismatch.desc=Bu onay, HTTP Content-Type \u00fcstbilgisi HTML veya XML v\u00fccut taraf\u0131ndan tan\u0131mlanan charset farkl\u0131 bir karakter k\u00fcmesi beyan yan\u0131tlar\u0131 tan\u0131mlar. HTTP ba\u015fl\u0131k ve i\u00e7erik beden Web taray\u0131c\u0131lar\u0131 aras\u0131nda bir charset uyumsuzlu\u011fu oldu\u011funda i\u00e7eri\u011fin do\u011fru karakter setini belirlemek i\u00e7in istenmeyen bir i\u00e7erik koklama moduna zorlanamaz.
pscanbeta.charsetmismatch.soln=Kuvvet UTF-8 XML HTTP ba\u015fl\u0131k ve meta etiketleri hem veya kodlama beyanlar t\u00fcm metin i\u00e7erik i\u00e7in.
pscanbeta.charsetmismatch.exploit=Sayfadaki i\u00e7eri\u011fi manip\u00fcle olabilir Sald\u0131rgan, kendi se\u00e7tikleri bir kodlama yorumlan\u0131r. Bir sald\u0131rgan\u0131n sayfan\u0131n ba\u015f\u0131nda i\u00e7eri\u011fini kontrol edebilirsiniz \u00d6rne\u011fin, onlar UTF-7 kodlanm\u0131\u015f metin kullanarak komut dosyas\u0131 ekleyebilir ve bu metin yorumlama i\u00e7ine baz\u0131 taray\u0131c\u0131lar i\u015fleyebilirsiniz.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing=Karakter k\u00fcmesi yaln\u0131zca META karakter setiyle tan\u0131mlan\u0131r, META i\u00e7erik t\u00fcr\u00fc taraf\u0131ndan tan\u0131mlanacak karakter k\u00fcmesini bekleyen daha eski istemciler bu i\u00e7eri\u011fi do\u011fru \u015fekilde g\u00f6r\u00fcnt\u00fcleyemez.
pscanbeta.charsetmismatch.extrainfo.html.header_metacontentype_mismatch=HTTP \u00dcstbilgisi ile META i\u00e7erik t\u00fcr\u00fc kodlama bildirimleri aras\u0131nda bir karakter k\u00fcmesi uyumsuzlu\u011fu vard\u0131\: [{0}] ve [{1}] e\u015fle\u015fmiyor.
pscanbeta.charsetmismatch.extrainfo.html.header_metacharset_mismatch=HTTP \u00dcstbilgisi ile META karakter k\u00fcmesi kodlama bildirimleri aras\u0131nda bir karakter k\u00fcmesi uyumsuzlu\u011fu vard\u0131\: [{0}] ve [{1}] e\u015fle\u015fmiyor.
pscanbeta.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch=META i\u00e7erik t\u00fcr\u00fc ile META karakter k\u00fcmesi kodlama bildirimleri aras\u0131nda bir karakter k\u00fcmesi uyumsuzlu\u011fu vard\u0131\: [{0}] ve [{1}] e\u015fle\u015fmiyor.
pscanbeta.charsetmismatch.extrainfo.xml=HTTP \u00dcstbilgi ve XML kodlama bildirimi aras\u0131nda bir charset uyumsuzlu\u011fu vard\u0131\: [ {0} ] ve [ {1} ] uyu\u015fmuyor.

pscanbeta.cookielooselyscoped.name=Gev\u015fek Scoped \u00c7erez
pscanbeta.cookielooselyscoped.desc=\u00c7erezler etki alan\u0131 veya yolu ile kapsaml\u0131 edilebilir. Bu onay, bir \u00e7erez uygulanan etki scope.The alan\u0131 kapsam\u0131 ile sadece endi\u015fe etki eri\u015febilir belirler. \u00d6rne\u011fin, bir \u00e7erez bir alt \u00f6rn www.nottrusted.com veya gev\u015fek bir \u00fcst etki, \u00f6rne\u011fin nottrusted.com i\u00e7in kapsaml\u0131 kesinlikle kapsaml\u0131 olabilir. Bu durumda, herhangi bir alt etki alan\u0131 nottrusted.com tan\u0131mlama eri\u015febilir. Gev\u015fek kapsaml\u0131 \u00e7erezler google.com ve live.com gibi mega-uygulamalar yayg\u0131nd\u0131r.
pscanbeta.cookielooselyscoped.soln=Bir FQDN (Tam Etki Alan\u0131 Ad\u0131) Her zaman kapsam tan\u0131mlama.
pscanbeta.cookielooselyscoped.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=Kar\u015f\u0131la\u015ft\u0131rma i\u00e7in kullan\u0131lan men\u015fe alan\u0131 oldu\: {0} {1} \n\n
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\n

pscanbeta.informationdisclosuredebugerrors.name=Bilginin A\u00e7\u0131\u011fa \u00c7\u0131kmas\u0131 - Hata Mesajlar\u0131 Hata Ay\u0131klama
pscanbeta.informationdisclosuredebugerrors.desc=Yan\u0131t, ASP.NET gibi platformlar taraf\u0131ndan d\u00f6nd\u00fcr\u00fclen genel hata iletilerini ve IIS ve Apache gibi Web sunucular\u0131n\u0131 i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor. S\u0131k kullan\u0131lan hata ay\u0131klama mesajlar\u0131n\u0131n bir listesini yap\u0131land\u0131rabilirsiniz.
pscanbeta.informationdisclosuredebugerrors.soln=\u00dcretmeye ge\u00e7meden \u00f6nce hata ay\u0131klama mesajlar\u0131n\u0131 devre d\u0131\u015f\u0131 b\u0131rak\u0131n.

pscanbeta.informationdisclosureinurl.name=Bilginin A\u00e7\u0131\u011fa \u00c7\u0131kmas\u0131 - URL'de Hassas Bilgiler
pscanbeta.informationdisclosureinurl.desc=\u0130ste\u011fin, URL'de s\u0131zd\u0131r\u0131lm\u0131\u015f hassas bilgileri i\u00e7erdi\u011fi g\u00f6r\u00fcld\u00fc. Bu, PCI ve \u00e7o\u011fu kurulu\u015f uyum politikas\u0131n\u0131 ihlal edebilir. Ortam\u0131n\u0131za \u00f6zg\u00fc de\u011ferleri eklemek veya kald\u0131rmak i\u00e7in bu denetimin dizelerinin listesini yap\u0131land\u0131rabilirsiniz.
pscanbeta.informationdisclosureinurl.otherinfo.sensitiveinfo=URL, potansiyel hassas bilgiler i\u00e7eriyor.
pscanbeta.informationdisclosureinurl.otherinfo.cc=URL, kredi kart\u0131 bilgileri i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor.
pscanbeta.informationdisclosureinurl.otherinfo.email=URL eposta adresi(ler) i\u00e7eriyor.
pscanbeta.informationdisclosureinurl.otherinfo.ssn=URL, ABD Sosyal G\u00fcvenlik Numaras\u0131(lar\u0131) i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor
pscanbeta.informationdisclosureinurl.soln=Hassas bilgileri URL'lerde ge\u00e7irmeyin.

pscanbeta.informationdisclosurereferrerscanner.name=Bilginin A\u00e7\u0131\u011fa \u00c7\u0131kmas\u0131 - HTTP Y\u00f6nlendirme Ba\u015fl\u0131\u011f\u0131nda Hassas Bilgiler
pscanbeta.informationdisclosurereferrerscanner.desc=HTTP ba\u015fl\u0131\u011f\u0131, potansiyel hassas bir parametreyi ba\u015fka bir alana s\u0131zd\u0131rm\u0131\u015f olabilir. Bu, PCI ve \u00e7o\u011fu kurulu\u015f uyum politikas\u0131n\u0131 ihlal edebilir. Ortam\u0131n\u0131za \u00f6zg\u00fc de\u011ferleri eklemek veya kald\u0131rmak i\u00e7in bu denetimin dizelerinin listesini yap\u0131land\u0131rabilirsiniz.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.sensitiveinfo=HTTP y\u00f6nlendiren ba\u015fl\u0131k alan\u0131ndaki URL, hassas bilgiler i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.cc=HTTP y\u00f6nlendiren ba\u015fl\u0131k alan\u0131ndaki URL, kredi kart\u0131 bilgileri i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.email=HTTP y\u00f6nlendiren ba\u015fl\u0131k alan\u0131ndaki URL, e-posta adresi(leri) i\u00e7eriyor.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.ssn=HTTP y\u00f6nlendiren ba\u015fl\u0131k alan\u0131ndaki URL, ABD Sosyal G\u00fcvenlik Numaras\u0131(lar\u0131) i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor.
pscanbeta.informationdisclosurereferrerscanner.soln=Hassas bilgilerinizi URI'lerde ge\u00e7irmeyin.

pscanbeta.informationdisclosuresuspiciouscomments.name=Bilginin A\u00e7\u0131\u011fa \u00c7\u0131kmas\u0131 - \u015e\u00fcpheli Yorumlar
pscanbeta.informationdisclosuresuspiciouscomments.desc=Yan\u0131t, bir sald\u0131rgana yard\u0131mc\u0131 olabilecek \u015f\u00fcpheli yorumlar i\u00e7eriyor gibi g\u00f6r\u00fcn\u00fcyor.
pscanbeta.informationdisclosuresuspiciouscomments.soln=Bir sald\u0131rgana yard\u0131mc\u0131 olabilecek bilgileri d\u00f6nd\u00fcren t\u00fcm yorumlar\u0131 kald\u0131r\u0131n ve alttaki ba\u015fvurulan problemleri d\u00fczeltin.

pscanbeta.insecureauthentication.name=Zay\u0131f Kimlik Do\u011frulama Y\u00f6ntemi
pscanbeta.insecureauthentication.desc=HTTP Temel ya da \u00f6zet kimlik do\u011frulamas\u0131 g\u00fcvenli olmayan ba\u011flant\u0131 \u00fczerinden kullan\u0131l\u0131r olmu\u015ftur. kimlik okuyun ve sonra a\u011fa eri\u015fimi olan bir ki\u015fi taraf\u0131ndan yeniden kullan\u0131labilir.
pscanbeta.insecureauthentication.soln=HTTPS kullanarak ba\u011flant\u0131y\u0131 korumak veya daha g\u00fc\u00e7l\u00fc bir kimlik do\u011frulama mekanizmas\u0131 kullan\u0131n
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=G\u00fcvensiz JSF ViewState
pscanbeta.insecurejsfviewstate.desc=a\u015fa\u011f\u0131daki URL'den yan\u0131t\u0131 yok kriptografik koruma olan bir ViewState de\u011feri i\u00e7erir.
pscanbeta.insecurejsfviewstate.soln=Ortam\u0131n\u0131za bir MAC \u00f6zg\u00fc olan G\u00fcvenli viewstate
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [ {0} ] g\u00fcvensiz

pscanbeta.noanticsrftokens.name=Anti-CSRF belirte\u00e7leri olmamas\u0131
pscanbeta.noanticsrftokens.desc=Hay\u0131r Anti-CSRF belirte\u00e7leri HTML g\u00f6nderme formunda bulundu.
pscanbeta.noanticsrftokens.alert.extrainfo=Bilinen Anti-CSRF belirte\u00e7leri {0} a\u015fa\u011f\u0131daki HTML formlar\u0131 bulundu\: {1} .  
pscanbeta.noanticsrftokens.extrainfo.annotation=Form, bir anti-CSRF Token'e ihtiya\u00e7 duymad\u0131\u011f\u0131n\u0131 belirten bir g\u00fcvenlik a\u00e7\u0131klamas\u0131 oldu\u011fu i\u00e7in bu bir bilgilendirme uyar\u0131s\u0131d\u0131r. Bu, a\u00e7\u0131klaman\u0131n do\u011fru oldu\u011fundan emin olmak i\u00e7in manuel olarak test edilmelidir.

pscanbeta.servletparameterpollutionscanner.name=HTTP Parametresini Ge\u00e7ersiz K\u0131lmak
pscanbeta.servletparameterpollutionscanner.desc=Belirsiz form eylemi\: HTTP parametresi ge\u00e7ersiz k\u0131lma sald\u0131r\u0131s\u0131 olas\u0131d\u0131r. Bu Java Servlets olarak da bilinen bir problemdir ancak di\u011fer platformlar da savunmas\u0131z olabilir.
pscanbeta.servletparameterpollutionscanner.soln=T\u00fcm formlar\u0131n i\u015flem URL'lerini belirtmesi gerekir.
pscanbeta.servletparameterpollutionscanner.refs=http\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf

pscanbeta.viewstatescanner.name=Viewstate Taray\u0131c\u0131
pscanbeta.viewstatescanner.soln=Sa\u011flanan bilgilerin gizli olmad\u0131\u011f\u0131n\u0131 do\u011frulay\u0131n.
pscanbeta.viewstatescanner.oldver.name=Eski Asp.Net S\u00fcr\u00fcm\u00fc Kullan\u0131mda
pscanbeta.viewstatescanner.oldver.desc=*** DENEYSEL ***\nBu web sitesi ASP.NET s\u00fcr\u00fcm 1.0 veya 1.1 kullanmakta.\n\n
pscanbeta.viewstatescanner.oldver.soln=Me\u015fgul yap\u0131n\u0131n halen Microsoft taraf\u0131ndan desteklendi\u011finden emin olun.
pscanbeta.viewstatescanner.nomac.unsure.name=MAC \u0130mzas\u0131 olmayan (G\u00fcvensiz) Viewstate
pscanbeta.viewstatescanner.nomac.unsure.desc=*** DENEYSEL ***\nBu web sitesi ASP.NET Viewstate kullan\u0131yor fakat herhangi bir MAC olmadan kullan\u0131yor olabilir.\n\n
pscanbeta.viewstatescanner.nomac.unsure.soln=Bu web sitesindeki t\u00fcm sayfalar i\u00e7in MAC ayarland\u0131\u011f\u0131ndan emin olun.
pscanbeta.viewstatescanner.nomac.unsure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.nomac.sure.name=MAC \u0130mzas\u0131 olmayan (G\u00fcvenli) Viewstate
pscanbeta.viewstatescanner.nomac.sure.desc=*** EXPERIMENTAL ***\nBu web sitesi ASP.NET Viewstate'i kullan\u0131r fakat herhangi bir MAC i\u00e7ermez.\n\n
pscanbeta.viewstatescanner.nomac.sure.soln=Bu web sitesindeki t\u00fcm sayfalar i\u00e7in MAC ayarland\u0131\u011f\u0131ndan emin olun.
pscanbeta.viewstatescanner.nomac.sure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.split.name=Viewstate'\u0131 Kullan\u0131mda Ay\u0131r
pscanbeta.viewstatescanner.split.desc=*** EXPERIMENTAL ***\nBu web sitesi ASP.NET Viewstate'i kullan\u0131r ve de\u011feri birka\u00e7 par\u00e7aya b\u00f6l\u00fcn\u00fcr.\n
pscanbeta.viewstatescanner.split.soln=Hi\u00e7biri - bu varsay\u0131lan ayar olmad\u0131\u011f\u0131 i\u00e7in sunucuyu y\u00f6neten ki\u015filer yap\u0131land\u0131rmay\u0131 de\u011fi\u015ftirmi\u015f olabilir.
pscanbeta.viewstatescanner.content.email.name=Viewstate'te Bulunan epostalar
pscanbeta.viewstatescanner.content.email.desc=A\u015fa\u011f\u0131daki e-postalar\u0131n g\u00f6r\u00fcn\u00fc\u015f alan\u0131nda seri hale getirilmi\u015f oldu\u011fu bulundu\:
pscanbeta.viewstatescanner.content.email.pattern.source=Eposta kal\u0131b\u0131 - http\://www.regular-expressions.info/regexbuddy/email.htm
pscanbeta.viewstatescanner.content.ip.name=Viewstate i\u00e7inde Bulunan Potansiyel IP Adresleri
pscanbeta.viewstatescanner.content.ip.desc=G\u00f6r\u00fcn\u00fcm durumu alan\u0131nda a\u015fa\u011f\u0131daki potansiyel IP adresleri seri hale getirilmi\u015ftir\:
pscanbeta.viewstatescanner.content.ip.pattern.source=IP kal\u0131b\u0131 - http\://www.regular-expressions.info/examples.html

