pscanbeta.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanbeta.inpagebanner.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0432 \u0440\u044f\u0434\u043e\u043a \u0431\u0430\u043d\u0435\u0440\u0430 \u0432\u0435\u0440\u0441\u0456\u0457 \u0443 \u0432\u043c\u0456\u0441\u0442\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456. \u0422\u0430\u043a\u0456 \u0432\u0438\u0442\u043e\u043a\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0443\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u0456 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438, \u0449\u043e \u0432\u043f\u043b\u0438\u0432\u0430\u044e\u0442\u044c \u043d\u0430 \u043f\u0440\u043e\u0434\u0443\u043a\u0442 \u0442\u0430 \u0432\u0435\u0440\u0441\u0456\u044e, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f.
pscanbeta.inpagebanner.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043d\u0430 \u0431\u0430\u043d\u0435\u0440\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438
pscanbeta.inpagebanner.other = \u0406\u0441\u043d\u0443\u0454 \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043d\u044f \u0443 \u043f\u043e\u0448\u0443\u043a\u0443 \u0441\u0442\u043e\u0441\u0443\u0454\u0442\u044c\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445, \u0430 \u043d\u0435 \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u0432 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.
pscanbeta.inpagebanner.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/
pscanbeta.inpagebanner.soln = Configure the server to prevent such information leaks. For example\:\nUnder Tomcat this is done via the "server" directive and implementation of custom error pages.\nUnder Apache this is done via the "ServerSignature" and "ServerTokens" directives.

pscanbeta.jsfunction.desc = \u0421\u0445\u043e\u0436\u0435, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0430 \u0444\u0443\u043d\u043a\u0446\u0456\u044f JS, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0441\u0430\u0439\u0442 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c.
pscanbeta.jsfunction.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 JS
pscanbeta.jsfunction.refs = https\://angular.io/guide/security
pscanbeta.jsfunction.soln = See the references for security advice on the use of these functions.

pscanbeta.jso.desc = \u0417\u0434\u0430\u0454\u0442\u044c\u0441\u044f, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f Java Serialization. \u042f\u043a\u0449\u043e \u0432\u043e\u043d\u0430 \u043d\u0435 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0430 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u043e \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0439 \u043e\u0431'\u0454\u043a\u0442. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e "\u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443". \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043c\u0430\u0433\u0456\u0447\u043d\u0443 \u043f\u043e\u0441\u043b\u0456\u0434\u043e\u0432\u043d\u0456\u0441\u0442\u044c, \u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0454 JSO (Base64\: rO0AB, Raw\: 0xac, 0xed, 0x00, 0x05).
pscanbeta.jso.name = Java Serialization Object
pscanbeta.jso.refs = https\://www.oracle.com/technetwork/java/seccodeguide-139067.html\#8
pscanbeta.jso.soln = Deserialization of untrusted data is inherently dangerous and should be avoided.

pscanbeta.name = Passive Scan Rules - beta

pscanbeta.nonstorable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0435\u0433\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438. \u042f\u043a\u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0447\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0457\u0457 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u043f\u043e\u043a\u0440\u0430\u0449\u0438\u0442\u0438 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u0456\u0441\u0442\u044c.
pscanbeta.nonstorable.extrainfo = {0}
pscanbeta.nonstorable.name = \u0412\u043c\u0456\u0441\u0442, \u0449\u043e \u043d\u0435 \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0454 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e
pscanbeta.nonstorable.refs = https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (\u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u0437\u0430 rfc7234)
pscanbeta.nonstorable.soln = The content may be marked as storable by ensuring that the following conditions are satisfied\:\nThe request method must be understood by the cache and defined as being cacheable ("GET", "HEAD", and "POST" are currently defined as cacheable)\nThe response status code must be understood by the cache (one of the 1XX, 2XX, 3XX, 4XX, or 5XX response classes are generally understood)\nThe "no-store" cache directive must not appear in the request or response header fields\nFor caching by "shared" caches such as "proxy" caches, the "private" response directive must not appear in the response\nFor caching by "shared" caches such as "proxy" caches, the "Authorization" header field must not appear in the request, unless the response explicitly allows it (using one of the "must-revalidate", "public", or "s-maxage" Cache-Control response directives)\nIn addition to the conditions above, at least one of the following conditions must also be satisfied by the response\:\nIt must contain an "Expires" header field\nIt must contain a "max-age" response directive\nFor "shared" caches such as "proxy" caches, it must contain a "s-maxage" response directive\nIt must contain a "Cache Control Extension" that allows it to be cached\nIt must have a status code that is defined as cacheable by default (200, 203, 204, 206, 300, 301, 404, 405, 410, 414, 501).   

pscanbeta.payloader.desc = Provides support for custom payloads in scan rules.
pscanbeta.payloader.name = Passive Scan Rules Beta Custom Payloads

pscanbeta.permissionspolicymissing.deprecated.desc = The header has now been renamed to Permissions-Policy. 
pscanbeta.permissionspolicymissing.deprecated.name = Deprecated Feature Policy Header Set
pscanbeta.permissionspolicymissing.deprecated.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Feature-Policy\nhttps\://scotthelme.co.uk/goodbye-feature-policy-and-hello-permissions-policy/
pscanbeta.permissionspolicymissing.deprecated.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Permissions-Policy \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Feature-Policy.
pscanbeta.permissionspolicymissing.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 - \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0444\u0443\u043d\u043a\u0446\u0456\u0439 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0430\u0431\u043e \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u0426\u044f \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456\u0441\u0442\u044c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432, \u043e\u0431\u043c\u0435\u0436\u0443\u044e\u0447\u0438 \u0430\u0431\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u044e\u0447\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0456\u0432 \u043e\u0431\u043c\u0435\u0436\u0443\u0432\u0430\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u043e\u044e, \u0442\u0430\u043a\u0456 \u044f\u043a \u043a\u0430\u043c\u0435\u0440\u0430, \u043c\u0456\u043a\u0440\u043e\u0444\u043e\u043d, \u043c\u0456\u0441\u0446\u0435\u0437\u043d\u0430\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f, \u043f\u043e\u0432\u043d\u043e\u0435\u043a\u0440\u0430\u043d\u043d\u0438\u0439 \u0440\u0435\u0436\u0438\u043c \u0442\u043e\u0449\u043e.
pscanbeta.permissionspolicymissing.name = Permissions Policy Header Not Set
pscanbeta.permissionspolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Feature-Policy\nhttps\://developers.google.com/web/updates/2018/06/feature-policy\nhttps\://scotthelme.co.uk/a-new-security-header-feature-policy/\nhttps\://w3c.github.io/webappsec-feature-policy/\nhttps\://www.smashingmagazine.com/2018/12/feature-policy/
pscanbeta.permissionspolicymissing.soln = Ensure that your web server, application server, load balancer, etc. is configured to set the Permissions-Policy header.

pscanbeta.servletparameterpollution.desc = Unspecified form action\: HTTP parameter override attack potentially possible. This is a known problem with Java Servlets but other platforms may also be vulnerable.
pscanbeta.servletparameterpollution.name = HTTP Parameter Override
pscanbeta.servletparameterpollution.refs = http\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf
pscanbeta.servletparameterpollution.soln = All forms must specify the action URL.

pscanbeta.site-isolation.coep.desc = Cross-Origin-Embedder-Policy header is a response header that prevents a document from loading any cross-origin resources that don't explicitly grant the document permission (using CORP or CORS).
pscanbeta.site-isolation.coep.name = Cross-Origin-Embedder-Policy Header Missing or Invalid
pscanbeta.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.soln = Ensure that the application/web server sets the Cross-Origin-Embedder-Policy header appropriately, and that it sets the Cross-Origin-Embedder-Policy header to 'require-corp' for documents.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Embedder-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy).
pscanbeta.site-isolation.coop.desc = Cross-Origin-Opener-Policy header is a response header that allows a site to control if others included documents share the same browsing context. Sharing the same browsing context with untrusted documents might lead to data leak.
pscanbeta.site-isolation.coop.name = Cross-Origin-Opener-Policy Header Missing or Invalid
pscanbeta.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.soln = Ensure that the application/web server sets the Cross-Origin-Opener-Policy header appropriately, and that it sets the Cross-Origin-Opener-Policy header to 'same-origin' for documents.\n'same-origin-allow-popups' is considered as less secured and should be avoided.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Opener-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy).
pscanbeta.site-isolation.corp.desc = Cross-Origin-Resource-Policy header is an opt-in header designed to counter side-channels attacks like Spectre. Resource should be specifically set as shareable amongst different origins.
pscanbeta.site-isolation.corp.name = Cross-Origin-Resource-Policy Header Missing or Invalid
pscanbeta.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Cross-Origin_Resource_Policy_(CORP)
pscanbeta.site-isolation.corp.soln = Ensure that the application/web server sets the Cross-Origin-Resource-Policy header appropriately, and that it sets the Cross-Origin-Resource-Policy header to 'same-origin' for all web pages.\n'same-site' is considered as less secured and should be avoided.\nIf resources must be shared, set the header to 'cross-origin'.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that supports the Cross-Origin-Resource-Policy header (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy).
pscanbeta.site-isolation.name = Insufficient Site Isolation Against Spectre Vulnerability

pscanbeta.sourcecodedisclosure.desc = Application Source Code was disclosed by the web server
pscanbeta.sourcecodedisclosure.extrainfo = {0}
pscanbeta.sourcecodedisclosure.name = Source Code Disclosure
pscanbeta.sourcecodedisclosure.refs = http\://blogs.wsj.com/cio/2013/10/08/adobe-source-code-leak-is-bad-news-for-u-s-government/
pscanbeta.sourcecodedisclosure.soln = Ensure that application Source Code is not available with alternative extensions, and ensure that source code is not present within other files or data deployed to the web server, or served by the web server. 

pscanbeta.sri-integrity.desc = The integrity attribute is missing on a script or link tag served by an external server. The integrity tag prevents an attacker who have gained access to this server from injecting a malicious content. 
pscanbeta.sri-integrity.name = Sub Resource Integrity Attribute Missing
pscanbeta.sri-integrity.otherinfo = The following hash was calculated (using base64 encoding of the output of the hash algorithm\: SHA-384) for the script in question {0}
pscanbeta.sri-integrity.refs = https\://developer.mozilla.org/en/docs/Web/Security/Subresource_Integrity
pscanbeta.sri-integrity.soln = \u041d\u0430\u0434\u0430\u0442\u0438 \u0442\u0435\u0433\u0443 \u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456.

pscanbeta.storabilitycacheability.name = \u041a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443

pscanbeta.storablecacheable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0456 \u0457\u0445 \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0437 \u043a\u0435\u0448\u0443, \u0430 \u043d\u0435 \u0437 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0432\u0456\u0434 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u0441\u0445\u043e\u0436\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432\u0456\u0434 \u0456\u043d\u0448\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432. \u042f\u043a\u0449\u043e \u0434\u0430\u043d\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u0456 \u0430\u0431\u043e \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u0456 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0432\u0438\u043f\u0430\u0434\u043a\u0430\u0445 \u0446\u0435 \u043c\u043e\u0436\u0435 \u043d\u0430\u0432\u0456\u0442\u044c \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043e\u0442\u0440\u0438\u043c\u0430\u0454 \u043f\u043e\u0432\u043d\u0438\u0439 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c \u043d\u0430\u0434 \u0441\u0435\u0430\u043d\u0441\u043e\u043c \u0456\u043d\u0448\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0437\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0432 \u0439\u043e\u0433\u043e \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0456. \u0426\u0435 \u043d\u0430\u0441\u0430\u043c\u043f\u0435\u0440\u0435\u0434 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430, \u043a\u043e\u043b\u0438 "\u0441\u043f\u0456\u043b\u044c\u043d\u0456" \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0456 \u044f\u043a "\u043f\u0440\u043e\u043a\u0441\u0456" \u043a\u0435\u0448\u0456, \u0454 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0432 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0456\u0439 \u043c\u0435\u0440\u0435\u0436\u0456. \u0422\u0430\u043a\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0437\u0443\u0441\u0442\u0440\u0456\u0447\u0430\u0454\u0442\u044c\u0441\u044f, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0443 \u043a\u043e\u0440\u043f\u043e\u0440\u0430\u0442\u0438\u0432\u043d\u0438\u0445 \u0430\u0431\u043e \u043e\u0441\u0432\u0456\u0442\u043d\u0456\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430\u0445.
pscanbeta.storablecacheable.extrainfo = {0}
pscanbeta.storablecacheable.name = Storable and Cacheable Content
pscanbeta.storablecacheable.otherinfo.liberallifetimeheuristic = \u0417\u0430 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u043e\u0441\u0442\u0456 \u0447\u0456\u0442\u043a\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e\u0457 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0434\u0456\u0457 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u043e \u043f\u0440\u0438\u043f\u0443\u0449\u0435\u043d\u043e \u0432\u0456\u043b\u044c\u043d\u0443 \u0435\u0432\u0440\u0438\u0441\u0442\u0438\u043a\u0443 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0436\u0438\u0442\u0442\u044f 1 \u0440\u0456\u043a. \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e rfc7234.
pscanbeta.storablecacheable.otherinfo.staleretrievenotblocked = The response is stale, and stale responses are not configured to be re-validated or blocked, using the 'must-revalidate', 'proxy-revalidate', 's-maxage', or 'max-age' response 'Cache-Control' directives.
pscanbeta.storablecacheable.refs = https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (\u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u0437\u0430 rfc7234)
pscanbeta.storablecacheable.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0430\u0431\u043e \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u042f\u043a\u0449\u043e \u0446\u0435 \u0442\u0430\u043a, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043d\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0445 \u043d\u0438\u0436\u0447\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0430\u0431\u043e \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e \u0442\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044e \u0432\u043c\u0456\u0441\u0442\u0443 \u0437 \u043a\u0435\u0448\u0443 \u0456\u043d\u0448\u0438\u043c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c\:\nCache-Control\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443, \u0431\u0435\u0437 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f, \u043e\u0431\u043e\u0432\u2019\u044f\u0437\u043a\u043e\u0432\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430, \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0439\nPragma\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443\n\u0422\u0435\u0440\u043c\u0456\u043d \u0434\u0456\u0457\: 0\n\u0426\u044f \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u043d\u0430\u043a\u0430\u0437\u0443\u0454 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u043c \u0456\u0437 HTTP 1.0 \u0456 HTTP 1.1, \u043d\u0435 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456 \u043d\u0435 \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u0431\u0435\u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438) \u0437 \u043a\u0435\u0448\u0443 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u0441\u0445\u043e\u0436\u0438\u0439 \u0437\u0430\u043f\u0438\u0442.

pscanbeta.storablenoncacheable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0435\u0433\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0430\u043b\u0435 \u043d\u0435 \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u0457\u0445 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0437 \u043a\u0435\u0448\u0443 \u0431\u0435\u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443 \u0432\u0438\u0449\u0435 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u043f\u043e\u0434\u0456\u0431\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432\u0456\u0434 \u0456\u043d\u0448\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432.
pscanbeta.storablenoncacheable.extrainfo = {0}}
pscanbeta.storablenoncacheable.name = \u0412\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438, \u0430\u043b\u0435 \u043d\u0435 \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438
pscanbeta.storablenoncacheable.refs = https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (\u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u0437\u0430 rfc7234)
pscanbeta.storablenoncacheable.soln=
