#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Passive Scan Rules - beta

pscanbeta.authenticationcredentialscaptured.name=Authentication Credentials Captured
pscanbeta.authenticationcredentialscaptured.desc=\u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u062f\u0631 \u062d\u0627\u0644 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0633\u062a. \u0627\u06cc\u0646 \u0628\u0647 \u0645\u0647\u0627\u062c\u0645 \u062f\u0631 \u0634\u0628\u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u062f\u0633\u062a\u0631\u0633\u06cc \u0628\u0647 \u0634\u0646\u0627\u0633\u0647 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u06a9\u0627\u0631\u0628\u0631 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0634\u062f\u0647 \u0631\u0627 \u0645\u06cc\u062f\u0647\u062f. \u0628\u0631\u0627\u06cc Basic Authentication\u060c \u0645\u0647\u0627\u062c\u0645 \u062a\u0646\u0647\u0627 \u0645\u06cc\u0628\u0627\u06cc\u0633\u062a \u062a\u0631\u0627\u0641\u06cc\u06a9 \u0634\u0628\u06a9\u0647 \u0631\u0627 \u062a\u0627 \u0632\u0645\u0627\u0646\u06cc\u06a9\u0647 \u06cc\u06a9 \u062f\u0631\u062e\u0648\u0627\u0633\u062a Basic Authentication \u062f\u0631\u06cc\u0627\u0641\u062a \u0634\u0648\u062f\u060c \u0646\u0638\u0627\u0631\u062a \u06a9\u0646\u062f\u060c \u0648 \u067e\u0633 \u0627\u0632 \u0622\u0646 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0631\u0627 \u0628\u0627 \u0631\u0648\u0634 base64 \u0631\u0645\u0632\u06af\u0634\u0627\u06cc\u06cc \u06a9\u0646\u062f. \u0628\u0631\u0627\u06cc Digest Authentication\u060c \u0645\u0647\u0627\u062c\u0645 \u0628\u0647 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u062f\u0633\u062a\u0631\u0633\u06cc \u062f\u0627\u0631\u062f \u0648 \u0627\u06af\u0631 \u062f\u0631\u0647\u0645 \u0633\u0627\u0632\u06cc (\u0634\u0627\u0645\u0644 \u06cc\u06a9 nonce) \u0628\u0647 \u0637\u0648\u0631 \u0645\u0648\u0641\u0642\u06cc\u062a \u0622\u0645\u06cc\u0632 \u0634\u06a9\u0633\u062a\u0647 \u0634\u0648\u062f\u060c \u06cc\u0627 \u06cc\u06a9 \u062d\u0645\u0644\u0647 Man-In-The-Middle \u0627\u062c\u0631\u0627 \u0634\u0648\u062f\u060c \u0627\u062d\u062a\u0645\u0627\u0644\u0627\u064b \u0628\u0647 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0647\u0645 \u062f\u0633\u062a\u0631\u0633\u06cc \u062e\u0648\u0627\u0647\u062f \u062f\u0627\u0634\u062a.     
pscanbeta.authenticationcredentialscaptured.soln=\u0627\u0632 HTTPS \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f \u0648 \u0627\u0632 \u06cc\u06a9 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f \u06a9\u0647 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0631\u0627 \u0628\u0635\u0648\u0631\u062a \u0631\u0645\u0632 \u06af\u0630\u0627\u0631\u06cc \u0646\u0634\u062f\u0647 \u0627\u0646\u062a\u0642\u0627\u0644 \u0646\u062f\u0647\u062f. \u0628\u0647 \u0637\u0648\u0631 \u0645\u0634\u062e\u0635\u060c \u0627\u0632 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 Basic Authentication \u062e\u0648\u062f\u062f\u0627\u0631\u06cc \u06a9\u0646\u06cc\u062f\u060c \u0686\u0631\u0627 \u06a9\u0647 \u0627\u06cc\u0646 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u062f\u0631\u0647\u0645 \u0633\u0627\u0632\u06cc \u0645\u0642\u062f\u0645\u0627\u062a\u06cc \u0628\u0647 \u0631\u0627\u062d\u062a\u06cc \u0634\u06a9\u0633\u062a\u0647 \u0645\u06cc\u0634\u0648\u062f. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}][{1}] \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc\u06a9\u0646\u062f [{2}]\u060c \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc [{3}] \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 [{4}] \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u0645\u06cc\u06a9\u0646\u062f.
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}][{1}] \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc\u06a9\u0646\u062f [{2}]\u060c \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc [{3}] \u0648 \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0627\u0636\u0627\u0641\u06cc \u062f\u06cc\u06af\u0631 [{4}] \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u0645\u06cc\u06a9\u0646\u062f.
pscanbeta.authenticationcredentialscaptured.alert.attack=\u0645\u0647\u0627\u062c\u0645 \u0634\u0628\u06a9\u0647 \u0631\u0627 \u0627\u0633\u062a\u0631\u0627\u0642 \u0633\u0645\u0639 \u0645\u06cc\u06a9\u0646\u062f \u062a\u0627 \u0627\u06cc\u0646\u06a9\u0647 \u06cc\u06a9 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u06a9\u0627\u0645\u0644 \u0634\u0648\u062f.

pscanbeta.charsetmismatch.name=Charset Mismatch
pscanbeta.charsetmismatch.variant.no_mismatch_metacontenttype_missing=(Meta Content-Type Charset Missing)
pscanbeta.charsetmismatch.variant.header_metacontentype_mismatch=(Header Versus Meta Content-Type Charset)
pscanbeta.charsetmismatch.variant.header_metacharset_mismatch=(Header Versus Meta Charset)
pscanbeta.charsetmismatch.variant.metacontenttype_metacharset_mismatch=(Meta Charset Versus Meta Content-Type Charset)
pscanbeta.charsetmismatch.desc=This check identifies responses where the HTTP Content-Type header declares a charset different from the charset defined by the body of the HTML or XML. When there's a charset mismatch between the HTTP header and content body Web browsers can be forced into an undesirable content-sniffing mode to determine the content's correct character set.
pscanbeta.charsetmismatch.soln=Force UTF-8 for all text content in both the HTTP header and meta tags in HTML or encoding declarations in XML.
pscanbeta.charsetmismatch.exploit=An attacker could manipulate content on the page to be interpreted in an encoding of their choice. For example, if an attacker can control content at the beginning of the page, they could inject script using UTF-7 encoded text and manipulate some browsers into interpreting that text.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing=Charset is defined only by META charset, older clients that expect character set to be defined by META content-type may not correctly display this content.
pscanbeta.charsetmismatch.extrainfo.html.header_metacontentype_mismatch=There was a charset mismatch between the HTTP Header and the META content-type encoding declarations\: [{0}] and [{1}] do not match.
pscanbeta.charsetmismatch.extrainfo.html.header_metacharset_mismatch=There was a charset mismatch between the HTTP Header and the META charset encoding declaration\: [{0}] and [{1}] do not match.
pscanbeta.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch=There was a charset mismatch between the META charset and the META content-type encoding declaration\: [{0}] and [{1}] do not match.
pscanbeta.charsetmismatch.extrainfo.xml=There was a charset mismatch between the HTTP Header and the XML encoding declaration\: [{0}] and [{1}] do not match.

pscanbeta.cookielooselyscoped.name=Loosely Scoped Cookie
pscanbeta.cookielooselyscoped.desc=Cookies can be scoped by domain or path. This check is only concerned with domain scope.The domain scope applied to a cookie determines which domains can access it. For example, a cookie can be scoped strictly to a subdomain e.g. www.nottrusted.com, or loosely scoped to a parent domain e.g. nottrusted.com. In the latter case, any subdomain of nottrusted.com can access the cookie. Loosely scoped cookies are common in mega-applications like google.com and live.com. Cookies set from a subdomain like app.foo.bar are transmitted only to that domain by the browser. However, cookies scoped to a parent-level domain may be transmitted to the parent, or any subdomain of the parent.
pscanbeta.cookielooselyscoped.soln=Always scope cookies to a FQDN (Fully Qualified Domain Name).
pscanbeta.cookielooselyscoped.refs=https\://tools.ietf.org/html/rfc6265\#section-4.1\nhttps\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OTG-SESS-002)\nhttp\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=The origin domain used for comparison was\: \r\n{0}\r\n{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\r\n

pscanbeta.informationdisclosuredebugerrors.name=Information Disclosure - Debug Error Messages
pscanbeta.informationdisclosuredebugerrors.desc=The response appeared to contain common error messages returned by platforms such as ASP.NET, and Web-servers such as IIS and Apache. You can configure the list of common debug messages.
pscanbeta.informationdisclosuredebugerrors.soln=Disable debugging messages before pushing to production.

pscanbeta.informationdisclosureinurl.name=Information Disclosure - Sensitive Informations in URL
pscanbeta.informationdisclosureinurl.desc=The request appeared to contain sensitive information leaked in the URL. This can violate PCI and most organizational compliance policies. You can configure the list of strings for this check to add or remove values specific to your environment.
pscanbeta.informationdisclosureinurl.otherinfo.sensitiveinfo=The URL contains potentially sensitive information.
pscanbeta.informationdisclosureinurl.otherinfo.cc=The URL appears to contain credit card information.
pscanbeta.informationdisclosureinurl.otherinfo.email=The URL contains email address(es).
pscanbeta.informationdisclosureinurl.otherinfo.ssn=The URL appears to contain US Social Security Number(s)
pscanbeta.informationdisclosureinurl.soln=Do not pass sensitive information in URIs.

pscanbeta.informationdisclosurereferrerscanner.name=Information Disclosure - Sensitive Information in HTTP Referrer Header
pscanbeta.informationdisclosurereferrerscanner.desc=The HTTP header may have leaked a potentially sensitive parameter to another domain. This can violate PCI and most organizational compliance policies. You can configure the list of strings for this check to add or remove values specific to your environment.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.sensitiveinfo=The URL in the HTTP referrer header field appears to contain sensitive information.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.cc=The URL in the HTTP referrer header field appears to contain credit card information.
pscanbeta.informationdisclosurereferrerscanner.otherinfo.email=The URL in the HTTP referrer header field contains email address(es).
pscanbeta.informationdisclosurereferrerscanner.otherinfo.ssn=The URL in the HTTP referrer header field appears to contain US Social Security Number(s).
pscanbeta.informationdisclosurereferrerscanner.soln=Do not pass sensitive information in URIs.

pscanbeta.informationdisclosuresuspiciouscomments.name=Information Disclosure - Suspicious Comments
pscanbeta.informationdisclosuresuspiciouscomments.desc=The response appears to contain suspicious comments which may help an attacker.
pscanbeta.informationdisclosuresuspiciouscomments.soln=Remove all comments that return information that may help an attacker and fix any underlying problems they refer to.

pscanbeta.insecureauthentication.name=Weak Authentication Method
pscanbeta.insecureauthentication.desc=HTTP basic or digest authentication has been used over an unsecured connection. The credentials can be read and then reused by someone with access to the network.
pscanbeta.insecureauthentication.soln=Protect the connection using HTTPS or use a stronger authentication mechanism
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=Insecure JSF ViewState
pscanbeta.insecurejsfviewstate.desc=The response at the following URL contains a ViewState value that has no cryptographic protections.
pscanbeta.insecurejsfviewstate.soln=Secure VIEWSTATE with a MAC specific to your environment
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] is insecure

pscanbeta.noanticsrftokens.name=Absence of Anti-CSRF Tokens
pscanbeta.noanticsrftokens.desc=No Anti-CSRF tokens were found in a HTML submission form.
pscanbeta.noanticsrftokens.alert.extrainfo=No known Anti-CSRF token {0} was found in the following HTML form\: {1}.
pscanbeta.noanticsrftokens.extrainfo.annotation=This is an informational alert as the form has a security annotation indicating that it does not need an anti-CSRF Token. This should be tested manually to ensure the annotation is correct.

pscanbeta.servletparameterpollutionscanner.name=HTTP Parameter Override
pscanbeta.servletparameterpollutionscanner.desc=Unspecified form action\: HTTP parameter override attack potentially possible. This is a known problem with Java Servlets but other platforms may also be vulnerable.
pscanbeta.servletparameterpollutionscanner.soln=All forms must specify the action URL.
pscanbeta.servletparameterpollutionscanner.refs=http\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf

pscanbeta.viewstatescanner.name=Viewstate Scanner
pscanbeta.viewstatescanner.soln=Verify the provided information isn't confidential.
pscanbeta.viewstatescanner.oldver.name=Old Asp.Net Version in Use
pscanbeta.viewstatescanner.oldver.desc=*** EXPERIMENTAL ***\nThis website uses ASP.NET version 1.0 or 1.1.\n\n
pscanbeta.viewstatescanner.oldver.soln=Ensure the engaged framework is still supported by Microsoft.
pscanbeta.viewstatescanner.nomac.unsure.name=Viewstate without MAC Signature (Unsure)
pscanbeta.viewstatescanner.nomac.unsure.desc=*** EXPERIMENTAL ***\nThis website uses ASP.NET's Viewstate but maybe without any MAC.\n\n
pscanbeta.viewstatescanner.nomac.unsure.soln=Ensure the MAC is set for all pages on this website.
pscanbeta.viewstatescanner.nomac.unsure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.nomac.sure.name=Viewstate without MAC Signature (Sure)
pscanbeta.viewstatescanner.nomac.sure.desc=*** EXPERIMENTAL ***\nThis website uses ASP.NET's Viewstate but without any MAC.\n\n
pscanbeta.viewstatescanner.nomac.sure.soln=Ensure the MAC is set for all pages on this website.
pscanbeta.viewstatescanner.nomac.sure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanbeta.viewstatescanner.split.name=Split Viewstate in Use
pscanbeta.viewstatescanner.split.desc=*** EXPERIMENTAL ***\nThis website uses ASP.NET's Viewstate and its value is split into several chunks.\n
pscanbeta.viewstatescanner.split.soln=None - the guys running the server may have tuned the configuration as this isn't the default setting.
pscanbeta.viewstatescanner.content.email.name=Emails Found in the Viewstate
pscanbeta.viewstatescanner.content.email.desc=The following emails were found being serialized in the viewstate field\:
pscanbeta.viewstatescanner.content.email.pattern.source=Email pattern - http\://www.regular-expressions.info/regexbuddy/email.html
pscanbeta.viewstatescanner.content.ip.name=Potential IP Addresses Found in the Viewstate
pscanbeta.viewstatescanner.content.ip.desc=The following potential IP addresses were found being serialized in the viewstate field\:
pscanbeta.viewstatescanner.content.ip.pattern.source=IP pattern - http\://www.regular-expressions.info/examples.html

