pscanbeta.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

pscanbeta.inpagebanner.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0432\u0435\u0440\u043d\u0443\u0432 \u0440\u044f\u0434\u043e\u043a \u0431\u0430\u043d\u0435\u0440\u0430 \u0432\u0435\u0440\u0441\u0456\u0457 \u0443 \u0432\u043c\u0456\u0441\u0442\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456. \u0422\u0430\u043a\u0456 \u0432\u0438\u0442\u043e\u043a\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0443\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u0456 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438, \u0449\u043e \u0432\u043f\u043b\u0438\u0432\u0430\u044e\u0442\u044c \u043d\u0430 \u043f\u0440\u043e\u0434\u0443\u043a\u0442 \u0442\u0430 \u0432\u0435\u0440\u0441\u0456\u044e, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f.
pscanbeta.inpagebanner.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043d\u0430 \u0431\u0430\u043d\u0435\u0440\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438
pscanbeta.inpagebanner.other = \u0406\u0441\u043d\u0443\u0454 \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u0433\u043e, \u0449\u043e \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043d\u044f \u0443 \u043f\u043e\u0448\u0443\u043a\u0443 \u0441\u0442\u043e\u0441\u0443\u0454\u0442\u044c\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430\u0445, \u0430 \u043d\u0435 \u0444\u0430\u043a\u0442\u0438\u0447\u043d\u043e\u0433\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0433\u043e \u0440\u044f\u0434\u043a\u0430 \u0432 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.
pscanbeta.inpagebanner.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/
pscanbeta.inpagebanner.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440, \u0449\u043e\u0431 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0442\u0430\u043a\u0438\u043c \u0434\u0436\u0435\u0440\u0435\u043b\u0430\u043c \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434\:\n\u0423 Tomcat \u0446\u0435 \u0440\u043e\u0431\u0438\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abserver\u00bb \u0456 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0438\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a \u043f\u043e\u043c\u0438\u043b\u043e\u043a.\n\u0423 Apache \u0446\u0435 \u0440\u043e\u0431\u0438\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abServerSignature\u00bb \u0456 \u00abServerTokens\u00bb.

pscanbeta.jsfunction.desc = \u0421\u0445\u043e\u0436\u0435, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0430 \u0444\u0443\u043d\u043a\u0446\u0456\u044f JS, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0441\u0430\u0439\u0442 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c.
pscanbeta.jsfunction.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 JS
pscanbeta.jsfunction.refs = https\://angular.io/guide/security
pscanbeta.jsfunction.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0434\u043e\u0432\u0456\u0434\u043a\u043e\u0432\u0456 \u043c\u0430\u0442\u0435\u0440\u0456\u0430\u043b\u0438 \u0449\u043e\u0434\u043e \u043f\u043e\u0440\u0430\u0434 \u043f\u0440\u043e \u0431\u0435\u0437\u043f\u0435\u043a\u0443 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0446\u0438\u0445 \u0444\u0443\u043d\u043a\u0446\u0456\u0439.

pscanbeta.jso.desc = \u0417\u0434\u0430\u0454\u0442\u044c\u0441\u044f, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f Java Serialization. \u042f\u043a\u0449\u043e \u0432\u043e\u043d\u0430 \u043d\u0435 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0435\u043d\u0430 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u043e \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0439 \u043e\u0431'\u0454\u043a\u0442. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e "\u0412\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f \u043a\u043e\u0434\u0443". \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u043c\u0430\u0433\u0456\u0447\u043d\u0443 \u043f\u043e\u0441\u043b\u0456\u0434\u043e\u0432\u043d\u0456\u0441\u0442\u044c, \u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0443\u0454 JSO (Base64\: rO0AB, Raw\: 0xac, 0xed, 0x00, 0x05).
pscanbeta.jso.name = \u041e\u0431\u2019\u0454\u043a\u0442 \u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 Java
pscanbeta.jso.refs = https\://www.oracle.com/java/technologies/javase/seccodeguide.html\#8
pscanbeta.jso.soln = \u0414\u0435\u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044f \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0437\u0430 \u0441\u0432\u043e\u0454\u044e \u0441\u0443\u0442\u0442\u044e \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0430, \u0456 \u0457\u0457 \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.

pscanbeta.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f - \u0431\u0435\u0442\u0430

pscanbeta.nonstorable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0435\u0433\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438. \u042f\u043a\u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0447\u0438 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0457\u0457 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u043f\u043e\u043a\u0440\u0430\u0449\u0438\u0442\u0438 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u0438\u0432\u043d\u0456\u0441\u0442\u044c.
pscanbeta.nonstorable.name = \u0412\u043c\u0456\u0441\u0442, \u0449\u043e \u043d\u0435 \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0454 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e
pscanbeta.nonstorable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.nonstorable.soln = \u0412\u043c\u0456\u0441\u0442 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u043e\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u044f\u043a \u0442\u0430\u043a\u0438\u0439, \u0449\u043e \u043f\u0456\u0434\u043b\u044f\u0433\u0430\u0454 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e, \u0437\u0430 \u0443\u043c\u043e\u0432\u0438 \u0434\u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0445 \u0443\u043c\u043e\u0432\:\n\u041c\u0435\u0442\u043e\u0434 \u0437\u0430\u043f\u0438\u0442\u0443 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u0437\u0440\u043e\u0437\u0443\u043c\u0456\u043b\u0438\u0439 \u043a\u0435\u0448\u0443 \u0442\u0430 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u044f\u043a \u0442\u0430\u043a\u0438\u0439, \u0449\u043e \u043a\u0435\u0448\u0443\u0454\u0442\u044c\u0441\u044f (\u00abGET\u00bb, \u00abHEAD\u00bb \u0456 \u00abPOST\u00bb \u043d\u0430\u0440\u0430\u0437\u0456 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0442\u0430\u043a\u0456, \u0449\u043e \u043a\u0435\u0448\u0443\u044e\u0442\u044c\u0441\u044f)\n\u041a\u0435\u0448 \u043c\u0430\u0454 \u0440\u043e\u0437\u0443\u043c\u0456\u0442\u0438 \u043a\u043e\u0434 \u0441\u0442\u0430\u0442\u0443\u0441\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 (\u0437\u0430\u0433\u0430\u043b\u043e\u043c \u0440\u043e\u0437\u0443\u043c\u0456\u0454\u0442\u044c\u0441\u044f \u043e\u0434\u0438\u043d \u0456\u0437 \u043a\u043b\u0430\u0441\u0456\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 1XX, 2XX, 3XX, 4XX \u0430\u0431\u043e 5XX)\n\u0414\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0430 \u043a\u0435\u0448\u0443 "no-store" \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u0430 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438\u0441\u044f \u0432 \u043f\u043e\u043b\u044f\u0445 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0447\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456\n\u0414\u043b\u044f \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u00ab\u0441\u043f\u0456\u043b\u044c\u043d\u0438\u043c\u0438\u00bb \u043a\u0435\u0448\u0430\u043c\u0438, \u0442\u0430\u043a\u0438\u043c\u0438 \u044f\u043a \u00ab\u043f\u0440\u043e\u043a\u0441\u0456\u00bb, \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u00abprivate\u00bb \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u0430 \u0437\u2019\u044f\u0432\u043b\u044f\u0442\u0438\u0441\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456\n\u0414\u043b\u044f \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u00ab\u0441\u043f\u0456\u043b\u044c\u043d\u0438\u0445\u00bb \u043a\u0435\u0448\u0456\u0432, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u00ab\u043f\u0440\u043e\u043a\u0441\u0456\u00bb, \u043f\u043e\u043b\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u00ab\u0410\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u044f\u00bb \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u043e \u0437\u2019\u044f\u0432\u043b\u044f\u0442\u0438\u0441\u044f \u0432 \u0437\u0430\u043f\u0438\u0442\u0456, \u044f\u043a\u0449\u043e \u0446\u0435 \u044f\u0432\u043d\u043e \u043d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 (\u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043e\u0434\u0438\u043d \u0456\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 \u00ab\u043d\u0435\u043e\u0431\u0445\u0456\u0434\u043d\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430\u00bb, \u00ab\u043f\u0443\u0431\u043b\u0456\u0447\u043d\u0438\u0439\u00bb \u0430\u0431\u043e \u00ab s-maxage" \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 Cache-Control)\n\u041e\u043a\u0440\u0456\u043c \u0443\u043c\u043e\u0432, \u043d\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0445 \u0432\u0438\u0449\u0435, \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0442\u0430\u043a\u043e\u0436 \u043c\u0430\u0454 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0442\u0438 \u043f\u0440\u0438\u043d\u0430\u0439\u043c\u043d\u0456 \u043e\u0434\u043d\u0456\u0439 \u0456\u0437 \u0442\u0430\u043a\u0438\u0445 \u0443\u043c\u043e\u0432\:\n\u0412\u0456\u043d \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u043f\u043e\u043b\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 "\u0417\u0430\u043a\u0456\u043d\u0447\u0443\u0454\u0442\u044c\u0441\u044f".\n\u0412\u0456\u043d \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "max-age".\n\u0414\u043b\u044f \u00ab\u0437\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0445\u00bb \u043a\u0435\u0448\u0456\u0432, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u00ab\u043f\u0440\u043e\u043a\u0441\u0456\u00bb, \u0432\u0456\u043d \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u00abs-maxage\u00bb.\n\u0412\u0456\u043d \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u00abCache Control Extension\u00bb, \u044f\u043a\u0438\u0439 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0439\u043e\u0433\u043e \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438\n\u0412\u0456\u043d \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043c\u0430\u0442\u0438 \u043a\u043e\u0434 \u0441\u0442\u0430\u043d\u0443, \u044f\u043a\u0438\u0439 \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u044f\u043a \u0442\u0430\u043a\u0438\u0439, \u0449\u043e \u043a\u0435\u0448\u0443\u0454\u0442\u044c\u0441\u044f (200, 203, 204, 206, 300, 301, 404, 405, 410, 414, 501).

pscanbeta.payloader.desc = \u0417\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0443 \u043f\u0440\u0430\u0432\u0438\u043b\u0430\u0445 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f.
pscanbeta.payloader.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0435\u0442\u0430-\u0432\u0435\u0440\u0441\u0456\u044f \u041a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0456 \u043a\u043e\u0440\u0438\u0441\u043d\u0456 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f

pscanbeta.permissionspolicymissing.deprecated.desc = \u0422\u0435\u043f\u0435\u0440 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u0435\u0440\u0435\u0439\u043c\u0435\u043d\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432.
pscanbeta.permissionspolicymissing.deprecated.name = \u0417\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u0439 \u043d\u0430\u0431\u0456\u0440 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0439
pscanbeta.permissionspolicymissing.deprecated.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://scotthelme.co.uk/goodbye-feature-policy-and-hello-permissions-policy/
pscanbeta.permissionspolicymissing.deprecated.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Permissions-Policy \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Feature-Policy.
pscanbeta.permissionspolicymissing.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 - \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u043d\u0435\u0441\u0430\u043d\u043a\u0446\u0456\u043e\u043d\u043e\u0432\u0430\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0444\u0443\u043d\u043a\u0446\u0456\u0439 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0430\u0431\u043e \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u0426\u044f \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456\u0441\u0442\u044c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432, \u043e\u0431\u043c\u0435\u0436\u0443\u044e\u0447\u0438 \u0430\u0431\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u044e\u0447\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0432\u0435\u0431\u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438. \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0456\u0432 \u043e\u0431\u043c\u0435\u0436\u0443\u0432\u0430\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u043e\u044e, \u0442\u0430\u043a\u0456 \u044f\u043a \u043a\u0430\u043c\u0435\u0440\u0430, \u043c\u0456\u043a\u0440\u043e\u0444\u043e\u043d, \u043c\u0456\u0441\u0446\u0435\u0437\u043d\u0430\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f, \u043f\u043e\u0432\u043d\u043e\u0435\u043a\u0440\u0430\u043d\u043d\u0438\u0439 \u0440\u0435\u0436\u0438\u043c \u0442\u043e\u0449\u043e.
pscanbeta.permissionspolicymissing.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432 \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e
pscanbeta.permissionspolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Permissions-Policy\nhttps\://developer.chrome.com/blog/feature-policy/\nhttps\://scotthelme.co.uk/a-new-security-header-feature-policy/\nhttps\://w3c.github.io/webappsec-feature-policy/\nhttps\://www.smashingmagazine.com/2018/12/feature-policy/
pscanbeta.permissionspolicymissing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u00ab\u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0456\u0432\u00bb.

pscanbeta.servletparameterpollution.desc = \u041d\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0430 \u0434\u0456\u044f \u0444\u043e\u0440\u043c\u0438\: \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043c\u043e\u0436\u043b\u0438\u0432\u0430 \u0430\u0442\u0430\u043a\u0430 \u0456\u0437 \u043f\u0435\u0440\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 HTTP. \u0426\u0435 \u0432\u0456\u0434\u043e\u043c\u0430 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0437 Java Servlets, \u0430\u043b\u0435 \u0456\u043d\u0448\u0456 \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c\u0438.
pscanbeta.servletparameterpollution.name = \u041f\u0435\u0440\u0435\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 HTTP
pscanbeta.servletparameterpollution.refs = https\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf
pscanbeta.servletparameterpollution.soln = \u0423\u0441\u0456 \u0444\u043e\u0440\u043c\u0438 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 URL \u0434\u0456\u0457.

pscanbeta.site-isolation.coep.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy \u2014 \u0446\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u044f\u043a\u0438\u0439 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0430\u0454 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044e \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u043e\u043c \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432 \u0456\u0437 \u043f\u0435\u0440\u0435\u0445\u0440\u0435\u0441\u043d\u0438\u043c \u0434\u0436\u0435\u0440\u0435\u043b\u043e\u043c, \u044f\u043a\u0456 \u044f\u0432\u043d\u043e \u043d\u0435 \u043d\u0430\u0434\u0430\u044e\u0442\u044c \u0434\u043e\u0437\u0432\u0456\u043b \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0443 (\u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e CORP \u0430\u0431\u043e CORS).
pscanbeta.site-isolation.coep.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430/\u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy \u0456 \u0449\u043e \u0432\u0456\u043d \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Embedder-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u00abrequire-corp\u00bb \u0434\u043b\u044f \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u0439 \u0456\u0437 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c\u0438 \u0442\u0430 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Embedder-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy).
pscanbeta.site-isolation.coop.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy - \u0446\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u044f\u043a\u0438\u0439 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0441\u0430\u0439\u0442\u0443 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438, \u0447\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c \u0456\u043d\u0448\u0456 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u0456 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0438 \u0442\u043e\u0439 \u0441\u0430\u043c\u0438\u0439 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443. \u0421\u043f\u0456\u043b\u044c\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043e\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443 \u0437 \u043d\u0435\u043d\u0430\u0434\u0456\u0439\u043d\u0438\u043c\u0438 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430\u043c\u0438 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u0434\u0430\u043d\u0438\u0445.
pscanbeta.site-isolation.coop.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0434\u0430\u0442\u043e\u043a/\u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy \u0456 \u0449\u043e \u0432\u0456\u043d \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Opener-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "same-origin" \u0434\u043b\u044f \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n'same-origin-allow-popups' \u0432\u0432\u0430\u0436\u0430\u0454\u0442\u044c\u0441\u044f \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u043c \u0456 \u0439\u043e\u0433\u043e \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.\n\u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c \u0456 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Opener-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy).
pscanbeta.site-isolation.corp.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy - \u0446\u0435 \u043f\u043e\u0433\u043e\u0434\u0436\u0435\u043d\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a, \u043f\u0440\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u0434\u043b\u044f \u043f\u0440\u043e\u0442\u0438\u0434\u0456\u0457 \u0430\u0442\u0430\u043a\u0430\u043c \u0456\u0437 \u043f\u043e\u0431\u0456\u0447\u043d\u0438\u0445 \u043a\u0430\u043d\u0430\u043b\u0456\u0432, \u0442\u0430\u043a\u0438\u043c \u044f\u043a Spectre. \u0420\u0435\u0441\u0443\u0440\u0441 \u043c\u0430\u0454 \u0431\u0443\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u044f\u043a \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0434\u043b\u044f \u0441\u043f\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043c\u0456\u0436 \u0440\u0456\u0437\u043d\u0438\u043c\u0438 \u0434\u0436\u0435\u0440\u0435\u043b\u0430\u043c\u0438.
pscanbeta.site-isolation.corp.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043d\u0435\u043f\u0440\u0438\u043f\u0443\u0441\u0442\u0438\u043c\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy
pscanbeta.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Cross-Origin_Resource_Policy
pscanbeta.site-isolation.corp.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043e\u0434\u0430\u0442\u043e\u043a/\u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy \u0456 \u0449\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0434\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Cross-Origin-Resource-Policy \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "same-origin" \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0432\u0435\u0431\u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a.\n'same-site' \u0432\u0432\u0430\u0436\u0430\u0454\u0442\u044c\u0441\u044f \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u043c \u0456 \u0439\u043e\u0433\u043e \u0441\u043b\u0456\u0434 \u0443\u043d\u0438\u043a\u0430\u0442\u0438.\n\u042f\u043a\u0449\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0438 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0441\u043f\u0456\u043b\u044c\u043d\u0438\u043c\u0438, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043d\u0430 "cross-origin".\n\u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c \u0456 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Cross-Origin-Resource-Policy (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy).
pscanbeta.site-isolation.name = \u041d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043d\u044f \u0456\u0437\u043e\u043b\u044f\u0446\u0456\u044f \u0441\u0430\u0439\u0442\u0443 \u0432\u0456\u0434 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 Spectre

pscanbeta.sourcecodedisclosure.desc = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0432\u0438\u043a\u0440\u0438\u0432 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0434\u043e\u0434\u0430\u0442\u043a\u0443
pscanbeta.sourcecodedisclosure.name = \u0412\u0438\u043a\u0440\u0438\u0442\u0442\u044f \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0443
pscanbeta.sourcecodedisclosure.refs = https\://www.wsj.com/articles/BL-CIOB-2999
pscanbeta.sourcecodedisclosure.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438 \u043d\u0435\u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0437 \u0430\u043b\u044c\u0442\u0435\u0440\u043d\u0430\u0442\u0438\u0432\u043d\u0438\u043c\u0438 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f\u043c\u0438, \u0456 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0432 \u0456\u043d\u0448\u0438\u0445 \u0444\u0430\u0439\u043b\u0430\u0445 \u0430\u0431\u043e \u0434\u0430\u043d\u0438\u0445, \u0440\u043e\u0437\u0433\u043e\u0440\u043d\u0443\u0442\u0438\u0445 \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0430\u0431\u043e \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.

pscanbeta.sri-integrity.desc = \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0443 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457 \u0430\u0431\u043e \u0442\u0435\u0433\u0443 \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u043e\u0431\u0441\u043b\u0443\u0433\u043e\u0432\u0443\u0454 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u0456\u0439 \u0441\u0435\u0440\u0432\u0435\u0440. \u0422\u0435\u0433 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0430\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443, \u044f\u043a\u0438\u0439 \u043e\u0442\u0440\u0438\u043c\u0430\u0432 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u0432\u0456\u0434 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443.
pscanbeta.sri-integrity.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456 \u043f\u0456\u0434\u0440\u0435\u0441\u0443\u0440\u0441\u0443
pscanbeta.sri-integrity.otherinfo = \u0411\u0443\u043b\u043e \u043e\u0431\u0447\u0438\u0441\u043b\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0445\u0435\u0448 (\u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f base64 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0443 \u0445\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f\: SHA-384) \u0434\u043b\u044f \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e, \u043f\u0440\u043e \u044f\u043a\u0438\u0439 \u0439\u0434\u0435\u0442\u044c\u0441\u044f {0}
pscanbeta.sri-integrity.refs = https\://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity
pscanbeta.sri-integrity.soln = \u041d\u0430\u0434\u0430\u0442\u0438 \u0442\u0435\u0433\u0443 \u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0446\u0456\u043b\u0456\u0441\u043d\u043e\u0441\u0442\u0456.

pscanbeta.storabilitycacheability.name = \u041a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443

pscanbeta.storablecacheable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0456 \u0457\u0445 \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0437 \u043a\u0435\u0448\u0443, \u0430 \u043d\u0435 \u0437 \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0432\u0456\u0434 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u0441\u0445\u043e\u0436\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432\u0456\u0434 \u0456\u043d\u0448\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432. \u042f\u043a\u0449\u043e \u0434\u0430\u043d\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u0456 \u0430\u0431\u043e \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u0456 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0432\u0438\u043f\u0430\u0434\u043a\u0430\u0445 \u0446\u0435 \u043c\u043e\u0436\u0435 \u043d\u0430\u0432\u0456\u0442\u044c \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043e\u0442\u0440\u0438\u043c\u0430\u0454 \u043f\u043e\u0432\u043d\u0438\u0439 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c \u043d\u0430\u0434 \u0441\u0435\u0430\u043d\u0441\u043e\u043c \u0456\u043d\u0448\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0437\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0432 \u0439\u043e\u0433\u043e \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0456. \u0426\u0435 \u043d\u0430\u0441\u0430\u043c\u043f\u0435\u0440\u0435\u0434 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430, \u043a\u043e\u043b\u0438 "\u0441\u043f\u0456\u043b\u044c\u043d\u0456" \u0441\u0435\u0440\u0432\u0435\u0440\u0438 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0456 \u044f\u043a "\u043f\u0440\u043e\u043a\u0441\u0456" \u043a\u0435\u0448\u0456, \u0454 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0432 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0456\u0439 \u043c\u0435\u0440\u0435\u0436\u0456. \u0422\u0430\u043a\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0437\u0443\u0441\u0442\u0440\u0456\u0447\u0430\u0454\u0442\u044c\u0441\u044f, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0443 \u043a\u043e\u0440\u043f\u043e\u0440\u0430\u0442\u0438\u0432\u043d\u0438\u0445 \u0430\u0431\u043e \u043e\u0441\u0432\u0456\u0442\u043d\u0456\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430\u0445.
pscanbeta.storablecacheable.name = \u0412\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0442\u0430 \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438
pscanbeta.storablecacheable.otherinfo.liberallifetimeheuristic = \u0417\u0430 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u043e\u0441\u0442\u0456 \u0447\u0456\u0442\u043a\u043e \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e\u0457 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0434\u0456\u0457 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u043b\u043e \u043f\u0440\u0438\u043f\u0443\u0449\u0435\u043d\u043e \u0432\u0456\u043b\u044c\u043d\u0443 \u0435\u0432\u0440\u0438\u0441\u0442\u0438\u043a\u0443 \u0442\u0440\u0438\u0432\u0430\u043b\u043e\u0441\u0442\u0456 \u0436\u0438\u0442\u0442\u044f 1 \u0440\u0456\u043a. \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e rfc7234.
pscanbeta.storablecacheable.otherinfo.staleretrievenotblocked = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0454 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u043e\u044e, \u0430 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043d\u0435 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0443 \u0447\u0438 \u0431\u043b\u043e\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "must-revalidate", "proxy-revalidate", "s-maxage" \u0430\u0431\u043e "max-age", \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 "Cache-Control".
pscanbeta.storablecacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.storablecacheable.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0430\u0431\u043e \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u042f\u043a\u0449\u043e \u0446\u0435 \u0442\u0430\u043a, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043d\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0445 \u043d\u0438\u0436\u0447\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0430\u0431\u043e \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e \u0442\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044e \u0432\u043c\u0456\u0441\u0442\u0443 \u0437 \u043a\u0435\u0448\u0443 \u0456\u043d\u0448\u0438\u043c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c\:\nCache-Control\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443, \u0431\u0435\u0437 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f, \u043e\u0431\u043e\u0432\u2019\u044f\u0437\u043a\u043e\u0432\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430, \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0439\nPragma\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443\n\u0422\u0435\u0440\u043c\u0456\u043d \u0434\u0456\u0457\: 0\n\u0426\u044f \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u043d\u0430\u043a\u0430\u0437\u0443\u0454 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u043c \u0456\u0437 HTTP 1.0 \u0456 HTTP 1.1, \u043d\u0435 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456 \u043d\u0435 \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u0431\u0435\u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438) \u0437 \u043a\u0435\u0448\u0443 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u0441\u0445\u043e\u0436\u0438\u0439 \u0437\u0430\u043f\u0438\u0442.

pscanbeta.storablenoncacheable.desc = \u0412\u043c\u0456\u0441\u0442 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0435\u0433\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0430\u043b\u0435 \u043d\u0435 \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u0457\u0445 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0437 \u043a\u0435\u0448\u0443 \u0431\u0435\u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0437\u0430\u043f\u0438\u0442\u0443 \u0432\u0438\u0449\u0435 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u043f\u043e\u0434\u0456\u0431\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432\u0456\u0434 \u0456\u043d\u0448\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432.
pscanbeta.storablenoncacheable.name = \u0412\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u043d\u0430 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438, \u0430\u043b\u0435 \u043d\u0435 \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438
pscanbeta.storablenoncacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.storablenoncacheable.soln=
