pscanbeta.desc = \u30d9\u30fc\u30bf\u7248\u306e\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

pscanbeta.inpagebanner.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u30ec\u30b9\u30dd\u30f3\u30b9\u30b3\u30f3\u30c6\u30f3\u30c4\u5185\u306b\u30d0\u30fc\u30b8\u30e7\u30f3\u30d0\u30ca\u30fc\u6587\u5b57\u5217\u3092\u8fd4\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u3088\u3046\u306a\u60c5\u5831\u6f0f\u6d29\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u304c\u4f7f\u7528\u4e2d\u306e\u88fd\u54c1\u3084\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u5f71\u97ff\u3059\u308b\u7279\u5b9a\u306e\u8106\u5f31\u6027\u3092\u72d9\u3046\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.inpagebanner.name = \u30da\u30fc\u30b8\u5185\u30d0\u30ca\u30fc\u60c5\u5831\u6f0f\u6d29
pscanbeta.inpagebanner.other = \u691c\u51fa\u7d50\u679c\u306e\u30cf\u30a4\u30e9\u30a4\u30c8\u304c\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u5185\u306e\u4e00\u81f4\u3057\u305f\u6587\u5b57\u5217\u3067\u306f\u306a\u304f\u3001\u30d8\u30c3\u30c0\u30fc\u5185\u306e\u5024\u306b\u5bfe\u3057\u3066\u8868\u793a\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.inpagebanner.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/
pscanbeta.inpagebanner.soln = \u3053\u306e\u3088\u3046\u306a\u60c5\u5831\u6f0f\u3048\u3044\u3092\u9632\u3050\u3088\u3046\u30b5\u30fc\u30d0\u30fc\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4f8b\u3048\u3070\uff1a\n  * Tomcat \u3067\u306f\u3001"server" \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3068\u30ab\u30b9\u30bf\u30e0\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u306e\u5b9f\u88c5\u306b\u3088\u3063\u3066\u884c\u3044\u307e\u3059\u3002\n  * Apache \u3067\u306f\u3001"ServerSignature" \u304a\u3088\u3073 "ServerTokens" \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306b\u3088\u3063\u3066\u884c\u3044\u307e\u3059\u3002

pscanbeta.jsfunction.desc = \u5371\u967a\u306aJavaScript\u95a2\u6570\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u3001\u30b5\u30a4\u30c8\u304c\u8106\u5f31\u306b\u306a\u308b\u304a\u305d\u308c\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.jsfunction.name = \u5371\u967a\u306aJavaScript\u95a2\u6570
pscanbeta.jsfunction.refs = https\://v17.angular.io/guide/security
pscanbeta.jsfunction.soln = \u3053\u308c\u3089\u306e\u95a2\u6570\u306e\u4f7f\u7528\u306b\u95a2\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4e0a\u306e\u52a9\u8a00\u306b\u3064\u3044\u3066\u306f\u3001\u53c2\u8003\u60c5\u5831\u3092\u3054\u89a7\u304f\u3060\u3055\u3044\u3002

pscanbeta.jso.desc = Java\u30b7\u30ea\u30a2\u30eb\u5316\u306e\u4f7f\u7528\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u9069\u5207\u306a\u691c\u8a3c\u304c\u884c\u308f\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u653b\u6483\u8005\u306f\u60aa\u610f\u306e\u3042\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9001\u4fe1\u3057\u3066\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30c9\u5b9f\u884c\u653b\u6483\u3092\u5b9f\u884c\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002Java\u30b7\u30ea\u30a2\u30eb\u5316\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30de\u30b8\u30c3\u30af\u30d0\u30a4\u30c8 (Base64\: rO0AB\u300116\u9032\: 0xac, 0xed, 0x00, 0x05) \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
pscanbeta.jso.name = Java\u30b7\u30ea\u30a2\u30eb\u5316\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
pscanbeta.jso.refs = https\://www.oracle.com/java/technologies/javase/seccodeguide.html\#8
pscanbeta.jso.soln = \u4fe1\u983c\u3067\u304d\u306a\u3044\u30c7\u30fc\u30bf\u306e\u30c7\u30b7\u30ea\u30a2\u30e9\u30a4\u30bc\u30fc\u30b7\u30e7\u30f3\u306f\u672c\u8cea\u7684\u306b\u5371\u967a\u3067\u3042\u308a\u3001\u907f\u3051\u308b\u3079\u304d\u3067\u3059\u3002

pscanbeta.name = \u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb - Beta

pscanbeta.nonstorable.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u5185\u5bb9\u306f\u3001\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u306a\u3069\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u3002\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u60c5\u5831\u3001\u30e6\u30fc\u30b6\u30fc\u56fa\u6709\u306e\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u4fdd\u5b58\u304a\u3088\u3073\u30ad\u30e3\u30c3\u30b7\u30e5\u3059\u308b\u3053\u3068\u3067\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306e\u5411\u4e0a\u304c\u671f\u5f85\u3067\u304d\u307e\u3059\u3002
pscanbeta.nonstorable.name = \u4fdd\u5b58\u4e0d\u53ef\u80fd\u306a\u30b3\u30f3\u30c6\u30f3\u30c4
pscanbeta.nonstorable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.nonstorable.soln = \u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u30ad\u30e3\u30c3\u30b7\u30e5\u53ef\u80fd\u3068\u5224\u5b9a\u3055\u308c\u308b\u305f\u3081\u306e\u6761\u4ef6\uff1a\n\u57fa\u672c\u6761\u4ef6 (\u3059\u3079\u3066\u5fc5\u9808)\uff1a\n* \u30ad\u30e3\u30c3\u30b7\u30e5\u53ef\u80fd\u306aHTTP\u30e1\u30bd\u30c3\u30c9\uff08GET\u3001HEAD\u3001POST\uff09\n* \u8a8d\u8b58\u53ef\u80fd\u306a\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9\uff081XX\uff5e5XX\u306e\u5404\u30af\u30e9\u30b9\uff09\n* no-store\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u4e0d\u5b58\u5728\uff08\u30ea\u30af\u30a8\u30b9\u30c8\u30fb\u30ec\u30b9\u30dd\u30f3\u30b9\u5171\u306b\uff09\n\n\u5171\u6709\u30ad\u30e3\u30c3\u30b7\u30e5 (\u30d7\u30ed\u30ad\u30b7\u30ad\u30e3\u30c3\u30b7\u30e5\u7b49) \u3067\u306e\u8ffd\u52a0\u6761\u4ef6\uff1a\n* private \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u4e0d\u5b58\u5728\n* Authorization \u30d8\u30c3\u30c0\u30fc\u306e\u4e0d\u5b58\u5728 (\u305f\u3060\u3057\u3001must-revalidate\u3001public\u3001s-maxage \u306e\u6307\u5b9a\u304c\u3042\u308b\u5834\u5408\u306f\u4f8b\u5916)\n\n\u6709\u52b9\u671f\u9650\u6761\u4ef6 (\u3044\u305a\u308c\u304b1\u3064\u4ee5\u4e0a)\uff1a\n* Expires \u30d8\u30c3\u30c0\u30fc\u306e\u5b58\u5728\n* max-age \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b58\u5728\n* s-maxage \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b58\u5728 (\u5171\u6709\u30ad\u30e3\u30c3\u30b7\u30e5\u7528)\n* \u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u8a31\u53ef\u3059\u308b Cache Control Extension \u306e\u5b58\u5728\n* \u30c7\u30d5\u30a9\u30eb\u30c8\u30ad\u30e3\u30c3\u30b7\u30e5\u53ef\u80fd\u30b9\u30c6\u30fc\u30bf\u30b9\u30b3\u30fc\u30c9 (200\u3001203\u3001204\u3001206\u3001300\u3001301\u3001404\u3001405\u3001410\u3001414\u3001501)

pscanbeta.payloader.desc = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306b\u304a\u3051\u308b\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
pscanbeta.payloader.name = \u30d9\u30fc\u30bf\u7248\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u7528\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9

pscanbeta.permissionspolicymissing.deprecated.desc = \u30d8\u30c3\u30c0\u30fc\u306f Permissions-Policy \u306b\u540d\u79f0\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
pscanbeta.permissionspolicymissing.deprecated.name = \u975e\u63a8\u5968\u306eFeature-Policy\u30d8\u30c3\u30c0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059
pscanbeta.permissionspolicymissing.deprecated.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Permissions-Policy\nhttps\://scotthelme.co.uk/goodbye-feature-policy-and-hello-permissions-policy/
pscanbeta.permissionspolicymissing.deprecated.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001Feature-Policy\u30d8\u30c3\u30c0\u30fc\u306e\u4ee3\u308f\u308a\u306bPermissions-Policy\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanbeta.permissionspolicymissing.desc = Permissions Policy Header\u306f\u3001Web\u30da\u30fc\u30b8\u304c\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u30d6\u30e9\u30a6\u30b6API\u6a5f\u80fd\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u3067\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30e9\u30a4\u30d0\u30b7\u30fc\u3068\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3092\u4fdd\u8b77\u3059\u308b\u4ed5\u7d44\u307f\u3067\u3059\u3002\u3053\u306e\u30dd\u30ea\u30b7\u30fc\u306b\u3088\u308a\u3001Web\u30b5\u30a4\u30c8\u7ba1\u7406\u8005\u306f\u3001\u30ab\u30e1\u30e9\u3001\u30de\u30a4\u30af\u30ed\u30d5\u30a9\u30f3\u3001\u4f4d\u7f6e\u60c5\u5831\u3001\u30d5\u30eb\u30b9\u30af\u30ea\u30fc\u30f3\u8868\u793a\u306a\u3069\u306e\u6a5f\u80fd\u3078\u306e\u7121\u8a31\u53ef\u30a2\u30af\u30bb\u30b9\u3092\u9632\u3050\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u6a19\u6e96HTTP\u30d8\u30c3\u30c0\u30fc\u3092\u901a\u3058\u3066\u3001\u30da\u30fc\u30b8\u304a\u3088\u3073\u57cb\u3081\u8fbc\u307f\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u6a5f\u80fd\u3092\u7d30\u304b\u304f\u5236\u5fa1\u3067\u304d\u307e\u3059\u3002
pscanbeta.permissionspolicymissing.name = Permissions-Policy \u30d8\u30c3\u30c0\u30fc\u672a\u8a2d\u5b9a
pscanbeta.permissionspolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Permissions-Policy\nhttps\://developer.chrome.com/blog/feature-policy/\nhttps\://scotthelme.co.uk/a-new-security-header-feature-policy/\nhttps\://w3c.github.io/webappsec-feature-policy/\nhttps\://www.smashingmagazine.com/2018/12/feature-policy/
pscanbeta.permissionspolicymissing.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001Permissions-Policy \u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanbeta.servletparameterpollution.desc = \u30d5\u30a9\u30fc\u30e0\u306e action \u5c5e\u6027\u304c\u672a\u6307\u5b9a\u3067\u3059\u3002HTTP\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u4e0a\u66f8\u304d\u653b\u6483\u304c\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306fJava\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3067\u77e5\u3089\u308c\u3066\u3044\u308b\u554f\u984c\u3067\u3059\u304c\u3001\u4ed6\u306e\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u3082\u8106\u5f31\u306a\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.servletparameterpollution.name = HTTP\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u4e0a\u66f8\u304d
pscanbeta.servletparameterpollution.refs = https\://download.oracle.com/javaee-archive/servlet-spec.java.net/jsr340-experts/att-0317/OnParameterPollutionAttacks.pdf
pscanbeta.servletparameterpollution.soln = \u3059\u3079\u3066\u306e\u30d5\u30a9\u30fc\u30e0\u3067 action URL \u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

pscanbeta.site-isolation.coep.desc = Cross-Origin-Embedder-Policy \u30d8\u30c3\u30c0\u30fc\u306f\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u660e\u793a\u7684\u306b\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u30af\u30ed\u30b9\u30aa\u30ea\u30b8\u30f3\u30ea\u30bd\u30fc\u30b9 (CORP \u307e\u305f\u306f CORS \u3092\u4f7f\u7528) \u3092\u8aad\u307f\u8fbc\u3080\u306e\u3092\u9632\u3050\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3067\u3059\u3002
pscanbeta.site-isolation.coep.name = Cross-Origin-Embedder-Policy \u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u843d\u307e\u305f\u306f\u7121\u52b9
pscanbeta.site-isolation.coep.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.coep.soln = Web\u30b5\u30fc\u30d0\u30fc/\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 Cross-Origin-Embedder-Policy \u30d8\u30c3\u30c0\u30fc\u3092 'require-corp' \u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001\u30af\u30ed\u30b9\u30aa\u30ea\u30b8\u30f3\u30ea\u30bd\u30fc\u30b9\u306e\u57cb\u3081\u8fbc\u307f\u306bCORP (Cross-Origin-Resource-Policy) \u30d8\u30c3\u30c0\u30fc\u306b\u3088\u308b\u660e\u793a\u7684\u8a31\u53ef\u304c\u5fc5\u8981\u3068\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u6a19\u6e96\u6e96\u62e0\u306e\u30e2\u30c0\u30f3\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u5229\u7528\u3092\u63a8\u5968\u3057\u307e\u3059 (https\://caniuse.com/mdn-http_headers_cross-origin-embedder-policy)\u3002
pscanbeta.site-isolation.coop.desc = Cross-Origin-Opener-Policy \u30d8\u30c3\u30c0\u30fc\u306f\u3001\u30b5\u30a4\u30c8\u304c\u3001\u4ed6\u306e\u542b\u307e\u308c\u305f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3068\u540c\u4e00\u306e\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u5171\u6709\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5236\u5fa1\u3059\u308b\u305f\u3081\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3067\u3059\u3002\u4fe1\u983c\u3067\u304d\u306a\u3044\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3068\u540c\u4e00\u306e\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u5171\u6709\u3059\u308b\u3068\u3001\u30c7\u30fc\u30bf\u6f0f\u3048\u3044\u306b\u3064\u306a\u304c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.site-isolation.coop.name = Cross-Origin-Opener-Policy \u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u843d\u307e\u305f\u306f\u7121\u52b9
pscanbeta.site-isolation.coop.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Cross-Origin-Opener-Policy
pscanbeta.site-isolation.coop.soln = Web\u30b5\u30fc\u30d0\u30fc/\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 Cross-Origin-Opener-Policy \u30d8\u30c3\u30c0\u30fc\u3092 'same-origin' \u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001\u7570\u306a\u308b\u30aa\u30ea\u30b8\u30f3\u304b\u3089\u306e\u30a6\u30a3\u30f3\u30c9\u30a6\u53c2\u7167\u304c\u906e\u65ad\u3055\u308c\u3001\u30b5\u30a4\u30c9\u30c1\u30e3\u30cd\u30eb\u653b\u6483\u304b\u3089\u306e\u4fdd\u8b77\u304c\u5411\u4e0a\u3057\u307e\u3059\u3002\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u306e\u4f4e\u3044 'same-origin-allow-popups' \u306f\u4f7f\u7528\u3092\u907f\u3051\u3001\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u6a19\u6e96\u6e96\u62e0\u306e\u30e2\u30c0\u30f3\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u5229\u7528\u3092\u63a8\u5968\u3057\u307e\u3059 (https\://caniuse.com/mdn-http_headers_cross-origin-opener-policy)\u3002
pscanbeta.site-isolation.corp.desc = Cross-Origin-Resource-Policy \u30d8\u30c3\u30c0\u30fc\u306f\u3001Spectre \u306e\u3088\u3046\u306a\u30b5\u30a4\u30c9\u30c1\u30e3\u30cd\u30eb\u653b\u6483\u306b\u5bfe\u6297\u3059\u308b\u305f\u3081\u306b\u8a2d\u8a08\u3055\u308c\u305f\u30aa\u30d7\u30c8\u30a4\u30f3\u306e\u30d8\u30c3\u30c0\u30fc\u3067\u3059\u3002\u30ea\u30bd\u30fc\u30b9\u306f\u3001\u7570\u306a\u308b\u30aa\u30ea\u30b8\u30f3\u9593\u3067\u5171\u6709\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u660e\u793a\u7684\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.site-isolation.corp.name = Cross-Origin-Resource-Policy \u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u843d\u307e\u305f\u306f\u7121\u52b9
pscanbeta.site-isolation.corp.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Cross-Origin-Embedder-Policy
pscanbeta.site-isolation.corp.soln = Web\u30b5\u30fc\u30d0\u30fc/\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 Cross-Origin-Resource-Policy \u30d8\u30c3\u30c0\u30fc\u3092\u9069\u5207\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3059\u3079\u3066\u306eWeb\u30da\u30fc\u30b8\u306b\u306f\u6700\u3082\u5b89\u5168\u306a 'same-origin' \u3092\u8a2d\u5b9a\u3057\u3001CDN\u3084\u5171\u6709\u30ea\u30bd\u30fc\u30b9\u306a\u3069\u4ed6\u30aa\u30ea\u30b8\u30f3\u304b\u3089\u306e\u8aad\u307f\u8fbc\u307f\u304c\u5fc5\u8981\u306a\u5834\u5408\u306e\u307f 'cross-origin' \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u306e\u4f4e\u3044 'same-site' \u306f\u4f7f\u7528\u3092\u907f\u3051\u3001\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u6a19\u6e96\u6e96\u62e0\u306e\u30e2\u30c0\u30f3\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u5229\u7528\u3092\u63a8\u5968\u3057\u307e\u3059 (https\://caniuse.com/mdn-http_headers_cross-origin-resource-policy)\u3002
pscanbeta.site-isolation.name = Spectre\u8106\u5f31\u6027\u306b\u5bfe\u3059\u308b\u30b5\u30a4\u30c8\u9694\u96e2\u306e\u4e0d\u5099

pscanbeta.sourcecodedisclosure.desc = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304cWeb\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u9732\u898b\u3057\u307e\u3057\u305f\u3002
pscanbeta.sourcecodedisclosure.name = \u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b
pscanbeta.sourcecodedisclosure.refs = https\://nhimg.org/twitter-breach
pscanbeta.sourcecodedisclosure.soln = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304c\u4ee3\u66ff\u306e\u62e1\u5f35\u5b50\u3067\u5229\u7528\u3067\u304d\u306a\u3044\u3053\u3068\u3001\u307e\u305f\u3001Web\u30b5\u30fc\u30d0\u30fc\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u305f\u3001\u3082\u3057\u304f\u306fWeb\u30b5\u30fc\u30d0\u30fc\u304c\u63d0\u4f9b\u3059\u308b\u4ed6\u306e\u30d5\u30a1\u30a4\u30eb\u3084\u30c7\u30fc\u30bf\u5185\u306b\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304c\u5b58\u5728\u3057\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanbeta.sri-integrity.desc = \u5916\u90e8\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u63d0\u4f9b\u3055\u308c\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u307e\u305f\u306f\u30ea\u30f3\u30af\u30bf\u30b0\u306b\u3001integrity \u5c5e\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u5c5e\u6027\u306f\u3001\u653b\u6483\u8005\u304c\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u7372\u5f97\u3057\u305f\u5834\u5408\u306b\u3001\u60aa\u610f\u306e\u3042\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u6ce8\u5165\u3059\u308b\u306e\u3092\u9632\u304e\u307e\u3059\u3002
pscanbeta.sri-integrity.name = \u30b5\u30d6\u30ea\u30bd\u30fc\u30b9\u6574\u5408\u6027\u5c5e\u6027\u306e\u6b20\u843d
pscanbeta.sri-integrity.otherinfo = \u5bfe\u8c61\u306e\u30b9\u30af\u30ea\u30d7\u30c8 {0} \u306b\u5bfe\u3057\u3066\u3001\u4ee5\u4e0b\u306e\u30cf\u30c3\u30b7\u30e5\u5024\u304c\u8a08\u7b97\u3055\u308c\u307e\u3057\u305f (\u30cf\u30c3\u30b7\u30e5\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 SHA-384 \u306e\u51fa\u529b\u3092Base64\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u305f\u3082\u306e)\u3002
pscanbeta.sri-integrity.refs = https\://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity
pscanbeta.sri-integrity.soln = \u30bf\u30b0\u306b\u6709\u52b9\u306a integrity \u5c5e\u6027\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanbeta.storabilitycacheability.name = \u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u9069\u6027

pscanbeta.storablecacheable.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u5171\u6709\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc (\u30d7\u30ed\u30ad\u30b7\u30ad\u30e3\u30c3\u30b7\u30e5\u7b49) \u306b\u4fdd\u5b58\u53ef\u80fd\u306a\u72b6\u614b\u3067\u3059\u3002\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u30c7\u30fc\u30bf\u3001\u307e\u305f\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u56fa\u6709\u306e\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u304b\u3089\u306e\u540c\u69d8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u914d\u4fe1\u3055\u308c\u3001\u60c5\u5831\u6f0f\u6d29\u3084\u30bb\u30c3\u30b7\u30e7\u30f3\u4e57\u3063\u53d6\u308a\u304c\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u554f\u984c\u306f\u4e3b\u306b\u3001\u4f01\u696d\u3084\u6559\u80b2\u6a5f\u95a2\u306a\u3069\u306e\u5171\u6709\u30d7\u30ed\u30ad\u30b7\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc\u304c\u8a2d\u7f6e\u3055\u308c\u305f\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u74b0\u5883\u3067\u767a\u751f\u3057\u307e\u3059\u3002
pscanbeta.storablecacheable.name = \u4fdd\u5b58\u53ef\u80fd\u3067\u30ad\u30e3\u30c3\u30b7\u30e5\u53ef\u80fd\u306a\u30b3\u30f3\u30c6\u30f3\u30c4
pscanbeta.storablecacheable.otherinfo.liberallifetimeheuristic = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u6709\u52b9\u671f\u9593\u3092\u660e\u793a\u3059\u308b\u6307\u793a\u304c\u306a\u3044\u5834\u5408\u30011\u5e74\u3068\u3044\u3046\u5bdb\u5bb9\u306a\u671f\u9593\u306e\u30d2\u30e5\u30fc\u30ea\u30b9\u30c6\u30a3\u30c3\u30af\u304c\u4eee\u5b9a\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306f RFC 7234 \u306b\u3088\u308a\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanbeta.storablecacheable.otherinfo.staleretrievenotblocked = \u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306f\u671f\u9650\u5207\u308c\u3067\u3042\u308a\u3001'must-revalidate'\u3001'proxy-revalidate'\u3001's-maxage'\u3001\u307e\u305f\u306f 'max-age' \u306a\u3069\u306e Cache-Control \u30ec\u30b9\u30dd\u30f3\u30b9\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u4f7f\u7528\u3057\u305f\u518d\u691c\u8a3c\u3084\u30d6\u30ed\u30c3\u30af\u306e\u8a2d\u5b9a\u304c\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanbeta.storablecacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
pscanbeta.storablecacheable.soln = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u60c5\u5831\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u30fc\u56fa\u6709\u306e\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u304b\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u4ee5\u4e0b\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u308b\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u306e\u30a2\u30af\u30bb\u30b9\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nCache-Control\: no-cache, no-store, must-revalidate, private\nPragma\: no-cache\nExpires\: 0\n\u3053\u306e\u8a2d\u5b9a\u306f\u3001HTTP/1.0\u304a\u3088\u3073HTTP/1.1\u6e96\u62e0\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u4fdd\u5b58\u305b\u305a\u3001\u540c\u69d8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u3082\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u306e\u914d\u4fe1\u3092\u884c\u308f\u306a\u3044\u3088\u3046\u6307\u793a\u3057\u307e\u3059\u3002

pscanbeta.storablenoncacheable.desc = \u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u5185\u5bb9\u306f\u3001\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u30fc\u306a\u3069\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u4fdd\u5b58\u53ef\u80fd\u3067\u3059\u304c\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u304b\u3089\u306e\u540c\u69d8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u306f\u3001\u30a2\u30c3\u30d7\u30b9\u30c8\u30ea\u30fc\u30e0\u3067\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u518d\u691c\u8a3c\u3059\u308b\u3053\u3068\u306a\u304f\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u76f4\u63a5\u53d6\u5f97\u3055\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002
pscanbeta.storablenoncacheable.name = \u4fdd\u5b58\u53ef\u80fd\u3060\u304c\u30ad\u30e3\u30c3\u30b7\u30e5\u4e0d\u53ef\u306a\u30b3\u30f3\u30c6\u30f3\u30c4
pscanbeta.storablenoncacheable.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html
