#X-Generator: crowdin.net
# ZAP Script Console 
#
# This file defines the default (English) variants of all of the internationalised messages

quickstart.desc=Panel de inicio r\u00e1pido 
quickstart.panel.title=Inicio R\u00e1pido
quickstart.button.label.attack=Atacar
quickstart.button.tooltip.attack=Realizar un test de penetraci\u00f3n r\u00e1pido en la URL
quickstart.button.label.mitm=Plug-n-Hack
quickstart.button.tooltip.mitm=Ajuste la configuraci\u00f3n del proxy de su navegador a trav\u00e9s de ZAP usando Plug-n-Hack
quickstart.button.label.stop=Detener
quickstart.button.tooltip.stop=Detener el ataque
quickstart.label.show=Mostrar esta pesta\u00f1a al inicio\:
quickstart.label.mitm=Configure su navegador\:
quickstart.label.progress=Progreso\:
quickstart.label.url=URL a atacar\:
quickstart.panel.helpmsg=<html><p>Ver el archivo de ayuda para obtener m\u00e1s informaci\u00f3n.</p><p><p></html>
quickstart.panel.proxymsg=<html><p><p><p>Para un an\u00e1lisis m\u00e1s en profundidad de la prueba se debe explorar la aplicaci\u00f3n mediante pruebas de regresi\u00f3n automatizadas navegando a trav\u00e9s ZAP como proxy.</p> <p></p> <p>Si usted est\u00e1 usando Firefox 24.0 o superior puede usar 'Plug-n-Hack' para configurar su navegador\:</p></html>
quickstart.panel.topmsg=<h1>Bienvenido al OWASP Zed Attack Proxy (ZAP)</h1> <html><p>ZAP es una herramienta para pruebas de penetraci\u00f3n, de f\u00e1cil uso y con m\u00faltiples componentes, para encontrar vulnerabilidades en aplicaciones web.</p><p></p> <p>Ten en cuenta que  s\u00f3lo debes atacar aplicaciones para las cuales se ha sido previamente autorizado.</p><p></p> <p>Para probar una aplicaci\u00f3n rapidamente, introduzca el URL abajo y presiona 'Atacar'.</p><p><p></html>
quickstart.progress.ascan=Explorando (atacando) activamente los URLs descubiertos por el programa 'spider'
quickstart.progress.complete=Ataque completo - vea los problemas encontrados en la pesta\u00f1a Alertas
quickstart.progress.failed=Error al atacar la URL, verifique que la URL sea v\u00e1lida
quickstart.progress.notstarted=No iniciado
quickstart.progress.spider=Explorando (spidering) el URL para descubrir el contenido del sitio
quickstart.progress.stopped=Detenido manualmente
quickstart.start.remove=\u00bfDesea retirar la pesta\u00f1a Inicio R\u00e1pido? Puede agregarla nuevamente marcando la extensi\u00f3n\: ExtensionQuickStart
quickstart.url.warning.invalid=Por favor, introduzca una URL v\u00e1lida para atacar.

quickstart.label.mitmalt=O utilice en el navegador\:
quickstart.label.mitmurl=Apunte su navegador a\:
