#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages
pscanalpha.desc=Pasif Tarama Kurallar\u0131 - alfa

pscanalpha.examplefile.name=Bir dosyadan veri y\u00fckler bir \u00f6rnek pasif tarama kural\u0131
pscanalpha.examplefile.desc=Burada g\u00fcvenlik a\u00e7\u0131\u011f\u0131 hakk\u0131nda daha fazla bilgi ekle
pscanalpha.examplefile.other=Bu, di\u011fer b\u00f6l\u00fcmlerin herhangi bir uygun does not bilgi i\u00e7indir
pscanalpha.examplefile.soln=Sorunu \u00e7\u00f6zmek i\u00e7in nas\u0131l genel bir a\u00e7\u0131klama
pscanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-3-passive-scan-rules.html

pscanalpha.insecureformload.name=Form Post HTTPS g\u00fcvensiz Ge\u00e7i\u015f HTTP
pscanalpha.insecureformload.desc=Bu kontrol g\u00fcvensiz HTTP sayfalar\u0131 bar\u0131nd\u0131ran HTTPS formlar\u0131 arar. Sorun g\u00fcvensiz HTTP sayfas\u0131 kolayca MITM yoluyla ka\u00e7\u0131rd\u0131lar olabilir ve g\u00fcvenli HTTPS formu de\u011fi\u015ftirilebilir veya sahte olmas\u0131d\u0131r.
pscanalpha.insecureformload.refs=
pscanalpha.insecureformload.soln=G\u00fcvenli formlar\u0131 bar\u0131nd\u0131ran a\u00e7\u0131l\u0131\u015f sayfalar\u0131 i\u00e7in HTTPS kullan\u0131n.
pscanalpha.insecureformload.exploit=
pscanalpha.insecureformload.extrainfo=HTTP \u00fczerinden a\u015fa\u011f\u0131daki iste\u011fine yan\u0131t bir HTTPS form etiketi eylem \u00f6znitelik de\u011feri dahil\:\n\n {0} ba\u011flam oldu\:\n\n {1}

pscanalpha.insecureformpost.name=HTTPS Form Post g\u00fcvensiz Ge\u00e7i\u015f http
pscanalpha.insecureformpost.desc=Bu kontrol g\u00fcvensiz HTTP formlar\u0131 bar\u0131nd\u0131ran g\u00fcvenli HTTPS sayfalar\u0131 belirler. Sorun verileri bir form arac\u0131l\u0131\u011f\u0131yla y\u00fcklendi\u011finde, g\u00fcvenli bir sayfan\u0131n g\u00fcvenli olmayan sayfaya ge\u00e7i\u015f olmas\u0131d\u0131r. Kullan\u0131c\u0131 asl\u0131nda onlar olmad\u0131\u011f\u0131 zaman onlar g\u00fcvenli bir sayfaya veri g\u00f6nderme d\u00fc\u015f\u00fcn\u00fcyorum edebilir.
pscanalpha.insecureformpost.refs=
pscanalpha.insecureformpost.soln=Hassas verileri sa\u011flamak, sadece g\u00fcvenli HTTPS kanallar\u0131 \u00fczerinden g\u00f6nderilir.
pscanalpha.insecureformpost.exploit=
pscanalpha.insecureformpost.extrainfo=HTTPS \u00fczerinden a\u015fa\u011f\u0131daki iste\u011fine yan\u0131t bir HTTP form etiketi eylem \u00f6znitelik de\u011feri dahil\:\n\n {0} ba\u011flam oldu\:\n\n {1}

pscanalpha.usercontrolledcharset.name=Kullan\u0131c\u0131 Kontrol Edilebilir Karakter
pscanalpha.usercontrolledcharset.desc=Content-Type veya meta tag charset bildirimleri kullan\u0131c\u0131 kontroll\u00fc olabilir nerede bu onay belirlemek i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. B\u00f6yle bir charset bildirimleri her zaman uygulama taraf\u0131ndan beyan edilmelidir. Bir sald\u0131rgan\u0131n yan\u0131t charset kontrol edebilirsiniz, onlar XSS veya di\u011fer sald\u0131r\u0131lar\u0131 ger\u00e7ekle\u015ftirmek i\u00e7in HTML manip\u00fcle olabilir.
pscanalpha.usercontrolledcharset.refs=
pscanalpha.usercontrolledcharset.soln=Kuvvet UTF-8 t\u00fcm charset beyanlar\u0131nda. Kullan\u0131c\u0131 giri\u015fi charset beyan\u0131 karar gerekiyorsa, sadece izin verilen liste kullan\u0131ld\u0131\u011f\u0131ndan emin olun.
pscanalpha.usercontrolledcharset.exploit=Kontrol Sald\u0131rgan, <meta> eleman\u0131 charset de\u011feri UTF-7 ilan edebilir ve ayn\u0131 zamanda UTF-7 olarak yorumlanabilir i\u00e7in erken HTML belgesi yeterli kullan\u0131c\u0131 kontroll\u00fc y\u00fck\u00fc dahil edebiliyor. UTF-7 ile y\u00fck\u00fc kodlayarak sald\u0131rgan sayfas\u0131nda herhangi bir sunucu taraf\u0131 XSS korumalar\u0131 ve embed komut atlamak m\u00fcmk\u00fcn.
pscanalpha.usercontrolledcharset.extrainfo=A (n) [ {0} ] etiketi [ {1} ] kullan\u0131c\u0131 giri\u015fi bulundu \u00f6zniteli\u011fi\:\n {2} \= {3} \n\nkontroll\u00fc charset de\u011fer oldu\:\n {4}

pscanalpha.usercontrolledcookie.name=\u00c7erez Zehirlenmesi
pscanalpha.usercontrolledcookie.desc=Bu onay \u00e7erez parametreleri kontrol edilebilir nerede belirlemek i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. Bu bir \u00e7erez zehirlenmesi sald\u0131r\u0131s\u0131 ad\u0131 verilen ve bir sald\u0131rgan\u0131n \u00e7e\u015fitli \u015fekillerde tan\u0131mlama i\u015fleyebilirsiniz zaman i\u015fletilebilir hale gelir. Baz\u0131 durumlarda bu, genellikle bir hata olarak kabul edilir URL parametreleri \u00e7erez de\u011ferleri ayarlamak i\u00e7in izin, ancak, s\u00f6m\u00fcr\u00fclebilir olmayacakt\u0131r.
pscanalpha.usercontrolledcookie.refs=http\://websecuritytool.codeplex.com/wikipage?title\=Checks\#user-controlled-cookie
pscanalpha.usercontrolledcookie.soln=Kullan\u0131c\u0131 giri\u015fi cookie isimlerini ve de\u011ferlerini kontrol etmek i\u00e7in izin vermeyin. Baz\u0131 sorgu dizesi parametreleri cookie de\u011ferlerine ayarlanm\u0131\u015f gerekiyorsa, d\u0131\u015far\u0131 noktal\u0131 virg\u00fcl ad\u0131 / de\u011fer \u00e7ifti ayra\u00e7 olarak hizmet verebilir filtrelemek i\u00e7in emin olun.
pscanalpha.usercontrolledcookie.exploit.get=Sald\u0131rgan, URL parametreleri arac\u0131l\u0131\u011f\u0131yla \u00e7erez de\u011ferlerini zehirlemek m\u00fcmk\u00fcn olabilir. (; Name \= anotherValue; \u00f6rne\u011fin name \= controlledValue) \u00e7erez de\u011ferleri ekleyebilirsiniz olmad\u0131\u011f\u0131n\u0131 g\u00f6rmek i\u00e7in bir noktal\u0131 virg\u00fcl enjekte deneyin.
pscanalpha.usercontrolledcookie.exploit.post=Sald\u0131rgan, POST parametreleri arac\u0131l\u0131\u011f\u0131yla \u00e7erez de\u011ferlerini zehirlemek m\u00fcmk\u00fcn olabilir. POST parametresi bir sorgu dizesi Parmeter olarak dahil olan bu daha ciddi bir sorun olup olmad\u0131\u011f\u0131n\u0131 test etmek i\u00e7in, bir GET olarak bu talebi yeniden g\u00f6ndermeyi deneyin gerekir. Http\://nottrusted.com/page?value\=maliciousInput \u00d6rne\u011fin.\n\n
pscanalpha.usercontrolledcookie.extrainfo=Bu tespit edilmi\u015ftir\:\n\n {0} \n\nKullan\u0131c\u0131 giri\u015fi a\u015fa\u011f\u0131daki \u00e7erez bulundu\:\n {1} \n\nkullan\u0131c\u0131 giri\u015fi oldu\:\n {2} \= {3}

pscanalpha.usercontrolledjavascriptevent.name=Kullan\u0131c\u0131 Kontrol Edilebilir JavaScript Olay (XSS)
pscanalpha.usercontrolledjavascriptevent.desc=Bu kontrol, belirli bir HTML \u00f6znitelik de\u011ferleri kontrol edilebilir nerede belirlemek i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. Bu Yararlanma belirlemek i\u00e7in bir g\u00fcvenlik analisti taraf\u0131ndan daha fazla g\u00f6zden gerektirir XSS (cross-site scripting) i\u00e7in hot-spot alg\u0131lanmas\u0131n\u0131 sa\u011flar.            
pscanalpha.usercontrolledjavascriptevent.refs=http\://websecuritytool.codeplex.com/wikipage?title\=Checks\#user-javascript-event
pscanalpha.usercontrolledjavascriptevent.soln=T\u00fcm giri\u015f do\u011frulamak ve * olaylardan herhangi Javascript yazmadan \u00f6nce \u00e7\u0131kt\u0131 onu dezenfekte.
pscanalpha.usercontrolledjavascriptevent.exploit=
pscanalpha.usercontrolledjavascriptevent.extrainfo=Kullan\u0131c\u0131 kontroll\u00fc javascript olay (lar) bulundu. Yararlanma elle tespit edilmesi gerekir. a\u015fa\u011f\u0131daki URL''den sayfa\:\n\n {0} "sald\u0131rgan kontroll\u00fc olabilir a\u015fa\u011f\u0131daki Javascript olay\u0131 i\u00e7erir\:  \n\nKullan\u0131c\u0131 input [a\u015fa\u011f\u0131daki verilere bulundu {1} ] olay\:\n {2} \n\nkullan\u0131c\u0131 giri\u015fi oldu\:\n {3}

pscanalpha.usercontrolledjavascriptproperty.name=Kullan\u0131c\u0131 Kontrol Edilebilir JavaScript \u00f6zelli\u011fi (XSS)
pscanalpha.usercontrolledjavascriptproperty.desc=Bu kontrol becontrolled olabilir (\u00f6rn createElement src) baz\u0131 javascript \u00f6zelliklerinde nereye URL tan\u0131mlamak i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. Bu Yararlanma belirlemek i\u00e7in bir g\u00fcvenlik analisti taraf\u0131ndan daha fazla g\u00f6zden gerektirir XSS (cross-site scripting) i\u00e7in hot-spot alg\u0131lanmas\u0131n\u0131 sa\u011flar.            
pscanalpha.usercontrolledjavascriptproperty.refs=http\://websecuritytool.codeplex.com/wikipage?title\=Checks\#user-controlled-javascript-reference
pscanalpha.usercontrolledjavascriptproperty.soln=Kullan\u0131c\u0131 giri\u015fi javascript kaynak yeri ba\u015fvurular\u0131 kontrol etmesine izin vermeyin.
pscanalpha.usercontrolledjavascriptproperty.exploit=
pscanalpha.usercontrolledjavascriptproperty.extrainfo=a\u015fa\u011f\u0131daki URL''den sayfa bir javascript \u00f6zellik de\u011feri kullan\u0131c\u0131 giri\u015fi i\u00e7eren g\u00f6r\u00fcn\u00fcr\:\n\n {0} kullan\u0131c\u0131 giri\u015fi bulunamad\u0131 oldu\:\n {1} \= {2} \n\nba\u011flam oldu\:\n {3}

pscanalpha.usercontrolledhtmlattributes.name=Kullan\u0131c\u0131 Kontrol Edilebilir HTML Eleman \u00d6zellik (Potansiyel XSS)
pscanalpha.usercontrolledhtmlattributes.desc=Bu kontrol, belirli bir HTML \u00f6znitelik de\u011ferleri kontrol edilebilir nerede belirlemek i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. Bu Yararlanma belirlemek i\u00e7in bir g\u00fcvenlik analisti taraf\u0131ndan daha fazla g\u00f6zden gerektirir XSS (cross-site scripting) i\u00e7in hot-spot alg\u0131lanmas\u0131n\u0131 sa\u011flar.
pscanalpha.usercontrolledhtmlattributes.refs=http\://websecuritytool.codeplex.com/wikipage?title\=Checks\#user-controlled-html-attribute
pscanalpha.usercontrolledhtmlattributes.soln=T\u00fcm giri\u015f do\u011frulamak ve herhangi bir HTML \u00f6zelliklerine yazmadan \u00f6nce \u00e7\u0131kt\u0131 onu dezenfekte.
pscanalpha.usercontrolledhtmlattributes.exploit=
pscanalpha.usercontrolledhtmlattributes.extrainfo=Kullan\u0131c\u0131 kontroll\u00fc HTML \u00f6znitelik de\u011ferleri bulunmu\u015ftur. XSS m\u00fcmk\u00fcn olabilir g\u00f6rmek i\u00e7in \u00f6zel karakterleri enjekte deneyin. a\u015fa\u011f\u0131daki URL''den sayfa\:\n\n {0} \n\nkullan\u0131c\u0131 giri\u015fi dahil g\u00f6r\u00fcn\u00fcr\:  \n\na (n) [ {1} ] etiketi [ {2} ] \u00f6zniteli\u011fi  \n\nkullan\u0131c\u0131 giri\u015fi oldu bulundu\:\n {3} \= {4} \n\nkullan\u0131c\u0131 kontroll\u00fc de\u011fer\:\n {5}

pscanalpha.usercontrolledopenredirect.name=A\u00e7\u0131k Y\u00f6nlendirme
pscanalpha.usercontrolledopenredirect.desc=A\u00e7\u0131k y\u00f6nlendirmeler OWASP 2010 Top Ten g\u00fcvenlik a\u00e7\u0131klar\u0131ndan biridir. Bu kontrol, a\u00e7\u0131k y\u00f6nlendirmeler m\u00fcmk\u00fcn olabilir nerede belirlemek i\u00e7in sorgu dizesi parametreleri ve POST verilerinde kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi bakar. Bir uygulama d\u0131\u015f\u0131na y\u00f6nlendirme kontrol etmek i\u00e7in kullan\u0131c\u0131 taraf\u0131ndan sa\u011flanan giri\u015fi (\u00f6rn http\://nottrusted.com) izin verdi\u011fi A\u00e7\u0131k y\u00f6nlendirmeleri ortaya \u00e7\u0131kar. Bu 301 ya da 302 y\u00f6nlendirmeleri spam veya phishing sald\u0131r\u0131lar\u0131 taraf\u0131ndan istismar edilebilir nerede oldu\u011funu bulmak i\u00e7in genellikle olduk\u00e7a do\u011fru bir yoldur
pscanalpha.usercontrolledopenredirect.soln=A\u00e7\u0131k y\u00f6nlendirme a\u00e7\u0131\u011f\u0131 \u00f6nlemek i\u00e7in, uygulama script / program parametreleri istemci taray\u0131c\u0131s\u0131na 302 HTTP kodu (y\u00f6nlendirme) g\u00f6ndermeden \u00f6nce do\u011frulanmas\u0131 gerekir. G\u00fcvenli y\u00f6nlendirme sadece g\u00f6reli URI en y\u00f6nlendirir i\u015flevselli\u011fi veya g\u00fcvenilen etki alanlar\u0131n\u0131n bir listesini uygulamak
pscanalpha.usercontrolledopenredirect.exploit=Http\://example.com/example.php?url\=http\://malicious.example.com\: Sald\u0131rgan, a\u015fa\u011f\u0131daki ba\u011flant\u0131y\u0131 kullanarak bir kullan\u0131c\u0131 kayna\u011f\u0131 olabilir
pscanalpha.usercontrolledopenredirect.refs=https\://www.owasp.org/index.php/Open_redirect\nhttps\://owasp.org/index.php/Top_10_2010-A10-Unvalidated_Redirects_and_Forwards\nhttps\://cwe.mitre.org/data/definitions/601.html
pscanalpha.usercontrolledopenredirect.extrainfo.get=A\u015fa\u011f\u0131daki URL i\u00e7in bir istek 301 veya 302 yan\u0131t konumu ba\u015fl\u0131\u011f\u0131nda kullan\u0131c\u0131 giri\u015fi i\u00e7ermesi ortaya \u00e7\u0131kt\u0131\:\n\n
pscanalpha.usercontrolledopenredirect.extrainfo.post=POST parametreleri taraf\u0131ndan kontrol edilen bir a\u00e7\u0131k y\u00f6nlendirme tespit edildi. POST parametresi bir sorgu dizesi parametresi olarak dahil olan bu daha ciddi bir sorun olup olmad\u0131\u011f\u0131n\u0131 test etmek i\u00e7in, bir GET olarak bu talebi yeniden g\u00f6ndermeyi deneyin gerekir. Http\://nottrusted.com/page?url\=http\://lookout.net \u00d6rne\u011fin. A\u015fa\u011f\u0131daki URL i\u00e7in bir istek 301 veya 302 yan\u0131t konumu ba\u015fl\u0131\u011f\u0131nda kullan\u0131c\u0131 giri\u015fi i\u00e7ermesi ortaya \u00e7\u0131kt\u0131\:\n\n
pscanalpha.usercontrolledopenredirect.extrainfo.common={0} \n\nkullan\u0131c\u0131 giri\u015fi bulunamad\u0131 oldu\:\n\n {1} \= {2} \n\nba\u011flam oldu\:\n\n {3}

pscanalpha.sourcecodedisclosure.name=Kaynak Kodu Bilgilendirme
pscanalpha.sourcecodedisclosure.desc=Uygulama Kaynak Kodu web sunucusu taraf\u0131ndan if\u015fa edildi
pscanalpha.sourcecodedisclosure.soln=Kaynak Kodu alternatif uzant\u0131lar\u0131 ile ge\u00e7erli olmad\u0131\u011f\u0131n\u0131 uygulanmas\u0131n\u0131 sa\u011flamak ve bu kaynak kodu web sunucusuna da\u011f\u0131t\u0131lan veya web sunucusu taraf\u0131ndan sunulan di\u011fer dosyalar\u0131 veya veri i\u00e7inde mevcut de\u011fil emin olun. 
pscanalpha.sourcecodedisclosure.refs=http\://blogs.wsj.com/cio/2013/10/08/adobe-source-code-leak-is-bad-news-for-us-government/
pscanalpha.sourcecodedisclosure.extrainfo={0}

pscanalpha.hashdisclosure.name=Hash Bilgilendirme
pscanalpha.hashdisclosure.desc=Bir hash web sunucusu taraf\u0131ndan if\u015fa edildi
pscanalpha.hashdisclosure.soln=Kimlik veya di\u011fer kaynaklar\u0131 korumak i\u00e7in kullan\u0131lan sa\u011flamalar\u0131n\u0131n web sunucusu veya veritaban\u0131 taraf\u0131ndan s\u0131zd\u0131r\u0131lm\u0131\u015f olmad\u0131\u011f\u0131ndan emin olun. \u015eifre i\u00e7in bir gereklilik web taray\u0131c\u0131s\u0131 i\u00e7in eri\u015filebilir olmas\u0131 i\u00e7in sa\u011flamalar\u0131n\u0131n genellikle yoktur.      
pscanalpha.hashdisclosure.refs=https\://www.owasp.org/index.php/Top_10_2013-A6-Sensitive_Data_Exposure http\://projects.webappsec.org/w/page/13246936/Information % 20Le akage http\://openwall.info/wiki/john / numune-sa\u011flamalar\u0131n\u0131n
pscanalpha.hashdisclosure.extrainfo={0}

pscanalpha.timestampdisclosure.name=Zaman Damgas\u0131 Bilgilendirme
pscanalpha.timestampdisclosure.desc=Bir zaman damgas\u0131 uygulama / web sunucusu taraf\u0131ndan if\u015fa edildi
pscanalpha.timestampdisclosure.soln=El ile zaman damgas\u0131 veri duyarl\u0131 olmad\u0131\u011f\u0131n\u0131 ve veri s\u00f6m\u00fcr\u00fclebilir desenleri if\u015fa etmek toplanm\u0131\u015f olamaz teyit etmektedir.
pscanalpha.timestampdisclosure.refs=https\://www.owasp.org/index.php/Top_10_2013-A6-Sensitive_Data_Exposure http\://projects.webappsec.org/w/page/13246936/Information % 20Le akage
pscanalpha.timestampdisclosure.extrainfo={0} , de\u011ferlendirir hangi\: {1}

pscanalpha.base64disclosure.name=Base64 Bilgilendirme
pscanalpha.base64disclosure.desc=Veri kodlanm\u0131\u015f base64 uygulama / web sunucusu taraf\u0131ndan if\u015fa edildi
pscanalpha.base64disclosure.soln=El ile Base64 veri hassas bilgileri s\u0131z\u0131nt\u0131 ve veri / toplanan di\u011fer g\u00fcvenlik a\u00e7\u0131klar\u0131ndan yararlanmak i\u00e7in kullan\u0131lan olamaz olmad\u0131\u011f\u0131n\u0131 teyit etmektedir.
pscanalpha.base64disclosure.refs=https\://www.owasp.org/index.php/Top_10_2013-A6-Sensitive_Data_Exposure http\://projects.webappsec.org/w/page/13246936/Information % 20Le akage
pscanalpha.base64disclosure.extrainfo={1}

pscanalpha.base64disclosure.viewstate.name=ASP.NET ViewState Bilgilendirme
pscanalpha.base64disclosure.viewstate.desc=Bir ASP.NET ViewState uygulama / web sunucusu taraf\u0131ndan if\u015fa edildi
pscanalpha.base64disclosure.viewstate.soln=El ile ASP.NET ViewState hassas bilgileri s\u0131z\u0131nt\u0131 ve veri / toplanan di\u011fer g\u00fcvenlik a\u00e7\u0131klar\u0131ndan yararlanmak i\u00e7in kullan\u0131lan olamaz olmad\u0131\u011f\u0131n\u0131 teyit etmektedir.
pscanalpha.base64disclosure.viewstate.refs=http\://msdn.microsoft.com/en-us/library/bb386448.aspx https\://www.owasp.org/index.php/Top_10_2013-A6-Sensitive_Data_Exposure http\://projects.webappsec.org/w/ sayfa / 13246936 / Bilgi % 20Le akage
pscanalpha.base64disclosure.viewstate.extrainfo={0}

pscanalpha.base64disclosure.viewstatewithoutmac.name=ASP.NET ViewState B\u00fct\u00fcnl\u00fc\u011f\u00fc
pscanalpha.base64disclosure.viewstatewithoutmac.desc=Uygulama k\u00f6t\u00fc niyetli bir istemci taraf\u0131ndan tahrif edilebilir ASP.NET ViewState b\u00fct\u00fcnl\u00fc\u011f\u00fcn\u00fc korumak i\u00e7in Mesaj Do\u011frulama Kodu (MAC) kullanmaz
pscanalpha.base64disclosure.viewstatewithoutmac.soln=T\u00fcm ASP.NET ViewStates g\u00fcvenli bir algoritma kullan\u0131larak olu\u015fturulan bir MAC, ve sunucu taraf\u0131nda gizli bir anahtar kullanarak, m\u00fcdahale korunur emin olun. Programlama basm\u0131\u015f a\u015f\u0131r\u0131 veya ASP.NET yap\u0131land\u0131rma yoluyla olabilir bu modern ASP.NET kurulumu varsay\u0131lan yap\u0131land\u0131rmad\u0131r.
pscanalpha.base64disclosure.viewstatewithoutmac.refs=http\://msdn.microsoft.com/en-us/library/bb386448.aspx https\://www.jardinesoftware.net/2012/02/06/asp-net-tampering-with-event-validation-part-1 /
pscanalpha.base64disclosure.viewstatewithoutmac.extrainfo={0}

pscanalpha.directorybrowsing.name=Dizin Tarama
pscanalpha.directorybrowsing.desc=Bu dizinin i\u00e7eri\u011fini bir listesini g\u00f6rmek m\u00fcmk\u00fcnd\u00fcr. Dizin listeleri gizli scriptler, hassas bilgileri ortaya \u00e7\u0131karmak i\u00e7in eri\u015filebilir vb dosyalar\u0131 yedekleme kaynak dosyalar\u0131, dahil g\u00f6sterebilir.
pscanalpha.directorybrowsing.soln=Dizin tarama devre d\u0131\u015f\u0131 b\u0131rakmak i\u00e7in web sunucusu yap\u0131land\u0131r\u0131n. 
pscanalpha.directorybrowsing.refs=https\://cwe.mitre.org/data/definitions/548.html
pscanalpha.directorybrowsing.extrainfo={0}

pscanalpha.heartbleed.name=Heartbleed OpenSSL G\u00fcvenlik A\u00e7\u0131\u011f\u0131 (G\u00f6stergeli)
pscanalpha.heartbleed.desc=1.0.1g \u00f6nce OpenSSL 1.0.1 TLS ve DTLS uygulamalar\u0131 d\u00fczg\u00fcn uzak sald\u0131rganlar\u0131n hassas bilgileri if\u015fa, okuma a\u015f\u0131r\u0131 bir tampon tetikleyen haz\u0131rlanm\u0131\u015f paketler yoluyla i\u015flem bellekten hassas bilgileri elde etmesini sa\u011flar Heartbeat Uzatma paketleri, kolu yok.\t
pscanalpha.heartbleed.soln=Daha sonra OpenSSL 1.0.1g veya g\u00fcncelleyin. Yeniden sorunu HTTPS sertifikalar\u0131. Bu tehlikeye olabilir \u00e7\u00fcnk\u00fc sunucu g\u00fcnl\u00fck dosyalar\u0131ndaki uzla\u015fma hi\u00e7bir kan\u0131t ile, asimetrik \u00f6zel anahtarlar\u0131 ve payla\u015f\u0131lan gizli anahtarlar\u0131 de\u011fi\u015ftirin.
pscanalpha.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
pscanalpha.heartbleed.extrainfo={0} kullan\u0131lmaktad\u0131r. Rapor s\u00fcr\u00fcm\u00fc geri portlu g\u00fcvenlik d\u00fczeltmelerini i\u00e7erebilir ve bu y\u00fczden konu yanl\u0131\u015f pozitif olabilece\u011fini ancak unutmay\u0131n. Bu, \u00f6rne\u011fin, Red Hat yayg\u0131nd\u0131r.

pscanalpha.crossdomain.name=Etki Alanlar\u0131 Aras\u0131 yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131
pscanalpha.crossdomain.desc=Etki Alanlar\u0131 Aras\u0131 yanl\u0131\u015f yap\u0131land\u0131r\u0131lmas\u0131
pscanalpha.crossdomain.soln=Bu hassas veriler kimli\u011fi do\u011frulanmam\u0131\u015f bir \u015fekilde (\u00f6rne\u011fin, IP adresi, beyaz-liste kullanarak) mevcut olmad\u0131\u011f\u0131ndan emin olun. Etki daha k\u0131s\u0131tlay\u0131c\u0131 dizi "Eri\u015fim Kontrol-izin-K\u00f6keni" HTTP ba\u015fl\u0131\u011f\u0131n\u0131 yap\u0131land\u0131rma ya da web taray\u0131c\u0131s\u0131 daha k\u0131s\u0131tlay\u0131c\u0131 bir \u015fekilde ayn\u0131 K\u00f6keni Politikas\u0131 (SOP) uygulamak i\u00e7in izin, tamamen t\u00fcm CORS ba\u015fl\u0131klar\u0131n\u0131 \u00e7\u0131kar\u0131n.
pscanalpha.crossdomain.refs=http\://www.hpenterprisesecurity.com/vulncat/en/vulncat/vb/html5_overly_permissive_cors_policy.html
pscanalpha.crossdomain.extrainfo=Web sunucusu \u00fczerinde CORS yanl\u0131\u015f yap\u0131land\u0131rma etki alanlar\u0131 aras\u0131 bu etki kimli\u011fi do\u011frulanmam\u0131\u015f API'leri kullanarak keyfi \u00fc\u00e7\u00fcnc\u00fc taraf etki alanlar\u0131ndan istekleri, okuma verir. Web taray\u0131c\u0131s\u0131 uygulamalar\u0131, ancak kimli\u011fi do\u011frulanm\u0131\u015f API'ler yan\u0131t\u0131 okumak i\u00e7in keyfi \u00fc\u00e7\u00fcnc\u00fc taraflar\u0131n izin vermez. Bu biraz riskini azalt\u0131r. Bu yanl\u0131\u015f yap\u0131land\u0131rma do\u011frulanmam\u0131\u015f bir \u015fekilde kullan\u0131labilir verilere eri\u015fmek i\u00e7in bir sald\u0131rgan taraf\u0131ndan kullan\u0131labilir, ancak hangi IP adresinin beyaz liste olarak, g\u00fcvenlik di\u011fer baz\u0131 form kullan\u0131r.

pscanalpha.serverheaderversioninfoleak.name=Sunucu "Sunucu" HTTP yan\u0131t Ba\u015fl\u0131k Alan\u0131 arac\u0131l\u0131\u011f\u0131yla S\u00fcr\u00fcm Bilgileri Ka\u00e7aklar
pscanalpha.serverheaderversioninfoleak.desc=Web / uygulama sunucusu "Sunucu" HTTP yan\u0131t \u00fcstbilgisi arac\u0131l\u0131\u011f\u0131yla s\u00fcr\u00fcm bilgisini s\u0131zd\u0131r\u0131yor. B\u00f6yle bilgiye eri\u015fim, web / uygulama sunucusu tabi di\u011fer g\u00fcvenlik a\u00e7\u0131klar\u0131n\u0131 tan\u0131mlayan sald\u0131rganlar\u0131n kolayla\u015ft\u0131rabilir.
pscanalpha.serverheaderversioninfoleak.refs=http\://httpd.apache.org/docs/current/mod/core.html\#servertokens\nhttp\://msdn.microsoft.com/en-us/library/ff648552.aspx\#ht_urlscan_007\nhttp\://blogs.msdn.com/b/varunm/archive/2013/04/23/remove-unwanted-http-response-headers.aspx\nhttp\://www.troyhunt.com/2012/02/shhh-dont-let-your-response-headers.html
pscanalpha.serverheaderversioninfoleak.soln=Vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, "Sunucu" ba\u015fl\u0131\u011f\u0131n\u0131 bast\u0131rmak veya jenerik ayr\u0131nt\u0131lar\u0131 i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun.
pscanalpha.serverheaderversioninfoleak.exploit=
pscanalpha.serverheaderversioninfoleak.extrainfo=

pscanalpha.stricttransportsecurity.scanner.name=Strict-Transport-Security Header Scanner
pscanalpha.stricttransportsecurity.name=S\u0131k\u0131-Transport-G\u00fcvenlik Header De\u011fil Seti
pscanalpha.stricttransportsecurity.desc=HTTP S\u0131k\u0131 Ula\u015f\u0131m G\u00fcvenli\u011fi (HST'lerinde) bir web sunucusu (\u00f6rne\u011fin bir web taray\u0131c\u0131s\u0131 gibi) uygun kullan\u0131c\u0131 aray\u00fczlerinin sadece g\u00fcvenli HTTPS ba\u011flant\u0131lar\u0131n\u0131 (\u00f6rne\u011fin HTTP katmanl\u0131 TLS \u00fczerinden / SSL) kullanarak etkile\u015fim oldu\u011funu beyan sayede bir web g\u00fcvenlik politikas\u0131 mekanizmas\u0131d\u0131r. HST'lerinde bir IETF standartlar\u0131 par\u00e7a protokol\u00fcd\u00fcr ve RFC 6797 y\u0131l\u0131nda belirtilir.
pscanalpha.stricttransportsecurity.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security https\://www.owasp.org/index.php/List_of_useful_HTTP_headers http\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security http\://caniuse.com / stricttransportsecurity http\://tools.ietf.org/html/rfc6797
pscanalpha.stricttransportsecurity.soln=Vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, s\u0131k\u0131-Ula\u015ft\u0131rma-G\u00fcvenlik zorlamak i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun.
pscanalpha.stricttransportsecurity.max.age.name=Strict-Transport-Security Disabled
pscanalpha.stricttransportsecurity.max.age.desc=A HTTP Strict Transport Security (HSTS) header was found, but it contains the directive max-age\=0 which disables the control and instructs browsers to reset any previous HSTS related settings. See RFC 6797 for further details.\nHTTP Strict Transport Security (HSTS) is a web security policy mechanism whereby a web server declares that complying user agents (such as a web browser) are to interact with it using only secure HTTPS  connections (i.e. HTTP layered over TLS/SSL).
pscanalpha.stricttransportsecurity.max.age.refs=http\://tools.ietf.org/html/rfc6797\#section-6.2
pscanalpha.stricttransportsecurity.max.age.soln=Review the configuration of this control. Ensure that your web server, application server, load balancer, etc. is configured to set Strict-Transport-Security with an appropriate max-age value.

pscanalpha.xpoweredbyheaderinfoleak.name=Sunucu "X-Powered-By" \u00fczerinden bilgiler Ka\u00e7aklar HTTP yan\u0131t \u00fcstbilgisi Field (ler)
pscanalpha.xpoweredbyheaderinfoleak.desc=Web / uygulama sunucusu, bir veya daha fazla "X-Powered-By" HTTP cevap ba\u015fl\u0131klar\u0131n\u0131n yoluyla bilgi s\u0131zd\u0131r\u0131yor. B\u00f6yle bilgiye eri\u015fim, web uygulamas\u0131 ba\u011f\u0131ml\u0131 olan di\u011fer \u00e7er\u00e7eveler / bile\u015fenleri tan\u0131mlayan sald\u0131rganlar\u0131n kolayla\u015ft\u0131rabilir ve g\u00fcvenlik a\u00e7\u0131klar\u0131 gibi bile\u015fenler tabi olabilir.
pscanalpha.xpoweredbyheaderinfoleak.refs=http\://blogs.msdn.com/b/varunm/archive/2013/04/23/remove-unwanted-http-response-headers.aspx http\://www.troyhunt.com/2012/02/shhh-dont -Art\u0131k-your-tepki-headers.html
pscanalpha.xpoweredbyheaderinfoleak.soln=Vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, "X-Powered-By" ba\u015fl\u0131klar\u0131n\u0131 \u00f6nlemek i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun.
pscanalpha.xpoweredbyheaderinfoleak.exploit=
pscanalpha.xpoweredbyheaderinfoleak.extrainfo=

pscanalpha.contentsecuritypolicymissing.name=\u0130\u00e7erik G\u00fcvenli\u011fi \u0130lkesi (CSP) \u00dcstbilgi De\u011fil Seti
pscanalpha.contentsecuritypolicymissing.desc=\u0130\u00e7erik G\u00fcvenli\u011fi \u0130lkesi (CSP) alg\u0131lar ve Cross Site Scripting (XSS) ve veri enjeksiyon sald\u0131r\u0131lar\u0131 da dahil olmak \u00fczere sald\u0131r\u0131lar\u0131n belirli t\u00fcrleri, azaltmak i\u00e7in yard\u0131mc\u0131 ek bir g\u00fcvenlik katman\u0131. Bu sald\u0131r\u0131lar veri h\u0131rs\u0131zl\u0131\u011f\u0131 site tahrifat ya da malware da\u011f\u0131t\u0131m\u0131 her \u015fey i\u00e7in kullan\u0131l\u0131r. CSP web sitesi sahiplerinin taray\u0131c\u0131lar bu sayfa \u00fczerinde y\u00fck izin verilmelidir i\u00e7erik onaylanm\u0131\u015f kaynaklar\u0131 beyan izin standart HTTP ba\u015fl\u0131klar\u0131n\u0131 bir dizi sa\u011flar - kapl\u0131 tipleri JavaScript, CSS, HTML \u00e7er\u00e7eveleri, yaz\u0131 tipleri, resimler ve Java uygulamalar\u0131 da g\u00f6m\u00fclebilir nesnelerdir, ActiveX, ses ve video dosyalar\u0131.
pscanalpha.contentsecuritypolicymissing.refs=https\://developer.mozilla.org/en-US/docs/Web/Security/CSP/Introducing_Content_Security_Policy\nhttps\://www.owasp.org/index.php/Content_Security_Policy\nhttp\://www.w3.org/TR/CSP/\nhttp\://w3c.github.io/webappsec/specs/content-security-policy/csp-specification.dev.html\nhttp\://www.html5rocks.com/en/tutorials/security/content-security-policy/\nhttp\://caniuse.com/\#feat\=contentsecuritypolicy\nhttp\://content-security-policy.com/
pscanalpha.contentsecuritypolicymissing.soln=Krom 25+, 23+ Firefox ve Safari i\u00e7in "Content-G\u00fcvenlik-Politikas\u0131"\: vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, optimum taray\u0131c\u0131 deste\u011fi sa\u011flamak i\u00e7in a\u015fa\u011f\u0131daki \u0130\u00e7erik G\u00fcvenli\u011fi \u0130lkesi ba\u015fl\u0131klar\u0131n\u0131n t\u00fcm\u00fcn\u00fc kurmak i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun 7+, Firefox i\u00e7in "X-Content-G\u00fcvenlik-Politika" 4.0+ ve Internet Explorer 10+ ve Chrome i\u00e7in "X-WebKit-CSP" 14+ ve Safari 6+.
pscanalpha.contentsecuritypolicymissing.exploit=
pscanalpha.contentsecuritypolicymissing.extrainfo=

pscanalpha.xbackendserver.name=X-Backend-Sunucu Ba\u015fl\u0131k Bilgileri Ka\u00e7ak
pscanalpha.xbackendserver.desc=Sunucu (\u00f6rne\u011fin hostname veya IP adresleri gibi) arka u\u00e7 sistemlerine ili\u015fkin bilgilerin s\u0131zd\u0131r\u0131yor. Bir sald\u0131rgan\u0131n, di\u011fer sistemler veya daha fazla do\u011frudan / verimli bu sistemlerin sald\u0131r\u0131 sald\u0131rmak m\u00fcmk\u00fcn olabilir bu bilgilerle donanm\u0131\u015f.
pscanalpha.xbackendserver.refs=
pscanalpha.xbackendserver.soln=Vb web sunucusu, uygulama sunucusu, y\u00fck dengeleyici, X-Backend-Sunucu ba\u015fl\u0131klar\u0131n\u0131 \u00f6nlemek i\u00e7in yap\u0131land\u0131r\u0131lm\u0131\u015f oldu\u011fundan emin olun.
pscanalpha.xbackendserver.exploit=
pscanalpha.xbackendserver.extrainfo=

pscanalpha.insecurecomponent.name=G\u00fcvensiz Bile\u015feni
pscanalpha.insecurecomponent.desc=Yan\u0131t pasif analizlere dayanarak, g\u00fcvensiz bile\u015fen {0}  {1} kullan\u0131mda oldu\u011fu g\u00f6r\u00fclmektedir. Bu \u00fcr\u00fcn s\u00fcr\u00fcm\u00fc i\u00e7in en y\u00fcksek not CVSS puan\u0131 {2} . Toplamda, {3} g\u00fcvenlik a\u00e7\u0131klar\u0131 tespit edildi. Red Hat gibi baz\u0131 Linux da\u011f\u0131t\u0131mlar\u0131 g\u00fcvenlik d\u00fczeltmeleri "backported" zaman eski s\u00fcr\u00fcm numaralar\u0131 istinat uygulamas\u0131n\u0131 kullan\u0131r. Bu olgular "Yanl\u0131\u015f Pozitif" olarak belirtilmi\u015ftir, ancak elle kontrol edilmelidir.  
pscanalpha.insecurecomponent.refs={0}
pscanalpha.insecurecomponent.soln=Y\u00fckseltme {0}  {1} \u00fcr\u00fcn\u00fcn son kararl\u0131 s\u00fcr\u00fcm\u00fc. Yaz\u0131l\u0131m paketleri y\u00fckl\u00fc s\u00fcr\u00fcmlerini y\u00f6netmek i\u00e7in bir paket y\u00f6neticisini ve paket y\u00f6netim politikalar\u0131 ve prosed\u00fcrleri kullan\u0131n.

pscanalpha.bigredirectsscanner.name=B\u00fcy\u00fck Y\u00f6nlendirme alg\u0131land\u0131 (Potansiyel Hassas Bilgi Ka\u00e7ak)
pscanalpha.bigredirectsscanner.desc=Sunucu b\u00fcy\u00fck tepkisini sa\u011flamak gibi g\u00f6r\u00fcn\u00fcyor bir y\u00f6nlendirme ile yan\u0131t verdi. Bu sunucu bir y\u00f6nlendirme g\u00f6nderdi, ancak ayn\u0131 zamanda (hassas ayr\u0131nt\u0131lar\u0131, vb PII i\u00e7erebilir) v\u00fccut i\u00e7eri\u011fi ile cevap oldu\u011funu g\u00f6steriyor olabilir.
pscanalpha.bigredirectsscanner.refs=
pscanalpha.bigredirectsscanner.soln=Hi\u00e7bir hassas bilgileri y\u00f6nlendirme yan\u0131tlar\u0131 arac\u0131l\u0131\u011f\u0131yla s\u0131zd\u0131r\u0131lm\u0131\u015f emin olun. Redirect yan\u0131tlar\u0131 neredeyse hi\u00e7 i\u00e7eri\u011fe sahip olmal\u0131d\u0131r.
pscanalpha.bigredirectsscanner.extrainfo=Yer ba\u015fl\u0131\u011f\u0131 URI uzunlu\u011fu\: {0} [ {1} ]. \u00d6ng\u00f6r\u00fclen yan\u0131t boyutu\: {2} . Tepki G\u00f6vde Uzunlu\u011fu\: {3} .


pscanalpha.storabilitycacheability.name=\u0130\u00e7erik Cacheability

pscanalpha.nonstorable.name=Olmayan Cihaz i\u00e7inde saklanabilen \u0130\u00e7erik
pscanalpha.nonstorable.desc=Yan\u0131t i\u00e7eri\u011fi gibi proxy sunucular\u0131 olarak \u00f6nbelle\u011fe bile\u015fenleri taraf\u0131ndan depolanabilir de\u011fil. Tepki duyarl\u0131, ki\u015fisel veya kullan\u0131c\u0131ya \u00f6zg\u00fc bilgileri i\u00e7ermiyorsa, bu performans\u0131n\u0131 art\u0131rmak, saklanabilir ve \u00f6nbelle\u011fe al\u0131nmas\u0131n\u0131 yararlanabilir.
pscanalpha.nonstorable.refs=https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (obsoleted by rfc7234)
pscanalpha.nonstorable.soln=\u0130\u00e7erik a\u015fa\u011f\u0131daki \u015fartlar kar\u015f\u0131land\u0131\u011f\u0131nda olmas\u0131n\u0131 sa\u011flayarak depolanabilir olarak i\u015faretlenmi\u015f olabilir\: istek y\u00f6ntemi (\u015fu anda \u00f6nbelleklenebilir olarak tan\u0131mlanan, "HEAD" "GET", ve "POST") \u00f6nbellek taraf\u0131ndan anla\u015f\u0131lmas\u0131 ve \u00f6nbelleklenebilir olarak tan\u0131mlanm\u0131\u015f olmal\u0131d\u0131r yan\u0131t durum kodu \u00f6nbellek (1xx, 2xx, 3xx, 4XX veya 5XX tepki s\u0131n\u0131flar\u0131n\u0131n biri genellikle anla\u015f\u0131ld\u0131\u011f\u0131) "no-store" \u00f6nbellek y\u00f6nergesi \u00f6nbelle\u011fe alma i\u00e7in istek veya yan\u0131t ba\u015fl\u0131k alanlar\u0131na g\u00f6re g\u00f6r\u00fcnmez gerekir taraf\u0131ndan anla\u015f\u0131lmal\u0131d\u0131r \u00f6rne\u011fin "vekil" \u00f6nbelleklerini olarak "ortak" \u00f6nbelleklerini, "\u00f6zel" yan\u0131t\u0131 y\u00f6nergesi gibi "vekil" \u00f6nbelleklerini olarak "ortak" cache taraf\u0131ndan \u00f6nbelle\u011fe i\u00e7in tepki g\u00f6r\u00fcnmez gerekir "Yetkilendirme" ba\u015fl\u0131k alan\u0131, istek g\u00f6r\u00fcnmez gerekir yan\u0131t\u0131 a\u00e7\u0131k\u00e7a yukar\u0131daki ko\u015fullara ek olarak ("s-maxage" Cache-Control tepki direktifleri, "kamu" "must-REVALIDATE" birini kullanarak, ya da) izin vermedik\u00e7e, a\u015fa\u011f\u0131daki ko\u015fullardan en az birinin de olmal\u0131 cevab\u0131yla tatmin\: Bir i\u00e7ermelidir ba\u015fl\u0131k alan\u0131 B\u00f6yle, bu It must bir "s-maxage" yan\u0131t\u0131 y\u00f6nergesini i\u00e7ermelidir "proxy" \u00f6nbelleklerini olarak "ortak" cache \u0130\u00e7in "max-age" yan\u0131t\u0131 y\u00f6nergesini i\u00e7ermelidir "Expires" Bu Varsay\u0131lan (200, 203, 204, 206, 300, 301, 404, 405, 410, 414, 501) taraf\u0131ndan \u00f6nbelleklenebilir olarak tan\u0131mlanan bir durum kodu olmas\u0131 gerekir \u00f6nbelle\u011fe al\u0131nmas\u0131n\u0131 sa\u011flayan bir "Cache Kontrol uzant\u0131s\u0131" i\u00e7erir.   
pscanalpha.nonstorable.extrainfo={0}

pscanalpha.storablenoncacheable.name=Depolanabilir ama Olmayan Cacheable \u0130\u00e7eri\u011fi
pscanalpha.storablenoncacheable.desc=Yan\u0131t i\u00e7eri\u011fi gibi proxy sunucular\u0131 olarak \u00f6nbelle\u011fe bile\u015fenleri taraf\u0131ndan depolanabilir, ancak di\u011fer kullan\u0131c\u0131lardan benzer isteklerine yan\u0131t olarak, yukar\u0131 iste\u011fini do\u011frulayarak olmadan do\u011frudan \u00f6nbellekten al\u0131nmas\u0131n\u0131 olmayacakt\u0131r. 
pscanalpha.storablenoncacheable.refs=https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (obsoleted by rfc7234)
pscanalpha.storablenoncacheable.soln=
pscanalpha.storablenoncacheable.extrainfo={0} }

pscanalpha.storablecacheable.name=Depolanabilir ve Cacheable \u0130\u00e7eri\u011fi
pscanalpha.storablecacheable.desc=Yan\u0131t i\u00e7eri\u011fi gibi proxy sunucular\u0131 olarak \u00f6nbelle\u011fe bile\u015fenleri taraf\u0131ndan depolanabilir, ve di\u011fer kullan\u0131c\u0131lardan benzer isteklerine yan\u0131t olarak, \u00f6nbellekten yerine \u00f6nbelle\u011fe sunucular\u0131 taraf\u0131ndan kaynak sunucudan do\u011frudan al\u0131nabilir. Yan\u0131t verileri, hassas ki\u015fisel ya da kullan\u0131c\u0131ya \u00f6zg\u00fc ise, bu hassas bilgilerin s\u0131zd\u0131r\u0131lm\u0131\u015f olmas\u0131 neden olabilir. Baz\u0131 durumlarda, bu da, bir kullan\u0131c\u0131, bir kullan\u0131c\u0131n\u0131n oturum tam kontrol elde kendi ortam\u0131nda kullan\u0131lan \u00f6nbelle\u011fe alma bile\u015fenlerinin konfig\u00fcrasyonuna ba\u011fl\u0131 olarak neden olabilir. Bu \u00f6ncelikle b\u00f6yle "proxy" \u00f6nbelleklerini olarak "ortak" \u00f6nbelle\u011fe alma sunucular\u0131 yerel a\u011f \u00fczerinde yap\u0131land\u0131r\u0131lm\u0131\u015f olan bir konudur. Bu yap\u0131land\u0131rma, tipik haliyle, \u00f6rne\u011fin, kurum veya e\u011fitim ortamlarda bulunur.
pscanalpha.storablecacheable.refs=https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (obsoleted by rfc7234)
pscanalpha.storablecacheable.soln=Tepki duyarl\u0131, ki\u015fisel veya kullan\u0131c\u0131ya \u00f6zg\u00fc bilgileri i\u00e7ermiyor do\u011frulay\u0131n. Cache-Control\: no-cache, no-store, olmal\u0131-REVALIDATE, \u00f6zel Pragma E\u011fer, ba\u015fka bir kullan\u0131c\u0131 taraf\u0131ndan saklan\u0131r ve \u00f6nbellekten al\u0131n\u0131yor, a\u015fa\u011f\u0131daki HTTP yan\u0131t ba\u015fl\u0131klar\u0131 kullan\u0131m\u0131n\u0131 dikkate s\u0131n\u0131rlamak i\u00e7in, veya i\u00e7eri\u011fi engellemek \: no-cache Expires\: 0 Bu yap\u0131land\u0131rma yan\u0131t\u0131n\u0131 saklamak de\u011fil, ve benzer bir iste\u011fine yan\u0131t olarak, \u00f6nbellekten (do\u011frulama olmadan), yan\u0131t\u0131 almak de\u011fil hem HTTP 1.0 ve HTTP 1.1 uyumlu \u00f6nbelle\u011fe alma sunucular\u0131 y\u00f6nlendirir. 
pscanalpha.storablecacheable.extrainfo={0}
pscanalpha.storablecacheable.otherinfo.liberallifetimeheuristic=In the absence of an explicitly specified caching lifetime directive in the response, a liberal lifetime heuristic of 1 year was assumed. This is permitted by rfc7234.
pscanalpha.storablecacheable.otherinfo.staleretrievenotblocked=The response is stale, and stale responses are not configured to be re-validated or blocked, using the 'must-revalidate', 'proxy-revalidate', 's-maxage', or 'max-age' response 'Cache-Control' directives.

pscanalpha.retrievedfromcache.name=Cache al\u0131nan
pscanalpha.retrievedfromcache.desc=i\u00e7erik payla\u015f\u0131lan \u00f6nbellek al\u0131nan edilmi\u015ftir. Yan\u0131t verileri, hassas ki\u015fisel ya da kullan\u0131c\u0131ya \u00f6zg\u00fc ise, bu hassas bilgilerin s\u0131zd\u0131r\u0131lm\u0131\u015f olmas\u0131 neden olabilir. Baz\u0131 durumlarda, bu da, bir kullan\u0131c\u0131, bir kullan\u0131c\u0131n\u0131n oturum tam kontrol elde kendi ortam\u0131nda kullan\u0131lan \u00f6nbelle\u011fe alma bile\u015fenlerinin konfig\u00fcrasyonuna ba\u011fl\u0131 olarak neden olabilir. Bu \u00f6ncelikle b\u00f6yle "vekil" \u00f6nbelleklerini olarak \u00f6nbelle\u011fe alma sunucular\u0131 yerel a\u011f \u00fczerinde yap\u0131land\u0131r\u0131lm\u0131\u015f olan bir konudur. Bu yap\u0131land\u0131rma, tipik haliyle, \u00f6rne\u011fin, kurum veya e\u011fitim ortamlarda bulunur. 
pscanalpha.retrievedfromcache.refs=https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttp\://www.w3.org/Protocols/rfc2616/rfc2616-sec13.html (obsoleted by rfc7234)
pscanalpha.retrievedfromcache.soln=Tepki duyarl\u0131, ki\u015fisel veya kullan\u0131c\u0131ya \u00f6zg\u00fc bilgileri i\u00e7ermiyor do\u011frulay\u0131n. Cache-Control\: no-cache, no-store, olmal\u0131-REVALIDATE, \u00f6zel Pragma E\u011fer, ba\u015fka bir kullan\u0131c\u0131 taraf\u0131ndan saklan\u0131r ve \u00f6nbellekten al\u0131n\u0131yor, a\u015fa\u011f\u0131daki HTTP yan\u0131t ba\u015fl\u0131klar\u0131 kullan\u0131m\u0131n\u0131 dikkate s\u0131n\u0131rlamak i\u00e7in, veya i\u00e7eri\u011fi engellemek \: no-cache Expires\: 0 Bu yap\u0131land\u0131rma yan\u0131t\u0131n\u0131 saklamak de\u011fil, ve benzer bir iste\u011fine yan\u0131t olarak, \u00f6nbellekten (do\u011frulama olmadan), yan\u0131t\u0131 almak de\u011fil hem HTTP 1.0 ve HTTP 1.1 uyumlu \u00f6nbelle\u011fe alma sunucular\u0131 y\u00f6nlendirir.
pscanalpha.retrievedfromcache.extrainfo={0}
pscanalpha.retrievedfromcache.extrainfo.http11ageheader='\u00c7a\u011f\u0131n' ba\u015fl\u0131\u011f\u0131n\u0131n varl\u0131\u011f\u0131 g\u00f6steren bir HTTP / 1.1 uyumlu \u00f6nbelle\u011fe alma sunucusu kullan\u0131mda oldu\u011funu s\u00f6yledi.

pscanalpha.imagelocationscanner.name=Image Location Scanner
pscanalpha.imagelocationscanner.alerttitle=Image Contains Embedded Location Information
pscanalpha.imagelocationscanner.alertDetailPrefix=This image contains the following embedded location information\:
pscanalpha.imagelocationscanner.desc=The image was found to contain embedded location information, such as GPS coordinates.  Depending on the context of the image in the website, this information may expose private details of the users of a site.  For example, a site that allows users to upload profile pictures taken in the home may expose the home's address.  
pscanalpha.imagelocationscanner.refs=http\://www.veggiespam.com/ils/
pscanalpha.imagelecationscanner.soln=Before allowing images to be stored on the server and/or transmitted to the browser, strip out the embedded location information from image.  This could mean removing all Exif data or just the GPS component.

pscanalpha.xchromeloggerdata.name=X-ChromeLogger-Data (XCOLD) Header Information Leak
pscanalpha.xchromeloggerdata.desc=The server is leaking information through the X-ChromeLogger-Data (or X-ChromePhp-Date) response header. The content of such headers can be customized by the developer, however it is not uncommon to find\: server file system locations, vhost declarations, etc.
pscanalpha.xchromeloggerdata.refs=https\://craig.is/writing/chrome-logger
pscanalpha.xchromeloggerdata.soln=Disable this functionality in Production when it might leak information that could be leveraged by an attacker. Alternatively ensure that use of the functionality is tied to a strong authorization check and only available to administrators or support personnel for troubleshooting purposes not general users.
pscanalpha.xchromeloggerdata.otherinfo.msg=The following represents an attempt to base64 decode the value\:
pscanalpha.xchromeloggerdata.otherinfo.error=Header value could not be base64 decoded\:

