formhandler.options.desc = \u0426\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u0432\u0456 \u0437\u043c\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c, \u044f\u043a\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u043e\u0431\u0445\u0456\u0434\u043d\u0438\u043a\u0438, \u0456\u043c\u043f\u043e\u0440\u0442\u0435\u0440\u0438).
formhandler.options.dialog.field.add.button.confirm = \u0414\u043e\u0434\u0430\u0442\u0438
formhandler.options.dialog.field.add.title = \u0414\u043e\u0434\u0430\u0442\u0438 \u043d\u043e\u0432\u0435 \u0456\u043c'\u044f \u0442\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043f\u043e\u043b\u044f
formhandler.options.dialog.field.field.label.enabled = \u0423\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e\:
formhandler.options.dialog.field.field.label.name = \u0406\u043c'\u044f\:
formhandler.options.dialog.field.field.label.regex = \u0420\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437\:
formhandler.options.dialog.field.field.label.value = \u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f\:
formhandler.options.dialog.field.modify.button.confirm = \u0417\u043c\u0456\u043d\u0438\u0442\u0438
formhandler.options.dialog.field.modify.title = \u0417\u043c\u0456\u043d\u0438\u0442\u0438 \u043f\u043e\u043b\u0435
formhandler.options.dialog.field.remove.button.cancel = \u0421\u043a\u0430\u0441\u0443\u0432\u0430\u0442\u0438
formhandler.options.dialog.field.remove.button.confirm = \u0412\u0438\u0434\u0430\u043b\u0438\u0442\u0438
formhandler.options.dialog.field.remove.checkbox.label = \u0411\u0456\u043b\u044c\u0448\u0435 \u043d\u0435 \u043f\u043e\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u0446\u0435 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f
formhandler.options.dialog.field.remove.text = \u0421\u043f\u0440\u0430\u0432\u0434\u0456 \u0432\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0432\u0438\u0431\u0440\u0430\u043d\u0435 \u043f\u043e\u043b\u0435?
formhandler.options.dialog.field.remove.title = \u0412\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u043f\u043e\u043b\u0435
formhandler.options.dialog.field.warning.bad.regex.text = \u041d\u0430\u0434\u0430\u043d\u0438\u0439 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u0439.
formhandler.options.dialog.field.warning.bad.regex.title = \u041d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u0439 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437
formhandler.options.dialog.field.warning.name.repeated.text = \u041f\u043e\u043b\u0435 \u0437 \u0432\u043a\u0430\u0437\u0430\u043d\u043e\u044e \u043d\u0430\u0437\u0432\u043e\u044e \u043f\u043e\u043b\u044f \u0432\u0436\u0435 \u0456\u0441\u043d\u0443\u0454.
formhandler.options.dialog.field.warning.name.repeated.title = \u041f\u043e\u0432\u0442\u043e\u0440\u044e\u0432\u0430\u043d\u0430 \u043d\u0430\u0437\u0432\u0430 \u043f\u043e\u043b\u044f
formhandler.options.label.description = \u0426\u0435 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f \u00ab\u0413\u0435\u043d\u0435\u0440\u0430\u0442\u043e\u0440 \u0437\u043d\u0430\u0447\u0435\u043d\u044c\u00bb \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u044c, \u044f\u043a\u0456 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u044e\u0442\u044c\u0441\u044f \u043d\u0430 \u0441\u0430\u0439\u0442\u0438/\u0434\u043e\u0434\u0430\u0442\u043a\u0438, \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0456\u043c\u0435\u043d \u0432\u0445\u0456\u0434\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445. \u041d\u0430\u0437\u0432\u0438 \u043d\u043e\u0432\u043e\u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0445 \u043f\u043e\u043b\u0456\u0432 \u043c\u0430\u044e\u0442\u044c \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0442\u0438 \u043d\u0430\u0437\u0432\u0456 \u043f\u043e\u043b\u0456\u0432 \u0443 \u0444\u0443\u043d\u043a\u0446\u0456\u0457, \u0449\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454\u0442\u044c\u0441\u044f. \u041d\u0430\u0437\u0432\u0430 \u043f\u043e\u043b\u044f \u043d\u0435 \u0447\u0443\u0442\u043b\u0438\u0432\u0430 \u0434\u043e \u0440\u0435\u0433\u0456\u0441\u0442\u0440\u0443, \u043e\u0434\u043d\u0430\u043a \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0454 \u0442\u0430 \u0431\u0443\u0434\u0443\u0442\u044c \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u0456 \u043f\u0456\u0434 \u0447\u0430\u0441 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f. \u042f\u043a\u0449\u043e \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u043b\u0438\u0448\u0435 \u043d\u0430\u0437\u0432\u0443 \u043f\u043e\u043b\u044f, \u044f\u043a \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0431\u0443\u0434\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e \u043f\u043e\u0440\u043e\u0436\u043d\u0456\u0439 \u0440\u044f\u0434\u043e\u043a. \u042f\u043a\u0449\u043e \u043f\u043e\u043b\u0435 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0436\u043e\u0434\u043d\u043e\u043c\u0443 \u0437 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0445 \u0443 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u0456, \u0432\u043e\u043d\u043e \u0431\u0443\u0434\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u043e \u0434\u043e \u0433\u0435\u043d\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u044c \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c, \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u043d\u0435 \u043d\u0430\u0434\u0430\u0442\u0438 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u044c.
formhandler.options.table.column.enabled = \u0412\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e
formhandler.options.table.column.field = \u0406\u043c'\u044f \u043f\u043e\u043b\u044f
formhandler.options.table.column.regex = \u0420\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0438\u0439 \u0432\u0438\u0440\u0430\u0437
formhandler.options.table.column.value = \u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f
formhandler.options.title = \u0413\u0435\u043d\u0435\u0440\u0430\u0442\u043e\u0440 \u0437\u043d\u0430\u0447\u0435\u043d\u044c
formhandler.popup.menu.params.add.label = \u0414\u043e\u0434\u0430\u0442\u0438 \u043f\u043e\u043b\u0435 \u0433\u0435\u043d\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u044c
