ascanalpha.desc = \u30a2\u30eb\u30d5\u30a1\u7248\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack = \u30d1\u30e9\u30e1\u30fc\u30bf [{0}] \u306b [{1}] \u3092\u30bb\u30c3\u30c8\u3057\u307e\u3059 
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo = [{1}] \u306e [{2}] \u306b\u3042\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{0}] \u306f\u3001LDAP\u30e1\u30bf\u6587\u5b57 [{3}] \u3092\u4f7f\u7528\u3057\u305f\u653b\u6483\u306b\u5bfe\u3057\u3066LDAP\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u8106\u5f31\u6027\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u5143\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u306a\u304b\u3063\u305f\u65e2\u77e5\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8 [{5}] \u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002
ascanalpha.ldapinjection.booleanbased.alert.attack = \u540c\u7b49\u306eLDAP\u5f0f\: [{0}]\u3002\u30e9\u30f3\u30c0\u30e0\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\: [{1}]\u3002
ascanalpha.ldapinjection.booleanbased.alert.extrainfo = [{1}] \u306e [{2}] \u306b\u3042\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{0}] \u306f\u3001\u8ad6\u7406\u7684\u306b\u540c\u7b49\u306e\u5f0f [{3}] \u3068 ''FALSE'' \u5f0f [{4}] \u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001LDAP\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u8106\u5f31\u6027\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.ldapinjection.desc = LDAP\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u8a8d\u8a3c\u5236\u5fa1\u3092\u30d0\u30a4\u30d1\u30b9\u3057\u3001LDAP\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u5185\u306e\u4efb\u610f\u306e\u30c7\u30fc\u30bf\u3092\u95b2\u89a7\u30fb\u5909\u66f4\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.ldapinjection.name = LDAP\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanalpha.ldapinjection.refs = https\://owasp.org/www-community/attacks/LDAP_Injection\nhttps\://cheatsheetseries.owasp.org/cheatsheets/LDAP_Injection_Prevention_Cheat_Sheet.html
ascanalpha.ldapinjection.soln = LDAP\u30af\u30a8\u30ea\u306e\u4f5c\u6210\u306b\u4f7f\u7528\u3059\u308b\u524d\u306b\u3001\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u691c\u8a3c\u304a\u3088\u3073/\u307e\u305f\u306f\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u7279\u306b\u3001\u4ee5\u4e0b\u306e\u6587\u5b57 (\u307e\u305f\u306f\u305d\u306e\u7d44\u307f\u5408\u308f\u305b) \u306f\u62d2\u5426\u30ea\u30b9\u30c8\u306b\u5165\u308c\u308b\u3079\u304d\u3067\u3059\uff1a\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNUL \u6587\u5b57
ascanalpha.ldapinjection.technologies.protocol = \u30d7\u30ed\u30c8\u30b3\u30eb

ascanalpha.mongodb.desc = MongoDB\u30af\u30a8\u30ea\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.mongodb.extrainfo.alldata = \u4e00\u90e8\u306ePHP\u3084NodeJS\u30d9\u30fc\u30b9\u306e\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u5b9f\u88c5\u306b\u304a\u3044\u3066\u3001\u653b\u6483\u8005\u306f\u6a5f\u5bc6\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u3001\u5358\u7d14\u306a\u6587\u5b57\u5217\u3067\u306f\u306a\u304f\u9023\u60f3\u914d\u5217\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u308b "[$ne]" \u6587\u5b57\u5217 (\u307e\u305f\u306f\u985e\u4f3c\u306e\u6f14\u7b97\u5b50) \u3092\u6ce8\u5165\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u653b\u6483\u306b\u3088\u308a\u3001MongoDB\u3078\u306e\u30af\u30a8\u30ea\u304c\u5e38\u306btrue\u6761\u4ef6\u3068\u3057\u3066\u8a55\u4fa1\u3055\u308c\u3001\u4e0d\u6b63\u306a\u30c7\u30fc\u30bf\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanalpha.mongodb.extrainfo.authbypass = MongoDB\u653b\u6483\u304c\u8a8d\u8a3c\u30da\u30fc\u30b8\u3092\u30d0\u30a4\u30d1\u30b9\u3057\u305f\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002
ascanalpha.mongodb.extrainfo.crash = MongoDB\u306e\u4f8b\u5916\u304c\u9069\u5207\u306b\u51e6\u7406\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
ascanalpha.mongodb.extrainfo.json = \u4e00\u90e8\u306eNodeJS\u30d9\u30fc\u30b9\u306e\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u5b9f\u88c5\u3067\u306f\u3001Content-Type \u30d8\u30c3\u30c0\u30fc\u3067JSON\u5f62\u5f0f\u304c\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u3057\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u6a5f\u5bc6\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u3001\u5358\u7d14\u306a\u6587\u5b57\u5217\u3067\u306f\u306a\u304f\u9023\u60f3\u914d\u5217\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u308b "{$ne\:}" \u6587\u5b57\u5217 (\u307e\u305f\u306f\u985e\u4f3c\u306eMongoDB\u6f14\u7b97\u5b50) \u3092\u6ce8\u5165\u3059\u308b\u3053\u3068\u3067\u3001\u3053\u308c\u3089\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u653b\u6483\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u653b\u6483\u306b\u3088\u308a\u3001MongoDB\u3078\u306e\u30af\u30a8\u30ea\u6761\u4ef6\u304c\u5e38\u306btrue\u3068\u3057\u3066\u8a55\u4fa1\u3055\u308c\u3001\u4e0d\u6b63\u306a\u30c7\u30fc\u30bf\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
ascanalpha.mongodb.extrainfo.sleep = where \u307e\u305f\u306f group MongoDB\u53e5\u3092\u4ecb\u3057\u3066\u3001JavaScript\u306esleep\u95a2\u6570\u304c\u5b9f\u884c\u53ef\u80fd\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002
ascanalpha.mongodb.name = NoSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - MongoDB
ascanalpha.mongodb.name.timebased = NoSQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - MongoDB (\u6642\u9593\u30d9\u30fc\u30b9)
ascanalpha.mongodb.refs = https\://arxiv.org/pdf/1506.04082\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05.6-Testing_for_NoSQL_Injection.html
ascanalpha.mongodb.soln = \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u306e\u5165\u529b\u3092\u4fe1\u983c\u305b\u305a\u3001\u30b5\u30fc\u30d0\u30fc\u5074\u3067\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u3092\u9069\u5207\u306b\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30af\u30a8\u30ea\u5165\u529b\u3092 where \u3084 group \u53e5\u306b\u76f4\u63a5\u7d44\u307f\u8fbc\u3080\u3053\u3068\u3092\u907f\u3051\u3001\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u30fc\u3092\u5229\u7528\u53ef\u80fd\u306a\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ascanalpha.name = \u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb - \u30a2\u30eb\u30d5\u30a1

ascanalpha.scripts.desc = \u30a2\u30eb\u30d5\u30a1\u30b9\u30c6\u30fc\u30bf\u30b9\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
ascanalpha.scripts.name = \u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u30b9\u30af\u30ea\u30d7\u30c8 - Alpha
ascanalpha.scripts.suspiciousInputTransformation.desc = Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u304a\u3051\u308b\u7591\u308f\u3057\u3044\u5165\u529b\u5909\u63db\u3092\u691c\u51fa\u3059\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u3067\u3059\u3002
ascanalpha.scripts.warn.couldNotAddScripts = \u30a2\u30eb\u30d5\u30a1\u7248\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\: {0}

ascanalpha.webCacheDeception.desc = Web\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u60aa\u7528\u3057\u305f\u653b\u6483\u306b\u3088\u308a\u3001\u8a8d\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30da\u30fc\u30b8\u306e\u6a5f\u5bc6\u30c7\u30fc\u30bf\u3092\u95b2\u89a7\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.webCacheDeception.name = Web\u30ad\u30e3\u30c3\u30b7\u30e5\u6b3a\u779e
ascanalpha.webCacheDeception.otherinfo = \u8a8d\u8a3c\u6e08\u307f\u30ec\u30b9\u30dd\u30f3\u30b9\u3068\u672a\u8a8d\u8a3c\u30ec\u30b9\u30dd\u30f3\u30b9\u304c\u985e\u4f3c\u3057\u3066\u3044\u307e\u3059\u3002
ascanalpha.webCacheDeception.refs = https\://blog.cloudflare.com/understanding-our-cache-and-the-web-cache-deception-attack/\nhttps\://www.invicti.com/web-vulnerability-scanner/vulnerabilities/web-cache-deception/
ascanalpha.webCacheDeception.soln = \u753b\u50cf\u3084\u30b9\u30bf\u30a4\u30eb\u30b7\u30fc\u30c8\u3068\u3044\u3063\u305f\u30d5\u30a1\u30a4\u30eb\u306e\u7a2e\u985e\u3092\u3001URL\u3084\u30d5\u30a1\u30a4\u30eb\u306e\u62e1\u5f35\u5b50\u3060\u3051\u3067\u5206\u985e\u3059\u308b\u3053\u3068\u306f\u53b3\u306b\u63a7\u3048\u3066\u304f\u3060\u3055\u3044\u3002\u4ee3\u308f\u308a\u306b\u3001\u30d5\u30a1\u30a4\u30eb\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u306f Content-Type \u30d8\u30c3\u30c0\u30fc\u306b\u57fa\u3065\u3044\u3066\u884c\u3046\u3088\u3046\u306b\u5fb9\u5e95\u3057\u3066\u304f\u3060\u3055\u3044\u3002
