ascanalpha.desc = Alpha status active scan rules
ascanalpha.name = Active Scan Rules - alpha

ascanalpha.examplefile.name=\u06cc\u06a9 \u0646\u0645\u0648\u0646\u0647 \u0642\u0627\u0646\u0648\u0646 \u0627\u0633\u06a9\u0646 \u0641\u0639\u0627\u0644 \u06a9\u0647 \u0627\u0637\u0627\u0639\u0627\u062a \u0631\u0627 \u0627\u0632 \u06cc\u06a9 \u0641\u0627\u06cc\u0644 \u0628\u0627\u0631\u06af\u0630\u0627\u0631\u06cc \u0645\u06cc \u06a9\u0646\u062f
ascanalpha.examplefile.desc=\u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0628\u06cc\u0634\u062a\u0631 \u062f\u0631 \u0645\u0648\u0631\u062f \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0631\u0627 \u062f\u0631 \u0627\u06cc\u0646\u062c\u0627 \u0648\u0627\u0631\u062f \u06a9\u0646\u06cc\u062f
ascanalpha.examplefile.other=\u0627\u06cc\u0646 \u0628\u0631\u0627\u06cc \u0627\u0637\u0644\u0627\u0639\u0627\u062a\u06cc \u0627\u0633\u062a \u06a9\u0647 \u062f\u0631 \u0647\u06cc\u0686 \u06cc\u06a9 \u0627\u0632 \u0628\u062e\u0634 \u0647\u0627\u06cc \u062f\u06cc\u06af\u0631 \u0641\u06cc\u062a \u06cc\u0627 \u0627\u0646\u062f\u0627\u0632\u0647 \u0646\u0645\u06cc \u0634\u0648\u062f
ascanalpha.examplefile.soln=\u062a\u0648\u0635\u06cc\u0641 \u06a9\u0644\u06cc \u0627\u0632 \u0686\u06af\u0648\u0646\u06af\u06cc \u062d\u0644 \u0645\u0634\u06a9\u0644
ascanalpha.examplefile.refs=https\://www.zaproxy.org/blog/2014-04-30-hacking-zap-4-active-scan-rules/

ascanalpha.ldapinjection.name=LDAP Injection
ascanalpha.ldapinjection.desc=\u062a\u0632\u0631\u06cc\u0642 LDAP \u0627\u0645\u06a9\u0627\u0646 \u067e\u0630\u06cc\u0631 \u0627\u0633\u062a. \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0628\u0631\u0627\u06cc \u06cc\u06a9 \u0645\u0647\u0627\u062c\u0645 \u0627\u0645\u06a9\u0627\u0646 \u0639\u0628\u0648\u0631 \u0627\u0632 \u06a9\u0646\u062a\u0631\u0644 \u0647\u0627\u06cc \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0648 \u0645\u0634\u0627\u0647\u062f\u0647 \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0647\u0627\u06cc \u062f\u0644\u062e\u0648\u0627\u0647 \u062f\u0631 \u0641\u0647\u0631\u0633\u062a \u0631\u0627\u0647\u0646\u0645\u0627 LDAP \u0648\u062c\u0648\u062f \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u062f. 
ascanalpha.ldapinjection.soln=Validate and/or escape all user input before using it to create an LDAP query.  In particular, the following characters (or combinations) should be deny listed\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNUL character\n 
ascanalpha.ldapinjection.refs=http\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection\nhttps\://owasp.org/www-community/attacks/LDAP_Injection
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo=\u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u0631\u0648\u06cc {1}{2} \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u0648\u062c\u0628 \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u062a\u0632\u0631\u06cc\u0642 LDAP \u0634\u0648\u062f\u060c \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u06cc\u06a9 \u062d\u0645\u0644\u0647 \u0645\u062a\u0627\u06a9\u0627\u0631\u0627\u06a9\u062a\u0631\u06cc LDAP {3}\u060c \u0628\u0627\u0632\u062f\u0647 \u0634\u0646\u0627\u062e\u062a\u0647 \u0634\u062f\u0647 {4} \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627 {5}\u060c \u06a9\u0647 \u062f\u0631 \u067e\u0627\u0633\u062e \u0627\u0648\u0644\u06cc\u0647 \u062d\u0636\u0648\u0631 \u0646\u062f\u0627\u0634\u062a\u0646\u062f.
ascanalpha.ldapinjection.alert.evidence={0}
ascanalpha.ldapinjection.booleanbased.alert.extrainfo=\u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u0631\u0648\u06cc{1}{2} \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u0648\u062c\u0628 \u0622\u0633\u06cc\u0628 \u062a\u0632\u0631\u06cc\u0642 LDAP\u060c \u062a\u0648\u0633\u0637 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0639\u0628\u0627\u0631\u062a \u0645\u0639\u0627\u062f\u0644\u0647 \u0645\u0646\u0637\u0642\u06cc {3}\u060c \u0648 \u0639\u0628\u0627\u0631\u062a ''FALSE'' {4} \u0634\u0648\u062f.
#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack=\u0642\u0631\u0627\u0631 \u062f\u0627\u062f\u0646 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u062f\u0631 \u0628\u0631\u0627\u0628\u0631 {1}
ascanalpha.ldapinjection.booleanbased.alert.attack=\u0645\u0639\u0627\u062f\u0644 \u0639\u0628\u0627\u0631\u062a LDAP\:{0}. \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u062a\u0635\u0627\u062f\u0641\u06cc\: {1}.
ascanalpha.ldapinjection.technologies.protocol = Protocol

ascanalpha.mongodb.name=NoSQL Injection - MongoDB
ascanalpha.mongodb.desc=MongoDB query injection may be possible.
ascanalpha.mongodb.soln=Do not trust client side input and escape all data on the server side. \nAvoid to use the query input directly into the where and group clauses and upgrade all drivers at the latest available version.
ascanalpha.mongodb.refs=https\://arxiv.org/pdf/1506.04082.pdf\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05.6-Testing_for_NoSQL_Injection.html
ascanalpha.mongodb.extrainfo.crash=A MongoDB exception hasn't been properly handled.
ascanalpha.mongodb.extrainfo.alldata=In some PHP or NodeJS based back end implementations, in order to obtain sensitive data it is possible to inject the "[$ne]" string (or other similar ones) that is processed as an associative array rather than a simple text.\nThrough this, the queries made to MongoDB will always be true.
ascanalpha.mongodb.extrainfo.sleep=Through the where or group MongoDB clauses, Javascript sleep function is probably executable.
ascanalpha.mongodb.extrainfo.json=In some NodeJS based back end implementations, messages having the JSON format as content-type are expected. In order to obtain sensitive data it is possible to attack these applications injecting the "{$ne\:}" string (or other similar ones) that is processed as an associative array rather than a simple text.\nThrough this, the queries made to MongoDB will always be true.
ascanalpha.mongodb.extrainfo.authbypass=More probably a MongoDB attack has bypassed an authentication page.

ascanalpha.webCacheDeception.name=Web Cache Deception
ascanalpha.webCacheDeception.desc=Web cache deception may be possible. It may be possible for unauthorised user to view sensitive data on this page.
ascanalpha.webCacheDeception.refs=https\://blogs.akamai.com/2017/03/on-web-cache-deception-attacks.html\nhttps\://www.netsparker.com/web-vulnerability-scanner/vulnerabilities/web-cache-deception/
ascanalpha.webCacheDeception.soln=It is strongly advised to refrain from classifying file types, such as images or stylesheets solely by their URL and file extension. Instead you should make sure that files are cached based on their Content-Type header.
ascanalpha.webCacheDeception.otherinfo=Cached Authorised Response and Unauthorised Response are similar.

ascanalpha.text4shell.name=Text4shell (CVE-2022-42889)
ascanalpha.text4shell.skipped=no Active Scan OAST service is selected.
ascanalpha.text4shell.desc=Apache Commons Text prior to 1.10.0 allows RCE when applied to untrusted input due to insecure interpolation defaults.\nApache Commons Text performs variable interpolation, allowing properties to be dynamically evaluated and expanded.\nThe application has been shown to initial contact with remote servers via variable interpolation and may well be vulnerable to Remote Code Execution (RCE).
ascanalpha.text4shell.soln=Upgrade Apache Commons Text prior to version 1.10.0 or newer.
ascanalpha.text4shell.refs=https\://www.cve.org/CVERecord?id\=CVE-2022-42889\nhttps\://securitylab.github.com/advisories/GHSL-2022-018_Apache_Commons_Text/

ascanalpha.ssrf.name=Server Side Request Forgery
ascanalpha.ssrf.desc=The web server receives a remote address and retrieves the contents of this URL, but it does not sufficiently ensure that the request is being sent to the expected destination.
ascanalpha.ssrf.soln=Do not accept remote addresses as request parameters, and if you must, ensure that they are validated against an allow-list of expected values.
ascanalpha.ssrf.refs=https\://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html
ascanalpha.ssrf.skipped=no Active Scan OAST service is selected.
ascanalpha.ssrf.otherinfo.canaryinbody=The canary token from the out-of-band service was found in the response body.
