ascanalpha.desc = \u0410\u043a\u0442\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u043b\u044c\u0444\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

ascanalpha.examplefile.desc = \u0414\u043e\u0434\u0430\u0439\u0442\u0435 \u0441\u044e\u0434\u0438 \u0431\u0456\u043b\u044c\u0448\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043f\u0440\u043e \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c
ascanalpha.examplefile.name = \u041f\u0440\u0438\u043a\u043b\u0430\u0434 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0454 \u0434\u0430\u043d\u0456 \u0437 \u0444\u0430\u0439\u043b\u0443
ascanalpha.examplefile.other = \u041b\u0438\u0448\u0435 \u0434\u043b\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u044f\u043a\u0430 \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u043d\u0456\u044f\u043a\u0438\u043c \u0456\u043d\u0448\u0438\u043c \u0440\u043e\u0437\u0434\u0456\u043b\u0430\u043c
ascanalpha.examplefile.refs = https\://www.zaproxy.org/blog/2014-04-30-hacking-zap-4-active-scan-rules/
ascanalpha.examplefile.soln = \u0417\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0439 \u043e\u043f\u0438\u0441 \u0442\u043e\u0433\u043e, \u044f\u043a \u0432\u0438\u0440\u0456\u0448\u0438\u0442\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443

#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u043d\u0430 [{1}]
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u043d\u0430 [{1}] [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0430\u0442\u0430\u043a\u0443 \u0437 \u043c\u0435\u0442\u0430\u0441\u0438\u043c\u0432\u043e\u043b\u0430\u043c\u0438 LDAP [{3}], \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u0432\u0456\u0434\u043e\u043c\u043e\u0433\u043e [{4}] \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 [{5}], \u044f\u043a\u043e\u0433\u043e \u043d\u0435 \u0431\u0443\u043b\u043e \u0432 \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0456\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.
ascanalpha.ldapinjection.booleanbased.alert.attack = \u0415\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442 \u0432\u0438\u0440\u0430\u0437\u0443 LDAP\: [{0}]. \u0414\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\: [{1}].
ascanalpha.ldapinjection.booleanbased.alert.extrainfo = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u043d\u0430 [{1}] [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043b\u043e\u0433\u0456\u0447\u043d\u043e \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u043e\u0433\u043e \u0432\u0438\u0440\u0430\u0437\u0443 [{3}] \u0456 \u0432\u0438\u0440\u0430\u0437\u0443 ''FALSE'' [{4}].
ascanalpha.ldapinjection.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP. \u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043e\u0431\u0456\u0439\u0442\u0438 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0438 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0454\u044e, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438 \u0442\u0430 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0456 \u0434\u0430\u043d\u0456 \u0432 \u043a\u0430\u0442\u0430\u043b\u043e\u0437\u0456 LDAP.
ascanalpha.ldapinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP 
ascanalpha.ldapinjection.refs = https\://owasp.org/www-community/attacks/LDAP_Injection\nhttps\://cheatsheetseries.owasp.org/cheatsheets/LDAP_Injection_Prevention_Cheat_Sheet.html
ascanalpha.ldapinjection.soln = \u0429\u043e\u0431 \u0441\u0442\u0432\u043e\u0440\u0438\u0442\u0438 \u0437\u0430\u043f\u0438\u0442 LDAP, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0442\u0430/\u0430\u0431\u043e \u0443\u043d\u0438\u043a\u043d\u0456\u0442\u044c \u0432\u0441\u0456 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043f\u0435\u0440\u0435\u0434 \u0457\u0445 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f\u043c. \u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u0442\u0430\u043a\u0456 \u0441\u0438\u043c\u0432\u043e\u043b\u0438 (\u0430\u0431\u043e \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0431\u0443\u0442\u0438 \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0456 \u0432 \u0441\u043f\u0438\u0441\u043a\u0443\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\n\u0441\u0438\u043c\u0432\u043e\u043b NUL
ascanalpha.ldapinjection.technologies.protocol = \u041f\u0440\u043e\u0442\u043e\u043a\u043e\u043b

ascanalpha.mongodb.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0435 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0437\u0430\u043f\u0438\u0442\u0443 MongoDB.
ascanalpha.mongodb.extrainfo.alldata = \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0431\u0430\u0437\u043e\u0432\u0438\u0445 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f\u0445 PHP \u0430\u0431\u043e NodeJS \u0434\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u043c\u043e\u0436\u043d\u0430 \u0432\u0441\u0442\u0430\u0432\u0438\u0442\u0438 \u0440\u044f\u0434\u043e\u043a "[$ne]" (\u0430\u0431\u043e \u0456\u043d\u0448\u0456 \u043f\u043e\u0434\u0456\u0431\u043d\u0456), \u044f\u043a\u0438\u0439 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u044f\u043a \u0430\u0441\u043e\u0446\u0456\u0430\u0442\u0438\u0432\u043d\u0438\u0439 \u043c\u0430\u0441\u0438\u0432, \u0430 \u043d\u0435 \u043f\u0440\u043e\u0441\u0442\u0438\u0439 \u0442\u0435\u043a\u0441\u0442.\n\u0422\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0437\u0430\u043f\u0438\u0442\u0438, \u0437\u0440\u043e\u0431\u043b\u0435\u043d\u0456 \u0434\u043e MongoDB \u0437\u0430\u0432\u0436\u0434\u0438 \u0431\u0443\u0434\u0443\u0442\u044c \u0432\u0456\u0440\u043d\u0438\u043c\u0438. 
ascanalpha.mongodb.extrainfo.authbypass = \u0428\u0432\u0438\u0434\u0448\u0435 \u0437\u0430 \u0432\u0441\u0435, \u0430\u0442\u0430\u043a\u0430 MongoDB \u043e\u0431\u0456\u0439\u0448\u043b\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457.
ascanalpha.mongodb.extrainfo.crash = \u0412\u0438\u043d\u044f\u0442\u043e\u043a MongoDB \u043d\u0435\u043e\u0431\u0440\u043e\u0431\u043b\u0435\u043d\u0438\u0439 \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c.
ascanalpha.mongodb.extrainfo.json = \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0431\u0430\u0437\u043e\u0432\u0438\u0445 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f\u0445 PHP \u0430\u0431\u043e NodeJS \u043e\u0447\u0456\u043a\u0443\u044e\u0442\u044c\u0441\u044f \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f, \u044f\u043a\u0456 \u043c\u0430\u044e\u0442\u044c \u0444\u043e\u0440\u043c\u0430\u0442\u0443\u0432\u0430\u043d\u043d\u044f JSON \u044f\u043a \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443. \u0429\u043e\u0431 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456, \u043c\u043e\u0436\u043d\u0430 \u0430\u0442\u0430\u043a\u0443\u0432\u0430\u0442\u0438 \u0446\u0456 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0443\u044e\u0447\u0438 \u0440\u044f\u0434\u043e\u043a "{$ne\:}" (\u0430\u0431\u043e \u0456\u043d\u0448\u0456 \u043f\u043e\u0434\u0456\u0431\u043d\u0456), \u044f\u043a\u0438\u0439 \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0454\u0442\u044c\u0441\u044f \u044f\u043a \u0430\u0441\u043e\u0446\u0456\u0430\u0442\u0438\u0432\u043d\u0438\u0439 \u043c\u0430\u0441\u0438\u0432, \u0430 \u043d\u0435 \u043f\u0440\u043e\u0441\u0442\u0438\u0439 \u0442\u0435\u043a\u0441\u0442.\n\u0422\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0437\u0430\u043f\u0438\u0442\u0438, \u0437\u0440\u043e\u0431\u043b\u0435\u043d\u0456 \u0434\u043e MongoDB \u0437\u0430\u0432\u0436\u0434\u0438 \u0431\u0443\u0434\u0443\u0442\u044c \u0432\u0456\u0440\u043d\u0438\u043c\u0438. 
ascanalpha.mongodb.extrainfo.sleep = \u0427\u0435\u0440\u0435\u0437 \u0440\u0435\u0447\u0435\u043d\u043d\u044f WHERE \u0442\u0430 GROUP MongoDB, \u0444\u0443\u043d\u043a\u0446\u0456\u044f \u0441\u043d\u0443 Javascript, \u0439\u043c\u043e\u0432\u0456\u0440\u043d\u043e, \u0454 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u043d\u043e\u044e. 
ascanalpha.mongodb.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f NoSQL - MongoDB
ascanalpha.mongodb.name.timebased = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f NoSQL - MongoDB (\u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0447\u0430\u0441\u0443)
ascanalpha.mongodb.refs = https\://arxiv.org/pdf/1506.04082.pdf\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05.6-Testing_for_NoSQL_Injection.html
ascanalpha.mongodb.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f\u043c \u0437\u0456 \u0441\u0442\u043e\u0440\u043e\u043d\u0438 \u043a\u043b\u0456\u0454\u043d\u0442\u0430 \u0439 \u0443\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0441\u0456\u0445 \u0434\u0430\u043d\u0438\u0445 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \n\u0423\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u0437\u0430\u043f\u0438\u0442\u0443 \u0431\u0435\u0437\u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u044c\u043e \u0432 \u0440\u0435\u0447\u0435\u043d\u043d\u044f\u0445 WHERE \u0442\u0430 GROUP \u0456 \u043e\u043d\u043e\u0432\u0456\u0442\u044c \u0443\u0441\u0456 \u0434\u0440\u0430\u0439\u0432\u0435\u0440\u0438 \u0434\u043e \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u0457 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457.

ascanalpha.name = \u0410\u043a\u0442\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f - \u0430\u043b\u044c\u0444\u0430

ascanalpha.webCacheDeception.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0438\u0439 \u043e\u0431\u043c\u0430\u043d \u0432\u0435\u0431 \u043a\u0435\u0448\u0443. \u041d\u0435\u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043c\u043e\u0436\u0435 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0446\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456.
ascanalpha.webCacheDeception.name = \u041e\u0431\u043c\u0430\u043d \u0432\u0435\u0431 \u043a\u0435\u0448\u0443
ascanalpha.webCacheDeception.otherinfo = \u041a\u0435\u0448\u043e\u0432\u0430\u043d\u0430 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456 \u043d\u0435\u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0441\u0445\u043e\u0436\u0456.
ascanalpha.webCacheDeception.refs = https\://blogs.akamai.com/2017/03/on-web-cache-deception-attacks.html\nhttps\://www.netsparker.com/web-vulnerability-scanner/vulnerabilities/web-cache-deception/
ascanalpha.webCacheDeception.soln = \u0420\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u043e\u0432\u0430\u043d\u043e \u0443\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438\u0441\u044c \u0432\u0456\u0434 \u043a\u043b\u0430\u0441\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0442\u0438\u043f\u0456\u0432 \u0444\u0430\u0439\u043b\u0443, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0430\u0431\u043e \u0442\u0430\u0431\u043b\u0438\u0446\u0456 \u0441\u0442\u0438\u043b\u0456\u0432, \u0432\u0438\u043a\u043b\u044e\u0447\u043d\u043e \u0437\u0430 \u0457\u0445 URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e \u0442\u0430 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f\u043c \u0444\u0430\u0439\u043b\u0443. \u041d\u0430\u0442\u043e\u043c\u0456\u0441\u0442\u044c \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044c, \u0449\u043e \u0444\u0430\u0439\u043b\u0438 \u043a\u0435\u0448\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0457\u0445\u043d\u044c\u043e\u0433\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Content-Type.
