ascanalpha.desc = \u0410\u043a\u0442\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0430\u043b\u044c\u0444\u0430-\u0441\u0442\u0430\u0442\u0443\u0441\u0443

#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u043d\u0430 [{1}]
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u043d\u0430 [{1}] [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0430\u0442\u0430\u043a\u0443 \u0437 \u043c\u0435\u0442\u0430\u0441\u0438\u043c\u0432\u043e\u043b\u0430\u043c\u0438 LDAP [{3}], \u0449\u043e \u043f\u0440\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c \u0434\u043e \u0432\u0456\u0434\u043e\u043c\u043e\u0433\u043e [{4}] \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 [{5}], \u044f\u043a\u043e\u0433\u043e \u043d\u0435 \u0431\u0443\u043b\u043e \u0432 \u043e\u0440\u0438\u0433\u0456\u043d\u0430\u043b\u044c\u043d\u0456\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456.
ascanalpha.ldapinjection.booleanbased.alert.attack = \u0415\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442 \u0432\u0438\u0440\u0430\u0437\u0443 LDAP\: [{0}]. \u0414\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\: [{1}].
ascanalpha.ldapinjection.booleanbased.alert.extrainfo = \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 [{0}] \u043d\u0430 [{1}] [{2}] \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0438\u043c \u0434\u043e \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043b\u043e\u0433\u0456\u0447\u043d\u043e \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u043e\u0433\u043e \u0432\u0438\u0440\u0430\u0437\u0443 [{3}] \u0456 \u0432\u0438\u0440\u0430\u0437\u0443 ''FALSE'' [{4}].
ascanalpha.ldapinjection.desc = LDAP Injection may be possible. It may be possible for an attacker to bypass authentication controls, and to view and modify arbitrary data in the LDAP directory.
ascanalpha.ldapinjection.name = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f LDAP 
ascanalpha.ldapinjection.refs = https\://owasp.org/www-community/attacks/LDAP_Injection\nhttps\://cheatsheetseries.owasp.org/cheatsheets/LDAP_Injection_Prevention_Cheat_Sheet.html
ascanalpha.ldapinjection.soln = Validate and/or escape all user input before using it to create an LDAP query.  In particular, the following characters (or combinations) should be deny listed\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNUL character\n
ascanalpha.ldapinjection.technologies.protocol = \u041f\u0440\u043e\u0442\u043e\u043a\u043e\u043b

ascanalpha.name = \u0410\u043a\u0442\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f - \u0430\u043b\u044c\u0444\u0430

ascanalpha.scripts.desc = Adds alpha status active scan rule scripts.
ascanalpha.scripts.name = Active Scan Rule Scripts - alpha
ascanalpha.scripts.suspiciousInputTransformation.desc = This script detects suspicious input transformations in web applications.
ascanalpha.scripts.warn.couldNotAddScripts = Could not add alpha active scan rule scripts\: {0}.

ascanalpha.sqlinjection.desc = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f SQL \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0435.
ascanalpha.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanalpha.sqlinjection.soln = \u041d\u0435 \u0434\u043e\u0432\u0456\u0440\u044f\u0439\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u0438\u043c \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u043d\u0430\u0432\u0456\u0442\u044c \u044f\u043a\u0449\u043e \u0456\u0441\u043d\u0443\u0454 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\u0417\u0430\u0433\u0430\u043b\u043e\u043c, \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.\n\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 JDBC, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 PreparedStatement \u0430\u0431\u043e CallableStatement \u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c\u0438, \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u0438\u043c\u0438 \u0447\u0435\u0440\u0435\u0437 '?'\n\u042f\u043a\u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 ASP, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 ADO Command Objects \u0456\u0437 \u0441\u0438\u043b\u044c\u043d\u043e\u044e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0442\u0438\u043f\u0443 \u0442\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0437\u0430\u043f\u0438\u0442\u0430\u043c\u0438.\n\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0438 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0457\u0445.\n*\u041d\u0435* \u043e\u0431\u2019\u0454\u0434\u043d\u0443\u0439\u0442\u0435 \u0440\u044f\u0434\u043a\u0438 \u0432 \u0437\u0430\u043f\u0438\u0442\u0438 \u0432 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u0456\u0439 \u043f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0456 \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u00abexec\u00bb, \u00abexec immediate\u00bb \u0430\u0431\u043e \u0435\u043a\u0432\u0456\u0432\u0430\u043b\u0435\u043d\u0442\u043d\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457\!\n\u041d\u0435 \u0441\u0442\u0432\u043e\u0440\u044e\u0439\u0442\u0435 \u0434\u0438\u043d\u0430\u043c\u0456\u0447\u043d\u0456 SQL-\u0437\u0430\u043f\u0438\u0442\u0438, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043f\u0440\u043e\u0441\u0442\u0443 \u043a\u043e\u043d\u043a\u0430\u0442\u0435\u043d\u0430\u0446\u0456\u044e \u0440\u044f\u0434\u043a\u0456\u0432.\n\u0412\u0438\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0432\u0441\u0456 \u0434\u0430\u043d\u0456, \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u0456 \u0432\u0456\u0434 \u043a\u043b\u0456\u0454\u043d\u0442\u0430.\n\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 \u00ab\u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0445\u00bb \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0445 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0430\u0431\u043e \u00ab\u0441\u043f\u0438\u0441\u043e\u043a \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0438\u0445\u00bb \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0438\u0445 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0443 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c.\n\u0417\u0430\u0441\u0442\u043e\u0441\u0443\u0439\u0442\u0435 \u043f\u0440\u0438\u043d\u0446\u0438\u043f \u043d\u0430\u0439\u043c\u0435\u043d\u0448\u0438\u0445 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0457\u0432, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043d\u0430\u0439\u043c\u0435\u043d\u0448 \u043f\u0440\u0438\u0432\u0456\u043b\u0435\u0439\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445.\n\u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u0443\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445 \u00absa\u00bb \u0430\u0431\u043e \u00abdb-owner\u00bb. \u0426\u0435 \u043d\u0435 \u0443\u0441\u0443\u0432\u0430\u0454 SQL-\u0456\u043d\u2019\u0454\u043a\u0446\u0456\u044e, \u0430\u043b\u0435 \u043c\u0456\u043d\u0456\u043c\u0456\u0437\u0443\u0454 \u0457\u0457 \u0432\u043f\u043b\u0438\u0432.\n\u041d\u0430\u0434\u0430\u0439\u0442\u0435 \u043c\u0456\u043d\u0456\u043c\u0430\u043b\u044c\u043d\u0438\u0439 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0431\u0430\u0437\u0438 \u0434\u0430\u043d\u0438\u0445, \u043d\u0435\u043e\u0431\u0445\u0456\u0434\u043d\u0438\u0439 \u0434\u043b\u044f \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438.
ascanalpha.sqlinjection.sqlite.alert.timing.error.extrainfo = The following known SQLite error message was provoked\: [{0}].
ascanalpha.sqlinjection.sqlite.alert.timing.extrainfo = The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, parameter value [{2}], which caused the request to take [{3}] milliseconds, when the original unmodified query with value [{4}] took [{5}] milliseconds.
ascanalpha.sqlinjection.sqlite.timing.name = SQL Injection - SQLite (Time Based)

ascanalpha.webCacheDeception.desc = \u041c\u043e\u0436\u043b\u0438\u0432\u0438\u0439 \u043e\u0431\u043c\u0430\u043d \u0432\u0435\u0431 \u043a\u0435\u0448\u0443. \u041d\u0435\u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043c\u043e\u0436\u0435 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0446\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456.
ascanalpha.webCacheDeception.name = \u041e\u0431\u043c\u0430\u043d \u0432\u0435\u0431 \u043a\u0435\u0448\u0443
ascanalpha.webCacheDeception.otherinfo = \u041a\u0435\u0448\u043e\u0432\u0430\u043d\u0430 \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456 \u043d\u0435\u0430\u0432\u0442\u043e\u0440\u0438\u0437\u043e\u0432\u0430\u043d\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0441\u0445\u043e\u0436\u0456.
ascanalpha.webCacheDeception.refs = https\://blog.cloudflare.com/understanding-our-cache-and-the-web-cache-deception-attack/\nhttps\://www.invicti.com/web-vulnerability-scanner/vulnerabilities/web-cache-deception
ascanalpha.webCacheDeception.soln = \u0420\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u043e\u0432\u0430\u043d\u043e \u0443\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438\u0441\u044c \u0432\u0456\u0434 \u043a\u043b\u0430\u0441\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0442\u0438\u043f\u0456\u0432 \u0444\u0430\u0439\u043b\u0443, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0430\u0431\u043e \u0442\u0430\u0431\u043b\u0438\u0446\u0456 \u0441\u0442\u0438\u043b\u0456\u0432, \u0432\u0438\u043a\u043b\u044e\u0447\u043d\u043e \u0437\u0430 \u0457\u0445 URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e \u0442\u0430 \u0440\u043e\u0437\u0448\u0438\u0440\u0435\u043d\u043d\u044f\u043c \u0444\u0430\u0439\u043b\u0443. \u041d\u0430\u0442\u043e\u043c\u0456\u0441\u0442\u044c \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044c, \u0449\u043e \u0444\u0430\u0439\u043b\u0438 \u043a\u0435\u0448\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0456 \u0457\u0445\u043d\u044c\u043e\u0433\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Content-Type.
