#X-Generator: crowdin.com
# ascanalphaAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=Activar Reglas de Escaneo - alfa

ascanalpha.apacherangeheaderdosscanner.name=Encabezado de rango Apache DoS (CVE-2011-3192)
ascanalpha.apacherangeheaderdosscanner.desc=El filtro byterange en versiones anteriores del Apache HTTP Server le permite a los atacantes autom\u00e1ticos causar una negaci\u00f3n de servicio (agotamiento de memoria y CPU) por medio de un encabezado de solicitud que identifica m\u00faltiples gamas traslapadas. Este tema fue explotado en libertad en agosto de 2011.
ascanalpha.apacherangeheaderdosscanner.soln=Mejore su servidor Apache a una versi\u00f3n actualmente estable. Soluciones alternativas u otras soluciones son descritas en las referencias. 
ascanalpha.apacherangeheaderdosscanner.refs=https\://httpd.apache.org/security/CVE-2011-3192.txt\nhttp\://cve.mitre.org/cgi-bin/cvename.cgi?name\=cve-2011-3192

ascanalpha.cookieslack.name=Detector de Cookie Slack
ascanalpha.cookieslack.desc=Repetidas solicitudes GET\: colocar una cookie diferente cada vez, seguido por la petici\u00f3n normal con todas las cookies para estabilizar la sesi\u00f3n, comparar las respuestas contra la l\u00ednea base GET original. Esto puede revelar \u00e1reas donde la cookie basado en autenticaci\u00f3n y atributos no se aplican realmente.
ascanalpha.cookieslack.otherinfo.intro=Las cookies que no tienen efectos esperados pueden revelar defectos en la l\u00f3gica de la aplicaci\u00f3n. En el peor de los casos, esto puede revelar donde la autenticaci\u00f3n por token(s) de cookies no se aplican realmente. 
ascanalpha.cookieslack.session.warning=Nota\: Debido a su nombre esta cookie puede ser importante, pero al caer parece no tener ning\u00fan efecto\: [{0}]  
ascanalpha.cookieslack.affect.response.yes=Estas cookies afectan la respuesta\: 
ascanalpha.cookieslack.affect.response.no=Estas cookies no afectaron la respuesta\:
ascanalpha.cookieslack.session.destroyed=Dejando caer esta cookie no parece tener invalida la sesi\u00f3n\: [{0}] Una solicitud de seguimiento con todas las cookies originales todav\u00eda ten\u00eda una respuesta diferente a la solicitud original.
ascanalpha.cookieslack.separator=,
ascanalpha.cookieslack.endline=\ 

ascanalpha.elmahscanner.name=Fuga de informaci\u00f3n ELMAH
ascanalpha.elmahscanner.desc=El Error Logging Modules and Handlers (ELMAH [elmah.axd]) M\u00f3dulo HTTP fue encontrado disponible. Este modulo puede tener fugas de una cantidad importante de informaci\u00f3n valiosa.
ascanalpha.elmahscanner.otherinfo=Basado en el c\u00f3digo de estado de respuesta ELMAH podr\u00eda estar protegida por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.  
ascanalpha.elmahscanner.refs=https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanalpha.elmahscanner.soln=Considere si o no ELMAH es actualmente requerido en la producci\u00f3n, si no es as\u00ed entonces deshabilitarlo. Si s\u00ed es entonces asegurar el acceso a el requiere autenticaci\u00f3n y autorizaci\u00f3n. Vea tambi\u00e9n\: https\://elmah.github.io/a/securing-error-log-pages/

ascanalpha.examplefile.name=Un ejemplo regla de lectura activa que carga datos desde un archivo
ascanalpha.examplefile.desc=A\u00f1adir m\u00e1s informaci\u00f3n acerca de la vulnerabilidad aqu\u00ed
ascanalpha.examplefile.other=Se trata de informaci\u00f3n que no encaja en ninguna de las otras secciones
ascanalpha.examplefile.soln=Una descripci\u00f3n general de como resolver el problema
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.getforpostscanner.name=GET para POST
ascanalpha.getforpostscanner.desc=Una petici\u00f3n que fue originalmente observada como un POST fue tambi\u00e9n aceptada como un GET. Este problema no representa debilidad de seguridad por si mismo, sin embargo, podr\u00eda facilitar la simplificaci\u00f3n de otros ataques. Por ejemplo si el POST original esta sujeto a Cross-Site SCripting (XSS), este hallazgo podr\u00eda indicar que un simplificado (GET base) XSS tambi\u00e9n podr\u00eda ser posible.
ascanalpha.getforpostscanner.soln=Aseg\u00farese de que solo POST es aceptado cuando se espera POST.

ascanalpha.httponlysite.name=\u00danico sitio HTTP
ascanalpha.httponlysite.desc=El sitio s\u00f3lo se sirve bajo HTTP y no HTTPS.
ascanalpha.httponlysite.soln=Configure su web o servidor de aplicaci\u00f3n para usar SSL (https).
ascanalpha.httponlysite.refs=https\://www.OWASP.org/index.php/Transport_Layer_Protection_Cheat_Sheet https\://www.owasp.org/index.php/SSL_Best_Practices \nhttps\://letsencrypt.org/
ascanalpha.httponlysite.otherinfo={0}\nZAP intent\u00f3 conectarse a trav\u00e9s de\: {1}
ascanalpha.httponlysite.otherinfo.connectionfail=Fallo en conexi\u00f3n.
ascanalpha.httponlysite.otherinfo.differenthosts=Hospedarores diferentes.
ascanalpha.httponlysite.otherinfo.redirectionlimit=L\u00edmite de redirecci\u00f3n alcanzado.
ascanalpha.httponlysite.otherinfo.noredirection=No hubo redirecci\u00f3n autom\u00e1tica.
ascanalpha.httponlysite.otherinfo.nossl=Sitio no tiene soporte SSL/TLS.
ascanalpha.httponlysite.otherinfo.redirecttohttp=Redirigido a HTTP.
ascanalpha.httponlysite.otherinfo.urinotencoded=Redirecci\u00f3n de URI no pudo ser codificada.

ascanalpha.httpoxy.name=Httpoxy - Mal uso de encabezado Proxy
ascanalpha.httpoxy.desc=El servidor inici\u00f3 una solicitud de Proxy por medio del Proxy especificado en el encabezado Proxy HTTP de la solicitud. \nhttpoxi usualmente afecta la ejecuci\u00f3n de c\u00f3digos en CGI o CGI como ambientes.\nEsto podr\u00eda permitirle a los atacantes a\:\n*Solicitudes salientes de Porxy HTTP hechas por la aplicaci\u00f3n web.\n*Dirigir el servidor a abrir conexiones salientes a una direcci\u00f3n y puerto de su elecci\u00f3n o \n*Atar recursos del servidor al forzar el software vulnerable para usar un proxy maligno
ascanalpha.httpoxy.otherinfo=Un mensaje saliente a {0} fue proxied v\u00eda el anfitri\u00f3n y puerto que ZAP inyect\u00f3 en el encabezado HTTP Proxy.
ascanalpha.httpoxy.soln=La mejor mitigaci\u00f3n inmediata es bloquear encabezados de petici\u00f3n de Proxy tan pronto posible, y antes de que lleguen a su aplicaci\u00f3n.
ascanalpha.httpoxy.refs=https\://httpoxy.org/

ascanalpha.httpsashttpscanner.name=HTTPS Contenido Disponible v\u00eda HTTP
ascanalpha.httpsashttpscanner.desc=El contenido que inicialmente se accede a trav\u00e9s de HTTPS (por ejemplo\: usando encriptaci\u00f3n SSL/TLS) es tambi\u00e9n accesible v\u00eda HTTP (sin encriptaci\u00f3n). 
ascanalpha.httpsashttpscanner.soln=Aseg\u00farese de que su servidor web, servidor de aplicaciones, balanceador de carga, etc. est\u00e1 configurado para s\u00f3lo servir a tales contenidos a trav\u00e9s de HTTPS. Considere implementar HTTP Strict Transport Security.
ascanalpha.httpsashttpscanner.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers\nhttp\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttp\://caniuse.com/stricttransportsecurity\nhttp\://tools.ietf.org/html/rfc6797
ascanalpha.httpsashttpscanner.otherinfo=ZAP intent\u00f3 conectarse a trav\u00e9s de\: {0}

ascanalpha.ldapinjection.name=Inyecci\u00f3n LDAP
ascanalpha.ldapinjection.desc=La inyecci\u00f3n LDAP podr\u00eda ser posible. Podr\u00eda ser posible para un atacante eludir controles de autenticaci\u00f3n, y ver y modificar datos arbitrarios en el directorio LDAP. 
ascanalpha.ldapinjection.soln=Validar y/o escapar toda entrada de usuario antes de usarla para crear una consulta LDAP. En particular, los siguientes caracteres (o combinaciones) deber\u00edan estar en la lista negra\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nCaracter NUL 
ascanalpha.ldapinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A9\nhttp\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection\nhttps\://www.owasp.org/index.php/LDAP_injection
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo=par\u00e1metro [{0}] en [{1}] [{2}] podr\u00eda ser vulnerable a una inyecci\u00f3n LDAP, mediante un ataque con meta-caracteres LDAP [{3}], rendimiento conocido [{4}] mensaje de error [{5}], el cual no estaba presente en la respuesta original.
ascanalpha.ldapinjection.alert.evidence={0}
ascanalpha.ldapinjection.booleanbased.alert.extrainfo=par\u00e1metro [{0}] en [{1}] [{2}] pod\u00eda ser vulnerable a inyecci\u00f3n LDAP, utilizando el equivalente l\u00f3gico de la expresi\u00f3n [{3}] y la expresi\u00f3n ''Falsa'' [{4}].
#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack=par\u00e1metro [{0}] asignado a [{1}]
ascanalpha.ldapinjection.booleanbased.alert.attack=Expresi\u00f3n equivalente LDAP\: [{0}]. Par\u00e1metro aleatorio\: [{1}].
# a colon delimited list of the known LDAP implementations (used to reference "ldapinjection.<implementation>.errormessages" here)  
ascanalpha.ldapinjection.knownimplementations=activedirectory\:openldap\:389directoryserver\:apachedirectoryservices
# OpenLDAP Error messages
# error messages may be localised, so in this case, pull them from the local version of OpenLDAP source, using the following command
# grep -Eo "\"[^\"]+\"" openldap-2.4.31/libraries/libldap/error.c
# the list will then need to be manually filtered slightly (remove common strings, and ensure that the messages contain no colons, which would mess up the colon delimiting used here)
ascanalpha.ldapinjection.openldap.errormessages=Operaciones de error\: Protocolo de error\: L\u00edmite de tiempo excedido\: L\u00edmite de tama\u00f1o excedido\: Comparar Falso\: Comparar Verdadero\: m\u00e9todo de autenticaci\u00f3n no admitido\: Fuerte (ER) de autenticaci\u00f3n requerido\: l\u00edmite administrativo excedi\u00f3\: extensi\u00f3n cr\u00edtica no est\u00e1 disponible\: La confidencialidad requerida\: bind SASL en curso\: n tales atributos\: Indefinido tipo de atributo\: coincidente inapropiado\: restricci\u00f3n de violaci\u00f3n\: existe tipo o el valor\: la sintaxis no v\u00e1lida\: no existe el objeto\: un problema Alias\: sintaxis inv\u00e1lida DN\: Alias \u200b\u200bdereferencing problema\: la autenticaci\u00f3n inapropiado\: credenciales no v\u00e1lidas\: el acceso insuficiente\: El servidor est\u00e1 ocupado\: servidor no est\u00e1 disponible\: El servidor no est\u00e1 dispuesto a realizar\: bucle detectado\: Naming violaci\u00f3n\: violaci\u00f3n clase de objeto\: Operaci\u00f3n no permitida en la no-hoja\: Operaci\u00f3n no permitida en RDN\: ya existe\: no se puede modificar la clase de objeto\: aprovechamiento afecte a m\u00faltiples DSA\: vista de lista virtual de error\: Otros (por ejemplo, la aplicaci\u00f3n espec\u00edfica) error\: Los resultados parciales y la remisi\u00f3n recibieron\: la entrada es una hoja\: resultados demasiado grande\: no Operaci\u00f3n para cancelar\: demasiado tarde para cancelar\: no puede Canc EL\: Error de aserci\u00f3n\: Error de aserci\u00f3n (X)\: con proxy autorizaci\u00f3n es denegada\: Autorizaci\u00f3n proxy fallo (X)\: Contenido de sincronizaci\u00f3n de actualizaci\u00f3n requerido\: Contenido de sincronizaci\u00f3n de actualizaci\u00f3n requerida (X)\: No Operaci\u00f3n (X)\: Recursos LCUP de existencias\: Violaci\u00f3n LCUP de seguridad\: LCUP Los datos no v\u00e1lido\: no compatible LCUP Esquema\: LCUP Recargar requerido\: TXN especificar bien\: TXN ID no es v\u00e1lido\: no se puede contactar con el servidor LDAP\: error local\: error de codificaci\u00f3n\: La decodificaci\u00f3n de error\: Tiempo de espera agotado\: m\u00e9todo de autenticaci\u00f3n Desconocido\: filtro de b\u00fasqueda malo\: el usuario cancel\u00f3 la operaci\u00f3n\: Bad par\u00e1metro a una rutina de LDAP\: Fuera de la memoria\: Conectar error\: no se admite\: control no encontrado\: no hay resultados devueltos\: M\u00e1s resultados para volver\: Cliente Loop\: L\u00edmite de Referencia excedido\: API error desconocido\: error desconocido (extensi\u00f3n)\: Desconocido ( extensi\u00f3n privada) error\: error desconocido\n\u00a0
# Active Directory error messages, from http://support.microsoft.com/kb/232282 
ascanalpha.ldapinjection.activedirectory.errormessages=0x00005011L\:0x00005012L\:0x00005013L\:0x80005000L\:0x80005001L\:0x80005002L\:0x80005003L\:0x80005004L\:0x80005005L\:0x80005006L\:0x80005007L\:0x80005008L\:0x80005009L\:0x8000500AL\:0x8000500BL\:0x8000500CL\:0x8000500DL\:0x8000500EL\:0x8000500FL\:0x80005010L\:0x80005014L\:A bad parameter was passed to a routine\:Administration limit on the server has exceeded\:An invalid ADSI path name was passed\:An unknown ADSI computer object was requested\:An unknown ADSI domain object was requested\:An unknown ADSI object was requested\:An unknown ADSI user object was requested\:Authentication is inappropriate\:Cannot contact the LDAP server\:Cannot dereference the alias\:Cannot establish the connection\:Cannot modify object class\:Client loop was detected\:Compare yielded FALSE\:Compare yielded TRUE\:Confidentiality is required\:Critical extension is unavailable\:Decoding error occurred\:E_ADS_BAD_PARAMETER\:E_ADS_BAD_PATHNAME\:E_ADS_CANT_CONVERT_DATATYPE\:E_ADS_COLUMN_NOT_SET\:E_ADS_INVALID_COMPUTER_OBJECT\:E_ADS_INVALID_DOMAIN_OBJECT\:E_ADS_INVALID_FILTER\:E_ADS_INVALID_USER_OBJECT\:E_ADS_OBJECT_EXISTS\:E_ADS_OBJECT_UNBOUND\:E_ADS_PROPERTY_INVALID\:E_ADS_PROPERTY_MODIFIED\:E_ADS_PROPERTY_NOT_FOUND\:E_ADS_PROPERTY_NOT_MODIFIED\:E_ADS_PROPERTY_NOT_SET\:E_ADS_PROPERTY_NOT_SUPPORTED\:E_ADS_SCHEMA_VIOLATION\:E_ADS_UNKNOWN_OBJECT\:Encoding error occurred\:ERROR_ACCESS_DENIED\:ERROR_CANCELLED\:ERROR_CONNECTION_REFUSED\:ERROR_DS_ADMIN_LIMIT_EXCEEDED\:ERROR_DS_AFFECTS_MULTIPLE_DSAS\:ERROR_DS_ALIAS_DEREF_PROBLEM\:ERROR_DS_ALIAS_PROBLEM\:ERROR_DS_ATTRIBUTE_OR_VALUE_EXISTS\:ERROR_DS_ATTRIBUTE_TYPE_UNDEFINED\:ERROR_DS_AUTH_METHOD_NOT_SUPPORTED\:ERROR_DS_AUTH_UNKNOWN\:ERROR_DS_BUSY\:ERROR_DS_CANT_MOD_OBJ_CLASS\:ERROR_DS_CANT_ON_NON_LEAF\:ERROR_DS_CANT_ON_RDN\:ERROR_DS_CLIENT_LOOP\:ERROR_DS_COMPARE_FALSE\:ERROR_DS_COMPARE_TRUE\:ERROR_DS_CONFIDENTIALITY_REQUIRED\:ERROR_DS_CONSTRAINT_VIOLATION\:ERROR_DS_CONTROL_NOT_FOUND\:ERROR_DS_DECODING_ERROR\:ERROR_DS_ENCODING_ERROR\:ERROR_DS_FILTER_UNKNOWN\:ERROR_DS_INAPPROPRIATE_AUTH\:ERROR_DS_INAPPROPRIATE_MATCHING\:ERROR_DS_INVALID_ATTRIBUTE_SYNTAX\:ERROR_DS_INVALID_DN_SYNTAX\:ERROR_DS_IS_LEAF\:ERROR_DS_LOCAL_ERROR\:ERROR_DS_LOOP_DETECT\:ERROR_DS_NAMING_VIOLATION\:ERROR_DS_NO_ATTRIBUTE_OR_VALUE\:ERROR_DS_NO_RESULTS_RETURNED\:ERROR_DS_NO_SUCH_OBJECT\:ERROR_DS_NOT_SUPPORTED\:ERROR_DS_OBJ_CLASS_VIOLATION\:ERROR_DS_OBJECT_RESULTS_TOO_LARGE\:ERROR_DS_OPERATIONS_ERROR\:ERROR_DS_PARAM_ERROR\:ERROR_DS_PROTOCOL_ERROR\:ERROR_DS_REFERRAL\:ERROR_DS_REFERRAL_LIMIT_EXCEEDED\:ERROR_DS_SERVER_DOWN\:ERROR_DS_SIZELIMIT_EXCEEDED\:ERROR_DS_STRONG_AUTH_REQUIRED\:ERROR_DS_TIMELIMIT_EXCEEDED\:ERROR_DS_UNAVAILABLE\:ERROR_DS_UNAVAILABLE_CRIT_EXTENSION\:ERROR_DS_UNWILLING_TO_PERFORM\:ERROR_GEN_FAILURE\:ERROR_LOGON_FAILURE\:ERROR_MORE_DATA\:ERROR_MORE_DATA\:ERROR_NOT_ENOUGH_MEMORY\:ERROR_OBJECT_ALREADY_EXISTS\:ERROR_TIMEOUT\:LDAP_ADMIN_LIMIT_EXCEEDED\:LDAP_AFFECTS_MULTIPLE_DSAS\:LDAP_ALIAS_DEREF_PROBLEM\:LDAP_ALIAS_PROBLEM\:LDAP_ALREADY_EXISTS\:LDAP_ATTRIBUTE_OR_VALUE_EXISTS\:LDAP_AUTH_METHOD_NOT_SUPPORTED\:LDAP_AUTH_UNKNOWN\:LDAP_BUSY\:LDAP_CLIENT_LOOP\:LDAP_COMPARE_FALSE\:LDAP_COMPARE_TRUE\:LDAP_CONFIDENTIALITY_REQUIRED\:LDAP_CONNECT_ERROR\:LDAP_CONSTRAINT_VIOLATION\:LDAP_CONTROL_NOT_FOUND\:LDAP_DECODING_ERROR\:LDAP_ENCODING_ERROR\:LDAP_FILTER_ERROR\:LDAP_INAPPROPRIATE_AUTH\:LDAP_INAPPROPRIATE_MATCHING\:LDAP_INSUFFICIENT_RIGHTS\:LDAP_INVALID_CREDENTIALS\:LDAP_INVALID_DN_SYNTAX\:LDAP_INVALID_SYNTAX\:LDAP_IS_LEAF\:LDAP_LOCAL_ERROR\:LDAP_LOOP_DETECT\:LDAP_MORE_RESULTS_TO_RETURN\:LDAP_NAMING_VIOLATION\:LDAP_NO_MEMORY\:LDAP_NO_OBJECT_CLASS_MODS\:LDAP_NO_RESULTS_RETURNED\:LDAP_NO_SUCH_ATTRIBUTE\:LDAP_NO_SUCH_OBJECT\:LDAP_NOT_ALLOWED_ON_NONLEAF\:LDAP_NOT_ALLOWED_ON_RDN\:LDAP_NOT_SUPPORTED\:LDAP_OBJECT_CLASS_VIOLATION\:LDAP_OPERATIONS_ERROR\:LDAP_OTHER\:LDAP_PARAM_ERROR\:LDAP_PARTIAL_RESULTS\:LDAP_PROTOCOL_ERROR\:LDAP_REFERRAL                       \:LDAP_REFERRAL_LIMIT_EXCEEDED\:LDAP_RESULTS_TOO_LARGE\:LDAP_SERVER_DOWN\:LDAP_SIZELIMIT_EXCEEDED\:LDAP_STRONG_AUTH_REQUIRED\:LDAP_TIMELIMIT_EXCEEDED\:LDAP_TIMEOUT\:LDAP_UNAVAILABLE\:LDAP_UNAVAILABLE_CRIT_EXTENSION\:LDAP_UNDEFINED_TYPE\:LDAP_UNWILLING_TO_PERFORM\:LDAP_USER_CANCELLED\:Local error occurred\:Loop was detected\:More results are to be returned\:Multiple directory service agents are affected\:Object does not exist\:One or more errors occurred\:One or more input parameters are invalid\:Operation is not allowed on a non leaf object\:Operation is not allowed on RDN\:Operations error occurred\:Partial results and referrals received\:Protocol error occurred\:Requested attribute does not exist\:Results are not returned\:Results returned are too large\:S_ADS_ERRORSOCCURRED\:S_ADS_NOMORE_COLUMNS\:S_ADS_NOMORE_ROWS\:Size limit has exceeded \:Strong authentication is required\:The ADSI data type cannot be converted to/from a native DS data type\:The ADSI object exists\:The ADSI property cannot be found in the cache\:The alias is invalid\:The attempted action violates the directory service schema rules\:The attribute exists or the value has been assigned\:The authentication method is not supported\:The control was not found\:The distinguished name has an invalid syntax\:The feature is not supported\:The object already exists\:The object is a leaf\:The referral limit has exceeded\:The search filter is bad\:The search operation has reached the last column for the current row\:The search operation has reached the last row\:The search was timed out\:The server is busy\:The server is not available\:The server is unwilling to perform\:The specified ADSI object has been modified\:The specified ADSI object has not been modified\:The specified ADSI object is not bound to a remote resource\:The specified ADSI property is invalid\:The specified ADSI property is not supported\:The specified ADSI property was not set\:The specified column in the ADSI was not set\:The specified search filter is invalid\:The supplied credential is invalid\:The syntax is invalid\:The system is out of memory\:The user has canceled the operation\:The user has insufficient access right\:There was a constrain violation\:There was a naming violation\:There was an inappropriate matching\:There was an object class violation\:Time limit has exceeded\:Type is not defined\:Unknown authentication error occurred\:Unknown error occurred
# 389 Directory Server error messages, using command: grep -Eo "\"[^\"]+\"" ./lib/ldaputil/errors.c 
ascanalpha.ldapinjection.389directoryserver.errormessages=b\u00fasqueda LDAP no encuentra una entrada LDAP\: funci\u00f3n de mapeo Cert fall\u00f3\: funci\u00f3n de b\u00fasqueda no Cert\: Cert verificar la funci\u00f3n fall\u00f3\: certmap funci\u00f3n InitFn fall\u00f3\: inv\u00e1lido local de prefijo de la base de datos LDAP url\: dn base est\u00e1 ausente en url ldapdb\: fuera de la memoria\: No se pudo 't inicializar la conexi\u00f3n con el servidor de directorio LDAP\: no se pudo inicializar la conexi\u00f3n con el directorio LDAP locales\: ldap_set_option fracas\u00f3 por la base de datos LDAP locales\: base de datos predeterminada cert no inicializado al utilizar LDAP sobre SSL\: se detectaron grupos circulares durante la pertenencia al grupo de control\: no v\u00e1lida de cadena\: \u00edndice de la cadena no v\u00e1lida\: falta de valor de atributo del resultado de la b\u00fasqueda\: no puede abrir el fichero de configuraci\u00f3n\: nombre de la base de datos no se encuentra\: la propiedad de base de datos no se encuentra\: Directiva ilegal en el fichero de configuraci\u00f3n\: error interno - LDAPU_ERR_NOT_PROPVAL\: no se puede extraer DN de emisor del certificado\: los emisores DN falta para certmap no predeterminado\: falta la informaci\u00f3n de asignaci\u00f3n de entrada de cert to ldap\: se encontr\u00f3 DN de sujeto malformado en el certificado\: no se puede e para cargar certmap las bibliotecas de conectores\: InitFn debe ser proporcionada al uso de las bibliotecas certmap de plugin\: No se pudo encontrar InitFn en la biblioteca de plugins certmap\: No se pudo certificado coincidente en la entrada LDAP del usuario\: la entrada LDAP del usuario no tiene ning\u00fan certificado para comparar\: Nombre de biblioteca falta en el fichero de configuraci\u00f3n\: Init nombre de la funci\u00f3n no se encuentra en el fichero de configuraci\u00f3n\: ldaputil funci\u00f3n de la API llamada con argumentos equivocados\: Cambiar el nombre del archivo no se pudo\: VerifyCert valor de la propiedad debe estar encendido o apagado\: Cert nombre del emisor no se encuentra\: nombre de la propiedad es que falta\: desconocido atributo cert\: B\u00fasqueda LDAP devolvi\u00f3 resultados vac\u00edo\: B\u00fasqueda LDAP devolvi\u00f3 varias coincidencias cuando uno espera\: no se pudo extraer una entrada del resultado de la b\u00fasqueda LDAP\: entrada LDAP le falta la 'uid' valor de atributo\: argumentos no v\u00e1lidos pasados \u200b\u200ba la funci\u00f3n API certmap\: inv\u00e1lido Sufijo de directorio LDAP\: no se pudo extraer el DN sujeto del certificado\: no se pudo extraer la codificaci\u00f3n DER original del certificado\: la funci\u00f3n no se implementa ented todav\u00eda\: ldaputil error interno\: error interno - c\u00f3digo de error desconocido
# Apache Directory Service (starting point: cat ./i18n/src/main/resources/org/apache/directory/server/i18n/errors.properties | sed -re '/^#/ d; /^$/d;' | cut -d"=" -f2)
ascanalpha.ldapinjection.apachedirectoryservices.errormessages=Error al identificar el OID para un \u00edndice del sistema en el atributo Un \u00edndice de usuario en el atributo no IGUALIDAD de la regla de coincidencia definida\: por el llamante no autenticado. Error de autenticaci\u00f3n No puede ser una contrase\u00f1a digerida para el algoritmo \u00a1La ra\u00edz DSE no se puede eliminar, mover ni renombrar\! no tiene permiso para mover o cambiar el nombre de la cuenta de administrador. Nadie, ni siquiera el administrador puede del, mover o cambiar el nombre, no pudo analizar la entrada ACI no pudo analizar el AIC de la entrada secundaria \u00a1No se puede eliminar la DSE ra\u00edz\! \u00a1El grupo Administradores no puede ser eliminado\! no tiene permiso para eliminar la cuenta de administrador. no tiene permiso para eliminar la entrada del grupo \u00a1La ra\u00edz DSE no se puede modificar\! no tiene permiso para modificar la cuenta del usuario administrador. no tiene permiso para modificar la entrada del grupo \u00a1El grupo Administradores no se puede mover ni renombrar\! no tiene permiso para mover o cambiar el nombre de la cuenta de administrador. Nadie no puede registrar o cambiar el nombre de la cuenta de usuario\: no tiene permiso para mover o cambiar el nombre de la entrada de grupo. Acceso a la cuenta de usuario. Acceso al grupo. al error de sintaxis No se puede agregar tuplas ACI a tuplas cach\u00e9 No se puede establecer una tienda de cambios cuando uno ya est\u00e1 activa\: atributo operativo no puede ser modificada por un usuario\: Los modificadores Nombre del atributo operacional no puede ser modificada por un usuario El atributo operacional modifyTimeStamp no puede ser modificada por un usuario no pudieron Propiedades de la versi\u00f3n LOG Un LDAPURL no debe contener una descripci\u00f3n. Un LDAPURL no debe contener ninguna extensi\u00f3n. Un LDAPURL no debe contener ninguna descripci\u00f3n. extensi\u00f3n cr\u00edtica\: un ldapurl deber\u00eda contener un DN no vac\u00eda una entrada con una 'referencia' debe ObjectClass contiene un atributo 'ref' no tiene ning\u00fan OID. Deber\u00eda ser un AttributeType. AttributeType incorrecto, no tiene un OID asociado El valor almacenado en un atributo de lectura mec\u00e1nica humano como un byte El valor almacenado en un atributo de lectura mec\u00e1nica no humano como una cadena debe ser convertible a un byte Un filtro no debe ser nulo A filtros de subcadena deben utilizarse solo en atributos legibles por humanos No se puede eliminar a un ausente valor del atributo Una clase de objeto no puede heredar de un objeto clase que no es una clase de objeto que no es una clase de objeto estructural que no es una clase de objeto estructural \: contiene m\u00e1s de un tipo de atributo de clase de objeto ESTRUCTURAL, que es parte del RDN\: el valor almacenado en un atributo que no es de lectura humana como una cadena deber\u00eda ser convertible a byte. El valor no es v\u00e1lido. Debe ser un String o un byte. No se pudo acceder al certificado en DIT. Error al intentar comparar los bytes del certificado para determinar el alias. Error al intentar extraer la clave. Excepci\u00f3n al buscar el DIT para la clase\: Error encontrado al buscar el directorio de la clase no pudo analizar el nuevo sub\u00e1rbol La especificaci\u00f3n no pudo analizar la entrada Desencadenador Desencadenador Error del analizador de la especificaci\u00f3n en\: SynchWorker no pudo sincronizar el directorio. Tipo de cambio desconocido Reversiones del tipo de cambio Encontrado un error al intentar revertir a una revisi\u00f3n anterior No se puede construir una entrada para El identificador de replicaci\u00f3n debe estar en No se puede insertar la siguiente entrada\: Los contenedores de entidad de esquema de objectClass organizativa La unidad debe tener 3 componentes de nombre de longitud. Esperando unidad organizativa con uno de los siguientes nombres No se puede agregar una entrada en No desear para realizar la modificaci\u00f3n en No desear para habilitar un esquema no cargado Dit Content Rule loading NYI Dit Structure Rule loading JNI Matching Rule Usar loading NYI\: NameForm cargar NYI Fall\u00f3 la inicializaci\u00f3n de partici\u00f3n envuelta . Intento de destruir la partici\u00f3n envuelta fall\u00f3. No se pudo crear el directorio No se pudo eliminar el archivo o el directorio No se puede crear una instancia del Servicio de directorio por un motivo desconocido. Se produjo un error al eliminar el directorio de trabajo. Se elimin\u00f3 el tipo de cambio no compatible en LDIF. Se detect\u00f3 un error al entregar las notificaciones. Excepci\u00f3n encontrada durante el manejo del evento. Error al configurar el servidor http del embarcadero Error al configurar las aplicaciones web Codificaci\u00f3n del error Clave de cifrado. Error al cerrar un \u00edndice. Tabla maestra cerrada para el error al cerrar el maestro. Error al cerrar el administrador de registros Error al identificar OID por Error al agregar Error al agregar Excepci\u00f3n al eliminar No se puede deserializar la entrada No se puede crear un ticket para No se puede crear un ticket No se puede codificar el objeto Ticket, el tama\u00f1o de la PDU es El tama\u00f1o del buffer de la PDU tambi\u00e9n peque\u00f1a \! No se puede codificar el objeto Data de Autorizaci\u00f3n, el tama\u00f1o de PDU es No se puede codificar el objeto Checksum, el tama\u00f1o de PDU es No se puede codificar el objeto Encrypted Data, el tama\u00f1o de PDU es No se puede codificar el objeto Key de Codificaci\u00f3n, el tama\u00f1o de PDU no se puede codificar el tama\u00f1o de la PDU es No se puede codificar el objeto Direcciones de host, el tama\u00f1o de la PDU es\: No se puede codificar el objeto de datos de autenticaci\u00f3n previa, el tama\u00f1o de la PDU es No se puede codificar el objeto Nombre principal, el tama\u00f1o de la PDU no se puede codificar No se puede colocar una PDU en un b\u00fafer nulo Se encontr\u00f3 m\u00e1s de una entrada de servidor para el nombre principal de Kerberos No se puede inicializar una partici\u00f3n sin un sufijo v\u00e1lido. Excepci\u00f3n inesperada Error en el monitor de solicitud Error en el monitor de contexto Error en el monitor de respuesta Error al obtener el contexto del cat\u00e1logo Error al obtener el contexto inicial. Error al volver a enlazar el servicio ldap. Error al escribir. Cierre agraciado Respuesta al mecanismo del cliente no compatible. Verifique el archivo de configuraci\u00f3n server.xml (campo ms Mechanis admitido)\: Handler no disponible para Solo LDAP v3 es compatible. Solo LDAP v3 es compatible. Fallo al abandonar correctamente esta b\u00fasqueda persistente. La referencia ser\u00e1 ignorada. Error al cerrar el cursor de b\u00fasqueda para el mensaje. Recib\u00ed m\u00e1s de una entrada para buscar en Root DSE, lo que significa que el Cursor no funciona correctamente. fall\u00f3 en list.close no pudo separar la sesi\u00f3n correctamente Error al enviar una solicitud de b\u00fasqueda con los modos Refresh And Persist Error al vincular un servicio LDAP Error en el cierre del cursor El archivo LDIF no existe. Error al importar LDIF en la tienda de respaldo. no se pudo cerrar la secuencia Error al cerrar la enumeraci\u00f3n en PSearch Listener Error al cerrar la conexi\u00f3n en PSearch Listener PSearch Listener con el error no se pudo obtener la ruta can\u00f3nica No se puede cargar el archivo ldif Error al ejecutar la clase Error al ejecutar el m\u00e9todo Error al explorar el \u00edndice en el atributo help for use . Comando desconocido carga forzada carga (-c) requiere la opci\u00f3n An\u00e1lisis de l\u00ednea de comando fallido para comando desconocido\: el valor de puerto de es mayor que el n\u00famero de puerto m\u00e1ximo es menor que el n\u00famero de puerto m\u00ednimo Valor de retardo de directorio de partici\u00f3n de\: es mayor que el retraso m\u00e1ximo (segundos) valor permitido de retardo de tiempo El valor fuera de l\u00ednea es mayor que el tiempo m\u00e1ximo Offline (minutos) permitido es menor que cero y no tiene sentido fall\u00f3 por las siguientes razones proporcionadas por el servidor Error de importaci\u00f3n. se debe proporcionar el nombre del archivo dif Sin normalizador presente para el tipo de atributo en el \u00edndice de memoria no puede almacenar los datos en el disco en el \u00edndice de memoria no admite el cach\u00e9 expl\u00edcito No se puede almacenar un identificador de entrada del servidor clonado para el padre no contiene ning\u00fan atributo de clase No un nombre normalizado no contiene entrada atributo Csn no contiene entrada atributo Uuid operaci\u00f3n de modificaci\u00f3n no identificada No se puede llamar al alias del m\u00e9todo de almacenamiento Desreferencia Problema intento de crear un alias alias alias Desreferencia Problema intento de crear alias con ciclo alias relativo Desreferencia Problema - el alias apunta a una entrada fuera del alias Problema, el alias al eliminar la referencia no nombrar\u00eda un objeto conocido, el nombre del objeto alias debe establecerse en una entrada existente v\u00e1lida. alias Problema de desreferenciaci\u00f3n El alias apunta a otro alias. Alias \u200b\u200bde encadenamiento no es compatible con este back-end. \u00a1Enlace an\u00f3nimo NO permitido\! No se puede autenticar el usuario Contrase\u00f1a no correcta para el usuario Error al buscar usuario para la autenticaci\u00f3n Protecci\u00f3n inesperada Elemento Clase de usuario inesperado La ra\u00edz DSE no se puede mover ni cambiar de nombre. Indefinido modificar el valor de operaci\u00f3n de ChangeLog no se ha habilitado. El almac\u00e9n de registro de cambios subyacente no admite la b\u00fasqueda a trav\u00e9s de sus registros El almac\u00e9n de registro de cambios subyacente no admite b\u00fasquedas a trav\u00e9s de sus etiquetas\: la revisi\u00f3n debe ser mayor o igual que la revisi\u00f3n debe ser menor o igual que la revisi\u00f3n actual. Subentradas de atributos No puede operar en atributos colectivos en subredes de atributos no colectivos Negaci\u00f3n no tiene hijo Operador de nodo de rama no reconocido\: Tipo de nodo de hoja no reconocido Tipo de coincidencia desconocido \u00c1mbito de b\u00fasqueda no reconocida con sintaxis incorrecta No se puede agregar la subinserci\u00f3n de esquema global porque existe de manera predeterminada. ya existe Intento de agregar entrada No se puede permitir la eliminaci\u00f3n del subesquema Subentrada Intentar agregar valor existente No se puede permitir el cambio de nombre del subesquema Subentrada Una Subentrada de atributo colectivo debe tener al menos un atributo colectivo No se puede permitir el movimiento del subschema Intento de subentrada buscar bajo una entrada no existente Tipo de afirmaci\u00f3n desconocida Error al expandir el nodo La partici\u00f3n del sistema tiene un nombre incorrecto Sufijo de partici\u00f3n duplicado No se puede establecer el id para la partici\u00f3n nexus.\:Grupo de muchas excepciones en la ra\u00edz nexus sincronizaci\u00f3n no encontrada dentro del atributo Tipo registro La partici\u00f3n actual no no tiene ning\u00fan sufijo No se puede encontrar una partici\u00f3n para el usuario Root inorg directorio apache prefs del servidor Preferencias del servidor F\u00e1brica no implementada No se pudo configurar el nodo. Error al obtener SPI. La operaci\u00f3n de modificaci\u00f3n no deja ning\u00fan objeto estructural Clase para la entrada Modificar la operaci\u00f3n intenta eliminar el atributo RDN Modificar la operaci\u00f3n intenta eliminar valores de atributo RDN en uso para no encontrarse en el registro de atributos Se esperan al menos dos componentes de nombre para el no declarado en el objeto Clases de entrada M\u00e1s que se ha proporcionado un valor para el atributo de un solo valor. Atributos requeridos es sint\u00e1cticamente incorrecto. El valor no es una cadena v\u00e1lida. El valor almacenado en un atributo de lectura humana no es una modificaci\u00f3n de cadena. Las operaciones de REEMPLAZO en subentradas de esquema no est\u00e1n permitidas. Operaci\u00f3n de modificaci\u00f3n indefinida. array\: Error al obtener BC Certificate factory para algoritmo Formato de certificado incorrecto. Error al obtener la f\u00e1brica de claves para el algoritmo Formato de clave privada incorrecta. Mal formato de clave p\u00fablica. No se puede generar el par de claves para TLS No se puede generar un certificado autofirmado. no encontrado en DIT. no es apoyado. nodo no puede ser objeto nulo Clases no pueden ser nulas Objeto de atributo Las clases deben ser de id 'objeto Clase'\: tipo de aserci\u00f3n no reconocido para refinamiento nodo Refinamiento nodo de hoja atributo fue objeto Las clases argumento no puede ser objeto nulo Clases atributo debe ser ID 'objeto Clase' A subinserci\u00f3n debe tener un objeto \u00a1El atributo de Clase no contiene un atributo de Funci\u00f3n administrativa\! Se requiere un atributo de rol administrativo en el punto administrativo para agregar una subinserci\u00f3n subordinada. Error al analizar el sub\u00e1rbol La especificaci\u00f3n de No permitir\u00e1 la operaci\u00f3n de cambio de nombre en las entradas con descendientes administrativas. Valor incorrecto para el OID El registro de cambios debe habilitarse para volver a las revisiones de registro anteriores. Debe haber al menos una etiqueta para volver a la \u00faltima etiqueta. no se puede cambiar el nombre de la ra\u00edz. La operaci\u00f3n inv\u00e1lida de DSE en la revisi\u00f3n del nombre debe ser menor que la revisi\u00f3n actual. No se puede crear una entrada bajo referencia cuando la REFERENCIA del contexto est\u00e1 configurada como 'ignorar'. El servicio del directorio no se inicia. Carga de esquema fallida No se puede ejecutar la b\u00fasqueda indirecta si no es la siguiente operaci\u00f3n. El m\u00e9todo de referencia de proyecci\u00f3n no se implementa para una operaci\u00f3n de vinculaci\u00f3n. El m\u00e9todo de derivaci\u00f3n de referencia no se implementa para una operaci\u00f3n de vinculaci\u00f3n\: el m\u00e9todo ignoreReferral no se implementa para una operaci\u00f3n de vinculaci\u00f3n. El m\u00e9todo omite referencia no se implementa para una operaci\u00f3n de vinculaci\u00f3n. contexto de operaci\u00f3n a cualquier cosa que no sea el DN vac\u00edo. El nuevo Superior no debe ser nulo. El nuevo superior no puede ser nulo para representar una operaci\u00f3n de movimiento y cambio de nombre. nuevo no debe ser nulo para un cambio de nombre Error al inicializar la cadena del interceptor. Interceptor no encontrado Nombre del interceptor desconocido\: Otro interceptor usa el nombre Excepci\u00f3n inesperada. para la nueva entidad de esquema no es \u00fanico. para la nueva entidad de esquema no existe. El dn padre de un tipo de atributo debe tener como m\u00e1ximo 3 componentes de nombre de longitud. deber\u00eda ser una Unidad organizacional. deber\u00eda tener un nombre relativo de out ya que este esquema ya contiene este elemento ya que este esquema no se carga ya que este esquema no contiene este elemento en los registros, los registros resultantes ser\u00edan inconsistentes de los registros, los registros resultantes ser\u00edan inconsistentes\: como el \u00faltimo tiene descendientes AttributeT ypes No se puede mover un objeto de esquema desde un esquema no cargado No se puede mover un objeto de esquema a un esquema no cargado en los registros, los registros resultantes ser\u00edan inconsistentes ya que no existe en ning\u00fan esquema en los registros, el los registros resultantes ser\u00edan inconsistentes, no pueden cambiar su OID hasta que se hayan eliminado todas las Reglas coincidentes que usan ese comparador. no se puede mover a otro esquema hasta que se hayan eliminado todas las Reglas coincidentes que usan ese comparador. para el nuevo comparador de esquemas no es \u00fanico. El dn padre de un comparador debe tener como m\u00e1ximo 3 componentes de nombre de longitud. La entrada principal de un comparador debe ser una Unidad organizacional. La entrada principal de un comparador debe tener un nombre relativo de ou en los registros, los registros resultantes ser\u00edan inconsistentes. El dn padre de una Regla coincidente debe tener como m\u00e1ximo 3 componentes de nombre de longitud. La entrada principal de una Regla coincidente debe ser una Unidad organizativa. La entrada principal de una sintaxis deber\u00eda tener un nombre relativo en los registros, los registros resultantes ser\u00edan inconsistentes en los registros, tenemos algunos errores\: como hay algunos objetos de esquema dependientes, no puede haber cambiado su OID hasta que todas las reglas coincidan con ese normalizador ha sido eliminado. no se puede mover a otro esquema hasta que todas las Reglas coincidentes que usan ese normalizador hayan sido eliminadas. para el nuevo esquema normalizador no es \u00fanico. El dn padre de un normalizador debe tener como m\u00e1ximo 3 componentes de nombre de longitud. La entrada principal de un normalizador debe ser una Unidad organizacional. La entrada principal de un normalizador debe tener un nombre relativo de salida en los registros, los registros resultantes ser\u00edan inconsistentes\: de los registros, los registros resultantes ser\u00edan consistentes, ya que el \u00faltimo tiene clases de objetos descendientes. La entrada principal de un objeto Clase deber\u00eda ser una Unidad organizacional. La entrada principal de un attributeType debe tener un nombre relativo out. Solo se pueden eliminar contenedores de entidad de esquema de objeto. Unidad organizativa de clase con 3 componentes de nombre de longitud. Solo se pueden eliminar contenedores de entidades de la Unidad organizativas con uno de los siguientes nombres. El dn principal de un esquema debe ser No se puede eliminar el esquema que tiene dependientes\: No se puede permitir cambiar el nombre con rdn. El conjunto de atributos Desplazarse por esquemas no est\u00e1 permitido. Tipo de operaci\u00f3n de modificaci\u00f3n desconocida\: no deseado para realizar operaciones en el esquema con dependencias faltantes en los registros, los registros resultantes ser\u00edan inconsistentes, ya que no existe en ning\u00fan esquema; no puede haber cambiado su OID hasta que se hayan eliminado todas las sintaxis que usan ese verificador de sintaxis. para la nueva sintaxis de esquema Checker no es \u00fanico. no puede tener su OID cambiado hasta que se hayan eliminado todas las sintaxis que usan ese verificador de sintaxis. no se puede mover a otro esquema hasta que se haya eliminado toda la sintaxis con ese verificador de sintaxis. La entrada principal de un verificador de sintaxis debe tener como m\u00e1ximo 3 componentes de nombre de longitud. La entrada principal de un verificador de sintaxis debe ser una unidad organizativa. en los registros, los registros resultantes ser\u00edan inconsistentes en los registros, los registros resultantes ser\u00edan inconsistentes, no se pueden eliminar hasta que todas las entidades que usan esta sintaxis tambi\u00e9n hayan sido eliminadas. Existen los siguientes dependientes. El padre dn de una sintaxis debe tener como m\u00e1ximo 3 componentes de nombre de longitud. La entrada principal de una sintaxis debe ser una Unidad organizativa. Lo siguiente no concuerda con la sintaxis Sintaxis de la descripci\u00f3n del verificador Lo siguiente no concuerda con el normalizador Descripci\u00f3n sintaxis Lo siguiente no concuerda con el comparador Descripci\u00f3n sintaxis Lo siguiente no concuerda con el atributo Tipo Descripci\u00f3n sintaxis No se puede agregar un atributo Tipo con un supertipo no v\u00e1lido\: no puede permitir la adici\u00f3n de un atributo tipo con una sintaxis no v\u00e1lida no permite la adici\u00f3n de un atributo tipo con una coincidencia de IGUALDAD no v\u00e1lida regla no puede permitir la adici\u00f3n de un tipo de atributo con una regla de coincidencia de ORDENAMIENTO no v\u00e1lida no puede permitir la adici\u00f3n de un atributo Tipo con un SUBSTRINGS no v\u00e1lido Regla de coincidencia No puede permitir la adici\u00f3n de un atributo Tipo con una coincidencia de IGUALDAD no Regla No puede permitir la adici\u00f3n de un tipo de atributo con el que no se puede resolver una regla de coincidencia de IGUALDAD de su s\u00faper tipo. No se puede permitir la adici\u00f3n de un atributo Tipo sin sintaxis Lo siguiente no concuerda con el objeto Clase Descripci\u00f3n sintaxis No se puede permitir la adici\u00f3n de un objeto Clase con un objeto superior no v\u00e1lido Clase No se puede permitir la adici\u00f3n de un objeto Clase con un atributo no v\u00e1lido Escriba en the may List No se puede permitir la adici\u00f3n de un objeto Class con un attributeType no v\u00e1lido en la lista must Lo siguiente no concuerda con la coincidencia Uso de la regla Descripci\u00f3n sintaxis Lo siguiente no se ajusta a la sintaxis de descripci\u00f3n de sintaxis ldap No se puede permitir la adici\u00f3n de una sintaxis sin la creaci\u00f3n previa de un Lo siguiente no se ajusta a la sintaxis de Descripci\u00f3n de regla coincidente No puede crear una Regla coincidente que depende de la sintaxis no existente Lo siguiente no concuerda con la sintaxis de descripci\u00f3n de regla de estructura dit Lo siguiente no se conforma con la descripci\u00f3n de la regla de contenido dit sintaxis Lo siguiente no se ajusta al nombre Formulario Descripci\u00f3n Sintaxis No permitido para configurar el wrapp Partici\u00f3n ed despu\u00e9s de la inicializaci\u00f3n. Obtuve m\u00e1s de una Regla coincidente para OID de Obtuve m\u00e1s de un atributo Tipo para OID de Tengo m\u00e1s de una sintaxis para OID de Tengo m\u00e1s de una sintaxis Corrector por OID de\: Atributo de RDN por segundo No obtienes m\u00e1s de un resultado para la entidad nombre \u00a1Los nombres utilizados para los directores deben estar normalizados\! Contexto JNDI desconocido. El valor de REFERENCIA de\: mala serializaci\u00f3n, \u00e1rbol nulo o matriz de datos vac\u00eda no es v\u00e1lida. Formato de datos serializado de matriz incorrecta\: \u00c1rbol incorrecto. Formato de datos serializado de Avl Tree. Este \u00c1rbol de Avl \u00fanico no admite cambios ya que el comportamiento de las alteraciones en un singleton no est\u00e1 definido. No se pudo encontrar la clase. Este cursor bloquea la tecla, por lo que no se permiten los avances de teclado. singleton no debe estar ordenado en nulo. Set no debe ser nulo. No puede solicitar singleton cuando est\u00e1 en modo de conjunto ordenado. No se puede configurar un singleton cuando se usan m\u00faltiples valores Ya en modo singleton. No se puede ordenar el conjunto en modo singleton. No se puede configurar un conjunto ordenado cuando est\u00e1 en modo singleton Ya en el modo de conjunto ordenado. No se puede usar la serializaci\u00f3n est\u00e1ndar para un atributo de servidor No se puede utilizar la serializaci\u00f3n est\u00e1ndar para una entrada de servidor\: tipo de modificaci\u00f3n indefinido No se puede determinar el ID de atributo si ambos argumentos son nulos. \u00a1No se pueden unir los atributos con diferentes ID\! no existe en el esquema Excepci\u00f3n de denominaci\u00f3n encontrada en la enumeraci\u00f3n subyacente. No es un valor v\u00e1lido Cadena esperada para normalizar Byte esperado no puede mover el DSE ra\u00edz Valor de tipo de cambio no identificado No puede encontrar el servicio de directorio en el entorno No se puede convertir Deserializaci\u00f3n de\: Deserializaci\u00f3n de objeto falla de cierre de secuencia Serializaci\u00f3n de serializaci\u00f3n de objeto falla de cierre Don ' t saber c\u00f3mo interpretar\: pero no pudo encontrarlo en env pero se estableci\u00f3 en null en env no puede ser nulo. no puede especificar autenticaci\u00f3n simple con el suministro de credenciales; no contiene el atributo obligatorio 'cn' para la clase de objetos del contenedor Java. no puede eliminar la ra\u00edz DSE. No sabe c\u00f3mo almacenar la referencia. \u00a1Todav\u00eda no s\u00e9 c\u00f3mo almacenar referencias\! No se puede encontrar una forma de enlazar\: usar f\u00e1bricas de objetos dentro del entorno del contexto. no es un antepasado de esta entrada Ambos obj y attrs args son nulos. Al menos uno de estos par\u00e1metros no debe ser nulo. La excepci\u00f3n de parse encontrada al analizar el filtro no pudo analizar el filtro. La partici\u00f3n de configuraci\u00f3n no puede ser nula. La partici\u00f3n de configuraci\u00f3n no se inicializ\u00f3. La partici\u00f3n del sistema no existe a\u00fan para implementarse. Orden de interceptor no v\u00e1lido. No se puede sobrescribir; el directorio de salida de configuraci\u00f3n ya no existe. no estar golpeando la ra\u00edz sin el patr\u00f3n config / config. padre no puede ser nulo Error al autenticar usuario Error durante flujo bajo Clave no encontrada B P\u00e1gina no ordenada Clave de subdirecci\u00f3n infantil no v\u00e1lida Argumento 'recman' es nulo Argumento 'comparador' es nulo Argumento 'comparador' debe ser serializable\: Argumento 'pageSize' debe ser par\: Argumento 'clave' es nulo Argumento 'valor' es nulo Argumento 'obj1' es nulo Argumento 'obj2' es nulo La plataforma no admite codificaci\u00f3n UTF8 La memoria cach\u00e9 MRU debe contener al menos una entrada No puede agregar escucha nula. La memoria cach\u00e9 interna no puede ser nula. la clave no puede ser nula. El valor no puede ser nulo. No se puede crear un cubo con profundidad> MAX_DEPTH + 1. Profundidad No se puede crear un directorio m\u00e1s profundo. Argumento de profundidad 'recid' no es v\u00e1lido El directorio de nombre debe existir Record Manager se ha cerrado\: falso ID de bloque BlockId asignado para transacci\u00f3n bloque cuenta de transacci\u00f3n en bloque Argumento 'cache' es nulo\: Data Page.set Primero\: archivo header magic no OK\: couldn ' t obtener la magia de encabezado de la p\u00e1gina de traducci\u00f3n gratuita para el bloque\: la magia del encabezado de p\u00e1gina no est\u00e1 bien asignar la p\u00e1gina libre? libre de p\u00e1gina gratis? p\u00e1gina de encabezado gratis? Cach\u00e9 de referencia suave no implementada Cach\u00e9 de referencia d\u00e9bil no implementada Doble obtenci\u00f3n del tipo de cach\u00e9 no v\u00e1lido para bloquear bloqueado incorrecto en la lista de uso no est\u00e1 vac\u00eda en el momento de la confirmaci\u00f3n en la lista de uso no est\u00e1 vac\u00eda en el tiempo de restituci\u00f3n en txn lista no est\u00e1 vac\u00eda en el tiempo de restituci\u00f3n tiempo de cierre inUse bloques en tiempo de cierre Compensaci\u00f3n demasiado grande para el encabezado de registro Argumento 'maxTxns' debe ser mayor que 0. No se puede cambiar la configuraci\u00f3n mientras las transacciones est\u00e1n pendientes en el registro Mal m\u00e1gico en el archivo de registro Excepci\u00f3n no aceptada Proveedor de administrador de registro no v\u00e1lido B Redireccionamiento de \u00e1rbol B objeto No es un objeto serializado B Tree Redirect esto no es una matriz Tree container this no es ab tree Redirect container Este cursor solo se puede usar con tablas que tengan duplicadas claves habilitadas. Los avances basados \u200b\u200ben el valor no son compatibles. No hay ninguna regla de igualdad de coincidencia disponible para el atributo\: la propiedad de un \u00edndice no se puede establecer despu\u00e9s de que se haya inicializado. No se puede establecer la propiedad de la tienda Los errores encontrados en la destrucci\u00f3n cuando se desreferencia no nombrar\u00edan un objeto conocido. El comparador de clave de nombre de objeto alias no puede ser nulo. El comparador de valores no debe ser nulo para tablas con claves duplicadas. Lamentablemente, esta tabla sin duplicados habilitados no contiene un comparador de valores que se necesita para responder a su pregunta de pedido. null para clave o valor no es v\u00e1lido Este cursor no admite claves duplicadas. Encoder no disponible para Error al codificador de instancia para Decodificador no disponible para Error al acceder al decodificador para Error al decodificador de instancia para AS-REQ PA-ENC-TIME SELECCIONAR padata times times, cifrado con la clave del cliente AS-REP Ticket y TGS-REP Ticket (incluye clave de sesi\u00f3n TGS o clave de sesi\u00f3n de la aplicaci\u00f3n) cifrada con la clave de servicio\: parte cifrada AS-REP (incluye clave de sesi\u00f3n TGS o clave de sesi\u00f3n de la aplicaci\u00f3n) cifrada con la clave de cliente TGS-REQ KDC-REQ-BODY Datos de autorizaci\u00f3n, cifrados con la clave de sesi\u00f3n TGS TGS-REQ KDC-REQ-BODY Datos de autorizaci\u00f3n, cifrados con la subclave TGS-REQ del autenticador TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator cksum, codificados con la clave de sesi\u00f3n TGS TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator (incluye la subclave de autentificaci\u00f3n TGS) cifrada con la clave de sesi\u00f3n TGS TGS-REP encrypted part (incluye la clave de sesi\u00f3n de la aplicaci\u00f3n) cifrada con la clave de sesi\u00f3n TGS\: parte cifrada de TGS-REP (incluye la clave de sesi\u00f3n de la aplicaci\u00f3n) cifrada con el autenticador TGS subke y AP-REQ Authenticator cksum, tecleado con la clave de sesi\u00f3n de la aplicaci\u00f3n\: AP-REQ Authenticator (incluye la subclave del autenticador de la aplicaci\u00f3n) cifrado con la clave de sesi\u00f3n de la aplicaci\u00f3n AP-REP encrypted part (incluye la subclave de la sesi\u00f3n de la aplicaci\u00f3n) cifrado con la clave de sesi\u00f3n de la aplicaci\u00f3n KRB -La parte cifrada de PRV, cifrada con una clave elegida por la aplicaci\u00f3n no es un tipo de cifrado admitido. La devoluci\u00f3n de llamada no se admite El archivo es demasiado grande No se pudo leer completamente el archivo No se puede codificar el objeto de entrada de datos de autorizaci\u00f3n, el tama\u00f1o de la PDU es la cuenta Kerberos clave atributo Error al obtener el contexto del cat\u00e1logo Error al obtener el contexto inicial\: la clave Kerberos no debe ser una cadena. No se puede obtener una sesi\u00f3n. Un nombre vac\u00edo no es v\u00e1lido en un nombre de kerberos. A '/' al final de un nombre de Kerberos no es v\u00e1lido. No se pudo conectar al servidor El directorio de configuraci\u00f3n especificado La entrada de contexto esperada no existe\: la entrada ya existe Tama\u00f1o m\u00e1ximo del objeto Sin codificaci\u00f3n ASCII No se puede establecer el valor de la opci\u00f3n No se puede analizar la representaci\u00f3n de la cadena\: direcci\u00f3n ilegal\: no es un descendiente de Dhcp Opci\u00f3n No se pueden inicializar las clases de campo de opci\u00f3n\: Longitud m\u00e1x. De datos Codificaci\u00f3n ASCII no disponible\: Tipo de registro para objec tLa asignaci\u00f3n de clase no se ha establecido. Registro de recursos requiere objeto ESTRUCTURAL Clase\: Base de b\u00fasqueda inv\u00e1lida\: No se puede obtener contexto en Valor de enum inv\u00e1lido Sistema Sam Sub no habilitado con verificador de integridad clave Entrada nulo Tipo SAM No se pudo encontrar la propiedad Esperando entradas con tipo SAM No se pudo encontrar la clase verificador No constructor predeterminado p\u00fablico en la clase Error en la invocaci\u00f3n de constructor predeterminada para el \u00edndice de columna de clase m\u00e1xima no se encuentra en la base de b\u00fasqueda DN No se puede recibir el mensaje NTLM antes de enviar el desaf\u00edo de Tipo 2. No se puede recibir el mensaje NTLM despu\u00e9s de que se haya recibido el Tipo 3. La respuesta al desaf\u00edo de Sasl ya se complet\u00f3. No se puede enviar un desaf\u00edo de tipo 2 antes de la respuesta de tipo 1. No se puede enviar el Tipo 2 despu\u00e9s de que ya se haya enviado. la respuesta fue nula con cero bytes Hubo una falla durante el manejo de mensajes NTLM de tipo 1. Hubo un error durante el manejo de mensajes NTLM Tipo 3. Se intent\u00f3 la autenticaci\u00f3n, pero las credenciales no fueron v\u00e1lidas. respuesta sin auhcid o sin contrase\u00f1a Los caracteres '0' no est\u00e1n permitidos en authcid o sin contrase\u00f1a. La respuesta inicial dada es incorrecta\: no se puede autenticar un DN de autenticaci\u00f3n inv\u00e1lido. No se puede autenticar al usuario\: autorizaci\u00f3n fallida en el controlador de devoluci\u00f3n de llamada. Fallo en la carga del almac\u00e9n de claves, lo que en realidad nunca deber\u00eda suceder.\: Fallo para crear Key Manager Factory Error al inicializar Key Manager Factory Error al crear el contexto SSL Error al inicializar SSLContext Fall\u00f3 la creaci\u00f3n de un contexto SSL. Aunque las solicitudes ampliadas son solicitudes de respuesta \u00fanica, no se manejan con esta clase base. No tienen entrada de destino a diferencia del resto de las Solicitudes de respuesta \u00fanica\: Tipo de respuesta de solicitud de respuesta \u00fanica no identificada Alcance de base inesperado. TimeUnit no soportado Tipo de protocolo no admitido No se pudo agregar la operaci\u00f3n extendida de tipo Error al agregar el mecanismo SASL con el nombre Error al agregar proveedor NTLM ID vac\u00edo Identificador de r\u00e9plica inv\u00e1lido No se pudo encontrar el siguiente directorio de esquema del dise\u00f1o de instalaci\u00f3n Desconocido Esquema Tipo de objeto Podr\u00eda no encontrar la entrada en Can not delete entry no en el rango de valores Bind solo solicita el t\u00fanel en las particiones si no hay autenticadores para manejar el mecanismo\: \u00a1Este cursor est\u00e1 vac\u00edo y no puede devolver elementos\! No se puede buscar de manera eficiente el DIB sin un \u00edndice en el atributo\: No se puede acceder al elemento si se lo coloc\u00f3 antes. No se puede acceder al elemento si est\u00e1 posicionado despu\u00e9s del \u00faltimo. Y los cursores no est\u00e1n ordenados y no admiten el posicionamiento por elemento. El cursor no se ha posicionado todav\u00eda. No se pudo encontrar la regla coincidente para utilizar para la evaluaci\u00f3n del nodo de igualdad Nodo hoja no reconocido Tipo de nodo de rama no reconocido\: valor de alcance de b\u00fasqueda no reconocido para el nodo de \u00e1mbito de filtro Los cursores de igualdad solo admiten el posicionamiento por elemento cuando existe un \u00edndice de usuario en el atributo afirmado. No se pudo encontrar la regla coincidente para utilizar para la evaluaci\u00f3n del nodo de mayor ecuaci\u00f3n. Los cursores de ecualizaci\u00f3n menor solo admiten el posicionamiento por elemento cuando existe un \u00edndice de usuario en el atributo afirmado. Regla ching para usar para la evaluaci\u00f3n de EQ Menos Eq. No Los cursores no est\u00e1n ordenados y no admiten el posicionamiento por elemento. Los cursores de \u00e1mbito no est\u00e1n ordenados y no admiten el posicionamiento por elemento. El nodo de alcance no tiene un alcance de un nivel. Esto es demasiado ineficiente sin obtener Id en Server Entry o los cursores no est\u00e1n ordenados y no admiten el posicionamiento por elemento. Debe tener 2 o m\u00e1s cursores de supresi\u00f3n para un cruce de uni\u00f3n Los cursores de presencia no admiten el posicionamiento por elemento sin un \u00edndice de usuario en el atributo de presencia. Los cursores de subcadena no se pueden pedir y no admiten el posicionamiento por elemento. No se puede eliminar el archivo. El nodo de alcance no tiene alcance de sub\u00e1rbol. Solo puede haber 2 columnas en el \u00edndice 0 y en 1 No estableci\u00f3 correctamente los nombres de los cols. Modo no reconocido. Comando de di\u00e1logo de filtro no reconocido No se puede procesar una solicitud mientras el enlace Principal no es v\u00e1lido Nombre No se puede codificar el objeto de error de Krb, el tama\u00f1o de la PDU es No se puede codificar el objeto de Krb Safe Body, el tama\u00f1o de la PDU es\: No se puede codificar el objeto KrbSafe No se puede codificar el objeto Enc Krb Priv Part, el tama\u00f1o de la PDU es No se puede codificar el objeto Krb Priv, el tama\u00f1o de la PDU es No se puede codificar el objeto Krb Cred Info, el tama\u00f1o de la PDU es No se puede codificar el objeto Enc Krb Cred Part codificar el objeto Krb Cred, el tama\u00f1o de la PDU es No se puede codificar el objeto Enc Ticket Part, el tama\u00f1o de la PDU es No se puede codificar el objeto Typed Data, el tama\u00f1o de la PDU es La longitud de la PDU es nula, no est\u00e1 permitido no es una cadena Kerberos v\u00e1lida un n\u00famero de archivo de registro v\u00e1lido No es un desplazamiento de archivo de registro v\u00e1lido Tama\u00f1o de b\u00fafer de archivo de registro no v\u00e1lido Tama\u00f1o / tama\u00f1o m\u00e1ximo es b\u00fafer sepcificado Tama\u00f1o Log Scanner ya est\u00e1 cerrado\: el contenido del registro no es v\u00e1lido
#
#TODO: add other error messages from other LDAP implementations such as the following list (from http://en.wikipedia.org/wiki/List_of_LDAP_software)
# Note: removed references to the ones handled above
#
# Apple Open Directory
# FreeIPA
# IBM Tivoli Directory Server
# Mandriva Directory Server
# Novell eDirectory
# OpenDJ - A fork of the OpenDS project
# OpenDS
# Virtual Identity Server from Optimal IdM
# Oracle Internet Directory
# Radiant Logic VDS
# Sun Java System Directory Server
# UnboundID Directory Server[1]
# Univention Corporate Server (with OpenLDAP from Univention)
# DirX Directory from Atos (ex-Siemens)  

ascanalpha.proxydisclosure.name=Disvulgaci\u00f3n Proxy
ascanalpha.proxydisclosure.desc={0} servidor(es) proxy fueron detectados o identificados sus huellas digitales. Esta informaci\u00f3n ayuda a determinar potenciales ataques contra la aplicaci\u00f3n. \n- Una lista de objetivos para un ataque en contra de la aplicaci\u00f3n.\n- Posibles vulnerabilidades en los servidores proxy que sirven a la aplicaci\u00f3n.\n- La presencia o ausencia de cualquier componente basado en proxy que podr\u00edan ocasionar ataques contra la aplicaci\u00f3n a ser detectado, prevenido o mitigado. 
ascanalpha.proxydisclosure.soln=Desactivar el m\u00e9todo de 'TRACE' en los servidores proxy, as\u00ed como el servidor de web/aplicaci\u00f3n de origen. Desactivar el m\u00e9todo de 'OPTIONS' en los servidores proxy, as\u00ed como el servidor de web/aplicaci\u00f3n de origen, si no es necesario para otros fines, tales como 'CORS' (Cross Origin Resource Sharing). \nConfigurar los servidores web y de aplicaciones con p\u00e1ginas de error personalizadas, para evitar que las p\u00e1ginas de error espec\u00edfico de productos 'fingerprintable' siendo filtrados al usuario en caso de errores HTTP, tales como peticiones 'TRACK' de p\u00e1ginas inexistentes.\nConfigurar todos los proxies, servidores de aplicaciones y servidores web para impedir la divulgaci\u00f3n de la informaci\u00f3n tecnologica en el 'Server' y cabeceras de respuesta HTTP 'X-Powered-By'.\n
ascanalpha.proxydisclosure.refs=???
ascanalpha.proxydisclosure.attack=TRACE, m\u00e9todos de OPTIONS con cabeceras 'Max-Forwards'. M\u00e9todo TRACK.
ascanalpha.proxydisclosure.extrainfo.unknown=Desconocido
ascanalpha.proxydisclosure.extrainfo.proxyserver.header=Utilizando los m\u00e9todos TRACE, OPTIONS y TRACK, se han identificado los siguientes servidores proxy entre OWASP ZAP y el servidor de aplicaci\u00f3n/web\: 
ascanalpha.proxydisclosure.extrainfo.proxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.webserver.header=Se ha identificado el siguiente servidor web/aplicaci\u00f3n\: 
ascanalpha.proxydisclosure.extrainfo.webserver=- {0}
ascanalpha.proxydisclosure.extrainfo.silentproxyserver.header=Se identificaron los siguientes servidores proxy 'silent' (silenciosos). Debido a su comportamiento, no se sabe en que punto en la topolog\u00eda de red residen estos servidores proxy\:
ascanalpha.proxydisclosure.extrainfo.silentproxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.traceenabled=El m\u00e9todo 'TRACE' est\u00e1 activado en uno o m\u00e1s de los servidores proxy, o en el servidor de origen. Este m\u00e9todo filtra toda la informaci\u00f3n enviada desde el navegador web y proxies al usuario agente. Esto puede facilitar ataques 'Cross Site Tracing'. 

ascanalpha.relativepathconfusion.name=Confusi\u00f3n de Ruta Relativa de acceso
ascanalpha.relativepathconfusion.desc=El servidor web est\u00e1 configurado para servir a las respuestas a las URLs ambiguas de manera que es probable que conduzca a confusi\u00f3n sobre la "relative path" (ruta relativa) correcta para la URL. Los recursos (CSS, im\u00e1genes, etc) tambi\u00e9n est\u00e1n especificados en la respuesta de la p\u00e1gina usando URL relativas, en lugar de las direcciones URL absolutas. En un ataque, si el navegador web analiza la respuesta de "cross-content" de manera permisiva, o puede ser enga\u00f1ado para permisivamente analizar la respuesta de "cross-content", utilizando t\u00e9cnicas como framing, entonces el navegador web puede ser enga\u00f1ado al interpretar HTML como CSS (u otros tipos de contenido), llevando a una vulnerabilidad XSS.
ascanalpha.relativepathconfusion.soln=Los servidores web y los frameworks deben actualizarse para ser configurado para no servir a las respuestas de URLs ambiguas de tal manera que la ruta relativa de tales direcciones URL podr\u00eda ser mal-interpretadas por componentes ya sea en el lado del cliente o del lado del servidor.\nDentro de la aplicaci\u00f3n, el uso correcto del tag HTML "<base>" en la respuesta HTTP sin ambig\u00fcedades especificar\u00e1 la URL base para todas las URLs relativas en el documento.\nUtilice en la cabecera de respuesta HTTP "Content-Type" para hacer m\u00e1s dif\u00edcil para el atacante para forzar el navegador web para mal interpretar el tipo de contenido de la respuesta.\nUtilice en la cabecera de respuesta HTTP la opci\u00f3n "X-Content-Type-Opciones\: NOSNIFF" para prevenir desde que el navegador web "sniffing" al tipo de contenido de respuesta.\nUse un DOCTYPE moderna como "<\!doctype html>" para prevenir que la p\u00e1gina sea mostrada en el navegador web utilizando "Quirks Mode", ya que resulta en el tipo de contenido que est\u00e1 siendo ignorado por el navegador web.\nEspecifique la cabecera de respuesta HTTP "X-Frame-Options" para prevenir Quirks Mode de ser habilitado en el navegador web utilizando ataques framing. 
ascanalpha.relativepathconfusion.refs=http\://www.thespanner.co.uk/2014/03/21/rpo/\nhttps\://hsivonen.fi/doctype/\nhttp\://www.w3schools.com/tags/tag_base.asp
ascanalpha.relativepathconfusion.extrainfo.morethanonebasetag=M\u00e1s de una etiqueta <base> fue especificada en la etiqueta HTML <head> para definir la ubicaci\u00f3n de las direcciones URL relativas, que no es v\u00e1lida.
ascanalpha.relativepathconfusion.extrainfo.nobasetag=Ninguna etiqueta <base> fue especificada en la etiqueta HTML <head> para definir la ubicaci\u00f3n de las direcciones URL relativas.
ascanalpha.relativepathconfusion.extrainfo.contenttypeenabled=Fue especificado un Content Type de "{0}". Si el navegador web esta utilizando reglas estrictas de an\u00e1lisis, esto evitar\u00e1 los ataques de cross-content tengan \u00e9xito. El Quirks Mode en el navegadorweb podr\u00eda desactivar an\u00e1lisis estricto.  
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly=El Quirks Mode esta habilitado de forma expl\u00edcita a trav\u00e9s de < meta http-equiv\="{0}", permitiendo que el Content Type especificado pase por alto.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly=El Quirks Mode est\u00e1 habilitada de forma impl\u00edcita a trav\u00e9s del uso de un antigua versi\u00f3n DOCTYPE con PUBLIC id "{0}", permitiendo que el Content Type especificado se omita en algunos navegadores web.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype=El Quirks Mode est\u00e1 habilitada de forma impl\u00edcita a trav\u00e9s de la ausencia de un DOCTYPE, permitiendo que el Content Type especificado se pasa por alto.
ascanalpha.relativepathconfusion.extrainfo.nocontenttype=Se ha especificado ning\u00fan Content Type, por lo que el Quirks Mode no est\u00e1 obligado a explotar la vulnerabilidad en el navegador web. 
ascanalpha.relativepathconfusion.extrainfo.framingallowed=No se especific\u00f3 ninguna cabecera X-Frame-Options, as\u00ed que la p\u00e1gina puede ser enmarcada, y esto puede utilizarse para activar el Quirks Mode, permitiendo que el Content Type especificado pase por alto.

ascanalpha.sourcecodedisclosure.desc=El c\u00f3digo fuente de la p\u00e1gina actual se dio a conocer por el servidor web
ascanalpha.sourcecodedisclosure.lfibased.name=Divulgaci\u00f3n de C\u00f3digo Fuente - Inclusi\u00f3n de archivos
ascanalpha.sourcecodedisclosure.lfibased.soln=Asegurar que los archivos arbitrarios especificados por el usuario no se incluyen en la salida
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=La salida para el nombre del archivo de c\u00f3digo fuente [{0}] se diferencia suficientemente de la del par\u00e1metro aleatorio [{1}], a [{2}%], en comparaci\u00f3n con un umbral de [{3}%]
ascanalpha.sourcecodedisclosure.lfibased.evidence=[cadena vac\u00eda]

ascanalpha.sourcecodedisclosure.gitbased.name=Divulgaci\u00f3n de C\u00f3digo Fuente - Git
ascanalpha.sourcecodedisclosure.gitbased.soln=Aseg\u00farese de que los archivos de metadatos Git no se implementan en el servidor web o servidor de aplicaciones
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=[cadena vac\u00eda]
ascanalpha.sourcecodedisclosure.gitbased.evidence=El c\u00f3digo fuente de [{0}] fue extra\u00eddo usando [{1}]

ascanalpha.sqlinjection.mssql.name=Inyecci\u00f3n SQL - MsSQL
ascanalpha.sqlinjection.mssql.desc=Falla por Inyecci\u00f3n SQL puede ser posible
ascanalpha.sqlinjection.mssql.soln=No conf\u00ede en los valores de entrada del lado del cliente, incluso si en el lado del cliente se realice una validaci\u00f3n.\nEn general, comprobar todos los datos de entrado en el servidor.\nSi la aplicaci\u00f3n usa JDBC, usar PreparedStatement o CallableStatement, con par\u00e1metros pasados por '?'\nSi la aplicaci\u00f3n utiliza ASP, utilice Command Objects ADO  con un fuerte tipo de verificaci\u00f3n y consultas parametrizadas.\nSi la Base de Datos puede usar Stored Procedures (Procedimientos Almacenados), \u00faselos.\n\u00a1NO concatenar cadenas en los query (consultas) en el procedimientos almacenados,  o utilizar 'exec', 'exec immediate', o su funcionalidad equivalente\!\nNo crear consultas SQL din\u00e1micas  usando una sencilla concatenaci\u00f3n de cadenas.\nAplique aun lista blanca (allow list) de caracteres permitidos, o una lista negra (deny list) de caracteres no permitidos en la entrada (input) del usuario.\nAplique el privilegio m\u00ednimo posible al usuario de la base de datos de los privilegios usados.\nEn particular evitar el uso de los usuarios de base de datos 'sa' o 'db-owner'. Esto no elimina la inyecci\u00f3n SQL, pero minimiza su impacto.\nConceder el m\u00ednimo acceso de base de datos que es necesario para la aplicaci\u00f3n.
ascanalpha.sqlinjection.mssql.refs=https\://www.OWASP.org/index.php/Top_10_2010-a1 https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.mssql.alert.timebased.extrainfo=El tiempo de consulta es controlable usando el valor del par\u00e1metro [{0}], el cual caus\u00f3 que la solicitud tomara [{1}] milisegundos, cuando la consulta original sin modificaciones con valor [{2}] tom\u00f3 [{3}] milisegundos.

ascanalpha.sqlinjection.sqlite.name=Inyecci\u00f3n SQL - SQLite
ascanalpha.sqlinjection.desc=Falla por Inyecci\u00f3n SQL puede ser posible
ascanalpha.sqlinjection.soln=No conf\u00ede en los valores de entrada del lado del cliente, incluso si en el lado del cliente se realice una validaci\u00f3n.\nEn general, comprobar todos los datos de entrado en el servidor.\nSi la aplicaci\u00f3n usa JDBC, usar PreparedStatement o CallableStatement, con par\u00e1metros pasados por '?'\nSi la aplicaci\u00f3n utiliza ASP, utilice Command Objects ADO  con un fuerte tipo de verificaci\u00f3n y consultas parametrizadas.\nSi la Base de Datos puede usar Stored Procedures (Procedimientos Almacenados), \u00faselos.\n\u00a1NO concatenar cadenas en los query (consultas) en el procedimientos almacenados,  o utilizar 'exec', 'exec immediate', o su funcionalidad equivalente\!\nNo crear consultas SQL din\u00e1micas  usando una sencilla concatenaci\u00f3n de cadenas.\nAplique aun lista blanca (allow list) de caracteres permitidos, o una lista negra (deny list) de caracteres no permitidos en la entrada (input) del usuario.\nAplique el privilegio m\u00ednimo posible al usuario de la base de datos de los privilegios usados.\nEn particular evitar el uso de los usuarios de base de datos 'sa' o 'db-owner'. Esto no elimina la inyecci\u00f3n SQL, pero minimiza su impacto.\nConceder el m\u00ednimo acceso de base de datos que es necesario para la aplicaci\u00f3n.
ascanalpha.sqlinjection.refs=https\://www.OWASP.org/index.php/Top_10_2010-a1 https\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.sqlite.alert.timebased.extrainfo=El tiempo de consulta es controlable mediante el valor del par\u00e1metro [{0}], que caus\u00f3 la petici\u00f3n de tomar [{1}] milisegundos, el valor del par\u00e1metro [{2}], que caus\u00f3 la petici\u00f3n de tomar [{3}] milisegundos, cuando la consulta original sin modificar con valor [{4}] tom\u00f3 [{5}] milisegundos.
ascanalpha.sqlinjection.sqlite.alert.errorbased.extrainfo=El siguiente mensaje de error SQLite conocido fue provocado\: [{0}].
ascanalpha.sqlinjection.sqlite.alert.versionnumber.extrainfo=Usando una UNION basado en un Ataque de Inyecci\u00f3n SQL, y explotando mecanismo de tipos din\u00e1micos de SQLite, la versi\u00f3n de SQLite fue determinada para ser [{0}]. \nCon los puntos de inyecci\u00f3n basada en cadenas (string), la versi\u00f3n completa SQLite la informaci\u00f3n se puede extraer. \nM\u00e1s informaci\u00f3n sobre la versi\u00f3n de SQLite [{0}] est\u00e1 disponible en http\://www.sqlite.org/changes.html

ascanalpha.testuseragent.name=Agente de usuario Fuzzer
ascanalpha.testuseragent.desc=Revisar por diferencias en respuestas basadas en el agente de usuario fuzzed (ej. sitios m\u00f3viles, acceso como Search Engine Crawler). Comparar el c\u00f3digo de estado de respuesta y el c\u00f3digo hash del cuerpo de la respuestas con la respuesta original.
ascanalpha.testuseragent.refs=xt for Translation\n\nhttps\://www.owasp.org/index.php/Web_Application_Security_Testing_Cheat_Sheet
ascanalpha.testuseragent.useragentparmname=Encabezado Agente de User

ascanalpha.traceaxdscanner.name=Fuga de informaci\u00f3n de Trace.axd
ascanalpha.traceaxdscanner.desc=El ASP.NET Trace Viewer (trace.axd) fue encontrado disponible. Este componente puede perder una cantidad significativa de informaci\u00f3n valiosa.
ascanalpha.traceaxdscanner.otherinfo=Basado en el c\u00f3digo de estado de respuesta Trace Viewer podr\u00eda estar protegido por un mecanismo de autenticaci\u00f3n o autorizaci\u00f3n.  
ascanalpha.traceaxdscanner.refs=https\://msdn.microsoft.com/en-us/library/bb386420.aspx\nhttps\://msdn.microsoft.com/en-us/library/wwh16c6c.aspx\nhttps\://www.dotnetperls.com/trace
ascanalpha.traceaxdscanner.soln=Considerar si Trace Viewer es o no requerido en producci\u00f3n, si no es entonces inhabilitarlo. Si s\u00ed es entonces asegurar el acceso a el requiere autenticaci\u00f3n y autorizaci\u00f3n. 

