ascanalpha.desc = \uc54c\ud30c \uc0c1\ud0dc \ub2a5\ub3d9\uc801 \uc2a4\uce94 \uaddc\uce59

#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack = \ud30c\ub77c\ubbf8\ud130 [{0}]\uc774(\uac00) [{1}]\ub85c \uc124\uc815\ub428
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo = [{1}] [{2}]\uc758 \ud30c\ub77c\ubbf8\ud130 [{0}]\uc740(\ub294) LDAP \uba54\ud0c0 \ubb38\uc790 [{3}]\uc744(\ub97c) \uc0ac\uc6a9\ud55c \uacf5\uaca9\uc5d0 \ucde8\uc57d\ud558\uc5ec, \uc6d0\ub798 \uc751\ub2f5\uc5d0 \uc5c6\uc5c8\ub358 \uc54c\ub824\uc9c4 [{4}] \uc624\ub958 \uba54\uc2dc\uc9c0 [{5}]\ub97c \ubc18\ud658\ud558\uba74\uc11c LDAP \uc778\uc81d\uc158\uc5d0 \ucde8\uc57d\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
ascanalpha.ldapinjection.booleanbased.alert.attack = \ub3d9\ub4f1\ud55c LDAP \ud45c\ud604\uc2dd\: [{0}]. \uc784\uc758\uc758 \ud30c\ub77c\ubbf8\ud130\: [{1}].
ascanalpha.ldapinjection.booleanbased.alert.extrainfo = [{1}] [{2}]\uc758 \ud30c\ub77c\ubbf8\ud130 [{0}]\uc740(\ub294) \ub17c\ub9ac\uc801\uc73c\ub85c \ub3d9\ub4f1\ud55c \ud45c\ud604\uc2dd [{3}]\uacfc ''FALSE'' \ud45c\ud604\uc2dd [{4}]\ub97c \uc0ac\uc6a9\ud558\uc5ec LDAP \uc778\uc81d\uc158\uc5d0 \ucde8\uc57d\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
ascanalpha.ldapinjection.desc = LDAP \uc778\uc81d\uc158\uc774 \uac00\ub2a5\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uacf5\uaca9\uc790\uac00 \uc778\uc99d \uc81c\uc5b4\ub97c \uc6b0\ud68c\ud558\uace0, LDAP \ub514\ub809\ud130\ub9ac \ub0b4\uc758 \uc784\uc758 \ub370\uc774\ud130\ub97c \ubcf4\uace0 \uc218\uc815\ud558\ub294 \uac83\uc774 \uac00\ub2a5\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
ascanalpha.ldapinjection.name = LDAP \uc778\uc81d\uc158
ascanalpha.ldapinjection.refs = https\://owasp.org/www-community/attacks/LDAP_Injection\nhttps\://cheatsheetseries.owasp.org/cheatsheets/LDAP_Injection_Prevention_Cheat_Sheet.html
ascanalpha.ldapinjection.soln = LDAP \ucffc\ub9ac\ub97c \uc0dd\uc131\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\uae30 \uc804\uc5d0 \ubaa8\ub4e0 \uc0ac\uc6a9\uc790 \uc785\ub825\uc744 \uac80\uc99d \ubc0f/\ub610\ub294 \uc774\uc2a4\ucf00\uc774\ud504 \ucc98\ub9ac\ud558\uc2ed\uc2dc\uc624. \ud2b9\ud788 \ub2e4\uc74c \ubb38\uc790(\ub610\ub294 \uc870\ud569)\ub294 \uac70\ubd80 \ubaa9\ub85d\uc5d0 \ud3ec\ud568\ub418\uc5b4\uc57c \ud569\ub2c8\ub2e4\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNULL \ubb38\uc790
ascanalpha.ldapinjection.technologies.protocol = \ud504\ub85c\ud1a0\ucf5c

ascanalpha.name = \ub2a5\ub3d9\uc801 \uc2a4\uce94 \uaddc\uce59 - \uc54c\ud30c

ascanalpha.scripts.desc = \uc54c\ud30c \uc0c1\ud0dc \ub2a5\ub3d9\uc801 \uc2a4\uce94 \uaddc\uce59 \uc2a4\ud06c\ub9bd\ud2b8\ub97c \ucd94\uac00\ud569\ub2c8\ub2e4.
ascanalpha.scripts.name = \ub2a5\ub3d9\uc801 \uc2a4\uce94 \uaddc\uce59 \uc2a4\ud06c\ub9bd\ud2b8 - \uc54c\ud30c
ascanalpha.scripts.suspiciousInputTransformation.desc = \uc774 \uc2a4\ud06c\ub9bd\ud2b8\ub294 \uc6f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \uc758\uc2ec\uc2a4\ub7ec\uc6b4 \uc785\ub825 \ubcc0\ud658\uc744 \uac10\uc9c0\ud569\ub2c8\ub2e4.
ascanalpha.scripts.warn.couldNotAddScripts = \uc54c\ud30c \ub2a5\ub3d9\uc801 \uc2a4\uce94 \uaddc\uce59 \uc2a4\ud06c\ub9bd\ud2b8\ub97c \ucd94\uac00\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4\: {0}.

ascanalpha.sqlinjection.desc = SQL \uc778\uc81d\uc158\uc774 \uac00\ub2a5\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
ascanalpha.sqlinjection.refs = https\://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html
ascanalpha.sqlinjection.soln = \ud074\ub77c\uc774\uc5b8\ud2b8 \uce21 \uc720\ud6a8\uc131 \uac80\uc0ac(validation)\uac00 \uac16\ucdb0\uc838 \uc788\ub354\ub77c\ub3c4, \ud074\ub77c\uc774\uc5b8\ud2b8 \uce21 \uc785\ub825\uc744 \uc2e0\ub8b0\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624.\n\uc77c\ubc18\uc801\uc73c\ub85c, \uc11c\ubc84 \uce21\uc5d0\uc11c \ubaa8\ub4e0 \ub370\uc774\ud130\uc758 \uc720\ud615\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.\n\uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 JDBC\ub97c \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0, PreparedStatement \ub610\ub294 CallableStatement\ub97c \uc0ac\uc6a9\ud558\uace0 \ud30c\ub77c\ubbf8\ud130\ub97c '?'\ub85c \uc804\ub2ec\ud558\uc2ed\uc2dc\uc624.\n\uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 ASP\ub97c \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0, \uac15\ub825\ud55c \uc720\ud615 \uac80\uc0ac \ubc0f \ub9e4\uac1c \ubcc0\uc218\ud654\ub41c \ucffc\ub9ac\ub97c \uc0ac\uc6a9\ud558\ub294 ADO Command Object\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.\n\ub370\uc774\ud130\ubca0\uc774\uc2a4 \uc800\uc7a5 \ud504\ub85c\uc2dc\uc800\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\ub2e4\uba74 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.\n\uc800\uc7a5 \ud504\ub85c\uc2dc\uc800 \ub0b4\uc5d0\uc11c \ucffc\ub9ac\uc5d0 \ubb38\uc790\uc5f4\uc744 \uc5f0\uacb0\ud558\uac70\ub098, 'exec', 'exec immediate' \ub610\ub294 \uc774\uc640 \ub3d9\ub4f1\ud55c \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624\!\n\ub2e8\uc21c \ubb38\uc790\uc5f4 \uc5f0\uacb0\uc744 \uc0ac\uc6a9\ud558\uc5ec \ub3d9\uc801 SQL \ucffc\ub9ac\ub97c \uc0dd\uc131\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624.\n\ud074\ub77c\uc774\uc5b8\ud2b8\ub85c\ubd80\ud130 \uc218\uc2e0\ub41c \ubaa8\ub4e0 \ub370\uc774\ud130\ub97c \uc774\uc2a4\ucf00\uc774\ud504 \ucc98\ub9ac\ud558\uc2ed\uc2dc\uc624.\n\uc0ac\uc6a9\uc790 \uc785\ub825\uc5d0 \ud5c8\uc6a9\ub418\ub294 \ubb38\uc790\uc758 '\ud5c8\uc6a9 \ubaa9\ub85d' \ub610\ub294 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\ub294 \ubb38\uc790\uc758 '\uac70\ubd80 \ubaa9\ub85d'\uc744 \uc801\uc6a9\ud558\uc2ed\uc2dc\uc624.\n\uac00\ub2a5\ud55c \uac00\uc7a5 \ub0ae\uc740 \uad8c\ud55c\uc744 \uac00\uc9c4 \ub370\uc774\ud130\ubca0\uc774\uc2a4 \uc0ac\uc6a9\uc790\ub97c \uc0ac\uc6a9\ud558\uc5ec \ucd5c\uc18c \uad8c\ud55c\uc758 \uc6d0\uce59\uc744 \uc801\uc6a9\ud558\uc2ed\uc2dc\uc624.\n\ud2b9\ud788 'sa' \ub610\ub294 'db-owner' \ub370\uc774\ud130\ubca0\uc774\uc2a4 \uc0ac\uc6a9\uc790\uc758 \uc0ac\uc6a9\uc744 \ud53c\ud558\uc2ed\uc2dc\uc624. \uc774\ub294 SQL \uc778\uc81d\uc158\uc744 \uc81c\uac70\ud558\uc9c0\ub294 \uc54a\uc9c0\ub9cc, \uadf8 \uc601\ud5a5\uc744 \ucd5c\uc18c\ud654\ud569\ub2c8\ub2e4.\n\uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0 \ud544\uc694\ud55c \ucd5c\uc18c\ud55c\uc758 \ub370\uc774\ud130\ubca0\uc774\uc2a4 \uc811\uadfc \uad8c\ud55c\uc744 \ubd80\uc5ec\ud558\uc2ed\uc2dc\uc624.
ascanalpha.sqlinjection.sqlite.alert.timing.error.extrainfo = The following known SQLite error message was provoked\: [{0}].
ascanalpha.sqlinjection.sqlite.alert.timing.extrainfo = The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, parameter value [{2}], which caused the request to take [{3}] milliseconds, when the original unmodified query with value [{4}] took [{5}] milliseconds.
ascanalpha.sqlinjection.sqlite.timing.name = SQL Injection - SQLite (Time Based)

ascanalpha.webCacheDeception.desc = \uc6f9 \uce90\uc2dc \ub514\uc149\uc158(Web Cache Deception)\uc774 \uac00\ub2a5\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uad8c\ud55c \uc5c6\ub294 \uc0ac\uc6a9\uc790\uac00 \uc774 \ud398\uc774\uc9c0\uc5d0\uc11c \ubbfc\uac10\ud55c \ub370\uc774\ud130\ub97c \ubcfc \uc218 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
ascanalpha.webCacheDeception.name = \uc6f9 \uce90\uc2dc \ub514\uc149\uc158
ascanalpha.webCacheDeception.otherinfo = \uce90\uc2dc\ub41c \uad8c\ud55c \uc788\ub294 \uc751\ub2f5\uacfc \uad8c\ud55c \uc5c6\ub294 \uc751\ub2f5\uc774 \uc720\uc0ac\ud569\ub2c8\ub2e4.
ascanalpha.webCacheDeception.refs = https\://blog.cloudflare.com/understanding-our-cache-and-the-web-cache-deception-attack/\nhttps\://www.invicti.com/web-vulnerability-scanner/vulnerabilities/web-cache-deception
ascanalpha.webCacheDeception.soln = \uc774\ubbf8\uc9c0 \ub610\ub294 \uc2a4\ud0c0\uc77c\uc2dc\ud2b8\uc640 \uac19\uc740 \ud30c\uc77c \uc720\ud615\uc744 URL \ubc0f \ud30c\uc77c \ud655\uc7a5\uc790\ub9cc\uc73c\ub85c \ubd84\ub958\ud558\ub294 \uac83\uc744 \uc0bc\uac00\ud560 \uac83\uc744 \uac15\ub825\ud788 \uad8c\uc7a5\ud569\ub2c8\ub2e4. \ub300\uc2e0, \ud30c\uc77c\uc774 Content-Type \ud5e4\ub354\ub97c \uae30\ubc18\uc73c\ub85c \uce90\uc2dc\ub418\ub3c4\ub85d \ud655\uc778\ud574\uc57c \ud569\ub2c8\ub2e4.
