#X-Generator: crowdin.com
# ascanalphaAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=\u0642\u0648\u0627\u0646\u06cc\u0646 \u0627\u0633\u06a9\u0646 \u0641\u0639\u0627\u0644 - \u0622\u0644\u0641\u0627

ascanalpha.apacherangeheaderdosscanner.name=Apache \u0645\u062d\u062f\u0648\u062f\u0647 Header DoS (CVE-2011-3192)
ascanalpha.apacherangeheaderdosscanner.desc=\u0641\u06cc\u0644\u062a\u0631 \u0645\u062d\u062f\u0648\u062f\u0647 \u0628\u0627\u06cc\u062a \u062f\u0631 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u0627\u0648\u0644\u06cc\u0647 \u0633\u0631\u0648\u0631 Apache HTTP \u0627\u062c\u0627\u0632\u0647 \u0645\u06cc\u062f\u0647\u062f \u062a\u0627 \u062d\u0645\u0644\u0647 \u06a9\u0646\u0646\u062f\u0647 \u0647\u0627 \u0631\u0627 \u0627\u0632 \u0631\u0627\u0647 \u062f\u0648\u0631 \u06a9\u0646\u062a\u0631\u0644 \u06a9\u0646\u062f \u062a\u0627 \u0633\u0631\u0648\u06cc\u0633 \u0631\u0627 ( \u062d\u0627\u0641\u0638\u0647 \u0648 \u067e\u0631\u062f\u0627\u0632\u0646\u062f\u0647 \u062e\u0633\u062a\u06af\u06cc) \u0628\u0627 \u0645\u062d\u062f\u0648\u062f\u0647 \u062f\u0631\u062e\u0648\u0627\u0633\u062a header \u0631\u062f \u06a9\u0646\u062f \u06a9\u0647 \u0686\u0646\u062f\u06cc\u0646 \u0645\u062d\u062f\u0648\u062f\u0647 \u0647\u0645\u067e\u0648\u0634\u0627\u0646\u06cc \u0631\u0627 \u0634\u0646\u0627\u0633\u0627\u06cc\u06cc \u0645\u06cc \u06a9\u0646\u062f. \u0627\u06cc\u0646 \u0645\u0633\u0626\u0644\u0647 \u062f\u0631 \u0645\u0627\u0647 \u0627\u0648\u062a 2011 \u0628\u0647 \u0635\u0648\u0631\u062a wild \u0628\u0647\u0631\u0647 \u0628\u0631\u062f\u0627\u0631\u06cc \u0634\u062f.
ascanalpha.apacherangeheaderdosscanner.soln=\u0633\u0631\u0648\u0631 Apache \u062e\u0648\u062f \u0631\u0627 \u0628\u0647 \u0646\u0633\u062e\u0647 \u062b\u0627\u0628\u062a \u0634\u062f\u0647 \u0631\u0648\u0632 \u0627\u0631\u062a\u0642\u0627 \u062f\u0647\u06cc\u062f. \u0631\u0627\u0647 \u062d\u0644 \u0647\u0627\u06cc \u062c\u0627\u06cc\u06af\u0632\u06cc\u0646 \u06cc\u0627 \u0631\u0627\u0647 \u062d\u0644 \u0647\u0627 \u062f\u0631 \u0645\u0646\u0627\u0628\u0639 \u0637\u0631\u062d \u0634\u062f\u0647 \u0627\u0633\u062a. 
ascanalpha.apacherangeheaderdosscanner.refs=https\://httpd.apache.org/security/CVE-2011-3192.txt\nhttp\://cve.mitre.org/cgi-bin/cvename.cgi?name\=cve-2011-3192

ascanalpha.cookieslack.name=\u0622\u0634\u06a9\u0627\u0631 \u0633\u0627\u0632 Cookie Slack
ascanalpha.cookieslack.desc=\u062f\u0631\u062e\u0648\u0627\u0633\u062a \u0647\u0627\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a\u06cc \u062a\u06a9\u0631\u0627\u0631 \u0634\u062f\u0647\: \u0647\u0631 \u0628\u0627\u0631 \u06cc\u06a9 \u06a9\u0648\u06a9\u06cc \u0645\u062a\u0641\u0627\u0648\u062a \u0628\u0631\u062f\u0627\u0631\u06cc\u062f\u060c \u062f\u0646\u0628\u0627\u0644 \u0634\u062f\u0647 \u062a\u0648\u0633\u0637 \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u0639\u0627\u062f\u06cc \u0628\u0627 \u062a\u0645\u0627\u0645 \u06a9\u0648\u06a9\u06cc \u0647\u0627 \u0628\u0631\u0627\u06cc \u062a\u062b\u0628\u06cc\u062a \u062c\u0644\u0633\u0647\u060c \u0645\u0642\u0627\u06cc\u0633\u0647 \u067e\u0627\u0633\u062e \u0647\u0627 \u062f\u0631 \u0628\u0631\u0627\u0628\u0631 GET \u062e\u0637 \u067e\u0627\u06cc\u0647 \u0627\u0635\u0644\u06cc. \u0627\u06cc\u0646 \u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u0632\u0645\u06cc\u0646\u0647 \u0647\u0627\u06cc\u06cc \u0631\u0627 \u06a9\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \u06a9\u0648\u06a9\u06cc \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a / \u0648\u06cc\u0698\u06af\u06cc \u06a9\u0647 \u0641\u0639\u0644\u0627 \u0627\u0639\u0645\u0627\u0644 \u0646\u0645\u06cc \u0634\u0648\u062f \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u06a9\u0646\u062f.
ascanalpha.cookieslack.otherinfo.intro=\u06a9\u0648\u06a9\u06cc \u0647\u0627\u06cc\u06cc \u06a9\u0647 \u0627\u062b\u0631\u0627\u062a \u0645\u0648\u0631\u062f \u0627\u0646\u062a\u0638\u0627\u0631 \u0631\u0627 \u0646\u062f\u0627\u0631\u0646\u062f\u060c \u0645\u06cc \u062a\u0648\u0627\u0646\u0646\u062f \u0645\u0639\u0627\u06cc\u0628 \u0645\u0646\u0637\u0642 \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0646\u0634\u0627\u0646 \u062f\u0647\u0646\u062f. \u062f\u0631 \u0628\u062f\u062a\u0631\u06cc\u0646 \u062d\u0627\u0644\u062a\u060c \u0627\u06cc\u0646 \u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u0646\u0634\u0627\u0646 \u062f\u0647\u062f \u06a9\u0647 \u06a9\u062c\u0627 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0627\u0632 \u0637\u0631\u06cc\u0642 \u06a9\u0648\u06a9\u06cc (\u0647\u0627) \u062f\u0631 \u0648\u0627\u0642\u0639 \u0627\u062c\u0631\u0627 \u0646\u0645\u06cc \u0634\u0648\u062f.\n
ascanalpha.cookieslack.session.warning=\u062a\u0648\u062c\u0647\: \u0628\u0647 \u062f\u0644\u06cc\u0644 \u0646\u0627\u0645 \u0627\u0634 \u0627\u06cc\u0646 \u06a9\u0648\u06a9\u06cc \u0645\u0647\u0645 \u0627\u0633\u062a\u060c \u0627\u0645\u0627 \u0628\u0647 \u0646\u0638\u0631 \u0645\u06cc \u0631\u0633\u062f \u06a9\u0627\u0647\u0634 \u0622\u0646 \u0647\u06cc\u0686 \u062a\u0627\u062b\u06cc\u0631\u06cc \u0646\u062f\u0627\u0631\u062f\: {0}\n
ascanalpha.cookieslack.affect.response.yes=\u0627\u06cc\u0646 \u06a9\u0648\u06a9\u06cc \u0647\u0627 \u062a\u062d\u062a \u062a\u0627\u062b\u06cc\u0631 \u067e\u0627\u0633\u062e \u0647\u0633\u062a\u0646\u062f\: 
ascanalpha.cookieslack.affect.response.no=\u0627\u06cc\u0646 \u06a9\u0648\u06a9\u06cc \u0647\u0627 \u062a\u062d\u062a \u062a\u0627\u062b\u06cc\u0631 \u067e\u0627\u0633\u062e \u0646\u06cc\u0633\u062a\u0646\u062f\: 
ascanalpha.cookieslack.session.destroyed=\u0628\u0647 \u0646\u0638\u0631 \u0645\u06cc \u0631\u0633\u062f \u06a9\u0647 \u062d\u0630\u0641 \u0627\u06cc\u0646 \u06a9\u0648\u06a9\u06cc \u062c\u0644\u0633\u0647 \u0631\u0627 \u0628\u0627\u0637\u0644 \u06a9\u0631\u062f\u0647 \u0627\u0633\u062a\: {0} \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u067e\u06cc\u06af\u06cc\u0631\u06cc \u0628\u0627 \u062a\u0645\u0627\u0645 \u06a9\u0648\u06a9\u06cc\u0647\u0627\u06cc \u0627\u0635\u0644\u06cc \u0628\u0627\u0632 \u0647\u0645 \u067e\u0627\u0633\u062e \u0645\u062a\u0641\u0627\u0648\u062a\u06cc \u0646\u0633\u0628\u062a \u0628\u0647 \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u0627\u0635\u0644\u06cc \u062f\u0627\u0634\u062a\u0647 \u0627\u0633\u062a.\n
ascanalpha.cookieslack.separator=,
ascanalpha.cookieslack.endline=\n

ascanalpha.elmahscanner.name=ELMAH Information Leak
ascanalpha.elmahscanner.desc=The Error Logging Modules and Handlers (ELMAH [elmah.axd]) HTTP Module was found to be available. This module can leak a significant amount of valuable information.
ascanalpha.elmahscanner.otherinfo=Based on response status code ELMAH may be protected by an authentication or authorization mechanism.  
ascanalpha.elmahscanner.refs=https\://www.troyhunt.com/aspnet-session-hijacking-with-google/\nhttps\://www.nuget.org/packages/elmah\nhttps\://elmah.github.io/
ascanalpha.elmahscanner.soln=Consider whether or not ELMAH is actually required in production, if it isn't then disable it. If it is then ensure access to it requires authentication and authorization. See also\: https\://elmah.github.io/a/securing-error-log-pages/

ascanalpha.examplefile.name=\u06cc\u06a9 \u0646\u0645\u0648\u0646\u0647 \u0642\u0627\u0646\u0648\u0646 \u0627\u0633\u06a9\u0646 \u0641\u0639\u0627\u0644 \u06a9\u0647 \u0627\u0637\u0627\u0639\u0627\u062a \u0631\u0627 \u0627\u0632 \u06cc\u06a9 \u0641\u0627\u06cc\u0644 \u0628\u0627\u0631\u06af\u0630\u0627\u0631\u06cc \u0645\u06cc \u06a9\u0646\u062f
ascanalpha.examplefile.desc=\u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0628\u06cc\u0634\u062a\u0631 \u062f\u0631 \u0645\u0648\u0631\u062f \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u0631\u0627 \u062f\u0631 \u0627\u06cc\u0646\u062c\u0627 \u0648\u0627\u0631\u062f \u06a9\u0646\u06cc\u062f
ascanalpha.examplefile.other=\u0627\u06cc\u0646 \u0628\u0631\u0627\u06cc \u0627\u0637\u0644\u0627\u0639\u0627\u062a\u06cc \u0627\u0633\u062a \u06a9\u0647 \u062f\u0631 \u0647\u06cc\u0686 \u06cc\u06a9 \u0627\u0632 \u0628\u062e\u0634 \u0647\u0627\u06cc \u062f\u06cc\u06af\u0631 \u0641\u06cc\u062a \u06cc\u0627 \u0627\u0646\u062f\u0627\u0632\u0647 \u0646\u0645\u06cc \u0634\u0648\u062f
ascanalpha.examplefile.soln=\u062a\u0648\u0635\u06cc\u0641 \u06a9\u0644\u06cc \u0627\u0632 \u0686\u06af\u0648\u0646\u06af\u06cc \u062d\u0644 \u0645\u0634\u06a9\u0644
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.getforpostscanner.name=GET for POST
ascanalpha.getforpostscanner.desc=A request that was originally observed as a POST was also accepted as a GET. This issue does not represent a security weakness unto itself, however, it may facilitate simplification of other attacks. For example if the original POST is subject to Cross-Site Scripting (XSS), then this finding may indicate that a simplified (GET based) XSS may also be possible.
ascanalpha.getforpostscanner.soln=Ensure that only POST is accepted where POST is expected.

ascanalpha.httponlysite.name=\u062a\u0646\u0647\u0627 \u0633\u0627\u06cc\u062a HTTP
ascanalpha.httponlysite.desc=\u0633\u0627\u06cc\u062a \u062a\u0646\u0647\u0627 \u062a\u062d\u062a HTTP \u062e\u062f\u0645\u062a \u0645\u06cc\u062f\u0647\u062f \u0646\u0647 HTTPS.
ascanalpha.httponlysite.soln=\u0648\u0628 \u06cc\u0627 \u0633\u0631\u0648\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u062e\u0648\u062f \u0631\u0627 \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 SSL (https) \u0634\u06a9\u0644 \u062f\u0647\u06cc\u062f.
ascanalpha.httponlysite.refs=https\://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet\nhttps\://www.owasp.org/index.php/SSL_Best_Practices\nhttps\://letsencrypt.org/
ascanalpha.httponlysite.otherinfo={0}\nZAP \u0628\u0631\u0627\u06cc \u0627\u062a\u0635\u0627\u0644 \u0628\u0627 {1} \u062a\u0644\u0627\u0634 \u06a9\u0631\u062f\u0647 \u0627\u0633\u062a
ascanalpha.httponlysite.otherinfo.connectionfail=\u0627\u062a\u0635\u0627\u0644 \u0628\u0631\u0642\u0631\u0627\u0631 \u0646\u0634\u062f.
ascanalpha.httponlysite.otherinfo.differenthosts=\u0645\u06cc\u0632\u0628\u0627\u0646 \u0647\u0627\u06cc \u0645\u062a\u0641\u0627\u0648\u062a.
ascanalpha.httponlysite.otherinfo.redirectionlimit=\u062d\u062f \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u0628\u0647 \u062f\u0633\u062a \u0622\u0645\u062f.
ascanalpha.httponlysite.otherinfo.noredirection=\u0647\u06cc\u0686 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u062e\u0648\u062f\u06a9\u0627\u0631\u06cc \u0648\u062c\u0648\u062f \u0646\u062f\u0627\u0634\u062a.
ascanalpha.httponlysite.otherinfo.nossl=\u0633\u0627\u06cc\u062a \u0627\u0632 SSL/TLS \u067e\u0634\u062a\u06cc\u0628\u0627\u0646\u06cc \u0646\u0645\u06cc \u06a9\u0646\u062f.
ascanalpha.httponlysite.otherinfo.redirecttohttp=\u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 \u0628\u0647 HTTP.
ascanalpha.httponlysite.otherinfo.urinotencoded=\u062a\u063a\u06cc\u06cc\u0631 \u0645\u0633\u06cc\u0631 URL \u0646\u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u06a9\u062f \u062f\u0647\u06cc \u0634\u0648\u062f.

ascanalpha.httpoxy.name=Httpoxy - \u067e\u0631\u0648\u06a9\u0633\u06cc \u0647\u062f\u0631 \u0633\u0648\u0621 \u0627\u0633\u062a\u0641\u0627\u062f\u0647
ascanalpha.httpoxy.desc=\u0633\u0631\u0648\u0631 \u06cc\u06a9 \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u067e\u0631\u0648\u06a9\u0633\u06cc \u0634\u062f\u0647 \u0631\u0627 \u0628\u0627 \u06a9\u0645\u06a9 \u067e\u0631\u0648\u06a9\u0633\u06cc \u0645\u0634\u062e\u0635 \u062f\u0631 HTTP \u067e\u0631\u0648\u06a9\u0633\u06cc \u0647\u062f\u0631 \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u0622\u063a\u0627\u0632 \u06a9\u0631\u062f.\nHttpoxy \u0645\u0639\u0645\u0648\u0644\u0627 \u0628\u0631 \u0631\u0648\u06cc \u06a9\u062f \u062f\u0631 CGI \u06cc\u0627 CGI \u0645\u0627\u0646\u0646\u062f \u0645\u062d\u06cc\u0637 \u0627\u062c\u0631\u0627 \u0645\u06cc \u0634\u0648\u062f.\n\u0627\u06cc\u0646 \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0628\u0647 \u0645\u0647\u0627\u062c\u0645\u0627\u0646 \u0627\u062c\u0627\u0632\u0647 \u062f\u0647\u062f\:\n* \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u0647\u0627\u06cc HTTP \u062e\u0631\u0648\u062c\u06cc \u06a9\u0647 \u062a\u0648\u0633\u0637 \u0628\u0631\u0646\u0627\u0645\u0647 \u0648\u0628 \u0633\u0627\u062e\u062a\u0647 \u0634\u062f\u0647 \u0627\u0633\u062a \u0631\u0627 \u067e\u0631\u0648\u06a9\u0633\u06cc \u06a9\u0646\u062f\n* \u0633\u0631\u0648\u0631 \u0631\u0627 \u0628\u0631\u0627\u06cc \u0628\u0627\u0632 \u06a9\u0631\u062f\u0646 \u0627\u062a\u0635\u0627\u0644\u0627\u062a \u062e\u0631\u0648\u062c\u06cc \u0628\u0647 \u0622\u062f\u0631\u0633 \u0648 \u067e\u0648\u0631\u062a \u0627\u0646\u062a\u062e\u0627\u0628\u06cc \u062e\u0648\u062f \u0647\u062f\u0627\u06cc\u062a \u06a9\u0646\u062f \u0648 \u06cc\u0627\n* \u0645\u0646\u0627\u0628\u0639 \u0633\u0631\u0648\u0631 \u0631\u0627 \u0628\u0627\u06a9\u0645\u06a9 \u0627\u062c\u0628\u0627\u0631 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631 \u0628\u0647 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u067e\u0631\u0648\u06a9\u0633\u06cc \u0628\u062f \u0627\u0641\u0632\u0627\u0631 \u06cc\u0627 \u0645\u062e\u0631\u0628
ascanalpha.httpoxy.otherinfo=\u06cc\u06a9 \u067e\u06cc\u0627\u0645 \u062e\u0631\u0648\u062c\u06cc \u0628\u0647 {0} \u0627\u0632 \u0637\u0631\u06cc\u0642 \u0645\u06cc\u0632\u0628\u0627\u0646 \u0648 \u067e\u0648\u0631\u062a \u062a\u0632\u0631\u06cc\u0642 \u0634\u062f\u0647 ZAP \u0628\u0647 \u0647\u062f\u0631 \u067e\u0631\u0648\u06a9\u0633\u06cc HTTP \u067e\u0631\u0648\u06a9\u0633\u06cc \u0634\u062f.
ascanalpha.httpoxy.soln=\u0628\u0647\u062a\u0631\u06cc\u0646 \u062a\u062f\u0627\u062e\u0644 \u0641\u0648\u0631\u06cc\u060c \u0627\u06cc\u0646 \u0627\u0633\u062a \u06a9\u0647 \u0647\u0631 \u0686\u0647 \u0632\u0648\u062f\u062a\u0631 \u0647\u062f\u0631 \u0647\u0627\u06cc \u062f\u0631\u062e\u0648\u0627\u0633\u062a \u067e\u0631\u0648\u06a9\u0633\u06cc \u0631\u0627 \u0645\u0633\u062f\u0648\u062f \u06a9\u0646\u06cc\u062f\u060c \u0642\u0628\u0644 \u0627\u0632 \u0627\u06cc\u0646\u06a9\u0647 \u0628\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0634\u0645\u0627 \u0628\u0631\u062e\u0648\u0631\u062f \u06a9\u0646\u0646\u062f.
ascanalpha.httpoxy.refs=https\://httpoxy.org/

ascanalpha.httpsashttpscanner.name=\u0645\u062d\u062a\u0648\u0627 \u0645\u0648\u062c\u0648\u062f HTTPS \u062a\u0648\u0633\u0637 HTTP
ascanalpha.httpsashttpscanner.desc=\u0645\u062d\u062a\u0648\u0627 \u06a9\u0647 \u0627\u0628\u062a\u062f\u0627 \u0627\u0632 \u0637\u0631\u06cc\u0642 HTTPS \u0642\u0627\u0628\u0644 \u062f\u0633\u062a\u0631\u0633\u06cc \u0628\u0648\u062f (i.e.\: \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0631\u0645\u0632\u06af\u0630\u0627\u0631\u06cc SSL / TLS) \u0647\u0645\u0686\u0646\u06cc\u0646 \u0627\u0632 \u0637\u0631\u06cc\u0642 HTTP \u0642\u0627\u0628\u0644 \u062f\u0633\u062a\u0631\u0633\u06cc \u0645\u06cc \u0628\u0627\u0634\u062f (\u0628\u062f\u0648\u0646 \u0631\u0645\u0632\u06af\u0630\u0627\u0631\u06cc). 
ascanalpha.httpsashttpscanner.soln=\u0627\u0637\u0645\u06cc\u0646\u0627\u0646 \u06cc\u0627\u0628\u06cc\u062f \u06a9\u0647 \u06a9\u0647 \u0633\u0631\u0648\u0631 \u0648\u0628 \u0634\u0645\u0627\u060c \u0633\u0631\u0648\u0631 \u0628\u0631\u0646\u0627\u0645\u0647\u060c \u0645\u062a\u0639\u0627\u062f\u0644 \u06a9\u0646\u0646\u062f\u0647 \u0628\u0627\u0631\u06af\u0632\u0627\u0631\u06cc\u060c \u0648 \u063a\u06cc\u0631\u0647 \u067e\u06cc\u06a9\u0631\u0628\u0646\u062f\u06cc \u0634\u062f\u0647 \u0627\u0633\u062a \u062a\u0627 \u062a\u0646\u0647\u0627 \u0627\u0632 \u0637\u0631\u06cc\u0642 HTTPS \u0628\u0627 \u0645\u062d\u062a\u0648\u0627 \u0628\u0647 \u06a9\u0627\u0631 \u0631\u0648\u062f. \u0628\u0647 \u0627\u0633\u0628\u0627\u0628 \u062d\u0645\u0644 \u0648 \u0646\u0642\u0644 \u0645\u0633\u062a\u0642\u06cc\u0645 \u0627\u0645\u0646\u06cc\u062a\u06cc HTTP \u062a\u0648\u062c\u0647 \u06a9\u0646\u06cc\u062f.
ascanalpha.httpsashttpscanner.refs=https\://www.owasp.org/index.php/HTTP_Strict_Transport_Security\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers\nhttp\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttp\://caniuse.com/stricttransportsecurity\nhttp\://tools.ietf.org/html/rfc6797
ascanalpha.httpsashttpscanner.otherinfo=ZAP \u0628\u0631\u0627\u06cc \u0627\u062a\u0635\u0627\u0644 \u0628\u0627 {0} \u062a\u0644\u0627\u0634 \u06a9\u0631\u062f\u0647 \u0627\u0633\u062a

ascanalpha.ldapinjection.name=LDAP Injection
ascanalpha.ldapinjection.desc=\u062a\u0632\u0631\u06cc\u0642 LDAP \u0627\u0645\u06a9\u0627\u0646 \u067e\u0630\u06cc\u0631 \u0627\u0633\u062a. \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0628\u0631\u0627\u06cc \u06cc\u06a9 \u0645\u0647\u0627\u062c\u0645 \u0627\u0645\u06a9\u0627\u0646 \u0639\u0628\u0648\u0631 \u0627\u0632 \u06a9\u0646\u062a\u0631\u0644 \u0647\u0627\u06cc \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0648 \u0645\u0634\u0627\u0647\u062f\u0647 \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0647\u0627\u06cc \u062f\u0644\u062e\u0648\u0627\u0647 \u062f\u0631 \u0641\u0647\u0631\u0633\u062a \u0631\u0627\u0647\u0646\u0645\u0627 LDAP \u0648\u062c\u0648\u062f \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u062f. 
ascanalpha.ldapinjection.soln=\u0642\u0628\u0644 \u0627\u0632 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0622\u0646 \u0628\u0631\u0627\u06cc \u0627\u06cc\u062c\u0627\u062f \u06cc\u06a9  LDAP query \u062a\u0645\u0627\u0645 \u0648\u0631\u0648\u062f\u06cc \u06a9\u0627\u0631\u0628\u0631 \u0631\u0627 \u062a\u0627\u0626\u06cc\u062f \u0648 \u06cc\u0627 \u062d\u0630\u0641 \u06a9\u0646\u06cc\u062f. \u0628\u0647 \u0648\u06cc\u0698\u0647\u060c \u06a9\u0627\u0631\u0627\u06a9\u062a\u0631 \u0647\u0627\u06cc \u0632\u06cc\u0631 (\u06cc\u0627 \u062a\u0631\u06a9\u06cc\u0628\u0627\u062a \u0622\u0646 \u0647\u0627) \u0628\u0627\u06cc\u062f \u0628\u0647 \u0644\u06cc\u0633\u062a \u0633\u06cc\u0627\u0647 \u0627\u0636\u0627\u0641\u0647 \u0634\u0648\u0646\u062f\:\n&\n|\n\!\n<\n>\n\=\n~\=\n>\=\n<\=\n*\n(\n)\n,\n+\n-\n"\n'\n;\n\\\n/\nNUL character\n 
ascanalpha.ldapinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A9\nhttp\://www.testingsecurity.com/how-to-test/injection-vulnerabilities/LDAP-Injection\nhttps\://www.owasp.org/index.php/LDAP_injection
#ascanalpha.ldapinjection.alert.extrainfo=[{0}] field [{1}] on [{2}] [{3}] may be vulnerable to LDAP injection, using an attack with LDAP meta-characters [{4}], yielding known [{5}] error message [{6}], which was not present in the original response.
ascanalpha.ldapinjection.alert.extrainfo=\u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u0631\u0648\u06cc {1}{2} \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u0648\u062c\u0628 \u0622\u0633\u06cc\u0628 \u067e\u0630\u06cc\u0631\u06cc \u062a\u0632\u0631\u06cc\u0642 LDAP \u0634\u0648\u062f\u060c \u0628\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u06cc\u06a9 \u062d\u0645\u0644\u0647 \u0645\u062a\u0627\u06a9\u0627\u0631\u0627\u06a9\u062a\u0631\u06cc LDAP {3}\u060c \u0628\u0627\u0632\u062f\u0647 \u0634\u0646\u0627\u062e\u062a\u0647 \u0634\u062f\u0647 {4} \u067e\u06cc\u0627\u0645 \u062e\u0637\u0627 {5}\u060c \u06a9\u0647 \u062f\u0631 \u067e\u0627\u0633\u062e \u0627\u0648\u0644\u06cc\u0647 \u062d\u0636\u0648\u0631 \u0646\u062f\u0627\u0634\u062a\u0646\u062f.
ascanalpha.ldapinjection.alert.evidence={0}
ascanalpha.ldapinjection.booleanbased.alert.extrainfo=\u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u0631\u0648\u06cc{1}{2} \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u0648\u062c\u0628 \u0622\u0633\u06cc\u0628 \u062a\u0632\u0631\u06cc\u0642 LDAP\u060c \u062a\u0648\u0633\u0637 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0639\u0628\u0627\u0631\u062a \u0645\u0639\u0627\u062f\u0644\u0647 \u0645\u0646\u0637\u0642\u06cc {3}\u060c \u0648 \u0639\u0628\u0627\u0631\u062a ''FALSE'' {4} \u0634\u0648\u062f.
#ascanalpha.ldapinjection.alert.attack=[{0}] field [{1}] set to [{2}]
ascanalpha.ldapinjection.alert.attack=\u0642\u0631\u0627\u0631 \u062f\u0627\u062f\u0646 \u067e\u0627\u0631\u0627\u0645\u062a\u0631 {0} \u062f\u0631 \u0628\u0631\u0627\u0628\u0631 {1}
ascanalpha.ldapinjection.booleanbased.alert.attack=\u0645\u0639\u0627\u062f\u0644 \u0639\u0628\u0627\u0631\u062a LDAP\:{0}. \u067e\u0627\u0631\u0627\u0645\u062a\u0631 \u062a\u0635\u0627\u062f\u0641\u06cc\: {1}.
# a colon delimited list of the known LDAP implementations (used to reference "ldapinjection.<implementation>.errormessages" here)  
ascanalpha.ldapinjection.knownimplementations=activedirectory\:openldap\:389directoryserver\:apachedirectoryservices
# OpenLDAP Error messages
# error messages may be localised, so in this case, pull them from the local version of OpenLDAP source, using the following command
# grep -Eo "\"[^\"]+\"" openldap-2.4.31/libraries/libldap/error.c
# the list will then need to be manually filtered slightly (remove common strings, and ensure that the messages contain no colons, which would mess up the colon delimiting used here)
ascanalpha.ldapinjection.openldap.errormessages=Operations error\:Protocol error\:Time limit exceeded\:Size limit exceeded\:Compare False\:Compare True\:Authentication method not supported\:Strong(er) authentication required\:Administrative limit exceeded\:Critical extension is unavailable\:Confidentiality required\:SASL bind in progress\:No such attribute\:Undefined attribute type\:Inappropriate matching\:Constraint violation\:Type or value exists\:Invalid syntax\:No such object\:Alias problem\:Invalid DN syntax\:Alias dereferencing problem\:Inappropriate authentication\:Invalid credentials\:Insufficient access\:Server is busy\:Server is unavailable\:Server is unwilling to perform\:Loop detected\:Naming violation\:Object class violation\:Operation not allowed on non-leaf\:Operation not allowed on RDN\:Already exists\:Cannot modify object class\:Operation affects multiple DSAs\:Virtual List View error\:Other (e.g., implementation specific) error\:Partial results and referral received\:Entry is a leaf\:Results too large\:No Operation to Cancel\:Too Late to Cancel\:Cannot Cancel\:Assertion Failed\:Assertion Failed (X)\:Proxied Authorization Denied\:Proxy Authorization Failure (X)\:Content Sync Refresh Required\:Content Sync Refresh Required (X)\:No Operation (X)\:LCUP Resources Exhausted\:LCUP Security Violation\:LCUP Invalid Data\:LCUP Unsupported Scheme\:LCUP Reload Required\:TXN specify okay\:TXN ID is invalid\:Can't contact LDAP server\:Local error\:Encoding error\:Decoding error\:Timed out\:Unknown authentication method\:Bad search filter\:User cancelled operation\:Bad parameter to an ldap routine\:Out of memory\:Connect error\:Not Supported\:Control not found\:No results returned\:More results to return\:Client Loop\:Referral Limit Exceeded\:Unknown API error\:Unknown (extension) error\:Unknown (private extension) error\:Unknown error
# Active Directory error messages, from http://support.microsoft.com/kb/232282 
ascanalpha.ldapinjection.activedirectory.errormessages=0x00005011L\:0x00005012L\:0x00005013L\:0x80005000L\:0x80005001L\:0x80005002L\:0x80005003L\:0x80005004L\:0x80005005L\:0x80005006L\:0x80005007L\:0x80005008L\:0x80005009L\:0x8000500AL\:0x8000500BL\:0x8000500CL\:0x8000500DL\:0x8000500EL\:0x8000500FL\:0x80005010L\:0x80005014L\:A bad parameter was passed to a routine\:Administration limit on the server has exceeded\:An invalid ADSI path name was passed\:An unknown ADSI computer object was requested\:An unknown ADSI domain object was requested\:An unknown ADSI object was requested\:An unknown ADSI user object was requested\:Authentication is inappropriate\:Cannot contact the LDAP server\:Cannot dereference the alias\:Cannot establish the connection\:Cannot modify object class\:Client loop was detected\:Compare yielded FALSE\:Compare yielded TRUE\:Confidentiality is required\:Critical extension is unavailable\:Decoding error occurred\:E_ADS_BAD_PARAMETER\:E_ADS_BAD_PATHNAME\:E_ADS_CANT_CONVERT_DATATYPE\:E_ADS_COLUMN_NOT_SET\:E_ADS_INVALID_COMPUTER_OBJECT\:E_ADS_INVALID_DOMAIN_OBJECT\:E_ADS_INVALID_FILTER\:E_ADS_INVALID_USER_OBJECT\:E_ADS_OBJECT_EXISTS\:E_ADS_OBJECT_UNBOUND\:E_ADS_PROPERTY_INVALID\:E_ADS_PROPERTY_MODIFIED\:E_ADS_PROPERTY_NOT_FOUND\:E_ADS_PROPERTY_NOT_MODIFIED\:E_ADS_PROPERTY_NOT_SET\:E_ADS_PROPERTY_NOT_SUPPORTED\:E_ADS_SCHEMA_VIOLATION\:E_ADS_UNKNOWN_OBJECT\:Encoding error occurred\:ERROR_ACCESS_DENIED\:ERROR_CANCELLED\:ERROR_CONNECTION_REFUSED\:ERROR_DS_ADMIN_LIMIT_EXCEEDED\:ERROR_DS_AFFECTS_MULTIPLE_DSAS\:ERROR_DS_ALIAS_DEREF_PROBLEM\:ERROR_DS_ALIAS_PROBLEM\:ERROR_DS_ATTRIBUTE_OR_VALUE_EXISTS\:ERROR_DS_ATTRIBUTE_TYPE_UNDEFINED\:ERROR_DS_AUTH_METHOD_NOT_SUPPORTED\:ERROR_DS_AUTH_UNKNOWN\:ERROR_DS_BUSY\:ERROR_DS_CANT_MOD_OBJ_CLASS\:ERROR_DS_CANT_ON_NON_LEAF\:ERROR_DS_CANT_ON_RDN\:ERROR_DS_CLIENT_LOOP\:ERROR_DS_COMPARE_FALSE\:ERROR_DS_COMPARE_TRUE\:ERROR_DS_CONFIDENTIALITY_REQUIRED\:ERROR_DS_CONSTRAINT_VIOLATION\:ERROR_DS_CONTROL_NOT_FOUND\:ERROR_DS_DECODING_ERROR\:ERROR_DS_ENCODING_ERROR\:ERROR_DS_FILTER_UNKNOWN\:ERROR_DS_INAPPROPRIATE_AUTH\:ERROR_DS_INAPPROPRIATE_MATCHING\:ERROR_DS_INVALID_ATTRIBUTE_SYNTAX\:ERROR_DS_INVALID_DN_SYNTAX\:ERROR_DS_IS_LEAF\:ERROR_DS_LOCAL_ERROR\:ERROR_DS_LOOP_DETECT\:ERROR_DS_NAMING_VIOLATION\:ERROR_DS_NO_ATTRIBUTE_OR_VALUE\:ERROR_DS_NO_RESULTS_RETURNED\:ERROR_DS_NO_SUCH_OBJECT\:ERROR_DS_NOT_SUPPORTED\:ERROR_DS_OBJ_CLASS_VIOLATION\:ERROR_DS_OBJECT_RESULTS_TOO_LARGE\:ERROR_DS_OPERATIONS_ERROR\:ERROR_DS_PARAM_ERROR\:ERROR_DS_PROTOCOL_ERROR\:ERROR_DS_REFERRAL\:ERROR_DS_REFERRAL_LIMIT_EXCEEDED\:ERROR_DS_SERVER_DOWN\:ERROR_DS_SIZELIMIT_EXCEEDED\:ERROR_DS_STRONG_AUTH_REQUIRED\:ERROR_DS_TIMELIMIT_EXCEEDED\:ERROR_DS_UNAVAILABLE\:ERROR_DS_UNAVAILABLE_CRIT_EXTENSION\:ERROR_DS_UNWILLING_TO_PERFORM\:ERROR_GEN_FAILURE\:ERROR_LOGON_FAILURE\:ERROR_MORE_DATA\:ERROR_MORE_DATA\:ERROR_NOT_ENOUGH_MEMORY\:ERROR_OBJECT_ALREADY_EXISTS\:ERROR_TIMEOUT\:LDAP_ADMIN_LIMIT_EXCEEDED\:LDAP_AFFECTS_MULTIPLE_DSAS\:LDAP_ALIAS_DEREF_PROBLEM\:LDAP_ALIAS_PROBLEM\:LDAP_ALREADY_EXISTS\:LDAP_ATTRIBUTE_OR_VALUE_EXISTS\:LDAP_AUTH_METHOD_NOT_SUPPORTED\:LDAP_AUTH_UNKNOWN\:LDAP_BUSY\:LDAP_CLIENT_LOOP\:LDAP_COMPARE_FALSE\:LDAP_COMPARE_TRUE\:LDAP_CONFIDENTIALITY_REQUIRED\:LDAP_CONNECT_ERROR\:LDAP_CONSTRAINT_VIOLATION\:LDAP_CONTROL_NOT_FOUND\:LDAP_DECODING_ERROR\:LDAP_ENCODING_ERROR\:LDAP_FILTER_ERROR\:LDAP_INAPPROPRIATE_AUTH\:LDAP_INAPPROPRIATE_MATCHING\:LDAP_INSUFFICIENT_RIGHTS\:LDAP_INVALID_CREDENTIALS\:LDAP_INVALID_DN_SYNTAX\:LDAP_INVALID_SYNTAX\:LDAP_IS_LEAF\:LDAP_LOCAL_ERROR\:LDAP_LOOP_DETECT\:LDAP_MORE_RESULTS_TO_RETURN\:LDAP_NAMING_VIOLATION\:LDAP_NO_MEMORY\:LDAP_NO_OBJECT_CLASS_MODS\:LDAP_NO_RESULTS_RETURNED\:LDAP_NO_SUCH_ATTRIBUTE\:LDAP_NO_SUCH_OBJECT\:LDAP_NOT_ALLOWED_ON_NONLEAF\:LDAP_NOT_ALLOWED_ON_RDN\:LDAP_NOT_SUPPORTED\:LDAP_OBJECT_CLASS_VIOLATION\:LDAP_OPERATIONS_ERROR\:LDAP_OTHER\:LDAP_PARAM_ERROR\:LDAP_PARTIAL_RESULTS\:LDAP_PROTOCOL_ERROR\:LDAP_REFERRAL                       \:LDAP_REFERRAL_LIMIT_EXCEEDED\:LDAP_RESULTS_TOO_LARGE\:LDAP_SERVER_DOWN\:LDAP_SIZELIMIT_EXCEEDED\:LDAP_STRONG_AUTH_REQUIRED\:LDAP_TIMELIMIT_EXCEEDED\:LDAP_TIMEOUT\:LDAP_UNAVAILABLE\:LDAP_UNAVAILABLE_CRIT_EXTENSION\:LDAP_UNDEFINED_TYPE\:LDAP_UNWILLING_TO_PERFORM\:LDAP_USER_CANCELLED\:Local error occurred\:Loop was detected\:More results are to be returned\:Multiple directory service agents are affected\:Object does not exist\:One or more errors occurred\:One or more input parameters are invalid\:Operation is not allowed on a non leaf object\:Operation is not allowed on RDN\:Operations error occurred\:Partial results and referrals received\:Protocol error occurred\:Requested attribute does not exist\:Results are not returned\:Results returned are too large\:S_ADS_ERRORSOCCURRED\:S_ADS_NOMORE_COLUMNS\:S_ADS_NOMORE_ROWS\:Size limit has exceeded \:Strong authentication is required\:The ADSI data type cannot be converted to/from a native DS data type\:The ADSI object exists\:The ADSI property cannot be found in the cache\:The alias is invalid\:The attempted action violates the directory service schema rules\:The attribute exists or the value has been assigned\:The authentication method is not supported\:The control was not found\:The distinguished name has an invalid syntax\:The feature is not supported\:The object already exists\:The object is a leaf\:The referral limit has exceeded\:The search filter is bad\:The search operation has reached the last column for the current row\:The search operation has reached the last row\:The search was timed out\:The server is busy\:The server is not available\:The server is unwilling to perform\:The specified ADSI object has been modified\:The specified ADSI object has not been modified\:The specified ADSI object is not bound to a remote resource\:The specified ADSI property is invalid\:The specified ADSI property is not supported\:The specified ADSI property was not set\:The specified column in the ADSI was not set\:The specified search filter is invalid\:The supplied credential is invalid\:The syntax is invalid\:The system is out of memory\:The user has canceled the operation\:The user has insufficient access right\:There was a constrain violation\:There was a naming violation\:There was an inappropriate matching\:There was an object class violation\:Time limit has exceeded\:Type is not defined\:Unknown authentication error occurred\:Unknown error occurred
# 389 Directory Server error messages, using command: grep -Eo "\"[^\"]+\"" ./lib/ldaputil/errors.c 
ascanalpha.ldapinjection.389directoryserver.errormessages=ldap search didn't find an ldap entry\:Cert mapping function failed\:Cert search function failed\:Cert verify function failed\:Certmap InitFn function failed\:invalid local ldap database url prefix\:base dn is missing in ldapdb url\:out of memory\:Couldn't initialize connection to the ldap directory server\:Couldn't initialize connection to the local ldap directory\:ldap_set_option failed for local ldap database\:default cert database not initialized when using LDAP over SSL\:Circular groups were detected during group membership check\:Invalid string\:Invalid string index\:Missing attribute value from the search result\:cannot open the config file\:database name is missing\:database property is missing\:illegal directive in the config file\:internal error - LDAPU_ERR_NOT_PROPVAL\:cannot extract issuer DN from the cert\:issuer DN missing for non-default certmap\:cert to ldap entry mapping information is missing\:Found malformed subject DN in the certificate\:Certificate couldn't be mapped to an ldap entry\:Unable to load certmap plugin library\:InitFn must be provided when using certmap plugin library\:Could not find InitFn in the certmap plugin library\:Could not matching certificate in User's LDAP entry\:User's LDAP entry doesn't have any certificates to compare\:Library name is missing in the config file\:Init function name is missing in the config file\:ldaputil API function called with wrong arguments\:Renaming of file failed\:VerifyCert property value must be on or off\:Cert issuer name is missing\:property name is missing\:unknown cert attribute\:ldap search returned empty result\:ldap search returned multiple matches when one expected\:Could not extract entry from the ldap search result\:ldap entry is missing the 'uid' attribute value\:invalid argument passed to the certmap API function\:invalid LDAP directory suffix\:Couldn't extract the subject DN from the certificate\:Couldn't extract the issuer DN from the certificate\:Couldn't extract the original DER encoding from the certificate\:function not implemented yet\:ldaputil internal error\:internal error - unknown error code
# Apache Directory Service (starting point: cat ./i18n/src/main/resources/org/apache/directory/server/i18n/errors.properties | sed -re '/^#/ d; /^$/d;' | cut -d"=" -f2)
ascanalpha.ldapinjection.apachedirectoryservices.errormessages=Failed to identify OID for\:A system index on attribute\:A user index on attribute\:no EQUALITY MatchingRule defined\:by unauthenticated caller.\:Authentication error\:Cannot create a digested password for algorithm\:The rootDSE cannot be deleted, moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can del, move or rename\:failed to parse entryACI\:failed to parse subentryACI\:The rootDSE cannot be deleted\!\:The Administrators group cannot be deleted\!\:does not have permission to delete the admin account. \:does not have permission to delete the user account\:does not have permission to delete the group entry\:The rootDSE cannot be modified\!\:does not have permission to modify the account of the admin user.\:does not have permission to modify the account of the user\:does not have permission to modify the group entry\:The Administrators group cannot be moved or renamed\!\:does not have permission to move or rename the admin account.  No one not even the admin can move or rename\:does not have permission to move or rename the user account\:does not have permission to move or rename the group entry\:Access to user account\:Access to group\:Access to admin account not permitted for user\:due to syntax error. Cannot add ACITuples to TupleCache\:Cannot set a changeLog store when one is already active\:operational attribute cannot be modified by a user\:The ModifiersName operational attribute cannot be modified by a user\:The ModifyTimestamp operational attribute cannot be modified by a user\:failed to LOG version properties\:No partition with suffix\:can be found in the NamingContexts\:An LDAPURL should not contains a scope\:An LDAPURL should not contains filters\:An LDAPURL should not contains any description attribute list\:An LDAPURL should not contains any extension\:An LDAPURL should not contains any critical extension\:An LDAPURL should contains a non-empty DN\:An entry with a 'referral' ObjectClass must contains a 'ref' Attribute\:does not have any OID. It should be a wrong AttributeType.\:Wrong AttributeType, does not have an associated OID\:The value stored in an Human Readable attribute as a byte\:The value stored in a non Human Readable attribute as a String should be convertible to a byte\:A filter should not be null\:A Substring filter should be used only on Human Readable attributes\:A Extensible filter should be used only on Human Readable attributes\:Cannot modify the attribute\:The new Attribute or one of its value is incorrect\:Cannot add a value which is already present\:Trying to remove an non-existant attribute\:Cannot remove an absent value from attribute\:An ABSTRACT ObjectClass cannot inherit from an objectClass which is not ABSTRACT\:An AUXILiARY ObjectClass cannot inherit from an objectClass which is not ABSTRACT or AUXILIARY\:Cannot have a superior which does not exist\:does not contain a STRUCTURAL ObjectClass\:contains more than one STRUCTURAL ObjectClass\:attributeType, which is part of the RDN\:The value stored in a not Human Readable attribute as a String should be convertible to a byte\:The value is not valid. It should be a String or a byte\:Failed to access certificate in DIT.\:Failed on attempt to compare certificate bytes to determine alias.\:Failed on attempt to extract key.\:Exception while searching the DIT for class\:Encountered failure while searching directory for class\:failed to parse the new subtreeSpecification\:failed to parse entryTrigger\:TriggerSpecification parser failure on\:SynchWorker failed to synch directory.\:ChangeType unknown\:Reverts of change type\:Encountered a failure while trying to revert to a previous revision\:Cannot build an entry for\:The replicaId must be in\:Cannot inject the following entry\:Schema entity containers of objectClass organizationalUnit should be 3 name components in length.\:Expecting organizationalUnit with one of the following names\:Cannot add an entry on\:Unwilling to perform modify on\:Unwilling to enable a not loaded schema\:DitContentRule loading NYI\:DitStructureRule loading NYI\:MatchingRuleUse loading NYI\:NameForm loading NYI\:Failed to initialize wrapped partition.\:Attempt to destroy wrapped partition failed.\:Could not create directory\:Could not delete file or directory\:Unable to create a DirectoryService instance for unknow reason\:Failed to delete the working directory.\:Failed to delete\:Unsupported changetype found in LDIF\:Error encountered while delivering notifications.\:Encountered exception during event handling.\:Failed to configure the jetty http server\:Failed to configure the web application(s)\:Error encoding EncryptionKey.\:Failed to close an index.\:Closed master table for\:Failed to close the master.\:Failed to close the record manager\:Failed to identify OID for \:Error while adding\:Error while adding\:Exception while removing\:Cannot deserialize the entry\:Cannot create a ticket for the\:Cannot create a ticket\:Cannot encode the Ticket object, the PDU size is\:The PDU buffer size is too small \!\:Cannot encode the AuthorizationData object, the PDU size is\:Cannot encode the Checksum object, the PDU size is\:Cannot encode the EncryptedData object, the PDU size is\:Cannot encode the EncryptionKey object, the PDU size is\:Cannot encode the HostAddress object, the PDU size is\:Cannot encode the HostAddresses object, the PDU size is\:Cannot encode the PreAuthenticationData object, the PDU size is\:Cannot encode the principalName object, the PDU size is\:Cannot encode the TransitedEncoding object, the PDU size is\:Cannot put a PDU in a null buffer \!\:More than one server entry found for kerberos principal name\:Cannot initialize a partition without a valid suffix\:can't be created\:Unexpected exception\:Error in request monitor\:Error in context monitor\:Error in reply monitor\:Failed to get catalog context \:Failed to get initial context \:failed to rebind ldap service\:Failed to write GracefulShutdownResponse to client\:mechanism not supported. Please check the server.xml configuration file (supportedMechanisms field)\:Handler unavailable for\:Only LDAP v3 is supported.\:Only LDAP v3 is supported.\:failed to properly abandon this persistent search\:Reference will be ignored.\:Failed to close the search cursor for message\:Got back more than one entry for search on RootDSE which means Cursor is not functioning properly\!\:failed on list.close()\:failed to unbind session properly\:Failed to send a search request with RefreshAndPersist mode\:Failed to bind an LDAP service\:Failing on cursor close\:LDIF file does not exist.\:Failed to import LDIF into backing store.\:failed to close stream\:Error closing NamingEnumeration on PSearchListener\:Error closing connection on PSearchListener\:PSearchListener encountered error\:could not get canonical path\:Cannot load the ldif file\:Failed to run the class\:Failed to run the method\:Error while scanning index on attribute\:help for usage.\:Unknown command\:forced configuration load (-c) requires the -i option\:Command line parsing failed for\:unknown command\:port value of\:is larger than max port number\:is smaller than the minimum port number\:Partition directory\:delay value of\:is larger than max delay (seconds) allowed\:delay value of\:timeOffline value of\:is larger than max timeOffline (minutes) allowed\:is less than zero and makes no sense\:failed for the following reasons provided by the server\:Import failed...\:ldif file name must be provided\:No Normalizer present for attribute type\:in memory index cannot store the data on disk\:in memory index doesn't support explicit caching\:Cannot store a ClonedServerEntry\:Id for parent\:contains no objectClass attribute\:Not a normalized name\:contains no entryCsn attribute\:contains no entryUuid attribute\:Unidentified modification operation\:Cannot call store method\:aliasDereferencingProblem - attempt to create alias to itself.\:aliasDereferencingProblem - attempt to create alias with cycle to relative\:aliasDereferencingProblem - the alias points to an entry outside of the\:aliasProblem - the alias when dereferenced would not name a known object the aliasedObjectName must be set to a valid existing entry.\:aliasDereferencingProblem - the alias points to another alias.  Alias chaining is not supported by this backend.\:Anonymous bind NOT permitted\!\:Cannot authenticate user\:Password not correct for user\:Failed to lookup user for authentication\:Unexpected protectedItem\:Unexpected userClass\:The rootDSE cannot be moved or renamed\!\:Undefined modify operation value of\:The ChangeLog has not been enabled.\:The underlying changelog store does not support searching through it's logs\:The underlying changelog store does not support searching through it's tags\:revision must be greater than or equal to 0\:revision must be less than or equal to the current revision\:Collective attributes cannot be stored in non-collectiveAttributeSubentries\:Cannot operate on collective attributes in non-collectiveAttributeSubentries\:Negation has no child\:Unrecognized branch node operator\:Unrecognized leaf node type\:Unknown match type\:Unrecognized search scope\!\:had incorrect syntax\:The global schema subentry cannot be added since it exists by default.\:already exists\!\:Attempt to add entry\:Can not allow the deletion of the subschemaSubentry\:Trying to add existing value\:Can not allow the renaming of the subschemaSubentry\:A CollectiveAttribute Subentry must have at least one collective Attribute\:Can not allow the move of the subschemaSubentry\:Attempt to search under non-existant entry\:Unknown assertion type\:Failed to expand node\:System partition has wrong name\:Duplicate partition suffix\:The id cannot be set for the partition nexus.\:Grouping many exceptions on root nexus sync()\:not found within the attributeType registry\:The current partition does not have any suffix\:Cannot find a partition for\:userRoot() in org.apache.directory.server.prefs.ServerPreferencesFactory not implemented\!\:Failed to set up node.\:Failed to get SPI.\:Modify operation leaves no structural objectClass for entry\:Modify operation attempts to delete RDN attribute\:Modify operation attempts to delete RDN attribute values in use for\:not found in attribute registry\!\:At least two name components are expected for the dn\:not declared in objectClasses of entry\:More than one value has been provided for the single-valued attribute\:Required attributes\:is syntactically incorrect\:The value is not a valid String\:The value stored in an Human Readable attribute is not a String\:Modify REPLACE operations on schema subentries are not allowed\:Undefined modify operation\:Unknown index into handler array\:Failed to get BC Certificate factory for algorithm\:Bad certificate format.\:Failed to get key factory for algorithm\:Bad private key format.\:Bad public key format.\:Cannot generate key pair for TLS\:Cannot generate self signed certificate.\:not found in DIT.\:is not supported.\:node cannot be null\:objectClasses cannot be null\:Attribute objectClasses should be of id 'objectClass'\:Unrecognized assertion type for refinement node\:Refinement leaf node attribute was\:objectClasses argument cannot be null\:objectClasses attribute must be for ID 'objectClass'\:A subentry must have an objectClass attribute\:does not contain an administrativeRole attribute\! An administrativeRole attribute in the administrative point is required to add a subordinate subentry.\:Failed while parsing subtreeSpecification for\:Will not allow rename operation on entries with administrative descendants.\:Bad value for the OID\:The change log must be enabled to revert to previous log revisions.\:There must be at least one tag to revert to the latest tag.\:can't rename the rootDSE\:Invalid operation on Name\:revision must be less than the current revision\:cannot create an entry under a referral when the Context.REFERRAL is set to 'ignore'\:Directory service is not started.\:Schema load failed\:Cannot execute indirect lookup if it is not the next operation.\:The throwReferral method is not implemented for a Bind operation\:The isReferralThrown method is not implemented for a Bind operation\:The ignoreReferral method is not implemented for a Bind operation\:The isReferralIgnored method is not implemented for a Bind operation\:Cannot set the empty operation context to anything other than the EmptyDN\:NewSuperior must not be null\:The new superior cannot be null for\:represents a move and rename operation.\:newRdn must not be null for a rename\:Failed to initialize interceptor chain.\:Interceptor not found\:Unknown interceptor name\:Other interceptor is using name\:Unexpected exception.\:for new schema entity is not unique.\:for new schema entity does not exist.\:The parent dn of a attributeType should be at most 3 name components in length.\:should be an organizationalUnit.\:should have a relative name of ou\:as this schema already contains this element\:as this schema is not loaded\:as this schema does not contain this element\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' AttributeTypes\:Cannot move a schemaObject from a not loaded schema\:Cannot move a schemaObject to a not loaded schema\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:into the registries, the resulting registries would be inconsistent\:cannot have it's OID changed until all matchingRules using that comparator have been deleted.\:cannot be moved to another schema until all matchingRules using that comparator have been deleted.\:for new schema comparator is not unique.\:The parent dn of a comparator should be at most 3 name components in length.\:The parent entry of a comparator should be an organizationalUnit.\:The parent entry of a comparator should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:The parent dn of a matchingRule should be at most 3 name components in length.\:The parent entry of a matchingRule should be an organizationalUnit.\:The parent entry of a syntax should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:into the registries, we have got some errors\:as there are some dependant SchemaObjects\:cannot have it's OID changed until all matchingRules using that normalizer have been deleted.\:cannot be moved to another schema until all matchingRules using that normalizer have been deleted.\:for new schema normalizer is not unique.\:The parent dn of a normalizer should be at most 3 name components in length.\:The parent entry of a normalizer should be an organizationalUnit.\:The parent entry of a normalizer should have a relative name of ou\:into the registries, the resulting registries would be inconsistent\:from the registries, the resulting registries would be inconsistent\:as the later has descendants' ObjectClasses\:The parent entry of a objectClass should be an organizationalUnit.\:The parent entry of a attributeType should have a relative name of ou\:Only schema entity containers of objectClass organizationalUnit with 3 name components in length can be deleted.\:Can only delete organizationalUnit entity containers with one of the following names\:The parent dn of a schema should be\:Cannot delete schema that has dependents\:Cannot allow rename with rdnAttribute set to\:Moving around schemas is not allowed.\:Unknown modify operation type\:Unwilling to perform operation on schema with missing dependencies\:into the registries, the resulting registries would be inconsistent\:as it does not exist in any schema\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:for new schema syntaxChecker is not unique.\:cannot have it's OID changed until all syntaxes using that syntaxChecker have been deleted.\:cannot be moved to another schema until all syntax using that syntaxChecker have been deleted.\:The parent dn of a syntaxChecker should be at most 3 name components in length.\:The parent entry of a syntaxChecker should be an organizationalUnit.\:into the registries, the resulting registries would be inconsistent\:into the registries, the resulting registries would be inconsistent\:cannot be deleted until all entities using this syntax have also been deleted. The following dependees exist\:The parent dn of a syntax should be at most 3 name components in length.\:The parent entry of a syntax should be an organizationalUnit.\:The following does not conform to the syntaxCheckerDescription syntax\:The following does not conform to the normalizerDescription syntax\:The following does not conform to the comparatorDescription syntax\:The following does not conform to the attributeTypeDescription syntax\:Cannot permit the addition of an attributeType with an invalid super type\:Cannot permit the addition of an attributeType with an invalid syntax\:Cannot permit the addition of an attributeType with an invalid EQUALITY matchingRule\:Cannot permit the addition of an attributeType with an invalid ORDERING matchingRule\:Cannot permit the addition of an attributeType with an invalid SUBSTRINGS matchingRule\:Cannot permit the addition of an attributeType with an no EQUALITY matchingRule\:Cannot permit the addition of an attributeType with which cannot resolve an EQUALITY matchingRule from it's super type.\:Cannot permit the addition of an attributeType with no syntax\:The following does not conform to the objectClassDescription syntax\:Cannot permit the addition of an objectClass with an invalid superior objectClass\:Cannot permit the addition of an objectClass with an invalid attributeType in the mayList\:Cannot permit the addition of an objectClass with an invalid attributeType in the mustList\:The following does not conform to the matchingRuleUseDescription syntax\:The following does not conform to the ldapSyntax description syntax\:Cannot permit the addition of a syntax without the prior creation of a\:The following does not conform to the matchingRuleDescription syntax\:Cannot create a matchingRule that depends on non-existant syntax\:The following does not conform to the ditStructureRuleDescription syntax\:The following does not conform to the ditContentRuleDescription syntax\:The following does not conform to the nameFormDescription syntax\:Not allowed to set the wrappedPartition after initialization.\:Got more than one matchingRule for oid of\:Got more than one attributeType for oid of\:Got more than one syntax for oid of\:Got more than one syntaxChecker for oid of\:Attribute of second rdn in dn\:Got more than one result for the entity name\:Names used for principals must be normalized\!\:Unknown JNDI Context.REFERRAL value of\:Bad serialization, tree\:Null or empty data array is invalid.\:wrong array serialized data format\:Bad tree\:wrong AvlTree serialized data format\:This singleton AvlTree does not support changes since the behavior of alterations on a singleton are undefined.\:Could not find class\:This cursor locks down the key so keywise advances are not allowed.\:singleton must not be null\:orderedSet must not be null\:Cannot request singleton when in ordered set mode.\:Cannot set a singleton when using multiple values\:Already in singleton mode.\:Cannot get ordered set in singleton mode.\:Cannot set a orderedSet when in singleton mode\:Already in ordered set mode.\:Cannot use standard serialization for a ServerAttribute\:Cannot use standard serialization for a ServerEntry\:undefined modification type\:Cannot figure out attribute ID if both args are null\:Cannot take union of attributes with different IDs\!\:does not exist in the schema\:Encountered NamingException on underlying enumeration.\:Not a valid value\:expected string to normalize\:expected byte\:can't move the root DSE\:Unidentified change type value\:Cannot find directory service in environment\:Can't convert\:De-serialization of\:object deserialization stream close() failure\:Serialization of\:object serialization stream close() failure\:Don't know how to interpret\:but could not find it in env\!\:but it was set to null in env\!\:cannot be null.\:cannot specify simple authentication with supplying credentials\:does not contains the mandatory 'cn' attribute for JavaContainer ObjectClass\!\:can't delete the rootDSE\:Do not know how to store Referenceables yet\!\:Do not know how to store References yet\!\:Can't find a way to bind\:using object factories within the context's environment.\:is not an ancestor of this entry\:Both obj and attrs args are null. At least one of these parameters must not be null.\:Encountered parse exception while parsing the filter\:could not parse filter\:Config partition cannot be null\:the config partition is not initialized\:system partition doesn't exist\:yet to implement\:Invalid interceptor order\:Cannot overwrite, config output directory already exists\:Cannot copy non-existant source file\:Should not be hitting root without config/config pattern.\:parent cannot be null\:Failed to authenticate user\:Error during underflow\:Key not found\:BPage not ordered\:Invalid child subordinate key\:Argument 'recman' is null\:Argument 'comparator' is null\:Argument 'comparator' must be serializable\:Argument 'pageSize' must be even\:Argument 'key' is null\:Argument 'value' is null\:Argument 'obj1' is null\:Argument 'obj2' is null\:Platform doesn't support UTF8 encoding\:MRU cache must contain at least one entry\:Cannot add null listener.\:Internal cache cannot be null.\:key cannot be null.\:value cannot be null.\:Cannot create bucket with depth > MAX_DEPTH+1. Depth\:Cannot create deeper directory. Depth\:Argument 'recid' is invalid\:Name directory must exist\:RecordManager has been closed\:bogus block id\:BlockId assigned for transaction block\:transaction count on block\:Argument 'cache' is null\:DataPage.setFirst\:file header magic not OK\:couldn't obtain free translation\:page header magic for block\:page header magic not OK\:allocate of free page?\:free free page?\:free header page?\:Soft reference cache not implemented\:Weak reference cache not implemented\:Invalid cache type\:double get for block\:bad blockid\:in use list not empty at commit time\:in use list not empty at rollback time\:in txn list not empty at rollback time\:In transaction not empty\:Dirty blocks at close time\:inUse blocks at close time\:Offset too large for record header\:Argument 'maxTxns' must be greater than 0.\:Cannot change setting while transactions are pending in the log\:Bad magic on log file\:Unexcepted exception\:Invalid record manager provider\:Not a serialized BTreeRedirect object\:Not a serialized BTreeRedirect object\:this is not an arrayTree container\:this is not a btreeRedirect container\:This cursor can only be used with tables that have duplicate keys enabled.\:Value based advances not supported.\:No Equality MatchingRule available for attribute\:property for an index cannot be set after it has been initialized.\:Cannot set jdbm store property\:Errors encountered on destroy()\:when dereferenced would not name a known object. The aliased ObjectName\:Key comparator cannot be null.\:Value comparator must not be null for tables with duplicate keys.\:Unfortunately this Table without duplicates enabled does not contain a value comparator which is needed to answer your ordering question.\:null for key or value is not valid\:This Cursor does not support duplicate keys.\:Encoder unavailable for\:Error instantiating encoder for\:Decoder unavailable for\:Error accessing decoder for\:Error instantiating decoder for\:AS-REQ PA-ENC-TIMESTAMP padata timestamp, encrypted with the client key\:AS-REP Ticket and TGS-REP Ticket (includes TGS session key or application session key), encrypted with the service key\:AS-REP encrypted part (includes TGS session key or application session key), encrypted with the client key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS session key\:TGS-REQ KDC-REQ-BODY AuthorizationData, encrypted with the TGS authenticator subkey\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator cksum, keyed with the TGS session key\:TGS-REQ PA-TGS-REQ padata AP-REQ Authenticator (includes TGS authenticator subkey), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS session key\:TGS-REP encrypted part (includes application session key), encrypted with the TGS authenticator subkey\:AP-REQ Authenticator cksum, keyed with the application session key\:AP-REQ Authenticator (includes application authenticator subkey), encrypted with the application session key\:AP-REP encrypted part (includes application session subkey), encrypted with the application session key\:KRB-PRIV encrypted part, encrypted with a key chosen by the application\:is not a supported encryption type.\:Callback not supported\:File is too large\:Could not completely read file\:Cannot encode the AuthorizationDataEntry object, the PDU size is\:Account Kerberos key attribute\:Failed to get catalog context\:Failed to get initial context\:Kerberos key should not be a String.\:Can't get a session\:An empty name is not valid in a kerberos name\:A '/' at the end of a Kerberos Name is not valid.\:Failed to connect to the server\:The specified configuration dir\:The expected context entry does not exist\:The entry already exists\:maxObjectSize\:No ASCII encoding\:Can't set option value\:Can't parse string representation\:illegal address\:is not a descendant of DhcpOption\:Can't initialize option field classes\:Max data length\:ASCII encoding unavailable\:Record type to objectClass mapping has not been set.\:ResourceRecord requires STRUCTURAL objectClass\:Invalid search base\:Can't get context at\:Invalid enum value\:SamSubsystem not enabled with key integrity checker\:Entry has null SAM type\:Could not find property\:Expecting entries with SAM type of\:Could not find verifier class\:No public default constructor on class\:Failed on default constructor invocation for class\:column index max is\:not found at search base DN\:Cannot receive NTLM message before sending Type 2 challenge.\:Cannot receive NTLM message after Type 3 has been received.\:Sasl challenge response already completed.\:Cannot send Type 2 challenge before Type 1 response.\:Cannot send Type 2 after it's already sent.\:response was null\:response with zero bytes\:There was a failure during NTLM Type 1 message handling.\:There was a failure during NTLM Type 3 message handling.\:Authentication attempted but the credentials were invalid..\:response with no auhcid or no password\:'0' chars are not allowed in authcid or no password\:The given InitialReponse is incorrect\:Cannot authenticate an invalid authcid DN\:Cannot authenticate the user\:Failed authorization in callback handler.\:Failed on keystore load which should never really happen.\:Failed to create KeyManagerFactory\:Failed to initialize KeyManagerFactory\:Failed to create SSLContext\:Failed to initialize SSLContext\:Failed to create a SSL context.\:Although ExtendedRequests are SingleReplyRequests they're not handled using this base class. They have no target entry unlike the rest of the SingleReplyRequests\:Unidentified single reply request/response type\:Unexpected base scope.\:TimeUnit not supported\:Unsupported protocol type\:Failed to add the extended operation of type\:Failed to add the SASL mechanism with the name\:Failed to add NTLM provider\:Empty ID\:Invalid replica ID\:The following schema directory from the installation layout could not be found\:Unknown SchemaObject type\:Could not find entry at\:Cannot delete entry\:not in value range\:Bind requests only tunnel down into partitions if there are no authenticators to handle the mechanism\:This cursor is empty and cannot return elements\!\:Cannot efficiently search the DIB w/o an index on attribute\:Cannot access element if positioned before first.\:Cannot access element if positioned after last.\:AndCursors are not ordered and do not support positioning by element.\:Cursor has not been positioned yet.\:Could not find matchingRule to use for EqualityNode evaluation\:Unrecognized leaf node\:Unrecognized branch node type\:Unrecognized search scope value for filter scope node\:EqualityCursors only support positioning by element when a user index exists on the asserted attribute.\:Could not find matchingRule to use for GreaterEqNode evaluation\:LessEqCursors only support positioning by element when a user index exists on the asserted attribute.\:chingRule to use for LessEqNode evaluation\:NotCursors are not ordered and do not support positioning by element.\:Scope Cursors are not ordered and do not support positioning by element.\:ScopeNode is not of onelevel scope.\:This is too inefficient without getId() on ServerEntry\:OrCursors are not ordered and do not support positioning by element.\:Must have 2 or more sub-expression Cursors for a disjunction\:PresenceCursors do not support positioning by element without a user index on the presence attribute.\:SubstringCursors may not be ordered and do not support positioning by element.\:Can't delete file\:ScopeNode is not of subtree scope.\:There can only be 2 columns at index 0 and at 1\:You didn't correctly set col names\:Unrecognized mode.\:Unrecognized FilterDialog command\:Cannot process a Request while binding\:Principal is not a valid Name\:Cannot encode the KrbError object, the PDU size is\:Cannot encode the KrbSafeBody object, the PDU size is\:Cannot encode the KrbSafe object, the PDU size is\:Cannot encode the EncKrbPrivPart object, the PDU size is\:Cannot encode the KrbPriv object, the PDU size is\:Cannot encode the KrbCredInfo object, the PDU size is\:Cannot encode the EncKrbCredPart object, the PDU size is\:Cannot encode the KrbCred object, the PDU size is\:Cannot encode the EncTicketPart object, the PDU size is\:Cannot encode the TypedData object, the PDU size is\:The PDU length is null, this is not allowed\:is not a valid KerberosString\:Not a valid log file number\:Not a valid log file offset\:Invalid log file bufferSize/ max size is sepcified bufferSize\:Log Scanner is already closed\:Log content is invalid
#
#TODO: add other error messages from other LDAP implementations such as the following list (from http://en.wikipedia.org/wiki/List_of_LDAP_software)
# Note: removed references to the ones handled above
#
# Apple Open Directory
# FreeIPA
# IBM Tivoli Directory Server
# Mandriva Directory Server
# Novell eDirectory
# OpenDJ - A fork of the OpenDS project
# OpenDS
# Virtual Identity Server from Optimal IdM
# Oracle Internet Directory
# Radiant Logic VDS
# Sun Java System Directory Server
# UnboundID Directory Server[1]
# Univention Corporate Server (with OpenLDAP from Univention)
# DirX Directory from Atos (ex-Siemens)  

ascanalpha.proxydisclosure.name=\u0627\u0641\u0634\u0627 \u067e\u0631\u0648\u06a9\u0633\u06cc
ascanalpha.proxydisclosure.desc={0} proxy server(s) were detected or fingerprinted. This information helps a potential attacker to determine \n - A list of targets for an attack against the application.\n - Potential vulnerabilities on the proxy servers that service the application.\n - The presence or absence of any proxy-based components that might cause attacks against the application to be detected, prevented, or mitigated. 
ascanalpha.proxydisclosure.soln=Disable the 'TRACE' method on the proxy servers, as well as the origin web/application server.\nDisable the 'OPTIONS' method on the proxy servers, as well as the origin web/application server, if it is not required for other purposes, such as 'CORS' (Cross Origin Resource Sharing).\nConfigure the web and application servers with custom error pages, to prevent 'fingerprintable' product-specific error pages being leaked to the user in the event of HTTP errors, such as 'TRACK' requests for non-existent pages.\nConfigure all proxies, application servers, and web servers to prevent disclosure of the technology and version information in the 'Server' and 'X-Powered-By' HTTP response headers.\n
ascanalpha.proxydisclosure.refs=???
ascanalpha.proxydisclosure.attack=\u0631\u062f\u06cc\u0627\u0628\u06cc\u060c \u0631\u0648\u0634 \u0647\u0627\u06cc \u06af\u0632\u06cc\u0646\u0647 \u0647\u0627 \u0628\u0627 \u0647\u062f\u0631 'Max-Forwards'. \u0631\u0648\u0634 TRACK.
ascanalpha.proxydisclosure.extrainfo.unknown=\u0646\u0627\u0634\u0646\u0627\u062e\u062a\u0647
ascanalpha.proxydisclosure.extrainfo.proxyserver.header=Using the TRACE, OPTIONS, and TRACK methods, the following proxy servers have been identified between OWASP ZAP and the application/web server\: 
ascanalpha.proxydisclosure.extrainfo.proxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.webserver.header=\u062f\u0631 \u0632\u06cc\u0631 \u0648\u0628/ \u0628\u0631\u0646\u0627\u0645\u0647 \u0633\u0631\u0648\u0631 \u0645\u0634\u062e\u0635 \u0634\u062f\u0647 \u0627\u0633\u062a\: 
ascanalpha.proxydisclosure.extrainfo.webserver=- {0}
ascanalpha.proxydisclosure.extrainfo.silentproxyserver.header=The following 'silent' proxy servers were identified. Due to their behaviour, it is not known at which point in the network topology these proxy servers reside\:
ascanalpha.proxydisclosure.extrainfo.silentproxyserver=- {0}
ascanalpha.proxydisclosure.extrainfo.traceenabled=The 'TRACE' method is enabled on one or more of the proxy servers, or on the origin server. This method leaks all information submitted from the web browser and proxies back to the user agent. This may facilitate 'Cross Site Tracing' attacks. 

ascanalpha.relativepathconfusion.name=\u067e\u0631\u06cc\u0634\u0627\u0646\u06cc \u0645\u0633\u06cc\u0631 \u0646\u0633\u0628\u06cc
ascanalpha.relativepathconfusion.desc=The web server is configured to serve responses to ambiguous URLs in a manner that is likely to lead to confusion about the correct "relative path" for the URL. Resources (CSS, images, etc) are also specified in the page response using relative, rather than absolute URLs. In an attack, if the web browser parses the "cross-content" response in a permissive manner, or can be tricked into permissively parsing the "cross-content" response, using techniques such as framing, then the web browser may be fooled into interpreting HTML as CSS (or other content types), leading to an XSS vulnerability.
ascanalpha.relativepathconfusion.soln=Web servers and frameworks should be updated to be configured to not serve responses to ambiguous URLs in such a way that the relative path of such URLs could be mis-interpreted by components on either the client side, or server side.\nWithin the application, the correct use of the "<base>" HTML tag in the HTTP response will unambiguously specify the base URL for all relative URLs in the document.\nUse the "Content-Type" HTTP response header to make it harder for the attacker to force the web browser to mis-interpret the content type of the response.\nUse the "X-Content-Type-Options\: nosniff" HTTP response header to prevent the web browser from "sniffing" the content type of the response.\nUse a modern DOCTYPE such as "<\!doctype html>" to prevent the page from being rendered in the web browser using "Quirks Mode", since this results in the content type being ignored by the web browser.\nSpecify the "X-Frame-Options" HTTP response header to prevent Quirks Mode from being enabled in the web browser using framing attacks. 
ascanalpha.relativepathconfusion.refs=http\://www.thespanner.co.uk/2014/03/21/rpo/\nhttps\://hsivonen.fi/doctype/\nhttp\://www.w3schools.com/tags/tag_base.asp
ascanalpha.relativepathconfusion.extrainfo.morethanonebasetag=More than one <base> tag was specified in the HTML <head> tag to define the location for relative URLs, which is not valid.
ascanalpha.relativepathconfusion.extrainfo.nobasetag=No <base> tag was specified in the HTML <head> tag to define the location for relative URLs.
ascanalpha.relativepathconfusion.extrainfo.contenttypeenabled=A Content Type of "{0}" was specified. If the web browser is employing strict parsing rules, this will prevent cross-content attacks from succeeding. Quirks Mode in the web browser would disable strict parsing.  
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledexplicitly=Quirks Mode is explicitly enabled via <meta http-equiv\="{0}", allowing the specified Content Type to be bypassed.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitly=Quirks Mode is implicitly enabled via the use of an old DOCTYPE with PUBLIC id "{0}", allowing the specified Content Type to be bypassed in some web browsers.
ascanalpha.relativepathconfusion.extrainfo.quirksmodeenabledimplicitlynodoctype=Quirks Mode is implicitly enabled via the absence of a DOCTYPE, allowing the specified Content Type to be bypassed.
ascanalpha.relativepathconfusion.extrainfo.nocontenttype=No Content Type was specified, so Quirks Mode is not required to exploit the vulnerability in the web browser. 
ascanalpha.relativepathconfusion.extrainfo.framingallowed=No X-Frame-Options header was specified, so the page can be framed, and this can be used to enable Quirks Mode, allowing the specified Content Type to be bypassed.

ascanalpha.sourcecodedisclosure.desc=\u06a9\u062f \u0645\u0646\u0628\u0639 \u0635\u0641\u062d\u0647 \u0641\u0639\u0644\u06cc \u062a\u0648\u0633\u0637 \u0633\u0631\u0648\u0631 \u0648\u0628 \u0622\u0634\u06a9\u0627\u0631 \u0634\u062f
ascanalpha.sourcecodedisclosure.lfibased.name=\u0627\u0641\u0634\u0627 \u06a9\u062f \u0645\u0646\u0628\u0639 - \u06af\u0646\u062c\u0627\u06cc\u0634 \u0641\u0627\u06cc\u0644
ascanalpha.sourcecodedisclosure.lfibased.soln=Ensure that arbitrary files specified by the user are not included in the output
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=The output for the source code filename [{0}] differs sufficiently from that of the random parameter [{1}], at [{2}%], compared to a threshold of [{3}%]
ascanalpha.sourcecodedisclosure.lfibased.evidence=

ascanalpha.sourcecodedisclosure.gitbased.name=\u0627\u0641\u0634\u0627 \u06a9\u062f \u0645\u0646\u0628\u0639 - git 
ascanalpha.sourcecodedisclosure.gitbased.soln=Ensure that Git metadata files are not deployed to the web server or application server
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=
ascanalpha.sourcecodedisclosure.gitbased.evidence=The source code for [{0}] was extracted using [{1}]

ascanalpha.sqlinjection.mssql.name=SQL \u062a\u0632\u0631\u06cc\u0642 - MsSQL
ascanalpha.sqlinjection.mssql.desc=\u062a\u0632\u0631\u06cc\u0642 SQL (\u0632\u0628\u0627\u0646 \u067e\u0631\u0633 \u0648 \u062c\u0648\u06cc \u0633\u0627\u062e\u062a\u0627\u0631\u06cc) \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u06cc\u0633\u0631 \u0634\u0648\u062f
ascanalpha.sqlinjection.mssql.soln=Do not trust client side input, even if there is client side validation in place. \nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply an 'allow list' of allowed characters, or a 'deny list' of disallowed characters in user input.\nApply the privilege of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanalpha.sqlinjection.mssql.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.mssql.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds.

ascanalpha.sqlinjection.sqlite.name=SQL\u062a\u0632\u0631\u06cc\u0642 - SQLite
ascanalpha.sqlinjection.desc=\u062a\u0632\u0631\u06cc\u0642 SQL (\u0632\u0628\u0627\u0646 \u067e\u0631\u0633 \u0648 \u062c\u0648\u06cc \u0633\u0627\u062e\u062a\u0627\u0631\u06cc) \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0645\u06cc\u0633\u0631 \u0634\u0648\u062f
ascanalpha.sqlinjection.soln=Do not trust client side input, even if there is client side validation in place. \nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply an 'allow list' of allowed characters, or a 'deny list' of disallowed characters in user input.\nApply the privilege of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanalpha.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanalpha.sqlinjection.sqlite.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, parameter value [{2}], which caused the request to take [{3}] milliseconds, when the original unmodified query with value [{4}] took [{5}] milliseconds.
ascanalpha.sqlinjection.sqlite.alert.errorbased.extrainfo=\u067e\u06cc\u0627\u0645 \u062e\u0637\u0627\u06cc SQLite \u0634\u0646\u0627\u062e\u062a\u0647 \u0634\u062f\u0647 \u0632\u06cc\u0631 \u062a\u062d\u0631\u06cc\u06a9 \u0634\u062f\: {0}.
ascanalpha.sqlinjection.sqlite.alert.versionnumber.extrainfo=Using a UNION based SQL Injection attack, and by exploiting SQLite''s dynamic typing mechanism, the SQLite version was determined to be [{0}].\nWith string-based injection points, full SQLite version information can be extracted, but with numeric injection points, only partial SQLite version information can be extracted.\nMore information on SQLite version [{0}] is available at http\://www.sqlite.org/changes.html

ascanalpha.testuseragent.name=Fuzzer \u0639\u0627\u0645\u0644 \u06a9\u0627\u0631\u0628\u0631
ascanalpha.testuseragent.desc=Check for differences in response based on fuzzed User Agent (eg. mobile sites, access as a Search Engine Crawler). Compares the response statuscode and the hashcode of the response body with the original response.
ascanalpha.testuseragent.refs=https\://www.owasp.org/index.php/Web_Application_Security_Testing_Cheat_Sheet
ascanalpha.testuseragent.useragentparmname=\u0647\u062f\u0631 \u06a9\u0627\u0631\u0628\u0631-\u0639\u0627\u0645\u0644

ascanalpha.traceaxdscanner.name=Trace.axd Information Leak
ascanalpha.traceaxdscanner.desc=The ASP.NET Trace Viewer (trace.axd) was found to be available. This component can leak a significant amount of valuable information.
ascanalpha.traceaxdscanner.otherinfo=Based on response status code Trace Viewer may be protected by an authentication or authorization mechanism.  
ascanalpha.traceaxdscanner.refs=https\://msdn.microsoft.com/en-us/library/bb386420.aspx\nhttps\://msdn.microsoft.com/en-us/library/wwh16c6c.aspx\nhttps\://www.dotnetperls.com/trace
ascanalpha.traceaxdscanner.soln=Consider whether or not Trace Viewer is actually required in production, if it isn't then disable it. If it is then ensure access to it requires authentication and authorization. 

