#X-Generator: crowdin.net
# This file defines the default (English) variants of all of the internationalised messages


ascanrules.sqlinjection.desc=SQL injection \uac00\ub2a5\uc131\uc774 \uc758\uc2ec\ub429\ub2c8\ub2e4
ascanrules.sqlinjection.soln=\uc124\ub839, \ud074\ub77c\uc774\uc5b8\ud2b8 \uce21\uc5d0\uc11c \uc720\ud6a8\uc131 \uac80\uc0ac\ub97c \ud558\ub354\ub77c\ub3c4 \ud074\ub77c\uc774\uc5b8\ud2b8 \uce21\uc73c\ub85c\ubd80\ud130 \uc804\ub2ec\ubc1b\ub294 \ub370\uc774\ud130\ub97c \uc2e0\ub8b0\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624. \uc77c\ubc18\uc801\uc73c\ub85c, \uc785\ub825\uac12\uc5d0 \ub300\ud55c \uac80\uc99d\uc740 \uc11c\ubc84 \uce21\uc5d0\uc11c \ubaa8\ub450 \uac80\uc0ac\ud574\uc57c \ud569\ub2c8\ub2e4.\n\uc5b4\ud50c\ub9ac\ucf00\uc774\uc158\uc774 JDBC \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud55c\ub2e4\uba74,  PreparedStatement \ud639\uc740 CallableStatement \ub97c \uc0ac\uc6a9\ud558\ub418 \ud30c\ub77c\uba54\ud130\ub294 '?' \ub97c \ud1b5\ud574 \uc804\ub2ec\ud558\uc2ed\uc2dc\uc624.\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\n\ub9cc\uc57d \ub370\uc774\ud130\ubca0\uc774\uc2a4 \uc800\uc7a5 \ud504\ub85c\uc2dc\uc800\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc788\ub2e4\uba74 \uadf8\uac83\uc744 \uc774\uc6a9\ud558\uc2ed\uc2dc\uc624. Do *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\n\ub2e8\uc21c\ud788 \ubb38\uc790\uc5f4\uc744 \uc870\ud569\ud558\ub294 \ud615\ud0dc\ub85c SQL \ucffc\ub9ac\ubb38\uc744 \uc0dd\uc131\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624.\n\ud074\ub77c\uc774\uc5b8\ud2b8\ub85c\ubd80\ud130 \ubc1b\uc740 \ubaa8\ub4e0 \ub370\uc774\ud130\ub294 \uc774\uc2a4\ucf00\uc774\ud504 \uc2dc\ucf1c\uc57c \ud569\ub2c8\ub2e4.\n\uc0ac\uc6a9\uc790\uc758 \uc785\ub825\uc5d0 \ub300\ud574 \ud5c8\uc6a9\ud560 \ubb38\uc790\ub4e4 \uc9d1\ud569\uc778 '\ud654\uc774\ud2b8\ub9ac\uc2a4\ud2b8', \ud639\uc740 \ud5c8\uc6a9\ud558\uc9c0 \uc54a\uc744 \ubb38\uc790\ub4e4 \uc9d1\ud569\uc778 '\ube14\ub799\ub9ac\uc2a4\ud2b8'\ub97c \uc801\uc6a9\ud558\uc2ed\uc2dc\uc624.\nApply the privilege of least privilege by\nusing the lease privileged database user possible. In particular, avoid using the 'sa' or 'db-owner' users. This does not eliminate SQL injection, but minimizes its impact.\ngranting the minimum database access that is necessary for the application.
ascanrules.sqlinjection.alert.errorbased.attack=[{0}] \ud544\ub4dc\: [{1}] \uac12 [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack=\uae30\ubcf8\uac12\: [{0}]. \ubcc0\uacbd\uac12\: [{1}]. \uc81c\uc5b4\uac12\: [{2}]
ascanrules.sqlinjection.alert.booleanbased.attack=[{0}] \ud544\ub4dc\: [{1}] \uac12 [{2}]
ascanrules.sqlinjection.alert.unionbased.attack=[{0}] \ud544\ub4dc\: [{1}] \uac12 [{2}]

