#X-Generator: crowdin.net
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.authenticationcredentialscaptured.name=Credenciales de autenticaci\u00f3n capturados
pscanbeta.authenticationcredentialscaptured.desc=Mecanismo inseguro de autenticaci\u00f3n en uso.  Esto permite a un atacante obtener los credenciales (ID de usuario y contrase\u00f1a) de un usuario autenticado. Usando el metodo HTTP de autenticaci\u00f3n b\u00e1sica, el atacante simplemente debe vigilar el tr\u00e1fico de la red hasta que se reciba una solicitud de autenticaci\u00f3n b\u00e1sica, y luego descifrar (base64) los credenciales.  Usando el m\u00e9todo HTTP de autenticaci\u00f3n por compendio (hash), el atacante tiene acceso al nombre de usuario y posiblemente la contrase\u00f1a, si el hash (incluyendo la semilla criptogr\u00e1fica) puede ser resuelto o si se monta un ataque Hombre-en-el-Medio (Man-In-The-Middle).     
pscanbeta.authenticationcredentialscaptured.soln=Utilice HTTPS y un mecanismo de autenticaci\u00f3n segura que no transmita el ID de usuario o la contrase\u00f1a sin cifrarlos.  En particular, evite el uso del mecanismo HTTP de autenticaci\u00f3n b\u00e1sica ya que este utiliza un mecanismo de ofuscaci\u00f3n trivial, que se rompe f\u00e1cilmente. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.OWASP.org/index.php/Top_10_2010-a3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29 https\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] utiliza el mecanismo de autenticaci\u00f3n inseguro [{2}], revelando el nombre de usuario [{3}] y contrase\u00f1a [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] utiliza el mecanismo de autenticaci\u00f3n inseguro [{2}], revelando el nombre de usuario [{3}] e informaci\u00f3n adicional [{4}].
pscanbeta.authenticationcredentialscaptured.alert.attack=El atacante fisgonea en la red hasta capturar los credenciales de autenticaci\u00f3n de un usuario.

pscanbeta.insecureauthentication.name=M\u00e9todo de autenticaci\u00f3n d\u00e9bil
pscanbeta.insecureauthentication.desc=M\u00e9todo HTTP de autenticaci\u00f3n b\u00e1sica o por compendio (hash) ha sido utilizado sobre una conexi\u00f3n no segura. Las credenciales pueden ser le\u00eddas y luego reutilizadas por alguien con acceso a la red.
pscanbeta.insecureauthentication.soln=Protege la conexi\u00f3n usando el protocolo HTTPS o alg\u00fan mecanismo de autenticaci\u00f3n fuerte
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=JSF ViewState inseguro
pscanbeta.insecurejsfviewstate.desc=La respuesta a la siguiente direcci\u00f3n URL contiene un valor ViewState que no posee ninguna protecci\u00f3n criptogr\u00e1fica.
pscanbeta.insecurejsfviewstate.soln=VIEWSTATE seguro utilizando un MAC espec\u00edfico a tu entorno
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] es inseguro

pscanbeta.noanticsrftokens.name=Ausencia de fichas (tokens) Anti-CSRF
pscanbeta.noanticsrftokens.desc=No se encontraron fichas (tokens) Anti-CSRF en un formulario HTML.
pscanbeta.noanticsrftokens.alert.attack=Ninguno. S\u00f3lo una advertencia.
pscanbeta.noanticsrftokens.alert.extrainfo=Ninguna ficha (token) Anti-CSRF {0} fue encontrada en los siguientes formularios HTML\: {1}.  
