#X-Generator: crowdin.com
# ascanrulesAlpha 
#
# This file defines the default (English) variants of all of the internationalised messages
ascanalpha.desc=\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3 \u30eb\u30fc\u30eb - \u30a2\u30eb\u30d5\u30a1

ascanalpha.examplefile.name=\u30c7\u30fc\u30bf\u3092\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30ed\u30fc\u30c9\u3059\u308b\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306e\u30b5\u30f3\u30d7\u30eb\u3067\u3059\u3002
ascanalpha.examplefile.desc=\u3053\u3053\u306b\u8a73\u7d30\u306a\u8106\u5f31\u6027\u306e\u60c5\u5831\u3092\u8ffd\u8a18\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.examplefile.other=\u3053\u306e\u9805\u76ee\u306b\u306f\u3001\u4ed6\u306e\u3044\u305a\u308c\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u306b\u3082\u5c5e\u3055\u306a\u3044\u60c5\u5831\u3092\u8a18\u8f09\u3057\u307e\u3059\u3002
ascanalpha.examplefile.soln=\u554f\u984c\u3092\u89e3\u6c7a\u3059\u308b\u65b9\u6cd5\u306e\u4e00\u822c\u7684\u306a\u8aac\u660e\u3092\u8a18\u8f09\u3057\u307e\u3059\u3002
ascanalpha.examplefile.refs=http\://zaproxy.blogspot.co.uk/2014/04/hacking-zap-4-active-scan-rules.html

ascanalpha.sourcecodedisclosure.desc=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u304cWeb\u30b5\u30fc\u30d0\u304b\u3089\u53c2\u7167\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.sourcecodedisclosure.lfibased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - \u30d5\u30a1\u30a4\u30eb\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3
ascanalpha.sourcecodedisclosure.lfibased.soln=\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u6307\u5b9a\u3055\u308c\u305f\u4efb\u610f\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u51fa\u529b\u306b\u542b\u307e\u308c\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.sourcecodedisclosure.lfibased.extrainfo=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u540d [{0}] \u306e\u51fa\u529b\u304c\u3001\u30e9\u30f3\u30c0\u30e0\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc [{1}] \u3092\u4e0e\u3048\u305f\u969b\u306b [{2}%] \u7570\u306a\u3063\u3066\u304a\u308a\u3001\n \u3057\u304d\u3044\u5024 [{3}%] \u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
ascanalpha.sourcecodedisclosure.lfibased.evidence=
ascanalpha.sourcecodedisclosure.svnbased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - SVN
ascanalpha.sourcecodedisclosure.svnbased.soln=SVN \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304c Web \u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3092\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.sourcecodedisclosure.svnbased.extrainfo=[{0}] \u306e\u30bd\u30fc\u30b9 \u30b3\u30fc\u30c9\u304c [{1}] \u304b\u3089\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002
ascanalpha.sourcecodedisclosure.svnbased.evidence=
ascanalpha.sourcecodedisclosure.gitbased.name=\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u9732\u898b - Git
ascanalpha.sourcecodedisclosure.gitbased.soln=Git \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304c Web \u30b5\u30fc\u30d0\u30fc\u3084\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u7f6e\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u78ba\u8a8d\u3092\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.sourcecodedisclosure.gitbased.extrainfo=
ascanalpha.sourcecodedisclosure.gitbased.evidence=[{1}] \u3092\u4f7f\u7528\u3057\u3066 [{0}] \u306e\u30bd\u30fc\u30b9 \u30b3\u30fc\u30c9\u304c\u62bd\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanalpha.backupfiledisclosure.name=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7 \u30d5\u30a1\u30a4\u30eb\u306e\u9732\u898b
ascanalpha.backupfiledisclosure.desc=Web \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u304c\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002
ascanalpha.backupfiledisclosure.soln=Web\u30b5\u30fc\u30d0\u3067\u516c\u958b\u3057\u3066\u3044\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u76f4\u63a5\u7de8\u96c6\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u307e\u305f\u3001\u96a0\u3057\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3081\u3001\u4e0d\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u304cWeb\u30b5\u30fc\u30d0\u3067\u516c\u958b\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ascanalpha.backupfiledisclosure.evidence=[{0}] \u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u304c [{1}] \u3067\u9732\u898b\u3057\u3066\u3044\u307e\u3059\u3002

ascanalpha.elinjection.name=EL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanalpha.elinjection.desc=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c Java Server Page (JSP) \u306e Expression Language Statement (EL\u5f0f) \u3067\u69cb\u6210\u3055\u308c\u3001\u5916\u90e8\u304b\u3089\u306e\u5165\u529b\u3092\u4e0a\u6d41\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u53d7\u3051\u53d6\u308b\u969b\u3001\u5165\u529b\u5024\u304c\u9069\u5207\u306b\u7121\u5bb3\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u7279\u5b9a\u306e\u8981\u7d20\u3092\u57cb\u3081\u8fbc\u3080\u3053\u3068\u3067\u5b9f\u884c\u524d\u306eEL\u5f0f\u3092\u66f8\u304d\u63db\u3048\u308b\u3053\u3068\u304c\u53ef\u80fd\u3067\u3059\u3002\n\nSprint 3.0.5 \u3088\u308a\u4ee5\u524d\u306e\u7279\u5b9a\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u306f\u8106\u5f31\u6027(CVE-2011-2730)\u304c\u5b58\u5728\u3057\u3001EL\u5f0f\u304c2\u5ea6\u8a55\u4fa1\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306bEL\u5f0f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u304c\u5f15\u304d\u8d77\u3053\u3055\u308c\u307e\u3059\u3002\n\u3053\u306e\u8106\u5f31\u6027\u306f\u3001\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Spring \u306b\u304a\u3044\u3066\u3082\u8a2d\u5b9a\u6b21\u7b2c\u3067\u6709\u52b9\u3068\u306a\u308a\u307e\u3059\u3002
ascanalpha.elinjection.soln=Perform data validation best practice against untrusted input and to ensure that output encoding is applied when data arrives on the EL layer, so that no metacharacter is found by the interpreter within the user content before evaluation. The most obvious patterns to detect include ${ and \#{, but it may be possible to encode or fragment this data.
ascanalpha.elinjection.refs=https\://www.owasp.org/index.php/Expression_Language_Injection\nhttp\://cwe.mitre.org/data/definitions/917.html

ascanalpha.heartbleed.name=Heartbleed OpenSSL \u306e\u8106\u5f31\u6027
ascanalpha.heartbleed.desc=The TLS implementation in OpenSSL 1.0.1 before 1.0.1g does not properly handle Heartbeat Extension packets, which allows remote attackers to obtain sensitive information from process memory via crafted packets that trigger a buffer over-read, potentially disclosing sensitive information.
ascanalpha.heartbleed.soln=OpenSSL \u3092 1.0.1g \u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u66f4\u65b0\u3057\u3001HTTPS \u8a3c\u660e\u66f8\u3092\u518d\u767a\u884c\u3057\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u975e\u5bfe\u79f0\u79d8\u5bc6\u9375\u3068\u3001\u5171\u6709\u79d8\u5bc6\u9375\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u6050\u308c\u304c\u3042\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3001\u3053\u308c\u3089\u3092\u5909\u66f4\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.heartbleed.refs=http\://cvedetails.com/cve-details.php?t\=1&cve_id\=CVE-2014-0160
ascanalpha.heartbleed.extrainfo=\u3053\u306e\u554f\u984c\u306f {0} \u3092\u4f7f\u7528\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30c7\u30fc\u30bf\u3092 \u7a83\u53d6\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u8aa4\u691c\u77e5\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u4f4e\u3044\u3067\u3059\u3002

ascanalpha.crossdomain.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9
#the refs cannot be customised for each sub-category (Adobe, Silverlight, etc)
ascanalpha.crossdomain.refs=http\://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html\nhttp\://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttp\://msdn.microsoft.com/en-US/library/cc197955%28v\=vs.95%29.aspx\nhttp\://msdn.microsoft.com/en-us/library/cc838250%28v\=vs.95%29.aspx
ascanalpha.crossdomain.adobe.read.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Read
ascanalpha.crossdomain.adobe.send.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Adobe - Send
ascanalpha.crossdomain.adobe.desc=Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u3063\u3066\u3001Flash \u307e\u305f\u306f Silverlight \u3092\u7528\u3044\u305f \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.crossdomain.adobe.read.soln=\u3053\u306e Web \u30b5\u30fc\u30d0\u3078\u306e\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8aad\u307f\u53d6\u308a\u3092\u5236\u9650\u3059\u308b\u305f\u3081\u3001crossdomain.xml \u30d5\u30a1\u30a4\u30eb\u3092\u69cb\u6210\u3057\u3001 <allow-access-from domain\="example.com"> \u3092\u7528\u3044\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u4f5c\u6210\u3057\u3066\u4e0b\u3055\u3044\u3002\u30b5\u30fc\u30d3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3084\u500b\u4eba\u60c5\u5831\u3092\u30db\u30b9\u30c8\u3057\u306a\u3044\u5834\u5408\u306b\u306e\u307f\u3001"*"(\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3)\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanalpha.crossdomain.adobe.read.extrainfo=The web server permits malicious cross-domain data read requests originating from Flash/Silverlight components served from any third party domain, to this domain. If the victim user is logged into this service, the malicious read requests are processed using the privileges of the victim, and can result in data from this service being compromised by an unauthorised third party web site, via the victim's web browser. This is particularly likely to be an issue if a Cookie based session implementation is in use. 
ascanalpha.crossdomain.adobe.send.soln=Configure the crossdomain.xml file to restrict the list of domains that are allowed to make cross-domain send (but not necessarily read) requests to this web server, using <allow-http-request-headers-from domain\="example.com" headers\="Authorization,X-Blahh">. You should only grant access to "*" (all domains) if you are certain that this service that this service is not vulnerable to Cross Site Request Forgery (CSRF) attacks.
ascanalpha.crossdomain.adobe.send.extrainfo=The web server permits malicious cross-domain data send (but not necessarily read) requests originating from Flash/Silverlight components served from any third party domain, to this domain. If the victim user is logged into this service, the malicious send requests are processed using the privileges of the victim, and can result in Cross Site Request Forgery (CSRF) type attacks, via the victim's web browser. This is particularly likely to be an issue if a Cookie based session implementation is in use.
ascanalpha.crossdomain.silverlight.name=\u30af\u30ed\u30b9 \u30c9\u30e1\u30a4\u30f3\u306e\u8a2d\u5b9a\u30df\u30b9 - Silverlight
ascanalpha.crossdomain.silverlight.desc=Web\u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u3063\u3066\u3001Silverlight \u3092\u7528\u3044\u305f \u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u304c\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
ascanalpha.crossdomain.silverlight.soln=Configure the clientaccesspolicy.xml file to restrict the list of domains that are allowed to make cross-domain requests to this web server, using <domain uri\="https\://example.com" />. You should only grant access to "*" (all domains) if you are certain that this service does not host any access-controlled, personalized, or private data.
ascanalpha.crossdomain.silverlight.extrainfo=The web server permits malicious cross-domain requests originating from Silverlight components served from any third party domain, to this domain. If the victim user is logged into this service, the malicious requests are processed using the privileges of the victim, and can result in data from this service being compromised by an unauthorised third party web site, via the victim's web browsers. It can also result in Cross Site Request Forgery (CSRF) type attacks. This is particularly likely to be an issue if a Cookie based session implementation is in use.

