pscanrules.anticlickjacking.compliance.malformed.setting.desc = \u0423 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0431\u0443\u0432 \u043f\u0440\u0438\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Frame-Options, \u0430\u043b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0431\u0443\u043b\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e.
pscanrules.anticlickjacking.compliance.malformed.setting.name = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 X-Frame-Options \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u043e\u043c\u0438\u043b\u043a\u0438
pscanrules.anticlickjacking.compliance.malformed.setting.refs = https\://tools.ietf.org/html/rfc7034\#section-2.1
pscanrules.anticlickjacking.compliance.malformed.setting.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043d\u0430 \u0432\u0441\u0456\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u0445, \u044f\u043a\u0456 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u0454 \u0432\u0430\u0448 \u0441\u0430\u0439\u0442, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0438\u0439 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 (\u044f\u043a\u0449\u043e \u0432\u0438 \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u0435, \u0449\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u0431\u0443\u0434\u0435 \u043e\u0431\u0440\u0430\u043c\u043b\u0435\u043d\u0430 \u043b\u0438\u0448\u0435 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u043d\u0430 \u0432\u0430\u0448\u043e\u043c\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u044f\u043a\u0449\u043e \u0432\u043e\u043d\u0430 \u0454 \u0447\u0430\u0441\u0442\u0438\u043d\u043e\u044e FRAMESET, \u0432\u0430\u043c \u0441\u043b\u0456\u0434 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 SAMEORIGIN, \u0456\u043d\u0430\u043a\u0448\u0435, \u044f\u043a\u0449\u043e \u0432\u0438 \u043d\u0456\u043a\u043e\u043b\u0438 \u043d\u0435 \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u0435, \u0449\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u0431\u0443\u0434\u0435 \u043e\u0431\u0440\u0430\u043c\u043b\u0435\u043d\u0430, \u0432\u0430\u043c \u0441\u043b\u0456\u0434 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 DENY. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 "frame-ancestors" \u0443 \u043f\u043e\u043b\u0456\u0442\u0438\u0446\u0456 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443.
pscanrules.anticlickjacking.compliance.meta.desc = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u041c\u0415\u0422\u0410 \u0442\u0435\u0433 X-Frame-Options (XFO), \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f XFO \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u041c\u0415\u0422\u0410 \u0442\u0435\u0433\u0443 \u044f\u0432\u043d\u043e \u043d\u0435 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454\u0442\u044c\u0441\u044f \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0454\u044e (RFC 7034).
pscanrules.anticlickjacking.compliance.meta.name = \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 X-Frame, \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0456 \u0447\u0435\u0440\u0435\u0437 META (\u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457)
pscanrules.anticlickjacking.compliance.meta.refs = https\://tools.ietf.org/html/rfc7034\#section-4
pscanrules.anticlickjacking.compliance.meta.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 X-Frame-Options \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abframe-ancestors\u00bb \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443.
pscanrules.anticlickjacking.incInCsp = Content-Security-Policy \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u00abframe-ancestors\u00bb, \u044f\u043a\u0438\u0439 \u043c\u0430\u0454 \u043f\u0435\u0440\u0435\u0432\u0430\u0433\u0443 \u043d\u0430\u0434 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c X-Frame-Options, \u0442\u043e\u043c\u0443 \u0446\u0435 \u0431\u0443\u043b\u043e \u043f\u0456\u0434\u043d\u044f\u0442\u043e \u0437 \u041d\u0418\u0417\u042c\u041a\u0418\u041c \u0440\u0438\u0437\u0438\u043a\u043e\u043c.
pscanrules.anticlickjacking.missing.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0430\u043d\u0456 Content-Security-Policy \u0437 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u043e\u044e \u00abframe-ancestors\u00bb, \u0430\u043d\u0456 X-Frame-Options \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0432\u0456\u0434 \u0430\u0442\u0430\u043a \u00abClickJacking\u00bb.
pscanrules.anticlickjacking.missing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u0432\u0456\u0434 \u043a\u043b\u0456\u043a\u0434\u0436\u0435\u043a\u0456\u043d\u0433\u0443
pscanrules.anticlickjacking.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
pscanrules.anticlickjacking.missing.soln = \u0421\u0443\u0447\u0430\u0441\u043d\u0456 \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0438 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u044e\u0442\u044c HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 Content-Security-Policy \u0456 X-Frame-Options. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043e\u0434\u0438\u043d \u0456\u0437 \u043d\u0438\u0445 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043d\u0430 \u0432\u0441\u0456\u0445 \u0432\u0435\u0431-\u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u0445, \u044f\u043a\u0456 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u0454 \u0432\u0430\u0448 \u0441\u0430\u0439\u0442/\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430.\n\u042f\u043a\u0449\u043e \u0432\u0438 \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u0435, \u0449\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u0431\u0443\u0434\u0435 \u043e\u0431\u0440\u0430\u043c\u043b\u0435\u043d\u0430 \u043b\u0438\u0448\u0435 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430\u043c\u0438 \u043d\u0430 \u0432\u0430\u0448\u043e\u043c\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0446\u0435 \u0447\u0430\u0441\u0442\u0438\u043d\u0430 FRAMESET), \u0442\u043e\u0434\u0456 \u0432\u0438 \u0437\u0430\u0445\u043e\u0447\u0435\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 SAMEORIGIN, \u0456\u043d\u0430\u043a\u0448\u0435, \u044f\u043a\u0449\u043e \u0432\u0438 \u043d\u0456\u043a\u043e\u043b\u0438 \u043d\u0435 \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u0435, \u0449\u043e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u0431\u0443\u0434\u0435 \u043e\u0431\u0440\u0430\u043c\u043b\u0435\u043d\u0430, \u0432\u0430\u043c \u0441\u043b\u0456\u0434 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 DENY. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00abframe-ancestors\u00bb \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443.
pscanrules.anticlickjacking.multiple.header.desc = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 X-Frame-Options (XFO), \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456\u0437 \u043a\u0456\u043b\u044c\u043a\u043e\u043c\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u043c\u0438 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 XFO \u043c\u043e\u0436\u0435 \u043d\u0435 \u043f\u0435\u0440\u0435\u0434\u0431\u0430\u0447\u0443\u0432\u0430\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u0442\u0438\u0441\u044f \u0432\u0441\u0456\u043c\u0430 \u0430\u0433\u0435\u043d\u0442\u0430\u043c\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430.
pscanrules.anticlickjacking.multiple.header.name = \u041a\u0456\u043b\u044c\u043a\u0430 \u0437\u0430\u043f\u0438\u0441\u0456\u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 X-Frame-Options
pscanrules.anticlickjacking.multiple.header.refs = https\://tools.ietf.org/html/rfc7034
pscanrules.anticlickjacking.multiple.header.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043f\u0440\u0438\u0441\u0443\u0442\u043d\u0456\u0439 \u043b\u0438\u0448\u0435 \u043e\u0434\u0438\u043d \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Frame-Options.
pscanrules.anticlickjacking.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u0440\u043e\u0442\u0438 \u043a\u043b\u0456\u043a\u0434\u0436\u0435\u043a\u0456\u043d\u0433\u0443

pscanrules.applicationerrors.desc = \u0426\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0430\u0431\u043e \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u0436\u0435\u043d\u043d\u044f, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u044f\u043a-\u043e\u0442 \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0443, \u044f\u043a\u0438\u0439 \u0441\u0442\u0432\u043e\u0440\u0438\u0432 \u043d\u0435\u043e\u0431\u0440\u043e\u0431\u043b\u0435\u043d\u0443 \u0432\u0438\u043d\u044f\u0442\u043a\u043e\u0432\u0443 \u0441\u0438\u0442\u0443\u0430\u0446\u0456\u044e. \u0426\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0438\u0445 \u0430\u0442\u0430\u043a \u043d\u0430 \u0432\u0435\u0431\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443. \u0421\u043f\u043e\u0432\u0456\u0449\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u043e\u043c\u0438\u043b\u043a\u043e\u0432\u0438\u043c, \u044f\u043a\u0449\u043e \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0443 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430\u0446\u0456\u0457.
pscanrules.applicationerrors.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u043f\u043e\u043c\u0438\u043b\u043e\u043a \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438
pscanrules.applicationerrors.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0432\u0438\u0445\u0456\u0434\u043d\u0438\u0439 \u043a\u043e\u0434 \u0446\u0456\u0454\u0457 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438. \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0438\u0442\u0438 \u0432\u043b\u0430\u0441\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u043f\u043e\u043c\u0438\u043b\u043e\u043a. \u0420\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u0443 \u043d\u0430\u0434\u0430\u043d\u043d\u044f \u043a\u043b\u0456\u0454\u043d\u0442\u0443 (\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0443) \u0443\u043d\u0456\u043a\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f/\u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u043f\u043e\u043c\u0438\u043b\u043a\u0438, \u0440\u0435\u0454\u0441\u0442\u0440\u0443\u044e\u0447\u0438 \u0434\u0435\u0442\u0430\u043b\u0456 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0442\u0430 \u043d\u0435 \u0432\u0456\u0434\u043a\u0440\u0438\u0432\u0430\u044e\u0447\u0438 \u0457\u0445 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430.

pscanrules.authenticationcredentialscaptured.alert.basicauth.extrainfo = [{0}] [{1}] \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 [{2}] \u0442\u0430 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0454 \u0456\u043c\u2019\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 [{3}] \u0456 \u043f\u0430\u0440\u043e\u043b\u044c [{4}].
pscanrules.authenticationcredentialscaptured.alert.digestauth.extrainfo = [{0}] [{1}] \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 [{2}] \u0442\u0430 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0454 \u0456\u043c\u2019\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 [{3}] \u0456 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e [{4}].
pscanrules.authenticationcredentialscaptured.desc = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457. \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0442\u0430 \u043f\u0430\u0440\u043e\u043b\u044f \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u0414\u043b\u044f \u0431\u0430\u0437\u043e\u0432\u043e\u0457 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043f\u043e\u0432\u0438\u043d\u0435\u043d \u043f\u0440\u043e\u0441\u0442\u043e \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u043c\u0435\u0440\u0435\u0436\u0435\u0432\u0438\u0439 \u0442\u0440\u0430\u0444\u0456\u043a, \u0434\u043e\u043a\u0438 \u043d\u0435 \u0431\u0443\u0434\u0435 \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0437\u0430\u043f\u0438\u0442 \u043d\u0430 \u0431\u0430\u0437\u043e\u0432\u0443 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044e, \u0430 \u043f\u043e\u0442\u0456\u043c \u0440\u043e\u0437\u043a\u043e\u0434\u0443\u0432\u0430\u0442\u0438 base64 \u0456\u043c\u2019\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0442\u0430 \u043f\u0430\u0440\u043e\u043b\u044c. \u0414\u043b\u044f \u0434\u0430\u0439\u0434\u0436\u0435\u0441\u0442 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u0430\u0454 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0456\u043c\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0442\u0430, \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u0442\u0430\u043a\u043e\u0436 \u0434\u043e \u043f\u0430\u0440\u043e\u043b\u044f, \u044f\u043a\u0449\u043e \u0433\u0435\u0448 (\u0432\u043a\u043b\u044e\u0447\u043d\u043e \u0437 \u043e\u0434\u043d\u043e\u0440\u0430\u0437\u043e\u0432\u0438\u043c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u043e\u043c) \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0443\u0441\u043f\u0456\u0448\u043d\u043e \u0437\u043b\u0430\u043c\u0430\u043d\u0438\u0439 \u0430\u0431\u043e \u044f\u043a\u0449\u043e \u0432\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u0430\u0442\u0430\u043a\u0443 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043c \u043f\u043e\u0441\u0435\u0440\u0435\u0434\u043d\u0438\u043a\u043e\u043c.\n\u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u0441\u043b\u0456\u0434\u043a\u0443\u0432\u0430\u0442\u0438\u043c\u0435 \u0437\u0430 \u043c\u0435\u0440\u0435\u0436\u0435\u044e, \u0434\u043e\u043a\u0438 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044f \u043d\u0435 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u044c\u0441\u044f.
pscanrules.authenticationcredentialscaptured.name = \u0417\u0430\u0444\u0456\u043a\u0441\u043e\u0432\u0430\u043d\u043e \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u0456 \u0434\u0430\u043d\u0456 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457
pscanrules.authenticationcredentialscaptured.refs = https\://owasp.org/www-community/attacks/Brute_force_attack\nhttps\://en.wikipedia.org/wiki/Digest_access_authentication
pscanrules.authenticationcredentialscaptured.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 HTTPS \u0456 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457, \u044f\u043a\u0438\u0439 \u043d\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u0454 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0447\u0438 \u043f\u0430\u0440\u043e\u043b\u044c \u0443 \u043d\u0435\u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e\u043c\u0443 \u0432\u0438\u0433\u043b\u044f\u0434\u0456. \u0417\u043e\u043a\u0440\u0435\u043c\u0430, \u0443\u043d\u0438\u043a\u0430\u0439\u0442\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c\u0443 \u0431\u0430\u0437\u043e\u0432\u043e\u0457 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0446\u0435\u0439 \u0442\u0440\u0438\u0432\u0456\u0430\u043b\u044c\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0437\u0430\u043f\u043b\u0443\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u043b\u0435\u0433\u043a\u043e \u0437\u043b\u0430\u043c\u0430\u0442\u0438.

pscanrules.bigredirects.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0432 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f\u043c, \u044f\u043a\u0435, \u0437\u0434\u0430\u0454\u0442\u044c\u0441\u044f, \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u0432\u0435\u043b\u0438\u043a\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043e\u0437\u043d\u0430\u0447\u0430\u0442\u0438, \u0449\u043e \u0445\u043e\u0447\u0430 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0432 \u043f\u0435\u0440\u0435\u0441\u043f\u0440\u044f\u043c\u0443\u0432\u0430\u043d\u043d\u044f, \u0432\u0456\u043d \u0442\u0430\u043a\u043e\u0436 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0432 \u043e\u0441\u043d\u043e\u0432\u043d\u0438\u043c \u0432\u043c\u0456\u0441\u0442\u043e\u043c (\u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0442\u043e\u0449\u043e).
pscanrules.bigredirects.extrainfo = \u0414\u043e\u0432\u0436\u0438\u043d\u0430 URI \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f\: {0} [{1}].\n\u041f\u0440\u043e\u0433\u043d\u043e\u0437\u043e\u0432\u0430\u043d\u0438\u0439 \u0440\u043e\u0437\u043c\u0456\u0440 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456\: {2}.\n\u0414\u043e\u0432\u0436\u0438\u043d\u0430 \u0442\u0456\u043b\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456\: {3}.
pscanrules.bigredirects.multi.desc = The server has responded with a redirect that seems to contain multiple links. This may indicate that although the server sent a redirect it also responded with body content links (which may include sensitive details, PII, lead to admin panels, etc.).
pscanrules.bigredirects.multi.extrainfo = The response contained {0} occurrences of "HREF".
pscanrules.bigredirects.multi.name = Multiple HREFs Redirect Detected (Potential Sensitive Information Leak)
pscanrules.bigredirects.name = \u0412\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0432\u0435\u043b\u0438\u043a\u0435 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f (\u043c\u043e\u0436\u043b\u0438\u0432\u0438\u0439 \u0432\u0438\u0442\u0456\u043a \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457)
pscanrules.bigredirects.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u043d\u0435 \u0432\u0438\u0442\u0456\u043a\u0430\u0454 \u0447\u0435\u0440\u0435\u0437 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f. \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u043c\u0430\u0439\u0436\u0435 \u043d\u0435 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u043c\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442\u0443.

pscanrules.cachecontrol.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u043a\u0435\u0448-\u043f\u0430\u043c\u2019\u044f\u0442\u0442\u044e \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0430\u0431\u043e \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0443 \u0442\u0430 \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442. \u0414\u043b\u044f \u0441\u0442\u0430\u0442\u0438\u0447\u043d\u0438\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u044f\u043a-\u043e\u0442 css, js \u0430\u0431\u043e \u0444\u0430\u0439\u043b\u0456\u0432 \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u044c, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0434\u0431\u0430\u0447\u0435\u043d\u043e, \u043e\u0434\u043d\u0430\u043a \u0440\u0435\u0441\u0443\u0440\u0441\u0438 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442 \u043d\u0435 \u043a\u0435\u0448\u0443\u0454\u0442\u044c\u0441\u044f.
pscanrules.cachecontrol.name = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u043a\u0435\u0448-\u043f\u0430\u043c\u2019\u044f\u0442\u0442\u044e
pscanrules.cachecontrol.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html\#web-content-caching\nhttps\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cache-Control\nhttps\://grayduck.mn/2021/09/13/cache-control-recommendations/
pscanrules.cachecontrol.soln = \u0414\u043b\u044f \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043b\u044f HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u043a\u0435\u0448-\u043f\u0430\u043c\u2019\u044f\u0442\u0442\u044e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u00abno-cache, no-store, must-revalidate\u00bb. \u042f\u043a\u0449\u043e \u0430\u043a\u0442\u0438\u0432 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u043a\u0435\u0448\u0443\u0432\u0430\u0442\u0438, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432 \u00abpublic, max-age, immutable\u00bb.

pscanrules.charsetmismatch.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u0454 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0434\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Content-Type \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454 \u043d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432, \u0432\u0456\u0434\u043c\u0456\u043d\u043d\u0438\u0439 \u0432\u0456\u0434 \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432, \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e\u0433\u043e \u0442\u0456\u043b\u043e\u043c HTML \u0430\u0431\u043e XML. \u042f\u043a\u0449\u043e \u0456\u0441\u043d\u0443\u0454 \u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043d\u0430\u0431\u043e\u0440\u0443 \u043a\u043e\u0434\u0456\u0432 \u043c\u0456\u0436 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c HTTP \u0442\u0430 \u0442\u0456\u043b\u043e\u043c \u0432\u043c\u0456\u0441\u0442\u0443, \u0432\u0435\u0431-\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0438 \u043c\u043e\u0436\u0443\u0442\u044c \u043f\u0435\u0440\u0435\u0439\u0442\u0438 \u0432 \u043d\u0435\u0431\u0430\u0436\u0430\u043d\u0438\u0439 \u0440\u0435\u0436\u0438\u043c \u043f\u0435\u0440\u0435\u0445\u043e\u043f\u043b\u0435\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443, \u0449\u043e\u0431 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0438\u0439 \u043d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0432\u043c\u0456\u0441\u0442\u0443.\n\n\u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043c\u0430\u043d\u0456\u043f\u0443\u043b\u044e\u0432\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442\u043e\u043c \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456, \u0449\u043e\u0431 \u0432\u0456\u043d \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0443\u0432\u0430\u0432\u0441\u044f \u0432 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u0456 \u043d\u0430 \u0441\u0432\u0456\u0439 \u0432\u0438\u0431\u0456\u0440. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u044f\u043a\u0449\u043e \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442 \u043d\u0430 \u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0432\u0456\u043d \u043c\u043e\u0436\u0435 \u0432\u0441\u0442\u0430\u0432\u0438\u0442\u0438 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u0442\u0435\u043a\u0441\u0442 \u0443 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u0456 UTF-7, \u0456 \u0437\u043c\u0443\u0441\u0438\u0442\u0438 \u0434\u0435\u044f\u043a\u0456 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0438 \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0443\u0432\u0430\u0442\u0438 \u0446\u0435\u0439 \u0442\u0435\u043a\u0441\u0442.
pscanrules.charsetmismatch.extrainfo.html.header_metacharset_mismatch = \u0412\u0438\u043d\u0438\u043a\u043b\u0430 \u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0436 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c \u0456 \u0434\u0435\u043a\u043b\u0430\u0440\u0430\u0446\u0456\u0454\u044e \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f META-\u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432\: [{0}] \u0456 [{1}] \u043d\u0435 \u0437\u0431\u0456\u0433\u0430\u044e\u0442\u044c\u0441\u044f.
pscanrules.charsetmismatch.extrainfo.html.header_metacontentype_mismatch = \u0412\u0438\u043d\u0438\u043a\u043b\u0430 \u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0436 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c \u0456 \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f\u043c\u0438 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443 META\: [{0}] \u0456 [{1}] \u043d\u0435 \u0437\u0431\u0456\u0433\u0430\u044e\u0442\u044c\u0441\u044f.
pscanrules.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch = \u0412\u0438\u043d\u0438\u043a\u043b\u0430 \u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0436 \u043d\u0430\u0431\u043e\u0440\u043e\u043c \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 META \u0442\u0430 \u0434\u0435\u043a\u043b\u0430\u0440\u0430\u0446\u0456\u0454\u044e \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443 META\: [{0}] \u0456 [{1}] \u043d\u0435 \u0437\u0431\u0456\u0433\u0430\u044e\u0442\u044c\u0441\u044f.
pscanrules.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing = \u041d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u041c\u0415\u0422\u0410 \u043d\u0430\u0431\u043e\u0440\u043e\u043c \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432, \u0441\u0442\u0430\u0440\u0456\u0448\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0438, \u044f\u043a\u0456 \u043e\u0447\u0456\u043a\u0443\u044e\u0442\u044c, \u0449\u043e \u043d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0431\u0443\u0434\u0435 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u041c\u0415\u0422\u0410 \u0442\u0438\u043f\u043e\u043c \u0432\u043c\u0456\u0441\u0442\u0443, \u043c\u043e\u0436\u0443\u0442\u044c \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0437\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438 \u0446\u0435\u0439 \u0432\u043c\u0456\u0441\u0442.
pscanrules.charsetmismatch.extrainfo.xml = \u0412\u0438\u043d\u0438\u043a\u043b\u0430 \u043d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043c\u0456\u0436 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u043e\u043c \u0456 \u0434\u0435\u043a\u043b\u0430\u0440\u0430\u0446\u0456\u0454\u044e \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f XML\: [{0}] \u0456 [{1}] \u043d\u0435 \u0437\u0431\u0456\u0433\u0430\u044e\u0442\u044c\u0441\u044f.
pscanrules.charsetmismatch.name = \u041d\u0435\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456\u0441\u0442\u044c \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f
pscanrules.charsetmismatch.refs = https\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanrules.charsetmismatch.soln = \u041f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 UTF-8 \u0434\u043b\u044f \u0432\u0441\u044c\u043e\u0433\u043e \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443 \u044f\u043a \u0443 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443, \u0442\u0430\u043a \u0456 \u0432 \u043c\u0435\u0442\u0430\u0442\u0435\u0433\u0430\u0445 \u0443 HTML \u0430\u0431\u043e \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f\u0445 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0432 XML.
pscanrules.charsetmismatch.variant.header_metacharset_mismatch = (\u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u0440\u043e\u0442\u0438 \u043c\u0435\u0442\u0430\u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432)
pscanrules.charsetmismatch.variant.header_metacontentype_mismatch = (\u041d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0442\u0438\u043f\u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0442\u0430 \u043c\u0435\u0442\u0430\u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0443)
pscanrules.charsetmismatch.variant.metacontenttype_metacharset_mismatch = (\u041c\u0435\u0442\u0430\u043d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043f\u0440\u043e\u0442\u0438 \u043c\u0435\u0442\u0430\u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443)
pscanrules.charsetmismatch.variant.no_mismatch_metacontenttype_missing = (\u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u043d\u0430\u0431\u0456\u0440 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u043c\u0435\u0442\u0430\u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0443)

pscanrules.contentsecuritypolicymissing.desc = \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP) \u2014 \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u0442\u0430 \u043f\u043e\u043c\u2019\u044f\u043a\u0448\u0443\u0432\u0430\u0442\u0438 \u043f\u0435\u0432\u043d\u0456 \u0442\u0438\u043f\u0438 \u0430\u0442\u0430\u043a, \u0437\u043e\u043a\u0440\u0435\u043c\u0430 \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0456 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457 (XSS) \u0456 \u0430\u0442\u0430\u043a\u0438 \u0437 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u0434\u0430\u043d\u0438\u0445. \u0426\u0456 \u0430\u0442\u0430\u043a\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0432\u0441\u044c\u043e\u0433\u043e\: \u0432\u0456\u0434 \u043a\u0440\u0430\u0434\u0456\u0436\u043a\u0438 \u0434\u0430\u043d\u0438\u0445 \u0434\u043e \u043f\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0430\u0439\u0442\u0443 \u0447\u0438 \u0440\u043e\u0437\u043f\u043e\u0432\u0441\u044e\u0434\u0436\u0435\u043d\u043d\u044f \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0433\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e\u0433\u043e \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f. CSP \u043d\u0430\u0434\u0430\u0454 \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431-\u0441\u0430\u0439\u0442\u0456\u0432 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0432\u0430\u0442\u0438 \u0441\u0445\u0432\u0430\u043b\u0435\u043d\u0456 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u0432\u043c\u0456\u0441\u0442\u0443, \u044f\u043a\u0456 \u0432\u0435\u0431-\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0447\u0456 \u043c\u0430\u044e\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0432\u0430\u0442\u0438 \u043d\u0430 \u0446\u044e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u2014 \u043e\u0445\u043e\u043f\u043b\u044e\u044e\u0442\u044c\u0441\u044f \u0442\u0438\u043f\u0438\: JavaScript, CSS, \u0444\u0440\u0435\u0439\u043c\u0438 HTML, \u0448\u0440\u0438\u0444\u0442\u0438, \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u0432\u0431\u0443\u0434\u043e\u0432\u0430\u043d\u0456 \u043e\u0431\u2019\u0454\u043a\u0442\u0438, \u0442\u0430\u043a\u0456 \u044f\u043a \u0430\u043f\u043b\u0435\u0442\u0438 Java, ActiveX, \u0430\u0443\u0434\u0456\u043e- \u0442\u0430 \u0432\u0456\u0434\u0435\u043e\u0444\u0430\u0439\u043b\u0438.
pscanrules.contentsecuritypolicymissing.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP) \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e
pscanrules.contentsecuritypolicymissing.obs.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 \u00abX-Content-Security-Policy\u00bb \u0442\u0430 \u00abX-WebKit-CSP\u00bb \u0431\u0456\u043b\u044c\u0448\u0435 \u043d\u0435 \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u044e\u0442\u044c\u0441\u044f.
pscanrules.contentsecuritypolicymissing.obs.name = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u043e\u0457 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP).
pscanrules.contentsecuritypolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/Security/CSP/Introducing_Content_Security_Policy\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Content_Security_Policy_Cheat_Sheet.html\nhttps\://www.w3.org/TR/CSP/\nhttps\://w3c.github.io/webappsec-csp/\nhttps\://web.dev/articles/csp\nhttps\://caniuse.com/\#feat\=contentsecuritypolicy\nhttps\://content-security-policy.com/
pscanrules.contentsecuritypolicymissing.ro.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u043b\u0430 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Security-Policy-Report-Only, \u0446\u0435 \u043c\u043e\u0436\u0435 \u0441\u0432\u0456\u0434\u0447\u0438\u0442\u0438 \u043f\u0440\u043e \u043d\u0435\u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u0443 \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u044e \u0430\u0431\u043e \u043d\u0435\u0434\u043e\u0433\u043b\u044f\u0434 \u0443 \u043f\u0440\u043e\u0441\u0443\u0432\u0430\u043d\u043d\u0456 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u044c\u043e\u0433\u043e \u0432\u0438\u043f\u0443\u0441\u043a\u0443 \u0434\u043e \u0440\u043e\u0431\u043e\u0447\u043e\u0433\u043e \u0442\u043e\u0449\u043e.\n\n\u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP) \u2014 \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u0442\u0430 \u043f\u043e\u043c\u2019\u044f\u043a\u0448\u0443\u0432\u0430\u0442\u0438 \u043f\u0435\u0432\u043d\u0456 \u0442\u0438\u043f\u0438 \u0430\u0442\u0430\u043a, \u0437\u043e\u043a\u0440\u0435\u043c\u0430 \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0456 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457 (XSS) \u0456 \u0430\u0442\u0430\u043a\u0438 \u0437 \u0432\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f\u043c \u0434\u0430\u043d\u0438\u0445. \u0426\u0456 \u0430\u0442\u0430\u043a\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0432\u0441\u044c\u043e\u0433\u043e\: \u0432\u0456\u0434 \u043a\u0440\u0430\u0434\u0456\u0436\u043a\u0438 \u0434\u0430\u043d\u0438\u0445 \u0434\u043e \u043f\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0430\u0439\u0442\u0443 \u0447\u0438 \u0440\u043e\u0437\u043f\u043e\u0432\u0441\u044e\u0434\u0436\u0435\u043d\u043d\u044f \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u043e\u0433\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043d\u043e\u0433\u043e \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0435\u043d\u043d\u044f. CSP \u043d\u0430\u0434\u0430\u0454 \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431-\u0441\u0430\u0439\u0442\u0456\u0432 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0432\u0430\u0442\u0438 \u0441\u0445\u0432\u0430\u043b\u0435\u043d\u0456 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u0432\u043c\u0456\u0441\u0442\u0443, \u044f\u043a\u0456 \u0432\u0435\u0431-\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0447\u0456 \u043c\u0430\u044e\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0432\u0430\u0442\u0438 \u043d\u0430 \u0446\u044e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u2014 \u043e\u0445\u043e\u043f\u043b\u044e\u044e\u0442\u044c\u0441\u044f \u0442\u0438\u043f\u0438\: JavaScript, CSS, \u0444\u0440\u0435\u0439\u043c\u0438 HTML, \u0448\u0440\u0438\u0444\u0442\u0438, \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u0432\u0431\u0443\u0434\u043e\u0432\u0430\u043d\u0456 \u043e\u0431\u2019\u0454\u043a\u0442\u0438, \u0442\u0430\u043a\u0456 \u044f\u043a \u0430\u043f\u043b\u0435\u0442\u0438 Java, ActiveX, \u0430\u0443\u0434\u0456\u043e- \u0442\u0430 \u0432\u0456\u0434\u0435\u043e\u0444\u0430\u0439\u043b\u0438.
pscanrules.contentsecuritypolicymissing.ro.name = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043b\u0438\u0448\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0437\u0432\u0456\u0442\u0443 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP).
pscanrules.contentsecuritypolicymissing.ro.refs = https\://www.w3.org/TR/CSP2/\nhttps\://w3c.github.io/webappsec-csp/\nhttps\://caniuse.com/\#feat\=contentsecuritypolicy\nhttps\://content-security-policy.com/
pscanrules.contentsecuritypolicymissing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Content-Security-Policy.

pscanrules.contenttypemissing.desc = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Type \u0431\u0443\u0432 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0430\u0431\u043e \u043f\u043e\u0440\u043e\u0436\u043d\u0456\u0439.
pscanrules.contenttypemissing.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Type
pscanrules.contenttypemissing.name.empty = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Type \u043f\u043e\u0440\u043e\u0436\u043d\u0456\u0439
pscanrules.contenttypemissing.refs = https\://learn.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v\=vs.85)
pscanrules.contenttypemissing.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043d\u0430 \u043a\u043e\u0436\u043d\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u0435 \u0442\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0442\u0438\u043f\u0443 \u0432\u043c\u0456\u0441\u0442\u0443 \u0434\u043b\u044f \u0432\u043c\u0456\u0441\u0442\u0443, \u044f\u043a\u0438\u0439 \u0434\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0454\u0442\u044c\u0441\u044f.

pscanrules.cookiehttponly.desc = Cookie \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0431\u0435\u0437 \u043f\u0440\u0430\u043f\u043e\u0440\u0446\u044f HttpOnly, \u0449\u043e \u043e\u0437\u043d\u0430\u0447\u0430\u0454, \u0449\u043e JavaScript \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0434\u043e \u0444\u0430\u0439\u043b\u0443 cookie. \u042f\u043a\u0449\u043e \u043d\u0430 \u0446\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u043c\u043e\u0436\u043d\u0430 \u0437\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u0438 \u0448\u043a\u0456\u0434\u043b\u0438\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439, \u0444\u0430\u0439\u043b cookie \u0431\u0443\u0434\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u043c \u0456 \u0439\u043e\u0433\u043e \u043c\u043e\u0436\u043d\u0430 \u0431\u0443\u0434\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u0442\u0438 \u043d\u0430 \u0456\u043d\u0448\u0438\u0439 \u0441\u0430\u0439\u0442. \u042f\u043a\u0449\u043e \u0446\u0435 \u0441\u0435\u0430\u043d\u0441\u043e\u0432\u0438\u0439 \u0444\u0430\u0439\u043b cookie, \u043c\u043e\u0436\u043b\u0438\u0432\u043e \u0432\u0438\u043a\u0440\u0430\u0434\u0435\u043d\u043d\u044f \u0441\u0435\u0430\u043d\u0441\u0443.
pscanrules.cookiehttponly.name = \u041f\u0440\u0430\u043f\u043e\u0440\u0435\u0446\u044c HttpOnly \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439
pscanrules.cookiehttponly.refs = https\://owasp.org/www-community/HttpOnly
pscanrules.cookiehttponly.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u0430\u043f\u043e\u0440\u0435\u0446\u044c HttpOnly.

pscanrules.cookielooselyscoped.desc = \u0424\u0430\u0439\u043b\u0438 cookie \u043c\u043e\u0436\u043d\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0437\u0430 \u0434\u043e\u043c\u0435\u043d\u043e\u043c \u0430\u0431\u043e \u0448\u043b\u044f\u0445\u043e\u043c. \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0441\u0442\u043e\u0441\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u043e\u0431\u043b\u0430\u0441\u0442\u0456 \u0434\u043e\u043c\u0435\u043d\u0443. \u041e\u0431\u043b\u0430\u0441\u0442\u044c \u0434\u043e\u043c\u0435\u043d\u0443, \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0430\u043d\u0430 \u0434\u043e \u0444\u0430\u0439\u043b\u0443 cookie, \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u0454, \u044f\u043a\u0456 \u0434\u043e\u043c\u0435\u043d\u0438 \u043c\u043e\u0436\u0443\u0442\u044c \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0444\u0430\u0439\u043b cookie \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0441\u0443\u0432\u043e\u0440\u043e \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u0439 \u0441\u0443\u0431\u0434\u043e\u043c\u0435\u043d\u043e\u043c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, www.nottrusted.com, \u0430\u0431\u043e \u0432\u0456\u043b\u044c\u043d\u043e \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u0439 \u0431\u0430\u0442\u044c\u043a\u0456\u0432\u0441\u044c\u043a\u0438\u043c \u0434\u043e\u043c\u0435\u043d\u043e\u043c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, nottrusted.com. \u0412 \u043e\u0441\u0442\u0430\u043d\u043d\u044c\u043e\u043c\u0443 \u0432\u0438\u043f\u0430\u0434\u043a\u0443 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0439 \u0441\u0443\u0431\u0434\u043e\u043c\u0435\u043d nottrusted.com \u043c\u043e\u0436\u0435 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0444\u0430\u0439\u043b\u0443 cookie. \u0424\u0430\u0439\u043b\u0438 cookie \u0437 \u0448\u0438\u0440\u043e\u043a\u043e\u044e \u0441\u0444\u0435\u0440\u043e\u044e \u0434\u0456\u0457 \u043f\u043e\u0448\u0438\u0440\u0435\u043d\u0456 \u0432 \u0442\u0430\u043a\u0438\u0445 \u043c\u0435\u0433\u0430-\u0434\u043e\u0434\u0430\u0442\u043a\u0430\u0445, \u044f\u043a google.com \u0442\u0430 live.com. \u0424\u0430\u0439\u043b\u0438 cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0456 \u0437 \u0441\u0443\u0431\u0434\u043e\u043c\u0435\u043d\u0443, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, app.foo.bar, \u043f\u0435\u0440\u0435\u0434\u0430\u044e\u0442\u044c\u0441\u044f \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c \u043b\u0438\u0448\u0435 \u0434\u043e \u0446\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443. \u041e\u0434\u043d\u0430\u043a, \u0444\u0430\u0439\u043b\u0438 cookie, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0456 \u0434\u043b\u044f \u0434\u043e\u043c\u0435\u043d\u0443 \u0431\u0430\u0442\u044c\u043a\u0456\u0432\u0441\u044c\u043a\u043e\u0433\u043e \u0440\u0456\u0432\u043d\u044f, \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u0456 \u0434\u043e \u0431\u0430\u0442\u044c\u043a\u0456\u0432\u0441\u044c\u043a\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443 \u0430\u0431\u043e \u0431\u0443\u0434\u044c-\u044f\u043a\u043e\u0433\u043e \u0441\u0443\u0431\u0434\u043e\u043c\u0435\u043d\u0443 \u0431\u0430\u0442\u044c\u043a\u0456\u0432\u0441\u044c\u043a\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443.
pscanrules.cookielooselyscoped.extrainfo = \u0414\u043e\u043c\u0435\u043d \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f, \u044f\u043a\u0438\u0439 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0432\u0441\u044f \u0434\u043b\u044f \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u044f, \u0431\u0443\u0432 \u0442\u0430\u043a\u0438\u043c\: \n{0}\n{1}
pscanrules.cookielooselyscoped.extrainfo.cookie = {0}
pscanrules.cookielooselyscoped.name = \u0424\u0430\u0439\u043b\u0438 Cookie \u0437 \u0432\u0456\u043b\u044c\u043d\u0438\u043c\u0438 \u043c\u0435\u0436\u0430\u043c\u0438
pscanrules.cookielooselyscoped.refs = https\://tools.ietf.org/html/rfc6265\#section-4.1\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html\nhttps\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanrules.cookielooselyscoped.soln = \u0417\u0430\u0432\u0436\u0434\u0438 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0444\u0430\u0439\u043b\u0438 cookie \u0434\u043e FQDN (\u043f\u043e\u0432\u043d\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u043d\u043e\u0433\u043e \u0456\u043c\u0435\u043d\u0456).

pscanrules.cookiesamesite.badval.desc = \u0424\u0430\u0439\u043b cookie \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0437 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 SameSite, \u0449\u043e \u043e\u0437\u043d\u0430\u0447\u0430\u0454, \u0449\u043e \u0444\u0430\u0439\u043b cookie \u043c\u043e\u0436\u043d\u0430 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0432 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0456 \u0437\u0430\u043f\u0438\u0442\u0443 \u00ab\u043c\u0456\u0436 \u0441\u0430\u0439\u0442\u043e\u043c\u00bb. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 SameSite \u0454 \u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u0438\u043c \u0437\u0430\u0441\u043e\u0431\u043e\u043c \u0431\u043e\u0440\u043e\u0442\u044c\u0431\u0438 \u0437 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u043e\u044e \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f\u043c \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432 \u0456 \u0430\u0442\u0430\u043a\u0430\u043c\u0438 \u043d\u0430 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u0456\u0437\u0430\u0446\u0456\u044e.
pscanrules.cookiesamesite.badval.name = \u0424\u0430\u0439\u043b cookie \u0437 \u043d\u0435\u0432\u0456\u0440\u043d\u0438\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c SameSite
pscanrules.cookiesamesite.desc = \u0424\u0430\u0439\u043b cookie \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0431\u0435\u0437 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 SameSite, \u0449\u043e \u043e\u0437\u043d\u0430\u0447\u0430\u0454, \u0449\u043e \u0444\u0430\u0439\u043b cookie \u043c\u043e\u0436\u043d\u0430 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0432 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0456 \u00ab\u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e\u00bb \u0437\u0430\u043f\u0438\u0442\u0443. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 SameSite \u0454 \u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u0438\u043c \u0437\u0430\u0441\u043e\u0431\u043e\u043c \u0431\u043e\u0440\u043e\u0442\u044c\u0431\u0438 \u0437 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u043e\u044e \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f\u043c \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432 \u0456 \u0430\u0442\u0430\u043a\u0430\u043c\u0438 \u043d\u0430 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u0456\u0437\u0430\u0446\u0456\u044e.
pscanrules.cookiesamesite.name = \u0424\u0430\u0439\u043b cookie \u0431\u0435\u0437 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 SameSite
pscanrules.cookiesamesite.none.desc = \u0414\u043b\u044f \u0444\u0430\u0439\u043b\u0443 cookie \u0431\u0443\u043b\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442 SameSite \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c \u00abnone\u00bb, \u0449\u043e \u043e\u0437\u043d\u0430\u0447\u0430\u0454, \u0449\u043e \u0444\u0430\u0439\u043b cookie \u043c\u043e\u0436\u043d\u0430 \u043d\u0430\u0434\u0456\u0441\u043b\u0430\u0442\u0438 \u0432 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0456 \u00ab\u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u043e\u0433\u043e\u00bb \u0437\u0430\u043f\u0438\u0442\u0443. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 SameSite \u0454 \u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u0438\u043c \u0437\u0430\u0441\u043e\u0431\u043e\u043c \u0431\u043e\u0440\u043e\u0442\u044c\u0431\u0438 \u0437 \u043f\u0456\u0434\u0440\u043e\u0431\u043a\u043e\u044e \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0437\u0430\u043f\u0438\u0442\u0456\u0432, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f\u043c \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432 \u0456 \u0430\u0442\u0430\u043a\u0430\u043c\u0438 \u043d\u0430 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u0456\u0437\u0430\u0446\u0456\u044e.\n
pscanrules.cookiesamesite.none.name = \u0424\u0430\u0439\u043b\u0438 Cookie \u0437 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c SameSite \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0456
pscanrules.cookiesamesite.refs = https\://tools.ietf.org/html/draft-ietf-httpbis-cookie-same-site
pscanrules.cookiesamesite.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442 SameSite \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f "lax" \u0430\u0431\u043e, \u0432 \u0456\u0434\u0435\u0430\u043b\u0456, "strict" \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0444\u0430\u0439\u043b\u0456\u0432 cookie.

pscanrules.cookiesecureflag.desc = \u0424\u0430\u0439\u043b cookie \u0431\u0443\u043b\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0431\u0435\u0437 \u043f\u0440\u0430\u043f\u043e\u0440\u0446\u044f \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0449\u043e \u043e\u0437\u043d\u0430\u0447\u0430\u0454, \u0449\u043e \u0434\u043e \u043d\u044c\u043e\u0433\u043e \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u0456 \u0437'\u0454\u0434\u043d\u0430\u043d\u043d\u044f.
pscanrules.cookiesecureflag.name = \u0424\u0430\u0439\u043b cookie \u0431\u0435\u0437 \u043f\u0440\u0430\u043f\u043e\u0440\u0446\u044f \u0431\u0435\u0437\u043f\u0435\u043a\u0438
pscanrules.cookiesecureflag.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html
pscanrules.cookiesecureflag.soln = \u042f\u043a\u0449\u043e \u0444\u0430\u0439\u043b cookie \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0430\u0431\u043e \u0454 \u0442\u043e\u043a\u0435\u043d\u043e\u043c \u0441\u0435\u0430\u043d\u0441\u0443, \u0439\u043e\u0433\u043e \u0437\u0430\u0432\u0436\u0434\u0438 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u0430\u043d\u0430\u043b\u0443. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0434\u043b\u044f \u0444\u0430\u0439\u043b\u0456\u0432 cookie, \u044f\u043a\u0456 \u043c\u0456\u0441\u0442\u044f\u0442\u044c \u0442\u0430\u043a\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043f\u0440\u0430\u043f\u043e\u0440\u0435\u0446\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438.

pscanrules.crossdomain.desc = \u0417\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0434\u0430\u043d\u0438\u0445 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u043c \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0443 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e Cross Origin Resource Sharing (CORS) \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456
pscanrules.crossdomain.extrainfo = \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f CORS \u043d\u0430 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0456 \u0437\u0430\u043f\u0438\u0442\u0438 \u043d\u0430 \u0447\u0438\u0442\u0430\u043d\u043d\u044f \u0432\u0456\u0434 \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u0445 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0445 \u0434\u043e\u043c\u0435\u043d\u0456\u0432 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0445 API \u0443 \u0446\u044c\u043e\u043c\u0443 \u0434\u043e\u043c\u0435\u043d\u0456. \u041e\u0434\u043d\u0430\u043a \u0440\u0435\u0430\u043b\u0456\u0437\u0430\u0446\u0456\u0457 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u043d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0434\u043e\u0432\u0456\u043b\u044c\u043d\u0438\u043c \u0442\u0440\u0435\u0442\u0456\u043c \u043e\u0441\u043e\u0431\u0430\u043c \u0447\u0438\u0442\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0437 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0445 API. \u0426\u0435 \u0434\u0435\u0449\u043e \u0437\u043d\u0438\u0436\u0443\u0454 \u0440\u0438\u0437\u0438\u043a. \u0426\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0430 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u043e\u043c \u0434\u043b\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0434\u0430\u043d\u0438\u0445, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0445 \u0443 \u043d\u0435\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431, \u0430\u043b\u0435 \u044f\u043a\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c \u0456\u043d\u0448\u0456 \u0444\u043e\u0440\u043c\u0438 \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434 \u0431\u0456\u043b\u0438\u0439 \u0441\u043f\u0438\u0441\u043e\u043a IP-\u0430\u0434\u0440\u0435\u0441.
pscanrules.crossdomain.name = \u041c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u0430 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f
pscanrules.crossdomain.refs = https\://vulncat.fortify.com/en/detail?id\=desc.config.dotnet.html5_overly_permissive_cors_policy
pscanrules.crossdomain.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456 \u043d\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0456 \u0431\u0435\u0437 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0431\u0456\u043b\u0438\u0445 \u0441\u043f\u0438\u0441\u043a\u0456\u0432 IP-\u0430\u0434\u0440\u0435\u0441.\n\u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 HTTP-\u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a "Access-Control-Allow-Origin" \u043d\u0430 \u0431\u0456\u043b\u044c\u0448 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u0439 \u043d\u0430\u0431\u0456\u0440 \u0434\u043e\u043c\u0435\u043d\u0456\u0432 \u0430\u0431\u043e \u043f\u043e\u0432\u043d\u0456\u0441\u0442\u044e \u0432\u0438\u0434\u0430\u043b\u0456\u0442\u044c \u0443\u0441\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 CORS, \u0449\u043e\u0431 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0443 \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0443 \u0442\u043e\u0433\u043e \u0436 \u043f\u043e\u0445\u043e\u0434\u0436\u0435\u043d\u043d\u044f (SOP) \u0443 \u0431\u0456\u043b\u044c\u0448 \u043e\u0431\u043c\u0435\u0436\u0435\u043d\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431.

pscanrules.crossdomainscriptinclusion.desc = \u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u0434\u0438\u043d \u0430\u0431\u043e \u043a\u0456\u043b\u044c\u043a\u0430 \u0444\u0430\u0439\u043b\u0456\u0432 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u044e \u0437\u0456 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u044c\u043e\u0433\u043e \u0434\u043e\u043c\u0435\u043d\u0443.
pscanrules.crossdomainscriptinclusion.name = \u0412\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f \u043c\u0456\u0436\u0434\u043e\u043c\u0435\u043d\u043d\u043e\u0433\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0443 JavaScript
pscanrules.crossdomainscriptinclusion.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u0445\u0456\u0434\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 JavaScript \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u044e\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437 \u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0445 \u0434\u0436\u0435\u0440\u0435\u043b, \u0456 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043d\u0435 \u043c\u043e\u0436\u0443\u0442\u044c \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u043c\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\u043c\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438.

pscanrules.csp.both.desc = \u041f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043c\u0456\u0441\u0442\u0438\u043b\u043e \u044f\u043a CSP, \u0443\u043a\u0430\u0437\u0430\u043d\u0438\u0439 \u0447\u0435\u0440\u0435\u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a, \u0442\u0430\u043a \u0456 \u0447\u0435\u0440\u0435\u0437 \u0442\u0435\u0433 Meta. \u041d\u0435 \u0432\u0434\u0430\u043b\u043e\u0441\u044f \u043e\u0431\u2019\u0454\u0434\u043d\u0430\u0442\u0438 \u0446\u0456 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438, \u0449\u043e\u0431 \u0432\u0438\u043a\u043e\u043d\u0430\u0442\u0438 \u0430\u043d\u0430\u043b\u0456\u0437. \u0422\u043e\u043c\u0443 \u0432\u043e\u043d\u0438 \u0431\u0443\u043b\u0438 \u043e\u0446\u0456\u043d\u0435\u043d\u0456 \u0456\u043d\u0434\u0438\u0432\u0456\u0434\u0443\u0430\u043b\u044c\u043d\u043e.
pscanrules.csp.both.name = Header & Meta
pscanrules.csp.desc = \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 (CSP) \u2013 \u0446\u0435 \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0439 \u0440\u0456\u0432\u0435\u043d\u044c \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0438\u0439 \u0434\u043e\u043f\u043e\u043c\u0430\u0433\u0430\u0454 \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438 \u0442\u0430 \u0437\u043c\u0435\u043d\u0448\u0443\u0432\u0430\u0442\u0438 \u043f\u0435\u0432\u043d\u0456 \u0442\u0438\u043f\u0438 \u0430\u0442\u0430\u043a. \u0412\u043a\u043b\u044e\u0447\u0430\u044e\u0447\u0438 (\u0430\u043b\u0435 \u043d\u0435 \u043e\u0431\u043c\u0435\u0436\u0443\u044e\u0447\u0438\u0441\u044c) \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 (XSS) \u0456 \u0430\u0442\u0430\u043a\u0438 \u0437 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f\u043c \u0434\u0430\u043d\u0438\u0445. \u0426\u0456 \u0430\u0442\u0430\u043a\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0432\u0441\u044c\u043e\u0433\u043e\: \u0432\u0456\u0434 \u043a\u0440\u0430\u0434\u0456\u0436\u043a\u0438 \u0434\u0430\u043d\u0438\u0445 \u0434\u043e \u043f\u0441\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0430\u0439\u0442\u0443 \u0447\u0438 \u0440\u043e\u0437\u043f\u043e\u0432\u0441\u044e\u0434\u0436\u0435\u043d\u043d\u044f \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u0445 \u043f\u0440\u043e\u0433\u0440\u0430\u043c. CSP \u043d\u0430\u0434\u0430\u0454 \u043d\u0430\u0431\u0456\u0440 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0445 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 HTTP, \u044f\u043a\u0456 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0435\u0431-\u0441\u0430\u0439\u0442\u0456\u0432 \u0434\u0435\u043a\u043b\u0430\u0440\u0443\u0432\u0430\u0442\u0438 \u0441\u0445\u0432\u0430\u043b\u0435\u043d\u0456 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u0432\u043c\u0456\u0441\u0442\u0443, \u044f\u043a\u0456 \u0432\u0435\u0431-\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0447\u0456 \u043c\u0430\u044e\u0442\u044c \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0432\u0430\u0442\u0438 \u043d\u0430 \u0446\u044e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u2014 \u043e\u0445\u043e\u043f\u043b\u044e\u044e\u0442\u044c\u0441\u044f \u0442\u0438\u043f\u0438\: JavaScript, CSS, \u043a\u0430\u0434\u0440\u0438 HTML, \u0448\u0440\u0438\u0444\u0442\u0438, \u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u0430 \u0432\u0431\u0443\u0434\u043e\u0432\u0430\u043d\u0456 \u043e\u0431\u2019\u0454\u043a\u0442\u0438, \u0442\u0430\u043a\u0456 \u044f\u043a \u0430\u043f\u043b\u0435\u0442\u0438 Java, ActiveX, \u0430\u0443\u0434\u0456\u043e- \u0442\u0430 \u0432\u0456\u0434\u0435\u043e\u0444\u0430\u0439\u043b\u0438.
pscanrules.csp.malformed.name = \u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u0430 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 (\u043d\u0435-ASCII)
pscanrules.csp.malformed.otherinfo = \u041f\u0456\u0434 \u0447\u0430\u0441 \u0441\u043f\u0440\u043e\u0431\u0438 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u0443\u0432\u0430\u0442\u0438 \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0443 \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0441\u0438\u043c\u0432\u043e\u043b, \u044f\u043a\u0438\u0439 \u043d\u0435 \u043d\u0430\u043b\u0435\u0436\u0438\u0442\u044c \u0434\u043e ASCII, \u0442\u0430\u043a\u0438\u043c \u0447\u0438\u043d\u043e\u043c \u0440\u043e\u0431\u043b\u044f\u0447\u0438 \u0439\u043e\u0433\u043e \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0438\u043c (\u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0430 \u043e\u0446\u0456\u043d\u043a\u0430 \u043d\u0435 \u0432\u0456\u0434\u0431\u0443\u043b\u0430\u0441\u044f). \u0411\u0443\u043b\u043e \u0437\u0456\u0431\u0440\u0430\u043d\u043e \u0442\u0430\u043a\u0456 \u043d\u0435\u0434\u0456\u0439\u0441\u043d\u0456 \u0441\u0438\u043c\u0432\u043e\u043b\u0438\: {0}
pscanrules.csp.meta.bad.directive.desc = \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430, \u0443\u043a\u0430\u0437\u0430\u043d\u0430 \u0447\u0435\u0440\u0435\u0437 \u043c\u0435\u0442\u0430\u0435\u043b\u0435\u043c\u0435\u043d\u0442, \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u0434\u043d\u0443 \u0430\u0431\u043e \u043e\u0431\u0438\u0434\u0432\u0456 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u00absandbox\u00bb \u0430\u0431\u043e \u00abframe-ancestors\u00bb, \u044f\u043a\u0456 \u0437\u0430\u0431\u043e\u0440\u043e\u043d\u0435\u043d\u0456 \u0432 \u043c\u0435\u0442\u0430\u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u0445 CSP.
pscanrules.csp.meta.bad.directive.name = \u041d\u0435\u0434\u0456\u0439\u0441\u043d\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0430 \u043c\u0435\u0442\u0430\u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438
pscanrules.csp.name = CSP
pscanrules.csp.notices.errors = \u041f\u043e\u043c\u0438\u043b\u043a\u0438\:
pscanrules.csp.notices.infoitems = \u0406\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439\u043d\u0456 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0438\:
pscanrules.csp.notices.name = \u041f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f
pscanrules.csp.notices.warnings = \u041f\u043e\u043f\u0435\u0440\u0435\u0434\u0436\u0435\u043d\u043d\u044f\:
pscanrules.csp.otherinfo.extended = \u0414\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438\: {0} \u043d\u0430\u043b\u0435\u0436\u0430\u0442\u044c \u0434\u043e \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432, \u044f\u043a\u0456 \u043d\u0435 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u044e\u0442\u044c\u0441\u044f \u0434\u043e default-src, \u043f\u0440\u043e\u043f\u0443\u0441\u0442\u0438\u0442\u0438/\u0432\u0438\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0457\u0445 \u2014 \u0446\u0435 \u0442\u0435 \u0441\u0430\u043c\u0435, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0431\u0443\u0434\u044c-\u0449\u043e.
pscanrules.csp.refs = https\://www.w3.org/TR/CSP/\nhttps\://caniuse.com/\#search\=content+security+policy\nhttps\://content-security-policy.com/\nhttps\://github.com/HtmlUnit/htmlunit-csp\nhttps\://developers.google.com/web/fundamentals/security/csp\#policy_applies_to_a_wide_variety_of_resources
pscanrules.csp.scriptsrc.unsafe.eval.name = script-src unsafe-eval
pscanrules.csp.scriptsrc.unsafe.eval.otherinfo = script-src \u043c\u0456\u0441\u0442\u0438\u0442\u044c unsafe-eval.
pscanrules.csp.scriptsrc.unsafe.hashes.name = script-src unsafe-hashes
pscanrules.csp.scriptsrc.unsafe.hashes.otherinfo = script-src \u043c\u0456\u0441\u0442\u0438\u0442\u044c unsafe-hashes, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u0437\u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0439 \u043a\u043e\u0434, \u043f\u043e\u043a\u0440\u0438\u0442\u0438\u0439 \u0442\u0430\u043a\u043e\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0454\u044e.
pscanrules.csp.scriptsrc.unsafe.hashes.refs = https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-script/
pscanrules.csp.scriptsrc.unsafe.name = script-src unsafe-inline
pscanrules.csp.scriptsrc.unsafe.otherinfo = script-src \u043c\u0456\u0441\u0442\u0438\u0442\u044c unsafe-inline
pscanrules.csp.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u0434\u043b\u044f \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 Content-Security-Policy.
pscanrules.csp.stylesrc.unsafe.hashes.name = style-src unsafe-hashes
pscanrules.csp.stylesrc.unsafe.hashes.otherinfo = style-src \u043c\u0456\u0441\u0442\u0438\u0442\u044c unsafe-hashes, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u0437\u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0439 \u043a\u043e\u0434, \u043f\u043e\u043a\u0440\u0438\u0442\u0438\u0439 \u0442\u0430\u043a\u043e\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0454\u044e.
pscanrules.csp.stylesrc.unsafe.hashes.refs = https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-style/
pscanrules.csp.stylesrc.unsafe.name = style-src unsafe-inline
pscanrules.csp.stylesrc.unsafe.otherinfo = style-src \u043c\u0456\u0441\u0442\u0438\u0442\u044c unsafe-inline
pscanrules.csp.wildcard.name = \u0414\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0430 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0443\u0437\u0430\u0433\u0430\u043b\u044c\u043d\u0435\u043d\u043d\u044f
pscanrules.csp.wildcard.otherinfo = \u041d\u0430\u0441\u0442\u0443\u043f\u043d\u0456 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0438 \u0430\u0431\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0443\u0437\u0430\u0433\u0430\u043b\u044c\u043d\u0435\u043d\u043d\u044f (\u0430\u0431\u043e \u043f\u0440\u0435\u0434\u043a\u0456\u0432), \u043d\u0435 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u0456 \u0430\u0431\u043e \u043c\u0430\u044e\u0442\u044c \u043d\u0430\u0434\u0442\u043e \u0448\u0438\u0440\u043e\u043a\u0435 \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\: \n{0}\n
pscanrules.csp.xcsp.name = \u041f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0432\u043c\u0456\u0441\u0442\u0443 X
pscanrules.csp.xcsp.otherinfo = \u0423 \u0446\u0456\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Content-Security-Policy. \u0425\u043e\u0447\u0430 \u0446\u0435 \u0445\u043e\u0440\u043e\u0448\u0438\u0439 \u0437\u043d\u0430\u043a, \u0449\u043e CSP \u043f\u0435\u0432\u043d\u043e\u044e \u043c\u0456\u0440\u043e\u044e \u0440\u0435\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u043e, \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430, \u0443\u043a\u0430\u0437\u0430\u043d\u0430 \u0432 \u0446\u044c\u043e\u043c\u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443, \u043d\u0435 \u0431\u0443\u043b\u0430 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0430 ZAP. \u0429\u043e\u0431 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0438\u0442\u0438 \u043f\u043e\u0432\u043d\u0443 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u043c\u0438 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u043c\u0438, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Security-Policy \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0442\u0430 \u0434\u043e\u0434\u0430\u043d\u043e \u0434\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439.
pscanrules.csp.xwkcsp.name = X-WebKit-CSP
pscanrules.csp.xwkcsp.otherinfo = \u0423 \u0446\u0456\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-WebKit-CSP. \u0425\u043e\u0447\u0430 \u0446\u0435 \u0445\u043e\u0440\u043e\u0448\u0438\u0439 \u0437\u043d\u0430\u043a, \u0449\u043e CSP \u043f\u0435\u0432\u043d\u043e\u044e \u043c\u0456\u0440\u043e\u044e \u0440\u0435\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u043e, \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430, \u0443\u043a\u0430\u0437\u0430\u043d\u0430 \u0432 \u0446\u044c\u043e\u043c\u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443, \u043d\u0435 \u0431\u0443\u043b\u0430 \u043f\u0440\u043e\u0430\u043d\u0430\u043b\u0456\u0437\u043e\u0432\u0430\u043d\u0430 ZAP. \u0429\u043e\u0431 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0438\u0442\u0438 \u043f\u043e\u0432\u043d\u0443 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u043c\u0438 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u043c\u0438, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Security-Policy \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0442\u0430 \u0434\u043e\u0434\u0430\u043d\u043e \u0434\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439.

pscanrules.desc = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0442\u0430\u043d\u0443 \u0432\u0438\u043f\u0443\u0441\u043a\u0443

pscanrules.directorybrowsing.desc = \u041c\u043e\u0436\u043d\u0430 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u0443\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0432\u043c\u0456\u0441\u0442\u0443 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443. \u0421\u043f\u0438\u0441\u043a\u0438 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0456\u0432 \u043c\u043e\u0436\u0443\u0442\u044c \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0456 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457, \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0444\u0430\u0439\u043b\u0438, \u0432\u0438\u0445\u0456\u0434\u043d\u0456 \u0444\u0430\u0439\u043b\u0438 \u0440\u0435\u0437\u0435\u0440\u0432\u043d\u0438\u0445 \u043a\u043e\u043f\u0456\u0439 \u0442\u043e\u0449\u043e, \u0434\u043e \u044f\u043a\u0438\u0445 \u043c\u043e\u0436\u043d\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f, \u0449\u043e\u0431 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e.
pscanrules.directorybrowsing.extrainfo = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u043e\u0432\u0430\u043d\u043e\: {0}
pscanrules.directorybrowsing.name = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u0434 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0456\u0432
pscanrules.directorybrowsing.refs = https\://cwe.mitre.org/data/definitions/548.html
pscanrules.directorybrowsing.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0449\u043e\u0431 \u0432\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443.

pscanrules.hashdisclosure.desc = \u0413\u0435\u0448 \u0431\u0443\u0432 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0438\u0439 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.
pscanrules.hashdisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u0433\u0435\u0448\u0443
pscanrules.hashdisclosure.refs = https\://openwall.info/wiki/john/sample-hashes
pscanrules.hashdisclosure.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0433\u0435\u0448\u0456, \u044f\u043a\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0437\u0430\u0445\u0438\u0441\u0442\u0443 \u043e\u0431\u043b\u0456\u043a\u043e\u0432\u0438\u0445 \u0434\u0430\u043d\u0438\u0445 \u0430\u0431\u043e \u0456\u043d\u0448\u0438\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u043d\u0435 \u0432\u0438\u0442\u0456\u043a\u0430\u044e\u0442\u044c \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0430\u0431\u043e \u0431\u0430\u0437\u0443 \u0434\u0430\u043d\u0438\u0445. \u0417\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u043d\u0435\u043c\u0430\u0454 \u0432\u0438\u043c\u043e\u0433\u0438, \u0449\u043e\u0431 \u0433\u0435\u0448\u0456 \u043f\u0430\u0440\u043e\u043b\u0456\u0432 \u0431\u0443\u043b\u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0456 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0443.

pscanrules.heartbleed.desc = \u0412\u043f\u0440\u043e\u0432\u0430\u0434\u0436\u0435\u043d\u043d\u044f TLS \u0456 DTLS \u0443 OpenSSL 1.0.1 \u0434\u043e 1.0.1g \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u043e\u0431\u0440\u043e\u0431\u043b\u044f\u044e\u0442\u044c \u043f\u0430\u043a\u0435\u0442\u0438 Heartbeat Extension, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0438\u043c \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0437 \u043f\u0430\u043c\u2019\u044f\u0442\u0456 \u043f\u0440\u043e\u0446\u0435\u0441\u0443 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u0438\u0445 \u043f\u0430\u043a\u0435\u0442\u0456\u0432, \u044f\u043a\u0456 \u0437\u0430\u043f\u0443\u0441\u043a\u0430\u044e\u0442\u044c \u043f\u0435\u0440\u0435\u0447\u0438\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u0431\u0443\u0444\u0435\u0440\u0430, \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u044e\u0447\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e.
pscanrules.heartbleed.extrainfo = {0} \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f. \u041e\u0434\u043d\u0430\u043a \u0437\u0430\u0443\u0432\u0430\u0436\u0442\u0435, \u0449\u043e \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u0430 \u0432\u0435\u0440\u0441\u0456\u044f \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0437\u0432\u043e\u0440\u043e\u0442\u043d\u0456 \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0442\u043e\u043c\u0443 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0445\u0438\u0431\u043d\u043e \u043f\u043e\u0437\u0438\u0442\u0438\u0432\u043d\u043e\u044e. \u0426\u0435 \u0447\u0430\u0441\u0442\u043e \u0437\u0443\u0441\u0442\u0440\u0456\u0447\u0430\u0454\u0442\u044c\u0441\u044f, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0443 Red Hat.
pscanrules.heartbleed.name = \u0423\u0440\u0430\u0437\u043b\u0438\u0432\u0456\u0441\u0442\u044c Heartbleed OpenSSL (\u0456\u043d\u0434\u0438\u043a\u0430\u0442\u0438\u0432\u043d\u043e)
pscanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
pscanrules.heartbleed.soln = \u041e\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e OpenSSL 1.0.1g \u0430\u0431\u043e \u043d\u043e\u0432\u0456\u0448\u043e\u0457 \u0432\u0435\u0440\u0441\u0456\u0457. \u041f\u0435\u0440\u0435\u0432\u0438\u0434\u0430\u0439\u0442\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u0438 HTTPS. \u0417\u043c\u0456\u043d\u0456\u0442\u044c \u0430\u0441\u0438\u043c\u0435\u0442\u0440\u0438\u0447\u043d\u0456 \u0437\u0430\u043a\u0440\u0438\u0442\u0456 \u043a\u043b\u044e\u0447\u0456 \u0442\u0430 \u0441\u043f\u0456\u043b\u044c\u043d\u0456 \u0441\u0435\u043a\u0440\u0435\u0442\u043d\u0456 \u043a\u043b\u044e\u0447\u0456, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0432\u043e\u043d\u0438 \u043c\u043e\u0433\u043b\u0438 \u0431\u0443\u0442\u0438 \u0441\u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u043e\u0432\u0430\u043d\u0456, \u0431\u0435\u0437 \u0434\u043e\u043a\u0430\u0437\u0456\u0432 \u043a\u043e\u043c\u043f\u0440\u043e\u043c\u0435\u0442\u0430\u0446\u0456\u0457 \u0443 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.

pscanrules.infoprivateaddressdisclosure.desc = \u0423 \u0442\u0456\u043b\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0443 IP-\u0430\u0434\u0440\u0435\u0441\u0443 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, 10.x.x.x, 172.x.x.x, 192.168.x.x) \u0430\u0431\u043e \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0435 \u0456\u043c\u2019\u044f \u0445\u043e\u0441\u0442\u0430 Amazon EC2 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, ip-10-0-56-78). \u0426\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u043d\u043e\u044e \u0434\u043b\u044f \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0438\u0445 \u0430\u0442\u0430\u043a, \u0441\u043f\u0440\u044f\u043c\u043e\u0432\u0430\u043d\u0438\u0445 \u043d\u0430 \u0432\u043d\u0443\u0442\u0440\u0456\u0448\u043d\u0456 \u0441\u0438\u0441\u0442\u0435\u043c\u0438.
pscanrules.infoprivateaddressdisclosure.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u043e\u0457 IP-\u0430\u0434\u0440\u0435\u0441\u0438
pscanrules.infoprivateaddressdisclosure.refs = https\://tools.ietf.org/html/rfc1918
pscanrules.infoprivateaddressdisclosure.soln = \u0412\u0438\u0434\u0430\u043b\u0456\u0442\u044c \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0443 IP-\u0430\u0434\u0440\u0435\u0441\u0443 \u0437 \u0442\u0456\u043b\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP. \u0414\u043b\u044f \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456\u0432 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456 JSP/ASP/PHP \u0437\u0430\u043c\u0456\u0441\u0442\u044c \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456\u0432 HTML/JavaScript, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0430\u0447\u0438\u0442\u0438 \u043a\u043b\u0456\u0454\u043d\u0442\u0441\u044c\u043a\u0456 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0438.

pscanrules.informationdisclosuredebugerrors.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0442\u0438\u043f\u043e\u0432\u0456 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0438, \u044f\u043a\u0456 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u044e\u0442\u044c\u0441\u044f \u0442\u0430\u043a\u0438\u043c\u0438 \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u0430\u043c\u0438, \u044f\u043a ASP.NET, \u0456 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c\u0438, \u044f\u043a IIS \u0456 Apache. \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0442\u0438\u043f\u043e\u0432\u0438\u0445 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u044c \u043d\u0430\u043b\u0430\u0433\u043e\u0434\u0436\u0435\u043d\u043d\u044f.
pscanrules.informationdisclosuredebugerrors.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 - \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0438 \u043d\u0430\u043b\u0430\u0433\u043e\u0434\u0436\u0435\u043d\u043d\u044f
pscanrules.informationdisclosuredebugerrors.soln = \u0412\u0438\u043c\u043a\u043d\u0443\u0442\u0438 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043f\u0440\u043e \u043d\u0430\u043b\u0430\u0433\u043e\u0434\u0436\u0435\u043d\u043d\u044f \u043f\u0435\u0440\u0435\u0434 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u043d\u043d\u044f\u043c \u0443 \u0432\u0438\u0440\u043e\u0431\u043d\u0438\u0446\u0442\u0432\u043e.

pscanrules.informationdisclosureinurl.desc = \u0412\u0438\u044f\u0432\u0438\u043b\u043e\u0441\u044f, \u0449\u043e \u0437\u0430\u043f\u0438\u0442 \u043c\u0456\u0441\u0442\u0438\u0432 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0432\u0438\u0442\u0456\u043a \u044f\u043a\u043e\u0457 \u0441\u0442\u0430\u0432\u0441\u044f \u0447\u0435\u0440\u0435\u0437 URL-\u0430\u0434\u0440\u0435\u0441\u0443. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u0440\u0443\u0448\u0438\u0442\u0438 \u0432\u0438\u043c\u043e\u0433\u0438 PCI \u0442\u0430 \u0431\u0456\u043b\u044c\u0448\u0456\u0441\u0442\u044c \u043e\u0440\u0433\u0430\u043d\u0456\u0437\u0430\u0446\u0456\u0439\u043d\u0438\u0445 \u043f\u043e\u043b\u0456\u0442\u0438\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0441\u0442\u0456. \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u0442\u0438 \u0441\u043f\u0438\u0441\u043e\u043a \u0440\u044f\u0434\u043a\u0456\u0432 \u0434\u043b\u044f \u0446\u0456\u0454\u0457 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438, \u0449\u043e\u0431 \u0434\u043e\u0434\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u043b\u0443\u0447\u0438\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f, \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440\u043d\u0456 \u0434\u043b\u044f \u0432\u0430\u0448\u043e\u0433\u043e \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430.
pscanrules.informationdisclosureinurl.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 - \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u0432 URL-\u0430\u0434\u0440\u0435\u0441\u0456
pscanrules.informationdisclosureinurl.otherinfo.cc = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u043a\u0440\u0435\u0434\u0438\u0442\u043d\u0443 \u043a\u0430\u0440\u0442\u043a\u0443.
pscanrules.informationdisclosureinurl.otherinfo.email = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0430\u0434\u0440\u0435\u0441\u0438 \u0435\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0457 \u043f\u043e\u0448\u0442\u0438.
pscanrules.informationdisclosureinurl.otherinfo.sensitiveinfo = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e. \u0417\u0430 \u0448\u0430\u0431\u043b\u043e\u043d\u043e\u043c \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0440\u044f\u0434\u043e\u043a\:{0}{1}
pscanrules.informationdisclosureinurl.otherinfo.ssn = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043d\u043e\u043c\u0435\u0440\u0438 \u0441\u043e\u0446\u0456\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0441\u0442\u0440\u0430\u0445\u0443\u0432\u0430\u043d\u043d\u044f \u0421\u0428\u0410\n
pscanrules.informationdisclosureinurl.soln = \u041d\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u0439\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0447\u0435\u0440\u0435\u0437 URI.

pscanrules.informationdisclosurereferrer.bin.field = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0439\u043d\u0438\u0439 \u043d\u043e\u043c\u0435\u0440 \u0431\u0430\u043d\u043a\u0443\:
pscanrules.informationdisclosurereferrer.brand.field = \u0411\u0440\u0435\u043d\u0434\:\n
pscanrules.informationdisclosurereferrer.category.field = \u041a\u0430\u0442\u0435\u0433\u043e\u0440\u0456\u044f\:
pscanrules.informationdisclosurereferrer.desc = \u0427\u0435\u0440\u0435\u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u0439 \u0432\u0438\u0442\u0456\u043a \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u0447\u0443\u0442\u043b\u0438\u0432\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u0432 \u0456\u043d\u0448\u0438\u0439 \u0434\u043e\u043c\u0435\u043d. \u0426\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u0440\u0443\u0448\u0438\u0442\u0438 PCI \u0442\u0430 \u0431\u0456\u043b\u044c\u0448\u0456\u0441\u0442\u044c \u043e\u0440\u0433\u0430\u043d\u0456\u0437\u0430\u0446\u0456\u0439\u043d\u0438\u0445 \u043f\u043e\u043b\u0456\u0442\u0438\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u0441\u0442\u0456. \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0441\u043f\u0438\u0441\u043e\u043a \u0440\u044f\u0434\u043a\u0456\u0432 \u0434\u043b\u044f \u0446\u0456\u0454\u0457 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438, \u0449\u043e\u0431 \u0434\u043e\u0434\u0430\u0442\u0438 \u0430\u0431\u043e \u0432\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f, \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u0456 \u0434\u043b\u044f \u0432\u0430\u0448\u043e\u0433\u043e \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430.
pscanrules.informationdisclosurereferrer.issuer.field = \u041f\u043e\u0441\u0442\u0430\u0447\u0430\u043b\u044c\u043d\u0438\u043a\:
pscanrules.informationdisclosurereferrer.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 - \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 HTTP
pscanrules.informationdisclosurereferrer.otherinfo.cc = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 HTTP \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u043a\u0440\u0435\u0434\u0438\u0442\u043d\u0443 \u043a\u0430\u0440\u0442\u043a\u0443.
pscanrules.informationdisclosurereferrer.otherinfo.email = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 HTTP \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0430\u0434\u0440\u0435\u0441\u0438 \u0435\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0457 \u043f\u043e\u0448\u0442\u0438.
pscanrules.informationdisclosurereferrer.otherinfo.sensitiveinfo = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 HTTP \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e.
pscanrules.informationdisclosurereferrer.otherinfo.ssn = URL-\u0430\u0434\u0440\u0435\u0441\u0430 \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 HTTP \u043c\u043e\u0436\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u043d\u043e\u043c\u0435\u0440\u0438 \u0441\u043e\u0446\u0456\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0441\u0442\u0440\u0430\u0445\u0443\u0432\u0430\u043d\u043d\u044f \u0421\u0428\u0410.
pscanrules.informationdisclosurereferrer.soln = \u041d\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u0439\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0447\u0435\u0440\u0435\u0437 URI.

pscanrules.informationdisclosuresuspiciouscomments.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043f\u0456\u0434\u043e\u0437\u0440\u0456\u043b\u0456 \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443. \u0417\u0430\u0443\u0432\u0430\u0436\u0435\u043d\u043d\u044f\: \u0437\u0431\u0456\u0433\u0438, \u0437\u0440\u043e\u0431\u043b\u0435\u043d\u0456 \u0432\u0441\u0435\u0440\u0435\u0434\u0438\u043d\u0456 \u0431\u043b\u043e\u043a\u0456\u0432 \u0441\u043a\u0440\u0438\u043f\u0442\u0456\u0432 \u0430\u0431\u043e \u0444\u0430\u0439\u043b\u0456\u0432, \u0441\u0442\u043e\u0441\u0443\u044e\u0442\u044c\u0441\u044f \u0432\u0441\u044c\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443, \u0430 \u043d\u0435 \u043b\u0438\u0448\u0435 \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456\u0432.
pscanrules.informationdisclosuresuspiciouscomments.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 - \u043f\u0456\u0434\u043e\u0437\u0440\u0456\u043b\u0456 \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456
pscanrules.informationdisclosuresuspiciouscomments.otherinfo = \u0411\u0443\u043b\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0448\u0430\u0431\u043b\u043e\u043d\: {0} \u0456 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0432 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0456, \u0449\u043e \u043f\u043e\u0447\u0438\u043d\u0430\u0454\u0442\u044c\u0441\u044f \u0437\: "{1}", \u0434\u0438\u0432\u0456\u0442\u044c\u0441\u044f \u043f\u043e\u043b\u0435 \u0434\u043e\u043a\u0430\u0437\u0456\u0432 \u0434\u043b\u044f \u043f\u0456\u0434\u043e\u0437\u0440\u0456\u043b\u043e\u0433\u043e \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u044f/\u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430.
pscanrules.informationdisclosuresuspiciouscomments.otherinfo2 = \u0411\u0443\u043b\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0448\u0430\u0431\u043b\u043e\u043d\: {0} \u0456 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0441\u0442\u0456\u043b\u044c\u043a\u0438 \u0440\u0430\u0437\u0456\u0432\: {2}, \u043f\u0435\u0440\u0448\u0438\u0439 \u0432 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0456, \u0449\u043e \u043f\u043e\u0447\u0438\u043d\u0430\u0454\u0442\u044c\u0441\u044f \u0437\: "{1}", \u0434\u0438\u0432\u0456\u0442\u044c\u0441\u044f \u043f\u043e\u043b\u0435 \u0434\u043e\u043a\u0430\u0437\u0456\u0432 \u0434\u043b\u044f \u043f\u0456\u0434\u043e\u0437\u0440\u0456\u043b\u043e\u0433\u043e \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u044f/\u0444\u0440\u0430\u0433\u043c\u0435\u043d\u0442\u0430.
pscanrules.informationdisclosuresuspiciouscomments.soln = \u0412\u0438\u0434\u0430\u043b\u0438\u0442\u0438 \u0443\u0441\u0456 \u043a\u043e\u043c\u0435\u043d\u0442\u0430\u0440\u0456, \u044f\u043a\u0456 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u044e\u0442\u044c \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u044f\u043a\u0430 \u043c\u043e\u0436\u0435 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0443, \u0456 \u0432\u0438\u043f\u0440\u0430\u0432\u0438\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0456 \u043e\u0441\u043d\u043e\u0432\u043d\u0456 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438, \u043d\u0430 \u044f\u043a\u0456 \u0432\u043e\u043d\u0438 \u043f\u043e\u0441\u0438\u043b\u0430\u044e\u0442\u044c\u0441\u044f.

pscanrules.infosessionidurl.desc = \u041f\u0435\u0440\u0435\u0437\u0430\u043f\u0438\u0441 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0434\u043b\u044f \u0432\u0456\u0434\u0441\u0442\u0435\u0436\u0435\u043d\u043d\u044f \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0438\u0439 \u0447\u0435\u0440\u0435\u0437 \u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0434\u0436\u0435\u0440\u0435\u043b\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443. \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043c\u043e\u0436\u0435 \u0442\u0430\u043a\u043e\u0436 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438\u0441\u044f \u0432 \u0456\u0441\u0442\u043e\u0440\u0456\u0457 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0430\u0431\u043e \u0436\u0443\u0440\u043d\u0430\u043b\u0430\u0445 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.
pscanrules.infosessionidurl.name = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0432 \u043d\u043e\u0432\u0456\u0439 URL-\u0430\u0434\u0440\u0435\u0441\u0456
pscanrules.infosessionidurl.referrer.alert = Referer \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0454 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443
pscanrules.infosessionidurl.referrer.desc = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0433\u0456\u043f\u0435\u0440\u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f, \u0449\u043e \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0456\u043d\u0448\u0435 \u0456\u043c\u2019\u044f \u0445\u043e\u0441\u0442\u0430. \u041e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0438\u0441 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440\u0430 \u0441\u0435\u0430\u043d\u0441\u0443, \u0432\u0456\u043d \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0440\u043e\u0437\u043a\u0440\u0438\u0442\u0438\u0439 \u0443 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043d\u0430 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u0456 \u0445\u043e\u0441\u0442\u0438.
pscanrules.infosessionidurl.referrer.soln = \u0406\u0441\u043d\u0443\u0454 \u0440\u0438\u0437\u0438\u043a, \u044f\u043a\u0449\u043e \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439, \u0430 \u0433\u0456\u043f\u0435\u0440\u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043f\u043e\u0441\u0438\u043b\u0430\u0454\u0442\u044c\u0441\u044f \u043d\u0430 \u0437\u043e\u0432\u043d\u0456\u0448\u043d\u0456\u0439 \u0430\u0431\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0439 \u0445\u043e\u0441\u0442. \u0414\u043b\u044f \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443 \u043f\u043e\u043c\u0456\u0441\u0442\u0456\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0443 \u0444\u0430\u0439\u043b cookie \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u043e\u0433\u043e \u0441\u0435\u0430\u043d\u0441\u0443.
pscanrules.infosessionidurl.refs = https\://seclists.org/webappsec/2002/q4/111
pscanrules.infosessionidurl.soln = \u0414\u043b\u044f \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u0433\u043e \u0432\u043c\u0456\u0441\u0442\u0443 \u043f\u043e\u043c\u0456\u0441\u0442\u0456\u0442\u044c \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0442\u043e\u0440 \u0441\u0435\u0430\u043d\u0441\u0443 \u0432 \u0444\u0430\u0439\u043b cookie. \u0414\u043b\u044f \u043f\u043e\u0441\u0438\u043b\u0435\u043d\u043d\u044f \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u043f\u043e\u0434\u0443\u043c\u0430\u0439\u0442\u0435 \u043f\u0440\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0442\u0430 \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0438\u0441\u0443 URL-\u0430\u0434\u0440\u0435\u0441\u0438.

pscanrules.insecureauthentication.desc = \u0427\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0435 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u0431\u0443\u043b\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043e \u0431\u0430\u0437\u043e\u0432\u0443 \u0430\u0431\u043e \u0434\u0430\u0439\u0434\u0436\u0435\u0441\u0442-\u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044e HTTP. \u041e\u0431\u043b\u0456\u043a\u043e\u0432\u0456 \u0434\u0430\u043d\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u043f\u0440\u043e\u0447\u0438\u0442\u0430\u043d\u0456 \u0442\u0430 \u0437\u043d\u043e\u0432\u0443 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u0456 \u043a\u0438\u043c\u043e\u0441\u044c \u0456\u0437 \u0434\u043e\u0441\u0442\u0443\u043f\u043e\u043c \u0434\u043e \u043c\u0435\u0440\u0435\u0436\u0456.
pscanrules.insecureauthentication.name = \u0421\u043b\u0430\u0431\u043a\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457
pscanrules.insecureauthentication.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Authentication_Cheat_Sheet.html
pscanrules.insecureauthentication.soln = \u0417\u0430\u0445\u0438\u0441\u0442\u0456\u0442\u044c \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e HTTPS \u0430\u0431\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0431\u0456\u043b\u044c\u0448 \u043d\u0430\u0434\u0456\u0439\u043d\u0438\u0439 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457

pscanrules.insecureformload.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0448\u0443\u043a\u0430\u0454 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 HTTP, \u044f\u043a\u0456 \u043c\u0456\u0441\u0442\u044f\u0442\u044c \u0444\u043e\u0440\u043c\u0438 HTTPS. \u041f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u043f\u043e\u043b\u044f\u0433\u0430\u0454 \u0432 \u0442\u043e\u043c\u0443, \u0449\u043e \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 HTTP \u043c\u043e\u0436\u043d\u0430 \u043b\u0435\u0433\u043a\u043e \u0437\u043b\u0430\u043c\u0430\u0442\u0438 \u0447\u0435\u0440\u0435\u0437 MITM, \u0430 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0443 \u0444\u043e\u0440\u043c\u0443 HTTPS \u043c\u043e\u0436\u043d\u0430 \u0437\u0430\u043c\u0456\u043d\u0438\u0442\u0438 \u0430\u0431\u043e \u043f\u0456\u0434\u0440\u043e\u0431\u0438\u0442\u0438.
pscanrules.insecureformload.extrainfo = The response to the following request over HTTP included an HTTPS form tag action attribute value\:\n\n{0}\nThe context was\:\n\n{1}
pscanrules.insecureformload.name = \u041d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u043f\u0435\u0440\u0435\u0445\u0456\u0434 \u0437 HTTP \u043d\u0430 HTTPS \u0443 \u043f\u0443\u0431\u043b\u0456\u043a\u0430\u0446\u0456\u0457 \u0444\u043e\u0440\u043c\u0438
pscanrules.insecureformload.refs=
pscanrules.insecureformload.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 HTTP-\u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u0446\u0456\u043b\u044c\u043e\u0432\u0438\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a, \u044f\u043a\u0456 \u043c\u0456\u0441\u0442\u044f\u0442\u044c \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0444\u043e\u0440\u043c\u0438.

pscanrules.insecureformpost.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0432\u0438\u0437\u043d\u0430\u0447\u0430\u0454 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 HTTPS, \u044f\u043a\u0456 \u043c\u0456\u0441\u0442\u044f\u0442\u044c \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0444\u043e\u0440\u043c\u0438 HTTP. \u041f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u043f\u043e\u043b\u044f\u0433\u0430\u0454 \u0432 \u0442\u043e\u043c\u0443, \u0449\u043e \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0438\u0442\u044c \u043d\u0430 \u043d\u0435\u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443, \u043a\u043e\u043b\u0438 \u0434\u0430\u043d\u0456 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u044e\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u0444\u043e\u0440\u043c\u0443. \u041a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043c\u043e\u0436\u0435 \u043f\u043e\u0434\u0443\u043c\u0430\u0442\u0438, \u0449\u043e \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u0454 \u0434\u0430\u043d\u0456 \u043d\u0430 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0443 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443, \u0445\u043e\u0447\u0430 \u043d\u0430\u0441\u043f\u0440\u0430\u0432\u0434\u0456 \u0446\u0435 \u043d\u0435 \u0442\u0430\u043a.
pscanrules.insecureformpost.extrainfo = The response to the following request over HTTPS included an HTTP form tag action attribute value\:\n\n{0}\nThe context was\:\n\n{1}
pscanrules.insecureformpost.name = HTTPS to HTTP Insecure Transition in Form Post
pscanrules.insecureformpost.refs=
pscanrules.insecureformpost.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u044e\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0437\u0430\u0445\u0438\u0449\u0435\u043d\u0438\u043c\u0438 \u043a\u0430\u043d\u0430\u043b\u0430\u043c\u0438 HTTPS.

pscanrules.insecurejsfviewstate.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0437\u0430 \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u043e\u044e URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f ViewState, \u044f\u043a\u0435 \u043d\u0435 \u043c\u0430\u0454 \u043a\u0440\u0438\u043f\u0442\u043e\u0433\u0440\u0430\u0444\u0456\u0447\u043d\u043e\u0433\u043e \u0437\u0430\u0445\u0438\u0441\u0442\u0443.
pscanrules.insecurejsfviewstate.extrainfo = JSF ViewState [{0}] is insecure
pscanrules.insecurejsfviewstate.name = Insecure JSF ViewState
pscanrules.insecurejsfviewstate.refs = https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanrules.insecurejsfviewstate.soln = Secure VIEWSTATE with a MAC specific to your environment

pscanrules.linktarget.desc = \u041f\u0440\u0438\u043d\u0430\u0439\u043c\u043d\u0456 \u043e\u0434\u043d\u0435 \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043d\u0430 \u0446\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u0435 \u0434\u043e \u0437\u0432\u043e\u0440\u043e\u0442\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u0445\u043e\u0434\u0443 \u0432\u043a\u043b\u0430\u0434\u043e\u043a, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0432\u043e\u043d\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0446\u0456\u043b\u044c\u043e\u0432\u0438\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0431\u0435\u0437 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043a\u043b\u044e\u0447\u043e\u0432\u0438\u0445 \u0441\u043b\u0456\u0432 \u00abnoopener\u00bb \u0456 \u00abnoreferrer\u00bb \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456 \u00abrel\u00bb, \u0449\u043e \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0446\u0456\u043b\u044c\u043e\u0432\u0456\u0439 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u0446\u044e \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443.
pscanrules.linktarget.name = Reverse Tabnabbing
pscanrules.linktarget.refs = https\://owasp.org/www-community/attacks/Reverse_Tabnabbing\nhttps\://dev.to/ben/the-targetblank-vulnerability-by-example\nhttps\://mathiasbynens.github.io/rel-noopener/\nhttps\://medium.com/@jitbit/target-blank-the-most-underestimated-vulnerability-ever-96e328301f4c
pscanrules.linktarget.soln = \u041d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u0446\u0456\u043b\u044c\u043e\u0432\u0438\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0430\u0431\u043e, \u044f\u043a\u0449\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e, \u0442\u0430\u043a\u043e\u0436 \u0434\u043e\u0434\u0430\u0439\u0442\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\: rel\="noopener noreferrer".

pscanrules.mixedcontent.desc = \u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0437\u043c\u0456\u0448\u0430\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442, \u0442\u043e\u0431\u0442\u043e \u0432\u043c\u0456\u0441\u0442, \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u044f\u043a\u043e\u0433\u043e \u0437\u0434\u0456\u0439\u0441\u043d\u044e\u0454\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 HTTP \u0437\u0430\u043c\u0456\u0441\u0442\u044c HTTPS.
pscanrules.mixedcontent.name = \u0417\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c \u0437\u043c\u0456\u0448\u0430\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442
pscanrules.mixedcontent.name.inclscripts = \u0417\u0430\u0445\u0438\u0449\u0435\u043d\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0442\u044c \u0437\u043c\u0456\u0448\u0430\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442 (\u0432\u043a\u043b\u044e\u0447\u043d\u043e \u0437\u0456 \u0441\u043a\u0440\u0438\u043f\u0442\u0430\u043c\u0438)
pscanrules.mixedcontent.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html
pscanrules.mixedcontent.soln = \u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430, \u044f\u043a\u0430 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430 \u0447\u0435\u0440\u0435\u0437 SSL/TLS, \u043c\u0430\u0454 \u043f\u043e\u0432\u043d\u0456\u0441\u0442\u044e \u0441\u043a\u043b\u0430\u0434\u0430\u0442\u0438\u0441\u044f \u0437 \u0432\u043c\u0456\u0441\u0442\u0443, \u044f\u043a\u0438\u0439 \u043f\u0435\u0440\u0435\u0434\u0430\u0454\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 SSL/TLS.\n\u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043d\u0435 \u043c\u0430\u0454 \u043c\u0456\u0441\u0442\u0438\u0442\u0438 \u0432\u043c\u0456\u0441\u0442, \u044f\u043a\u0438\u0439 \u043f\u0435\u0440\u0435\u0434\u0430\u0454\u0442\u044c\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0437\u0430\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u0438\u0439 HTTP.\n  \u0426\u0435 \u0432\u043a\u043b\u044e\u0447\u0430\u0454 \u0432\u043c\u0456\u0441\u0442 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0445 \u0441\u0430\u0439\u0442\u0456\u0432.

pscanrules.modernapp.desc = \u041f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0432\u0438\u0433\u043b\u044f\u0434\u0430\u0454 \u044f\u043a \u0441\u0443\u0447\u0430\u0441\u043d\u0430 \u0432\u0435\u0431\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430. \u042f\u043a\u0449\u043e \u0432\u0430\u043c \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u0434\u043e\u0441\u043b\u0456\u0434\u0436\u0443\u0432\u0430\u0442\u0438 \u0439\u043e\u0433\u043e \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e, \u0442\u043e Ajax Spider \u0446\u0456\u043b\u043a\u043e\u043c \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u0456\u0448\u0438\u043c, \u043d\u0456\u0436 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u0438\u0439.
pscanrules.modernapp.name = Modern Web Application
pscanrules.modernapp.other.links = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f, \u044f\u043a\u0456 \u043d\u0435 \u043c\u0430\u044e\u0442\u044c \u0442\u0440\u0430\u0434\u0438\u0446\u0456\u0439\u043d\u0438\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 href, \u0449\u043e \u0441\u0432\u0456\u0434\u0447\u0438\u0442\u044c \u043f\u0440\u043e \u0442\u0435, \u0449\u043e \u0446\u0435 \u0441\u0443\u0447\u0430\u0441\u043d\u0430 \u0432\u0435\u0431\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430.
pscanrules.modernapp.other.nolinks = \u041d\u0435 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0436\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f, \u0445\u043e\u0447\u0430 \u0454 \u0441\u043a\u0440\u0438\u043f\u0442\u0438, \u0449\u043e \u0441\u0432\u0456\u0434\u0447\u0438\u0442\u044c \u043f\u0440\u043e \u0442\u0435, \u0449\u043e \u0446\u0435 \u0441\u0443\u0447\u0430\u0441\u043d\u0430 \u0432\u0435\u0431\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430.
pscanrules.modernapp.other.noscript = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0442\u0435\u0433 noScript, \u044f\u043a\u0438\u0439 \u0454 \u043e\u0437\u043d\u0430\u043a\u043e\u044e \u0442\u043e\u0433\u043e, \u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u043f\u0440\u0430\u0446\u044e\u0454 \u043f\u043e-\u0456\u043d\u0448\u043e\u043c\u0443, \u043a\u043e\u043b\u0438 JavaScript \u0443\u0432\u0456\u043c\u043a\u043d\u0435\u043d\u043e, \u0443 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u043d\u043d\u0456 \u0437 \u0442\u0438\u043c, \u043a\u043e\u043b\u0438 \u0432\u0456\u043d \u043d\u0435 \u0430\u043a\u0442\u0438\u0432\u043d\u0438\u0439.
pscanrules.modernapp.other.self = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u0437 \u043c\u0435\u0442\u043e\u044e '_self' - \u0446\u0435 \u0447\u0430\u0441\u0442\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u043c\u0438 \u0444\u0440\u0435\u0439\u043c\u0432\u043e\u0440\u043a\u0430\u043c\u0438 \u0434\u043b\u044f \u043f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e\u0433\u043e \u043f\u043e\u0432\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438.
pscanrules.modernapp.soln = \u0426\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439\u043d\u0435 \u0441\u043f\u043e\u0432\u0456\u0449\u0435\u043d\u043d\u044f, \u0442\u043e\u043c\u0443 \u0436\u043e\u0434\u043d\u0438\u0445 \u0437\u043c\u0456\u043d \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e.

pscanrules.name = \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u043e\u0433\u043e \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f

pscanrules.noanticsrftokens.alert.extrainfo = \u0416\u043e\u0434\u0435\u043d \u0432\u0456\u0434\u043e\u043c\u0438\u0439 \u043c\u0430\u0440\u043a\u0435\u0440 Anti-CSRF {0} \u043d\u0435 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0432 \u0442\u0430\u043a\u0456\u0439 \u0444\u043e\u0440\u043c\u0456 HTML\: {1}.
pscanrules.noanticsrftokens.desc = \u0423 HTML-\u0444\u043e\u0440\u043c\u0456 \u043f\u043e\u0434\u0430\u043d\u043d\u044f \u043d\u0435 \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0436\u043e\u0434\u043d\u0438\u0445 \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF.
pscanrules.noanticsrftokens.extrainfo.annotation = \u0426\u0435 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0439\u043d\u0435 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u0436\u0435\u043d\u043d\u044f, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u0444\u043e\u0440\u043c\u0430 \u043c\u0430\u0454 \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044e \u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u044f\u043a\u0430 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0442\u0435, \u0449\u043e \u0457\u0439 \u043d\u0435 \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0430\u043d\u0442\u0438-CSRF \u043c\u0430\u0440\u043a\u0435\u0440. \u0426\u0435 \u0441\u043b\u0456\u0434 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u0430\u043d\u043e\u0442\u0430\u0446\u0456\u044f \u0454 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u044e.
pscanrules.noanticsrftokens.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0441\u0442\u044c \u0442\u043e\u043a\u0435\u043d\u0456\u0432 Anti-CSRF

pscanrules.payloader.desc = \u0417\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0446\u044c\u043a\u0438\u0445 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u0445 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u044c \u0443 \u043f\u0440\u0430\u0432\u0438\u043b\u0430\u0445 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f.
pscanrules.payloader.name = Passive Scan Rules Release Custom Payloads

pscanrules.pii.bin.field = \u0406\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0439\u043d\u0438\u0439 \u043d\u043e\u043c\u0435\u0440 \u0431\u0430\u043d\u043a\u0443\:
pscanrules.pii.brand.field = \u0411\u0440\u0435\u043d\u0434\:\n
pscanrules.pii.category.field = \u041a\u0430\u0442\u0435\u0433\u043e\u0440\u0456\u044f\:
pscanrules.pii.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u0443 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u044f\u043a \u043d\u043e\u043c\u0435\u0440 CC, SSN \u0442\u0430 \u043f\u043e\u0434\u0456\u0431\u043d\u0456 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456.
pscanrules.pii.extrainfo = \u0412\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043e \u0442\u0438\u043f \u043a\u0440\u0435\u0434\u0438\u0442\u043d\u043e\u0457 \u043a\u0430\u0440\u0442\u043a\u0438\: {0}
pscanrules.pii.issuer.field = \u041f\u043e\u0441\u0442\u0430\u0447\u0430\u043b\u044c\u043d\u0438\u043a\:
pscanrules.pii.name = \u0420\u043e\u0437\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u044c\u043d\u043e\u0457 \u0456\u0434\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457
pscanrules.pii.soln = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0443 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 (PII), \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u043d\u0435 \u0440\u043e\u0437\u043f\u043e\u0432\u0441\u044e\u0434\u0436\u0443\u0454 \u043d\u0456\u0447\u043e\u0433\u043e \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0433\u043e.\n

pscanrules.retrievedfromcache.desc = \u0412\u043c\u0456\u0441\u0442 \u0431\u0443\u043b\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0437\u0456 \u0441\u043f\u0456\u043b\u044c\u043d\u043e\u0433\u043e \u043a\u0435\u0448\u0443. \u042f\u043a\u0449\u043e \u0434\u0430\u043d\u0456 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u0456 \u0430\u0431\u043e \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u0456 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0446\u0435 \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0432\u0438\u0442\u043e\u043a\u0443 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0432\u0438\u043f\u0430\u0434\u043a\u0430\u0445 \u0446\u0435 \u043c\u043e\u0436\u0435 \u043d\u0430\u0432\u0456\u0442\u044c \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0442\u043e\u0433\u043e, \u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043e\u0442\u0440\u0438\u043c\u0430\u0454 \u043f\u043e\u0432\u043d\u0438\u0439 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c \u043d\u0430\u0434 \u0441\u0435\u0430\u043d\u0441\u043e\u043c \u0456\u043d\u0448\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u0437\u0430\u043b\u0435\u0436\u043d\u043e \u0432\u0456\u0434 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432 \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0442\u044c\u0441\u044f \u0432 \u0439\u043e\u0433\u043e \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0456. \u0426\u0435 \u043d\u0430\u0441\u0430\u043c\u043f\u0435\u0440\u0435\u0434 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430, \u043a\u043e\u043b\u0438 \u043a\u0435\u0448-\u0441\u0435\u0440\u0432\u0435\u0440\u0438, \u0442\u0430\u043a\u0456 \u044f\u043a "\u043f\u0440\u043e\u043a\u0441\u0456-\u043a\u0435\u0448\u0456", \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u0432 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0456\u0439 \u043c\u0435\u0440\u0435\u0436\u0456. \u0422\u0430\u043a\u0430 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0437\u0443\u0441\u0442\u0440\u0456\u0447\u0430\u0454\u0442\u044c\u0441\u044f, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0443 \u043a\u043e\u0440\u043f\u043e\u0440\u0430\u0442\u0438\u0432\u043d\u0438\u0445 \u0430\u0431\u043e \u043e\u0441\u0432\u0456\u0442\u043d\u0456\u0445 \u0441\u0435\u0440\u0435\u0434\u043e\u0432\u0438\u0449\u0430\u0445.
pscanrules.retrievedfromcache.extrainfo.http11ageheader = The presence of the 'Age' header indicates that a HTTP/1.1 compliant caching server is in use.
pscanrules.retrievedfromcache.name = \u041e\u0442\u0440\u0438\u043c\u0430\u043d\u043e \u0437 \u043a\u0435\u0448\u0443
pscanrules.retrievedfromcache.refs = https\://tools.ietf.org/html/rfc7234\nhttps\://tools.ietf.org/html/rfc7231\nhttps\://www.rfc-editor.org/rfc/rfc9110.html
pscanrules.retrievedfromcache.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0435 \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u0457, \u043e\u0441\u043e\u0431\u0438\u0441\u0442\u043e\u0457 \u0430\u0431\u043e \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u0447\u043d\u043e\u0457 \u0434\u043b\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457. \u042f\u043a\u0449\u043e \u043c\u0456\u0441\u0442\u0438\u0442\u044c, \u0440\u043e\u0437\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043c\u043e\u0436\u043b\u0438\u0432\u0456\u0441\u0442\u044c \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043d\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0445 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP, \u0449\u043e\u0431 \u043e\u0431\u043c\u0435\u0436\u0438\u0442\u0438 \u0430\u0431\u043e \u0437\u0430\u043f\u043e\u0431\u0456\u0433\u0442\u0438 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u043d\u043d\u044e \u0442\u0430 \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044e \u0432\u043c\u0456\u0441\u0442\u0443 \u0437 \u043a\u0435\u0448\u0443 \u0456\u043d\u0448\u0438\u043c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c\:\n\u041a\u0435\u0448-\u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443, \u0431\u0435\u0437 \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043d\u043d\u044f, \u043e\u0431\u043e\u0432\u2019\u044f\u0437\u043a\u043e\u0432\u0430 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430, \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438\u0439\n\u041f\u0440\u0430\u0433\u043c\u0430\: \u0431\u0435\u0437 \u043a\u0435\u0448\u0443\n\u0422\u0435\u0440\u043c\u0456\u043d \u0434\u0456\u0457\: 0\n\u0426\u044f \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044f \u0432\u043a\u0430\u0437\u0443\u0454 \u0441\u0435\u0440\u0432\u0435\u0440\u0430\u043c \u043a\u0435\u0448\u0443\u0432\u0430\u043d\u043d\u044f, \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u043c \u0456\u0437 HTTP 1.0 \u0456 HTTP 1.1, \u043d\u0435 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456 \u043d\u0435 \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0442\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c (\u0431\u0435\u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438) \u0437 \u043a\u0435\u0448\u0443 \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043d\u0430 \u043f\u043e\u0434\u0456\u0431\u043d\u0438\u0439 \u0437\u0430\u043f\u0438\u0442.

pscanrules.serverheader.rule.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 HTTP\n

pscanrules.serverheaderinfoleak.desc = \u0412\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440/\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0443 \u043f\u043e\u0448\u0438\u0440\u044e\u0454 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443, \u044f\u043a\u0443 \u0432\u0456\u043d \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u044f\u043a \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0447\u0435\u0440\u0435\u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP "\u0421\u0435\u0440\u0432\u0435\u0440". \u0414\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0442\u0430\u043a\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0435 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u0456\u043d\u0448\u0456 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0432\u0430\u0448\u043e\u0433\u043e \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0430/\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0434\u043e\u0434\u0430\u0442\u043a\u0443. \u0426\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u0441\u0430\u043c\u0430 \u043f\u043e \u0441\u043e\u0431\u0456, \u0442\u043e\u0431\u0442\u043e \u0431\u0435\u0437 \u0440\u044f\u0434\u043a\u0430 \u0432\u0435\u0440\u0441\u0456\u0457, \u043d\u0435 \u0454 \u0434\u0443\u0436\u0435 \u043d\u0435\u0431\u0435\u0437\u043f\u0435\u0447\u043d\u043e\u044e \u0434\u043b\u044f \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u043e\u0434\u043d\u0430\u043a \u0446\u044f \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u0432 \u043f\u043e\u043b\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u043c\u0430\u0439\u0436\u0435 \u0437\u0430\u0432\u0436\u0434\u0438 \u043c\u0430\u0440\u043d\u0430 \u0456, \u043e\u0442\u0436\u0435, \u0454 \u043f\u0440\u043e\u0441\u0442\u043e \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0438\u043c \u0432\u0435\u043a\u0442\u043e\u0440\u043e\u043c \u0430\u0442\u0430\u043a\u0438.
pscanrules.serverheaderinfoleak.general.refs = https\://httpd.apache.org/docs/current/mod/core.html\#servertokens\nhttps\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff648552(v\=pandp.10)\nhttps\://www.troyhunt.com/shhh-dont-let-your-response-headers/
pscanrules.serverheaderinfoleak.general.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0431\u043b\u043e\u043a\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u00ab\u0421\u0435\u0440\u0432\u0435\u0440\u00bb \u0430\u0431\u043e \u043d\u0430\u0434\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u0430\u043b\u044c\u043d\u0438\u0445 \u0432\u0456\u0434\u043e\u043c\u043e\u0441\u0442\u0435\u0439.
pscanrules.serverheaderinfoleak.name = \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0448\u0438\u0440\u044e\u0454 \u0441\u0432\u043e\u044e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043d\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443 \u0447\u0435\u0440\u0435\u0437 \u043f\u043e\u043b\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u00ab\u0421\u0435\u0440\u0432\u0435\u0440\u00bb.

pscanrules.serverheaderversioninfoleak.desc = \u0412\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440/\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0443 \u043f\u043e\u0448\u0438\u0440\u044e\u0454 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0432\u0435\u0440\u0441\u0456\u044e \u0447\u0435\u0440\u0435\u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 "\u0421\u0435\u0440\u0432\u0435\u0440". \u0414\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0442\u0430\u043a\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0435 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u0438\u0442\u0438 \u0456\u043d\u0448\u0456 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0432\u0430\u0448\u043e\u0433\u043e \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0430/\u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0434\u043e\u0434\u0430\u0442\u043a\u0443.
pscanrules.serverheaderversioninfoleak.name = \u0421\u0435\u0440\u0432\u0435\u0440 \u043f\u043e\u0448\u0438\u0440\u044e\u0454 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u043f\u0440\u043e \u0432\u0435\u0440\u0441\u0456\u044e \u0447\u0435\u0440\u0435\u0437 \u043f\u043e\u043b\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u00ab\u0421\u0435\u0440\u0432\u0435\u0440\u00bb.

pscanrules.stricttransportsecurity.compliance.malformed.content.desc = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Strict Transport Security (HSTS), \u0430\u043b\u0435 \u0432\u0456\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0434\u0435\u044f\u043a\u0438\u0439 \u043d\u0435\u043e\u0447\u0456\u043a\u0443\u0432\u0430\u043d\u0438\u0439 \u0432\u043c\u0456\u0441\u0442 (\u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u0444\u0456\u0433\u0443\u0440\u043d\u0456 \u043b\u0430\u043f\u043a\u0438), \u043e\u0447\u0456\u043a\u0443\u0454\u0442\u044c\u0441\u044f, \u0449\u043e \u0432\u043c\u0456\u0441\u0442 \u0431\u0443\u0434\u0435 \u0434\u0440\u0443\u043a\u043e\u0432\u0430\u043d\u0438\u043c\u0438 \u0441\u0438\u043c\u0432\u043e\u043b\u0430\u043c\u0438 ASCII.
pscanrules.stricttransportsecurity.compliance.malformed.content.name = Strict-Transport-Security Malformed Content (Non-compliant with Spec)
pscanrules.stricttransportsecurity.compliance.malformed.content.refs = https\://datatracker.ietf.org/doc/html/rfc6797
pscanrules.stricttransportsecurity.compliance.malformed.content.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0446\u044c\u043e\u0433\u043e \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f Strict-Transport-Security \u0437 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0438\u043c \u0432\u043c\u0456\u0441\u0442\u043e\u043c. 
pscanrules.stricttransportsecurity.compliance.max.age.malformed.desc = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Strict Transport Security (HSTS), \u0430\u043b\u0435 \u0432\u0456\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u043b\u0430\u043f\u043a\u0438 \u043f\u0435\u0440\u0435\u0434 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u043e\u044e max-age (\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f max-age \u043c\u043e\u0436\u043d\u0430 \u0432\u0437\u044f\u0442\u0438 \u0432 \u043b\u0430\u043f\u043a\u0438, \u0430\u043b\u0435 \u0441\u0430\u043c\u0443 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0443 - \u043d\u0456). \u0414\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0445 \u0432\u0456\u0434\u043e\u043c\u043e\u0441\u0442\u0435\u0439 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 RFC 6797.\nHTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL).
pscanrules.stricttransportsecurity.compliance.max.age.malformed.name = Strict-Transport-Security Max-Age Malformed (Non-compliant with Spec)
pscanrules.stricttransportsecurity.compliance.max.age.malformed.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.1
pscanrules.stricttransportsecurity.compliance.max.age.malformed.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0446\u044c\u043e\u0433\u043e \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f Strict-Transport-Security \u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u043e\u043c\u0443 \u0444\u043e\u0440\u043c\u0430\u0442\u0456.
pscanrules.stricttransportsecurity.compliance.max.age.missing.desc = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Strict Transport Security (HSTS), \u0430\u043b\u0435 \u0432 \u043d\u044c\u043e\u043c\u0443 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u044f \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0430 max-age (\u0430\u0431\u043e \u0432 \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0456 \u0432\u0456\u0434\u0441\u0443\u0442\u043d\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f). \u0414\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0445 \u0432\u0456\u0434\u043e\u043c\u043e\u0441\u0442\u0435\u0439 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 RFC 6797. \nHTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL).
pscanrules.stricttransportsecurity.compliance.max.age.missing.name = Strict-Transport-Security Missing Max-Age (Non-compliant with Spec)
pscanrules.stricttransportsecurity.compliance.max.age.missing.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.2
pscanrules.stricttransportsecurity.compliance.max.age.missing.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0446\u044c\u043e\u0433\u043e \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f Strict-Transport-Security \u0437 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c max-age.
pscanrules.stricttransportsecurity.compliance.meta.desc = A HTTP Strict Transport Security (HSTS) META tag was found, defining HTTP Strict Transport Security (HSTS) via a META tag is explicitly not supported by the spec (RFC 6797).
pscanrules.stricttransportsecurity.compliance.meta.name = Strict-Transport-Security Defined via META (Non-compliant with Spec)
pscanrules.stricttransportsecurity.compliance.meta.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.5
pscanrules.stricttransportsecurity.compliance.meta.soln = \u041d\u0435 \u043d\u0430\u043c\u0430\u0433\u0430\u0439\u0442\u0435\u0441\u044f \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 HTTP Strict Transport Security (HSTS) \u0447\u0435\u0440\u0435\u0437 META-\u0442\u0435\u0433.
pscanrules.stricttransportsecurity.compliance.multiple.header.desc = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 HTTP Strict Transport Security (HSTS), \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u0456\u0437 \u043a\u0456\u043b\u044c\u043a\u043e\u043c\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u043c\u0438 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 HSTS \u043d\u0435 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0430\u0454 \u0441\u043f\u0435\u0446\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u0457 (RFC 6797), \u0456 \u043b\u0438\u0448\u0435 \u043f\u0435\u0440\u0448\u0438\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HSTS \u0431\u0443\u0434\u0435 \u043e\u0431\u0440\u043e\u0431\u043b\u0435\u043d\u043e; \u0456\u043d\u0448\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 \u0456\u0433\u043d\u043e\u0440\u0443\u0432\u0430\u0442\u0438\u043c\u0443\u0442\u044c\u0441\u044f \u0430\u0433\u0435\u043d\u0442\u0430\u043c\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0430\u0431\u043e \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0430 HSTS \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e \u0437\u0430\u0441\u0442\u043e\u0441\u043e\u0432\u0430\u043d\u0430.\nHTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL).
pscanrules.stricttransportsecurity.compliance.multiple.header.name = Strict-Transport-Security Multiple Header Entries (Non-compliant with Spec)
pscanrules.stricttransportsecurity.compliance.multiple.header.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.1
pscanrules.stricttransportsecurity.compliance.multiple.header.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043b\u0438\u0448\u0435 \u043e\u0434\u0438\u043d \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u0443 \u0432\u0430\u0448\u043e\u043c\u0443 \u0441\u0442\u0435\u043a\u0443\: \u043a\u043e\u0434, \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u0434\u043b\u044f \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0430\u0431\u043e \u0434\u043e\u0434\u0430\u0432\u0430\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 HTTP Strict-Transport-Security (HSTS).
pscanrules.stricttransportsecurity.desc = HTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL). HSTS \u2014 \u0446\u0435 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b \u0432\u0456\u0434\u0441\u0442\u0435\u0436\u0435\u043d\u043d\u044f \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0456\u0432 IETF, \u044f\u043a\u0438\u0439 \u0432\u043a\u0430\u0437\u0430\u043d\u043e \u0432 RFC 6797.
pscanrules.stricttransportsecurity.max.age.desc = \u0411\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Strict Transport Security (HSTS), \u0430\u043b\u0435 \u0432\u0456\u043d \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0434\u0438\u0440\u0435\u043a\u0442\u0438\u0432\u0443 max-age\=0, \u044f\u043a\u0430 \u0432\u0438\u043c\u0438\u043a\u0430\u0454 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0442\u0430 \u0432\u043a\u0430\u0437\u0443\u0454 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\u043c \u0441\u043a\u0438\u043d\u0443\u0442\u0438 \u0432\u0441\u0456 \u043f\u043e\u043f\u0435\u0440\u0435\u0434\u043d\u0456 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u043d\u044f, \u043f\u043e\u0432\u2019\u044f\u0437\u0430\u043d\u0456 \u0437 HSTS. \u0414\u043b\u044f \u043e\u0442\u0440\u0438\u043c\u0430\u043d\u043d\u044f \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u0432\u0438\u0445 \u0432\u0456\u0434\u043e\u043c\u043e\u0441\u0442\u0435\u0439 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 RFC 6797. \nHTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL).
pscanrules.stricttransportsecurity.max.age.name = Strict-Transport-Security \u0432\u0438\u043c\u043a\u043d\u0435\u043d\u043e\n
pscanrules.stricttransportsecurity.max.age.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.2
pscanrules.stricttransportsecurity.max.age.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0446\u044c\u043e\u0433\u043e \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f Strict-Transport-Security \u0437 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c max-age.
pscanrules.stricttransportsecurity.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Strict-Transport-Security \u043d\u0435 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e
pscanrules.stricttransportsecurity.plain.resp.desc = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a HTTP Strict Transport Security (HSTS), \u0430\u043b\u0435 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 HSTS \u0456\u0433\u043d\u043e\u0440\u0443\u044e\u0442\u044c\u0441\u044f \u0443 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u0445 (\u043d\u0435 HTTPS) \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044f\u0445.\nHTTP Strict Transport Security (HSTS) \u2014 \u0446\u0435 \u043c\u0435\u0445\u0430\u043d\u0456\u0437\u043c \u043f\u043e\u043b\u0456\u0442\u0438\u043a\u0438 \u0432\u0435\u0431\u0431\u0435\u0437\u043f\u0435\u043a\u0438, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u044f\u043a\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0454, \u0449\u043e \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0456 \u0430\u0433\u0435\u043d\u0442\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440) \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u0432\u0437\u0430\u0454\u043c\u043e\u0434\u0456\u044f\u0442\u0438 \u0437 \u043d\u0438\u043c, \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u044e\u0447\u0438 \u043b\u0438\u0448\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0456 \u0437\u2019\u0454\u0434\u043d\u0430\u043d\u043d\u044f HTTPS (\u0442\u043e\u0431\u0442\u043e HTTP \u043d\u0430 \u0440\u0456\u0432\u043d\u0456 TLS/SSL).\n
pscanrules.stricttransportsecurity.plain.resp.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Strict-Transport-Security \u0443 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0456\u0439 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 HTTP
pscanrules.stricttransportsecurity.plain.resp.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.1
pscanrules.stricttransportsecurity.plain.resp.soln = \u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u044e \u0446\u044c\u043e\u0433\u043e \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f. \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u043e\u0433\u0440\u0430\u043c, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f Strict-Transport-Security \u0434\u043b\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 HTTPS.
pscanrules.stricttransportsecurity.refs = https\://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\nhttps\://owasp.org/www-community/Security_Headers\nhttps\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttps\://caniuse.com/stricttransportsecurity\nhttps\://datatracker.ietf.org/doc/html/rfc6797
pscanrules.stricttransportsecurity.rule.name = \u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Strict-Transport-Security
pscanrules.stricttransportsecurity.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432, \u0431\u0430\u043b\u0430\u043d\u0441\u0443\u0432\u0430\u043b\u044c\u043d\u0438\u043a \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u0432\u0430\u043d\u043d\u044f Strict-Transport-Security.

pscanrules.timestampdisclosure.desc = \u041f\u043e\u0437\u043d\u0430\u0447\u043a\u0443 \u0447\u0430\u0441\u0443 \u0431\u0443\u043b\u043e \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u043e \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u043c/\u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c
pscanrules.timestampdisclosure.extrainfo = {0}, \u0449\u043e \u043c\u0430\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\: {1}
pscanrules.timestampdisclosure.name = \u0420\u043e\u0437\u043a\u0440\u0438\u0442\u0442\u044f \u043f\u043e\u0437\u043d\u0430\u0447\u043a\u0438 \u0447\u0430\u0441\u0443
pscanrules.timestampdisclosure.refs = https\://cwe.mitre.org/data/definitions/200.html
pscanrules.timestampdisclosure.soln = \u041f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u044c\u0442\u0435 \u0432\u0440\u0443\u0447\u043d\u0443, \u0449\u043e \u0434\u0430\u043d\u0456 \u043f\u0440\u043e \u043f\u043e\u0437\u043d\u0430\u0447\u043a\u0443 \u0447\u0430\u0441\u0443 \u043d\u0435 \u0454 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u043c\u0438 \u0442\u0430 \u0449\u043e \u0434\u0430\u043d\u0456 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u043e\u0431'\u0454\u0434\u043d\u0443\u0432\u0430\u0442\u0438 \u0434\u043b\u044f \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043d\u044f \u0448\u0430\u0431\u043b\u043e\u043d\u0456\u0432, \u044f\u043a\u0456 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438.

pscanrules.usercontrolledcharset.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0440\u043e\u0437\u0433\u043b\u044f\u0434\u0430\u0454 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0442\u0430 \u0434\u0430\u043d\u0456 POST, \u0449\u043e\u0431 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438, \u0434\u0435 \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 Content-Type \u0430\u0431\u043e \u043c\u0435\u0442\u0430\u0442\u0435\u0433\u0456\u0432 \u043c\u043e\u0436\u0443\u0442\u044c \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c. \u0422\u0430\u043a\u0456 \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u043d\u0430\u0431\u043e\u0440\u0443 \u0441\u0438\u043c\u0432\u043e\u043b\u0456\u0432 \u0437\u0430\u0432\u0436\u0434\u0438 \u043f\u043e\u0432\u0438\u043d\u043d\u0456 \u043e\u0433\u043e\u043b\u043e\u0448\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0434\u043e\u0434\u0430\u0442\u043a\u043e\u043c. \u042f\u043a\u0449\u043e \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0432\u0456\u043d \u043c\u043e\u0436\u0435 \u043a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 HTML \u0434\u043b\u044f \u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f XSS \u0430\u0431\u043e \u0456\u043d\u0448\u0438\u0445 \u0430\u0442\u0430\u043a. \u041d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a, \u044f\u043a\u0438\u0439 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0454 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 <meta>, \u043c\u043e\u0436\u0435 \u043e\u0433\u043e\u043b\u043e\u0441\u0438\u0442\u0438 UTF-7, \u0430 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435 \u0432\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0434\u043e\u0441\u0442\u0430\u0442\u043d\u044c\u043e \u043a\u043e\u0440\u0438\u0441\u043d\u043e\u0433\u043e \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f, \u043a\u0435\u0440\u043e\u0432\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c, \u043d\u0430 \u043f\u043e\u0447\u0430\u0442\u043a\u0443 HTML-\u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430, \u0449\u043e\u0431 \u0432\u0456\u043d \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0443\u0432\u0430\u0432\u0441\u044f \u044f\u043a UTF-7. \u041a\u043e\u0434\u0443\u044e\u0447\u0438 \u0441\u0432\u043e\u0454 \u043a\u043e\u0440\u0438\u0441\u043d\u0435 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e UTF-7, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043e\u0431\u0456\u0439\u0442\u0438 \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0439 \u0437\u0430\u0445\u0438\u0441\u0442 XSS \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0442\u0430 \u0432\u0431\u0443\u0434\u0443\u0432\u0430\u0442\u0438 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0439 \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443.
pscanrules.usercontrolledcharset.extrainfo = \u0410\u0442\u0440\u0438\u0431\u0443\u0442 [{0}] \u0442\u0435\u0433\u0443  [{1}]\n\n\u0417\u043d\u0430\u0439\u0434\u0435\u043d\u0438\u0439 \u0432\u0445\u0456\u0434 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\:\n{2}\={3}\n\n\u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a\u0438\u043c \u0432\u0456\u043d \u043a\u0435\u0440\u0443\u0432\u0430\u0432, \u0431\u0443\u043b\u043e\:\n{4}
pscanrules.usercontrolledcharset.name = User Controllable Charset
pscanrules.usercontrolledcharset.refs=
pscanrules.usercontrolledcharset.soln = \u041f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438 UTF-8 \u0443 \u0432\u0441\u0456\u0445 \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f\u0445 \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f. \u042f\u043a\u0449\u043e \u0434\u043b\u044f \u0432\u0438\u0440\u0456\u0448\u0435\u043d\u043d\u044f \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f \u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u043f\u043e\u0442\u0440\u0456\u0431\u0435\u043d \u0432\u0445\u0456\u0434 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u043b\u0438\u0448\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u0438\u0439 \u0441\u043f\u0438\u0441\u043e\u043a.\n

pscanrules.usercontrolledcookie.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0440\u043e\u0437\u0433\u043b\u044f\u0434\u0430\u0454 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0442\u0430 \u0434\u0430\u043d\u0456 POST, \u0449\u043e\u0431 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438, \u0434\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u043c\u043e\u0436\u0443\u0442\u044c \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f. \u0426\u0435 \u043d\u0430\u0437\u0438\u0432\u0430\u0454\u0442\u044c\u0441\u044f cookie poisoning attack, \u0456 \u0457\u0457 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438, \u043a\u043e\u043b\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u0444\u0430\u0439\u043b\u0430\u043c\u0438 cookie \u0440\u0456\u0437\u043d\u0438\u043c\u0438 \u0441\u043f\u043e\u0441\u043e\u0431\u0430\u043c\u0438. \u0423 \u0434\u0435\u044f\u043a\u0438\u0445 \u0432\u0438\u043f\u0430\u0434\u043a\u0430\u0445 \u0446\u0435 \u043d\u0435 \u043c\u043e\u0436\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438, \u043e\u0434\u043d\u0430\u043a \u0434\u043e\u0437\u0432\u0456\u043b \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0434\u043b\u044f \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u044c \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0437\u0430\u0437\u0432\u0438\u0447\u0430\u0439 \u0432\u0432\u0430\u0436\u0430\u0454\u0442\u044c\u0441\u044f \u043f\u043e\u043c\u0438\u043b\u043a\u043e\u044e.
pscanrules.usercontrolledcookie.extrainfo = {\u0426\u0435 \u0431\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e \u0432..\:\n\n{1}\n\n\u0412\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0443\u043b\u043e \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0432 \u043d\u0430\u0441\u0442\u0443\u043f\u043d\u043e\u043c\u0443 \u0444\u0430\u0439\u043b\u0456 cookie\:\n{2}\n\n\u0412\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0443\u043b\u0438\:\n{3}\={4}
pscanrules.usercontrolledcookie.extrainfo.get = \u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432 \u0437\u043c\u043e\u0437\u0456 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u0456\u0432 cookie \u0447\u0435\u0440\u0435\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0438. \u0412\u0432\u0435\u0434\u0456\u0442\u044c \u043a\u0440\u0430\u043f\u043a\u0443 \u0437 \u043a\u043e\u043c\u043e\u044e, \u0449\u043e\u0431 \u043f\u043e\u0431\u0430\u0447\u0438\u0442\u0438, \u0447\u0438 \u043c\u043e\u0436\u043d\u0430 \u0434\u043e\u0434\u0430\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f cookie (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, name\=controlledValue;name\=anotherValue;).
pscanrules.usercontrolledcookie.extrainfo.post = An attacker may be able to poison cookie values through POST parameters. To test if this is a more serious issue, you should try resending that request as a GET, with the POST parameter included as a query string parameter. For example\:  https\://nottrusted.com/page?value\=maliciousInput.\n\n
pscanrules.usercontrolledcookie.name = Cookie Poisoning
pscanrules.usercontrolledcookie.refs = https\://en.wikipedia.org/wiki/HTTP_cookie\nhttps\://cwe.mitre.org/data/definitions/565.html
pscanrules.usercontrolledcookie.soln = \u041d\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0439\u0442\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\u043c \u043a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u0456\u043c\u0435\u043d\u0430\u043c\u0438 \u0442\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c\u0438 \u0444\u0430\u0439\u043b\u0456\u0432 cookie. \u042f\u043a\u0449\u043e \u0434\u0435\u044f\u043a\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0438 \u0432 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u0445 \u0444\u0430\u0439\u043b\u0456\u0432 cookie, \u0432\u0456\u0434\u0444\u0456\u043b\u044c\u0442\u0440\u0443\u0439\u0442\u0435 \u043a\u0440\u0430\u043f\u043a\u0438 \u0437 \u043a\u043e\u043c\u043e\u044e, \u044f\u043a\u0456 \u043c\u043e\u0436\u0443\u0442\u044c \u0441\u043b\u0443\u0436\u0438\u0442\u0438 \u0440\u043e\u0437\u0434\u0456\u043b\u044c\u043d\u0438\u043a\u0430\u043c\u0438 \u043f\u0430\u0440 \u0456\u043c\u2019\u044f/\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f.

pscanrules.usercontrolledhtmlattributes.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0440\u043e\u0437\u0433\u043b\u044f\u0434\u0430\u0454 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0442\u0430 \u0434\u0430\u043d\u0456 POST, \u0449\u043e\u0431 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438, \u0434\u0435 \u043f\u0435\u0432\u043d\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 HTML \u043c\u043e\u0436\u0443\u0442\u044c \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f. \u0426\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043d\u044f \u0431\u0435\u0437\u043f\u0440\u043e\u0432\u0456\u0434\u043d\u0438\u0445 \u0442\u043e\u0447\u043e\u043a \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043b\u044f XSS (\u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432), \u044f\u043a\u0456 \u0432\u0438\u043c\u0430\u0433\u0430\u044e\u0442\u044c \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0457 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0430\u043d\u0430\u043b\u0456\u0442\u0438\u043a\u043e\u043c \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f. 
pscanrules.usercontrolledhtmlattributes.extrainfo = \u0417\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 HTML, \u043a\u0435\u0440\u043e\u0432\u0430\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c. \u0421\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0432\u0441\u0442\u0430\u0432\u0438\u0442\u0438 \u0441\u043f\u0435\u0446\u0456\u0430\u043b\u044c\u043d\u0456 \u0441\u0438\u043c\u0432\u043e\u043b\u0438, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438, \u0447\u0438 \u043c\u043e\u0436\u043b\u0438\u0432\u0438\u0439 XSS. \u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u0437\u0430 \u0442\u0430\u043a\u043e\u044e URL-\u0430\u0434\u0440\u0435\u0441\u043e\u044e\:\n\n{0}\n\n\u0437\u0434\u0430\u0454\u0442\u044c\u0441\u044f, \u0432\u043a\u043b\u044e\u0447\u0430\u0454 \u0432\u0432\u0435\u0434\u0435\u043d\u043d\u044f \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0432\:\n\na(n) \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0435\u0433\u0443 [{1}] [{2}].\n\n\u0417\u043d\u0430\u0439\u0434\u0435\u043d\u0438\u0439 \u0432\u0445\u0456\u0434 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\:\n{3}\={4}\n\n\u041a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043e\u0432\u0430\u043d\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0431\u0443\u043b\u043e\:\n{5}
pscanrules.usercontrolledhtmlattributes.name = \u041a\u0435\u0440\u043e\u0432\u0430\u043d\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442 HTML-\u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 (\u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0439 XSS)\n
pscanrules.usercontrolledhtmlattributes.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Input_Validation_Cheat_Sheet.html
pscanrules.usercontrolledhtmlattributes.soln = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0441\u0456 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u0434\u0430\u043d\u0456 \u0442\u0430 \u043e\u0447\u0438\u0441\u0442\u044c\u0442\u0435 \u0432\u0438\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u043f\u0435\u0440\u0435\u0434 \u0437\u0430\u043f\u0438\u0441\u043e\u043c \u0434\u043e \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 HTML.

pscanrules.usercontrolledjavascriptevent.desc = \u0426\u044f \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u0440\u043e\u0437\u0433\u043b\u044f\u0434\u0430\u0454 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u0440\u044f\u0434\u043a\u0430 \u0437\u0430\u043f\u0438\u0442\u0443 \u0442\u0430 \u0434\u0430\u043d\u0456 POST, \u0449\u043e\u0431 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438, \u0434\u0435 \u043f\u0435\u0432\u043d\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0456\u0432 HTML \u043c\u043e\u0436\u0443\u0442\u044c \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f. \u0426\u0435 \u0437\u0430\u0431\u0435\u0437\u043f\u0435\u0447\u0443\u0454 \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043d\u044f \u0431\u0435\u0437\u043f\u0440\u043e\u0432\u0456\u0434\u043d\u0438\u0445 \u0442\u043e\u0447\u043e\u043a \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043b\u044f XSS (\u043c\u0456\u0436\u0441\u0430\u0439\u0442\u043e\u0432\u0438\u0445 \u0441\u0446\u0435\u043d\u0430\u0440\u0456\u0457\u0432), \u044f\u043a\u0456 \u0432\u0438\u043c\u0430\u0433\u0430\u044e\u0442\u044c \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u043e\u0457 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438 \u0430\u043d\u0430\u043b\u0456\u0442\u0438\u043a\u043e\u043c \u0431\u0435\u0437\u043f\u0435\u043a\u0438 \u0434\u043b\u044f \u0432\u0438\u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u043c\u043e\u0436\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f. 
pscanrules.usercontrolledjavascriptevent.extrainfo = User-controlled javascript event(s) was found. Exploitability will need to be manually determined. The page at the following URL\:\n\n{0}\n\nincludes the following Javascript event which may be attacker-controllable\: \n\nUser-input was found in the following data of an [{1}] event\:\n{2}\n\nThe user input was\:\n{3}
pscanrules.usercontrolledjavascriptevent.name = \u041a\u0435\u0440\u043e\u0432\u0430\u043d\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0435\u043c \u043f\u043e\u0434\u0456\u044f JavaScript (XSS)
pscanrules.usercontrolledjavascriptevent.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Input_Validation_Cheat_Sheet.html
pscanrules.usercontrolledjavascriptevent.soln = \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0441\u0456 \u0432\u0432\u0435\u0434\u0435\u043d\u0456 \u0434\u0430\u043d\u0456 \u0442\u0430 \u043e\u0447\u0438\u0441\u0442\u044c\u0442\u0435 \u0432\u0438\u0445\u0456\u0434\u043d\u0456 \u0434\u0430\u043d\u0456 \u043f\u0435\u0440\u0435\u0434 \u0437\u0430\u043f\u0438\u0441\u043e\u043c \u0434\u043e \u0431\u0443\u0434\u044c-\u044f\u043a\u0438\u0445 \u043f\u043e\u0434\u0456\u0439 Javascript on*.

pscanrules.usercontrolledopenredirect.desc = Open redirects are one of the OWASP 2010 Top Ten vulnerabilities. This check looks at user-supplied input in query string parameters and POST data to identify where open redirects might be possible. Open redirects occur when an application allows user-supplied input (e.g. https\://nottrusted.com) to control an offsite redirect. This is generally a pretty accurate way to find where 301 or 302 redirects could be exploited by spammers or phishing attacks.\n\nFor example an attacker could supply a user with the following link\: https\://example.com/example.php?url\=https\://malicious.example.com.
pscanrules.usercontrolledopenredirect.extrainfo.common = {0}\n\n\u0417\u043d\u0430\u0439\u0434\u0435\u043d\u0438\u0439 \u0432\u0445\u0456\u0434 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\:\n\n{1}\={2}\n\n\u041a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u0431\u0443\u0432 \u0442\u0430\u043a\u0438\u043c\:\n\n{3}
pscanrules.usercontrolledopenredirect.extrainfo.get = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c 301 \u0430\u0431\u043e 302 \u043d\u0430 \u0437\u0430\u043f\u0438\u0442 \u0449\u043e\u0434\u043e \u0442\u0430\u043a\u043e\u0457 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u043c\u0456\u0441\u0442\u0438\u043b\u0430 \u0434\u0430\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0432 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f\:
pscanrules.usercontrolledopenredirect.extrainfo.post = An open redirect controlled by POST parameters was detected. To test if this is a more serious issue, you should try resending that request as a GET, with the POST parameter included as a query string parameter. For example\: https\://nottrusted.com/page?url\=https\://lookout.net.\n\nThe 301 or 302 response to a request for the following URL appeared to contain user input in the location header\:\n\n
pscanrules.usercontrolledopenredirect.name = \u0412\u0456\u0434\u043a\u0440\u0438\u0442\u0438 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f
pscanrules.usercontrolledopenredirect.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Unvalidated_Redirects_and_Forwards_Cheat_Sheet.html\nhttps\://cwe.mitre.org/data/definitions/601.html
pscanrules.usercontrolledopenredirect.soln = \u0429\u043e\u0431 \u0443\u043d\u0438\u043a\u043d\u0443\u0442\u0438 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u043e\u0457 \u0443\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f, \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 \u043f\u0440\u0438\u043a\u043b\u0430\u0434\u043d\u043e\u0433\u043e \u0441\u043a\u0440\u0438\u043f\u0442\u0443/\u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438 \u0442\u0440\u0435\u0431\u0430 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u043f\u0435\u0440\u0435\u0434 \u043d\u0430\u0434\u0441\u0438\u043b\u0430\u043d\u043d\u044f\u043c 302 HTTP \u043a\u043e\u0434\u0443 (\u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f) \u0434\u043e \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u043a\u043b\u0456\u0454\u043d\u0442\u0430. \u0420\u0435\u0430\u043b\u0456\u0437\u0443\u0439\u0442\u0435 \u0431\u0435\u0437\u043f\u0435\u0447\u043d\u0438\u0439 \u0444\u0443\u043d\u043a\u0446\u0456\u043e\u043d\u0430\u043b\u044c\u043d\u0456\u0441\u0442\u044c \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u044f, \u044f\u043a\u0430 \u043f\u0435\u0440\u0435\u043d\u0430\u043f\u0440\u0430\u0432\u043b\u044f\u0454 \u0442\u0456\u043b\u044c\u043a\u0438 \u043d\u0430 \u0432\u0456\u0434\u043d\u043e\u0441\u043d\u0456 URI \u0430\u0431\u043e \u0441\u043f\u0438\u0441\u043e\u043a \u0434\u043e\u0432\u0456\u0440\u0435\u043d\u0438\u0445 \u0434\u043e\u043c\u0435\u043d\u0456\u0432

pscanrules.usernameidor.desc = A hash of a username ({0}) was found in the response. This may indicate that the application is subject to an Insecure Direct Object Reference (IDOR) vulnerability. Manual testing will be required to see if this discovery can be abused.
pscanrules.usernameidor.name = Username Hash Found
pscanrules.usernameidor.otherinfo = \u0413\u0435\u0448 \u0431\u0443\u0432 {0} \u0437\u0456 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\u043c\: {1}
pscanrules.usernameidor.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/05-Authorization_Testing/04-Testing_for_Insecure_Direct_Object_References.html
pscanrules.usernameidor.soln = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043d\u0435\u043f\u0440\u044f\u043c\u0456 \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043d\u0430 \u043e\u0431'\u0454\u043a\u0442\u0438 \u0434\u043b\u044f \u043a\u043e\u0436\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0430\u0431\u043e \u0441\u0435\u0430\u043d\u0441\u0443 (\u0441\u0442\u0432\u043e\u0440\u044e\u0439\u0442\u0435 \u0442\u0438\u043c\u0447\u0430\u0441\u043e\u0432\u0435 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u043d\u0430 \u0447\u0430\u0441 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f). \u0410\u0431\u043e \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u043e\u0436\u043d\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u043f\u0440\u044f\u043c\u043e\u0433\u043e \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u043d\u0430 \u043e\u0431'\u0454\u043a\u0442 \u043f\u043e\u0432'\u044f\u0437\u0430\u043d\u0435 \u0437 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457, \u0449\u043e\u0431 \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0442\u0438\u0441\u044f, \u0449\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043c\u0430\u0454 \u043f\u0440\u0430\u0432\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0434\u043e \u0437\u0430\u043f\u0438\u0442\u0443\u0432\u0430\u043d\u043e\u0433\u043e \u043e\u0431'\u0454\u043a\u0442\u0430. 

pscanrules.viewstate.content.email.desc = \u0411\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e, \u0449\u043e \u0442\u0430\u043a\u0456 \u0435\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u0456 \u043b\u0438\u0441\u0442\u0438 \u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u0432 \u043f\u043e\u043b\u0456 viewstate\:
pscanrules.viewstate.content.email.name = \u0415\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u0456 \u043b\u0438\u0441\u0442\u0438 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u043e \u0443 Viewstate
pscanrules.viewstate.content.email.pattern.source = Email pattern - https\://www.regular-expressions.info/email.html
pscanrules.viewstate.content.ip.desc = \u0411\u0443\u043b\u043e \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043e, \u0449\u043e \u0442\u0430\u043a\u0456 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0456 IP-\u0430\u0434\u0440\u0435\u0441\u0438 \u0441\u0435\u0440\u0456\u0430\u043b\u0456\u0437\u0443\u044e\u0442\u044c\u0441\u044f \u0432 \u043f\u043e\u043b\u0456 viewstate\:
pscanrules.viewstate.content.ip.name = \u041f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0456 IP-\u0430\u0434\u0440\u0435\u0441\u0438, \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u0456 \u0432 \u0441\u0442\u0430\u043d\u0456 \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443
pscanrules.viewstate.content.ip.pattern.source = IP pattern - https\://www.regular-expressions.info/ip.html
pscanrules.viewstate.name = Viewstate
pscanrules.viewstate.nomac.sure.desc = This website uses ASP.NET's Viewstate but without any MAC.\n\n
pscanrules.viewstate.nomac.sure.name = Viewstate without MAC Signature (Sure)
pscanrules.viewstate.nomac.sure.refs = https\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff649308(v\=pandp.10)
pscanrules.viewstate.nomac.sure.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e MAC \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a \u0446\u044c\u043e\u0433\u043e \u0432\u0435\u0431\u0441\u0430\u0439\u0442\u0443.
pscanrules.viewstate.nomac.unsure.desc = This website uses ASP.NET's Viewstate but maybe without any MAC.\n\n
pscanrules.viewstate.nomac.unsure.name = Viewstate without MAC Signature (Unsure)
pscanrules.viewstate.nomac.unsure.refs = https\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff649308(v\=pandp.10)
pscanrules.viewstate.nomac.unsure.soln = Ensure the MAC is set for all pages on this website.
pscanrules.viewstate.oldver.desc = \u0426\u0435\u0439 \u0432\u0435\u0431\u0441\u0430\u0439\u0442 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 1.0 \u0430\u0431\u043e 1.1 \u0432\u0435\u0440\u0441\u0456\u044e ASP.NET
pscanrules.viewstate.oldver.name = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454\u0442\u044c\u0441\u044f \u0441\u0442\u0430\u0440\u0430 \u0432\u0435\u0440\u0441\u0456\u044f Asp.Net 
pscanrules.viewstate.oldver.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0437\u0430\u043b\u0443\u0447\u0435\u043d\u0438\u0439 \u0444\u0440\u0435\u0439\u043c\u0432\u043e\u0440\u043a \u0432\u0441\u0435 \u0449\u0435 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454\u0442\u044c\u0441\u044f \u043a\u043e\u0440\u043f\u043e\u0440\u0430\u0446\u0456\u0454\u044e Microsoft.
pscanrules.viewstate.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043d\u0430\u0434\u0430\u043d\u0430 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f \u043d\u0435 \u0454 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u043e\u044e.
pscanrules.viewstate.split.desc = This website uses ASP.NET's Viewstate and its value is split into several chunks.\n
pscanrules.viewstate.split.name = Split Viewstate in Use
pscanrules.viewstate.split.soln = None - the guys running the server may have tuned the configuration as this isn't the default setting.

pscanrules.xaspnetversion.desc = Server leaks information via "X-AspNet-Version"/"X-AspNetMvc-Version" HTTP response header field(s).
pscanrules.xaspnetversion.extrainfo = \u0417\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0446\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e, \u0449\u043e\u0431 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0432\u0456\u0434\u043e\u043c\u0456 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0456.
pscanrules.xaspnetversion.name = X-AspNet-Version Response Header
pscanrules.xaspnetversion.refs = https\://www.troyhunt.com/shhh-dont-let-your-response-headers/\nhttps\://blogs.msdn.microsoft.com/varunm/2013/04/23/remove-unwanted-http-response-headers/
pscanrules.xaspnetversion.soln = \u041d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440 \u0442\u0430\u043a, \u0449\u043e\u0431 \u0432\u0456\u043d \u043d\u0435 \u043f\u043e\u0432\u0435\u0440\u0442\u0430\u0432 \u0446\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438.

pscanrules.xbackendserver.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u0432\u0438\u0442\u0456\u043a\u0430\u0454 \u0437 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457, \u0449\u043e \u0441\u0442\u043e\u0441\u0443\u0454\u0442\u044c\u0441\u044f \u0441\u0435\u0440\u0432\u0435\u0440\u043d\u0438\u0445 \u0441\u0438\u0441\u0442\u0435\u043c (\u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u0456\u043c\u0435\u043d\u0430 \u0445\u043e\u0441\u0442\u0456\u0432 \u0430\u0431\u043e IP-\u0430\u0434\u0440\u0435\u0441\u0438). \u041e\u0437\u0431\u0440\u043e\u0457\u0432\u0448\u0438\u0441\u044c \u0446\u0456\u0454\u044e \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0454\u044e, \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u0430\u0442\u0430\u043a\u0443\u0432\u0430\u0442\u0438 \u0456\u043d\u0448\u0456 \u0441\u0438\u0441\u0442\u0435\u043c\u0438 \u0430\u0431\u043e \u0431\u0456\u043b\u044c\u0448 \u043f\u0440\u044f\u043c\u043e/\u0435\u0444\u0435\u043a\u0442\u0438\u0432\u043d\u043e \u0430\u0442\u0430\u043a\u0443\u0432\u0430\u0442\u0438 \u0446\u0456 \u0441\u0438\u0441\u0442\u0435\u043c\u0438.
pscanrules.xbackendserver.extrainfo=
pscanrules.xbackendserver.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 X-Backend-Server
pscanrules.xbackendserver.refs=
pscanrules.xbackendserver.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432, \u0441\u0442\u0430\u0431\u0456\u043b\u0456\u0437\u0430\u0442\u043e\u0440 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u043f\u0440\u0438\u0434\u0443\u0448\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 X-Backend-Server.

pscanrules.xchromeloggerdata.desc = \u0421\u0435\u0440\u0432\u0435\u0440 \u0432\u0438\u0442\u0456\u043a\u0430\u0454 \u0447\u0435\u0440\u0435\u0437 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 X-ChromeLogger-Data (\u0430\u0431\u043e X-ChromePhp-Data). \u0420\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a \u043c\u043e\u0436\u0435 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u0442\u0438 \u0432\u043c\u0456\u0441\u0442 \u0442\u0430\u043a\u0438\u0445 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432, \u043e\u0434\u043d\u0430\u043a \u043d\u0435\u0440\u0456\u0434\u043a\u043e \u043c\u043e\u0436\u043d\u0430 \u0437\u043d\u0430\u0439\u0442\u0438\: \u0440\u043e\u0437\u0442\u0430\u0448\u0443\u0432\u0430\u043d\u043d\u044f \u0444\u0430\u0439\u043b\u043e\u0432\u043e\u0457 \u0441\u0438\u0441\u0442\u0435\u043c\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430, \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u043d\u044f vhost \u0442\u043e\u0449\u043e.
pscanrules.xchromeloggerdata.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 X-ChromeLogger-Data (XCOLD)
pscanrules.xchromeloggerdata.otherinfo.error = \u0417\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u0434\u0435\u043a\u043e\u0434\u043e\u0432\u0430\u043d\u043e \u0432 base64\:
pscanrules.xchromeloggerdata.otherinfo.msg = \u041d\u0438\u0436\u0447\u0435 \u043d\u0430\u0432\u0435\u0434\u0435\u043d\u043e \u0441\u043f\u0440\u043e\u0431\u0443 base64 \u0434\u0435\u043a\u043e\u0434\u0443\u0432\u0430\u043d\u043d\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f\:
pscanrules.xchromeloggerdata.refs = https\://craig.is/writing/chrome-logger
pscanrules.xchromeloggerdata.soln = \u0412\u0438\u043c\u043a\u043d\u0456\u0442\u044c \u0446\u044e \u0444\u0443\u043d\u043a\u0446\u0456\u044e \u0432 \u0440\u043e\u0431\u043e\u0447\u0456\u0439 \u0432\u0435\u0440\u0441\u0456\u0457, \u044f\u043a\u0449\u043e \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u0457 \u043c\u043e\u0436\u0435 \u0432\u0438\u0442\u0456\u043a\u0430\u0442\u0438 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044f, \u044f\u043a\u0443 \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a. \u041a\u0440\u0456\u043c \u0442\u043e\u0433\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u0430\u043d\u043d\u044f \u0446\u0456\u0454\u0457 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u043f\u043e\u0432\u2019\u044f\u0437\u0430\u043d\u0435 \u0437 \u043d\u0430\u0434\u0456\u0439\u043d\u043e\u044e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0430\u0432\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0456\u0457 \u0442\u0430 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0435 \u043b\u0438\u0448\u0435 \u0430\u0434\u043c\u0456\u043d\u0456\u0441\u0442\u0440\u0430\u0442\u043e\u0440\u0430\u043c \u0430\u0431\u043e \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u0443 \u0441\u043b\u0443\u0436\u0431\u0438 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0438 \u0434\u043b\u044f \u0446\u0456\u043b\u0435\u0439 \u0443\u0441\u0443\u043d\u0435\u043d\u043d\u044f \u043d\u0435\u0441\u043f\u0440\u0430\u0432\u043d\u043e\u0441\u0442\u0435\u0439, \u0430 \u043d\u0435 \u0437\u0432\u0438\u0447\u0430\u0439\u043d\u0438\u043c \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430\u043c.

pscanrules.xcontenttypeoptions.desc = \u0423 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0443 Anti-MIME-Sniffing X-Content-Type-Options \u043d\u0435 \u0431\u0443\u043b\u043e \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f 'nosniff'. \u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0441\u0442\u0430\u0440\u0438\u043c \u0432\u0435\u0440\u0441\u0456\u044f\u043c Internet Explorer \u0456 Chrome \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438 MIME-\u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0449\u043e \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u043e \u043c\u043e\u0436\u0435 \u043f\u0440\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0434\u043e \u0456\u043d\u0442\u0435\u0440\u043f\u0440\u0435\u0442\u0430\u0446\u0456\u0457 \u0442\u0430 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u043d\u044f \u0432\u043c\u0456\u0441\u0442\u0443 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456 \u044f\u043a \u0442\u0438\u043f\u0443 \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0443, \u0432\u0456\u0434\u043c\u0456\u043d\u043d\u043e\u0433\u043e \u0432\u0456\u0434 \u0437\u0430\u044f\u0432\u043b\u0435\u043d\u043e\u0433\u043e. \u041f\u043e\u0442\u043e\u0447\u043d\u0456 (\u043f\u043e\u0447\u0430\u0442\u043e\u043a 2014 \u0440\u043e\u043a\u0443) \u0442\u0430 \u0437\u0430\u0441\u0442\u0430\u0440\u0456\u043b\u0456 \u0432\u0435\u0440\u0441\u0456\u0457 Firefox \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u043c\u0443\u0442\u044c \u043e\u0433\u043e\u043b\u043e\u0448\u0435\u043d\u0438\u0439 \u0442\u0438\u043f \u0432\u043c\u0456\u0441\u0442\u0443 (\u044f\u043a\u0449\u043e \u0432\u0456\u043d \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0439), \u0430 \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0432\u0430\u0442\u0438\u043c\u0443\u0442\u044c MIME-\u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f.
pscanrules.xcontenttypeoptions.name = \u0412\u0456\u0434\u0441\u0443\u0442\u043d\u0456\u0439 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Content-Type-Options
pscanrules.xcontenttypeoptions.otherinfo = This issue still applies to error type pages (401, 403, 500, etc.) as those pages are often still affected by injection issues, in which case there is still concern for browsers sniffing pages away from their actual content type.\nAt "High" threshold this scan rule will not alert on client or server error responses.
pscanrules.xcontenttypeoptions.refs = https\://learn.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v\=vs.85)\nhttps\://owasp.org/www-community/Security_Headers
pscanrules.xcontenttypeoptions.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430/\u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a Content-Type \u043d\u0430\u043b\u0435\u0436\u043d\u0438\u043c \u0447\u0438\u043d\u043e\u043c, \u0430 \u0442\u0430\u043a\u043e\u0436 \u0432\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u044e\u0454 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Content-Type-Options \u043d\u0430 "nosniff" \u0434\u043b\u044f \u0432\u0441\u0456\u0445 \u0432\u0435\u0431-\u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a.\n\u042f\u043a\u0449\u043e \u043c\u043e\u0436\u043b\u0438\u0432\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u043a\u0456\u043d\u0446\u0435\u0432\u0438\u0439 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0441\u0443\u043c\u0456\u0441\u043d\u0438\u0439 \u0437\u0456 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0430\u043c\u0438 \u0441\u0443\u0447\u0430\u0441\u043d\u0438\u0439 \u0432\u0435\u0431\u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u044f\u043a\u0438\u0439 \u0432\u0437\u0430\u0433\u0430\u043b\u0456 \u043d\u0435 \u0432\u0438\u043a\u043e\u043d\u0443\u0454 MIME-\u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f, \u0430\u0431\u043e \u044f\u043a\u0438\u0439 \u043c\u043e\u0436\u0435 \u0431\u0443\u0442\u0438 \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0438\u0439 \u0432\u0435\u0431\u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u043e\u043c/\u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c \u043d\u0430 \u043d\u0435\u0432\u0438\u043a\u043e\u043d\u0430\u043d\u043d\u044f MIME-\u0440\u043e\u0437\u043f\u0456\u0437\u043d\u0430\u0432\u0430\u043d\u043d\u044f.

pscanrules.xdebugtoken.desc = \u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c \u043c\u0456\u0441\u0442\u0438\u0442\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a X-Debug-Token \u0430\u0431\u043e X-Debug-Token-Link. \u0426\u0435 \u0432\u043a\u0430\u0437\u0443\u0454 \u043d\u0430 \u0442\u0435, \u0449\u043e \u043f\u0440\u043e\u0444\u0430\u0439\u043b\u0435\u0440 Symfony \u043c\u043e\u0436\u0435 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0432\u0430\u0442\u0438\u0441\u044f \u0456 \u0440\u043e\u0437\u043a\u0440\u0438\u0432\u0430\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0434\u0435\u043d\u0446\u0456\u0439\u043d\u0456 \u0434\u0430\u043d\u0456.
pscanrules.xdebugtoken.name = \u0412\u0438\u0442\u0456\u043a \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 X-Debug-Token
pscanrules.xdebugtoken.otherinfo = By accessing a URL in the form https\://target_host/_profiler/token_value (i.e.\: https\://example.com/_profiler_/123ab4), you may gain access to the profiler and further leaked information.
pscanrules.xdebugtoken.refs = https\://symfony.com/doc/current/cookbook/profiler/profiling_data.html\nhttps\://symfony.com/blog/new-in-symfony-2-4-quicker-access-to-the-profiler-when-working-on-an-api
pscanrules.xdebugtoken.soln = Limit access to Symfony's Profiler, either via authentication/authorization or limiting inclusion of the header to specific clients (by IP, etc.).

pscanrules.xpoweredbyheaderinfoleak.desc = \u0412\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440/\u0441\u0435\u0440\u0432\u0435\u0440 \u0434\u043e\u0434\u0430\u0442\u043a\u0456\u0432 \u043f\u0440\u043e\u043f\u0443\u0441\u043a\u0430\u0454 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u044e \u0447\u0435\u0440\u0435\u0437 \u043e\u0434\u0438\u043d \u0430\u0431\u043e \u043a\u0456\u043b\u044c\u043a\u0430 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 HTTP-\u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0435\u0439 "X-\u041d\u0430-\u043e\u0441\u043d\u043e\u0432\u0456". \u0414\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u0442\u0430\u043a\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457 \u043c\u043e\u0436\u0435 \u043f\u043e\u043b\u0435\u0433\u0448\u0438\u0442\u0438 \u0437\u043b\u043e\u0432\u043c\u0438\u0441\u043d\u0438\u043a\u0430\u043c \u0432\u0438\u044f\u0432\u043b\u0435\u043d\u043d\u044f \u0456\u043d\u0448\u0438\u0445 \u0444\u0440\u0435\u0439\u043c\u0432\u043e\u0440\u043a\u0456\u0432/\u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0456\u0432, \u043d\u0430 \u044f\u043a\u0456 \u043f\u043e\u043a\u043b\u0430\u0434\u0430\u0454\u0442\u044c\u0441\u044f \u0432\u0430\u0448 \u0432\u0435\u0431-\u0434\u043e\u0434\u0430\u0442\u043e\u043a, \u0442\u0430 \u0432\u0440\u0430\u0437\u043b\u0438\u0432\u043e\u0441\u0442\u0435\u0439, \u0434\u043e \u044f\u043a\u0438\u0445 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u0441\u0445\u0438\u043b\u044c\u043d\u0456 \u0442\u0430\u043a\u0456 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0438.
pscanrules.xpoweredbyheaderinfoleak.extrainfo=
pscanrules.xpoweredbyheaderinfoleak.name = Server Leaks Information via "X-Powered-By" HTTP Response Header Field(s)
pscanrules.xpoweredbyheaderinfoleak.otherinfo.msg = \u0422\u0430\u043a\u043e\u0436 \u0431\u0443\u043b\u0438 \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u0456 \u0442\u0430\u043a\u0456 \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0438 X-Powered-By\:
pscanrules.xpoweredbyheaderinfoleak.refs = https\://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/01-Information_Gathering/08-Fingerprint_Web_Application_Framework\nhttps\://www.troyhunt.com/2012/02/shhh-dont-let-your-response-headers.html
pscanrules.xpoweredbyheaderinfoleak.soln = \u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0430\u0448 \u0432\u0435\u0431\u0441\u0435\u0440\u0432\u0435\u0440, \u0441\u0435\u0440\u0432\u0435\u0440 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0456\u0432, \u0441\u0442\u0430\u0431\u0456\u043b\u0456\u0437\u0430\u0442\u043e\u0440 \u043d\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0435\u043d\u043d\u044f \u0442\u043e\u0449\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u043e\u0432\u0430\u043d\u0456 \u043d\u0430 \u043f\u0440\u0438\u0434\u0443\u0448\u0435\u043d\u043d\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0456\u0432 "X-Powered-By".
