pscanrules.desc = Release status passive scan rules
pscanrules.name = Passive Scan Rules

pscanrules.payloader.desc=Provides support for custom payloads in scan rules.
pscanrules.payloader.name=Passive Scan Rules Release Custom Payloads

pscanrules.anticlickjacking.name = Anti-clickjacking Header
pscanrules.anticlickjacking.incInCsp = The Content-Security-Policy does include a 'frame-ancestors' element which takes precedence over the X-Frame-Options header, which is why this has been raised with a LOW risk.  
pscanrules.anticlickjacking.missing.name = Missing Anti-clickjacking Header
pscanrules.anticlickjacking.missing.desc = The response does not include either Content-Security-Policy with 'frame-ancestors' directive or X-Frame-Options to protect against 'ClickJacking' attacks.
pscanrules.anticlickjacking.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
pscanrules.anticlickjacking.missing.soln = Modern Web browsers support the Content-Security-Policy and X-Frame-Options HTTP headers. Ensure one of them is set on all web pages returned by your site/app.\nIf you expect the page to be framed only by pages on your server (e.g. it's part of a FRAMESET) then you'll want to use SAMEORIGIN, otherwise if you never expect the page to be framed, you should use DENY. Alternatively consider implementing Content Security Policy's "frame-ancestors" directive.
pscanrules.anticlickjacking.multiple.header.name = Multiple X-Frame-Options Header Entries
pscanrules.anticlickjacking.multiple.header.desc = X-Frame-Options (XFO) headers were found, a response with multiple XFO header entries may not be predictably treated by all user-agents.
pscanrules.anticlickjacking.multiple.header.refs = https\://tools.ietf.org/html/rfc7034
pscanrules.anticlickjacking.multiple.header.soln = Ensure only a single X-Frame-Options header is present in the response.
pscanrules.anticlickjacking.compliance.meta.name = X-Frame-Options Defined via META (Non-compliant with Spec)
pscanrules.anticlickjacking.compliance.meta.desc = An X-Frame-Options (XFO) META tag was found, defining XFO via a META tag is explicitly not supported by the spec (RFC 7034).
pscanrules.anticlickjacking.compliance.meta.refs = https\://tools.ietf.org/html/rfc7034\#section-4
pscanrules.anticlickjacking.compliance.meta.soln = Ensure X-Frame-Options is set via a response header field.  Alternatively consider implementing Content Security Policy's "frame-ancestors" directive.
pscanrules.anticlickjacking.compliance.malformed.setting.name = X-Frame-Options Setting Malformed
pscanrules.anticlickjacking.compliance.malformed.setting.desc = An X-Frame-Options header was present in the response but the value was not correctly set.
pscanrules.anticlickjacking.compliance.malformed.setting.refs = https\://tools.ietf.org/html/rfc7034\#section-2.1
pscanrules.anticlickjacking.compliance.malformed.setting.soln = Ensure a valid setting is used on all web pages returned by your site (if you expect the page to be framed only by pages on your server (e.g. it's part of a FRAMESET) then you'll want to use SAMEORIGIN, otherwise if you never expect the page to be framed, you should use DENY.  Alternatively consider implementing Content Security Policy's "frame-ancestors" directive.

pscanrules.authenticationcredentialscaptured.name=\u0985\u09a8\u09c1\u09ae\u09cb\u09a6\u09a8\u09c7\u09b0 \u09aa\u09b0\u09bf\u099a\u09df\u09aa\u09a4\u09cd\u09b0 \u09ac\u09a8\u09cd\u09a6\u09bf\u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7\u0964
pscanrules.authenticationcredentialscaptured.desc=An insecure authentication mechanism is in use. This allows an attacker on the network access to the userid and password of the authenticated user. For Basic Authentication, the attacker must merely monitor the network traffic until a Basic Authentication request is received, and then base64 decode the username and password.  For Digest Authentication, the attacker has access to the username, and possibly also the password, if the hash (including a nonce) can be successfully cracked, or if a Man-In-The-Middle attack is mounted.\nThe attacker eavesdrops on the network until an authentication has completed.
pscanrules.authenticationcredentialscaptured.soln=HTTPS \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8, \u098f\u09ac\u0982 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8  \u09af\u09be \u098f\u0995\u099f\u09bf \u0987\u0989\u09a8\u09bf\u0995-\u098f\u09a8\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f\u09c7\u09a1 \u09ab\u09cd\u09af\u09be\u09b6\u09a8 \u0987\u0989\u099c\u09be\u09b0 \u0986\u0987\u09a1\u09bf \u09ac\u09be \u09aa\u09be\u09b8\u0993\u09af\u09bc\u09be\u09b0\u09cd\u09a1 \u09aa\u09cd\u09b0\u09c7\u09b0\u09a3 \u0995\u09b0\u09c7 \u09a8\u09be . 
pscanrules.authenticationcredentialscaptured.refs=https\://owasp.org/www-community/attacks/Brute_force_attack\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanrules.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}][{1}]\u0985\u09b8\u09c1\u09b0\u0995\u09cd\u09b7\u09bf\u09a4 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be [{2}] \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0  \u09a8\u09be\u09ae [{3}] \u098f\u09ac\u0982 \u09aa\u09be\u09b8\u0993\u09df\u09be\u09b0\u09cd\u09a1 \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0964[{4}]
pscanrules.authenticationcredentialscaptured.alert.digestauth.extrainfo=\u0985\u09b8\u09c1\u09b0\u0995\u09cd\u09b7\u09bf\u09a4 \u09aa\u09cd\u09b0\u09ae\u09be\u09a3\u09c0\u0995\u09b0\u09a3 \u09aa\u09cd\u09b0\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0  \u09a8\u09be\u09ae \u098f\u09ac\u0982  \u0985\u09a4\u09bf\u09b0\u09bf\u0995\u09cd\u09a4 \u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6\u0964

pscanrules.charsetmismatch.variant.no_mismatch_metacontenttype_missing=(\u09ae\u09c7\u099f\u09be \u09a8\u09bf\u0996\u09cb\u0981\u099c \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1\u09b0 \u09a7\u09b0\u09a8 \u09ac\u09b0\u09cd\u09a3\u09ae\u09be\u09b2\u09be)
pscanrules.charsetmismatch.name=\u09ac\u09b0\u09cd\u09a3\u09ae\u09be\u09b2\u09be \u09ae\u09bf\u09b2 \u09a8\u09c7\u0987
pscanrules.charsetmismatch.variant.header_metacontentype_mismatch=(\u09b9\u09c7\u09a1\u09be\u09b0 \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1-\u099f\u09be\u0987\u09aa \u0985\u0995\u09cd\u09b7\u09b0)
pscanrules.charsetmismatch.variant.header_metacharset_mismatch=(\u09b9\u09c7\u09a1\u09be\u09b0 \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be)
pscanrules.charsetmismatch.variant.metacontenttype_metacharset_mismatch=(\u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be  \u09ac\u09a8\u09be\u09ae \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09af\u09bc\u09ac\u09b8\u09cd\u09a4\u09c1-\u099f\u09be\u0987\u09aa \u0985\u0995\u09cd\u09b7\u09b0)
pscanrules.charsetmismatch.desc=This check identifies responses where the HTTP Content-Type header declares a charset different from the charset defined by the body of the HTML or XML. When there's a charset mismatch between the HTTP header and content body Web browsers can be forced into an undesirable content-sniffing mode to determine the content's correct character set.\n\nAn attacker could manipulate content on the page to be interpreted in an encoding of their choice. For example, if an attacker can control content at the beginning of the page, they could inject script using UTF-7 encoded text and manipulate some browsers into interpreting that text.
pscanrules.charsetmismatch.soln=Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u099f\u09cd\u09af\u09be\u0997 \u098f\u0987\u099a\u099f\u09bf\u098f\u09ae\u098f\u09b2 \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u0985\u09a5\u09ac\u09be \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be \u098f\u0995\u09cd\u09b8\u098f\u09ae\u098f\u09b2 \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7  \u09b8\u0995\u09b2 \u09b2\u09c7\u0996\u09be\u09b0 \u09ac\u09b8\u09cd\u09a4\u09c1\u0995\u09c7 UTF-8 \u09ac\u09be\u09a7\u09cd\u09af \u0995\u09b0\u09c7\u0964
pscanrules.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanrules.charsetmismatch.extrainfo.html.no_mismatch_metacontenttype_missing=\u0985\u0995\u09cd\u09b7\u09b0\u099f\u09bf \u0995\u09c7\u09ac\u09b2\u09ae\u09be\u09a4\u09cd\u09b0 \u09ae\u09c7\u099f\u09be \u0985\u0995\u09cd\u09b7\u09b0\u09c7\u09b0 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b8\u0982\u099c\u09cd\u099e\u09be\u09af\u09bc\u09bf\u09a4 \u0995\u09b0\u09be \u09b9\u09af\u09bc, \u09aa\u09c1\u09b0\u09cb\u09a8\u09cb \u0995\u09cd\u09b2\u09be\u09af\u09bc\u09c7\u09a8\u09cd\u099f\u0997\u09c1\u09b2\u09bf \u09af\u09be \u09ae\u09c7\u099f\u09be \u0995\u09a8\u099f\u09c7\u09a8\u09cd\u099f-\u099f\u09be\u0987\u09ae \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ac\u09b0\u09cd\u09a3\u09bf\u09a4 \u0985\u0995\u09cd\u09b7\u09b0\u09c7\u09b0 \u09b8\u09c7\u099f\u099f\u09bf \u09b8\u09a0\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8  \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u09a8\u09be\u0964
pscanrules.charsetmismatch.extrainfo.html.header_metacontentype_mismatch=HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 META \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1  \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u098f\u0995\u099f\u09bf \u09ac\u09b0\u09cd\u09a3\u099a\u09bf\u09b9\u09cd\u09a8 \u09ac\u09bf\u099c\u09a1\u09bc\u09bf\u09a4 \u099b\u09bf\u09b2 - \u099f\u09be\u0987\u09aa \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a3\u09be\u09df \u098f\u09ac\u0982 \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf \u0964
pscanrules.charsetmismatch.extrainfo.html.header_metacharset_mismatch=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u09ac\u09b0\u09cd\u09a8\u09ae\u09be\u09b2\u09be\u09b0 \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf\u0964
pscanrules.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u09ae\u09c7\u099f\u09be \u09ac\u09bf\u09b7\u09df\u09ac\u09b8\u09cd\u09a4\u09c1  \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf\u0964
pscanrules.charsetmismatch.extrainfo.xml=\u09b8\u09c7\u0996\u09be\u09a8\u09c7 Http \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u098f\u09ac\u0982 \u098f\u0995\u09cd\u09b8\u098f\u09ae\u098f\u09b2 \u098f\u09a8\u0995\u09cb\u09a1\u09bf\u0982 \u0998\u09cb\u09b7\u09a8\u09be\u09df \u09ac\u09b0\u09cd\u09a8\u099a\u09bf\u09a8\u09cd\u09b9 \u09b9\u09be\u09b0\u09bf\u09df\u09c7\u099b\u09bf\u09b2  \u098f\u09ac\u0982 \u09a4\u09be \u09ae\u09c7\u09b2\u09c7\u09a8\u09bf

pscanrules.contentsecuritypolicymissing.name=Content Security Policy (CSP) Header Not Set
pscanrules.contentsecuritypolicymissing.desc=Content Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks, including Cross Site Scripting (XSS) and data injection attacks. These attacks are used for everything from data theft to site defacement or distribution of malware. CSP provides a set of standard HTTP headers that allow website owners to declare approved sources of content that browsers should be allowed to load on that page \u2014 covered types are JavaScript, CSS, HTML frames, fonts, images and embeddable objects such as Java applets, ActiveX, audio and video files.
pscanrules.contentsecuritypolicymissing.refs=https\://developer.mozilla.org/en-US/docs/Web/Security/CSP/Introducing_Content_Security_Policy\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Content_Security_Policy_Cheat_Sheet.html\nhttp\://www.w3.org/TR/CSP/\nhttp\://w3c.github.io/webappsec/specs/content-security-policy/csp-specification.dev.html\nhttp\://www.html5rocks.com/en/tutorials/security/content-security-policy/\nhttp\://caniuse.com/\#feat\=contentsecuritypolicy\nhttp\://content-security-policy.com/
pscanrules.contentsecuritypolicymissing.soln=Ensure that your web server, application server, load balancer, etc. is configured to set the Content-Security-Policy header, to achieve optimal browser support\: "Content-Security-Policy" for Chrome 25+, Firefox 23+ and Safari 7+, "X-Content-Security-Policy" for Firefox 4.0+ and Internet Explorer 10+, and "X-WebKit-CSP" for Chrome 14+ and Safari 6+.
pscanrules.contentsecuritypolicymissing.extrainfo=
pscanrules.contentsecuritypolicymissing.ro.name=Content Security Policy (CSP) Report-Only Header Found
pscanrules.contentsecuritypolicymissing.ro.desc=The response contained a Content-Security-Policy-Report-Only header, this may indicate a work-in-progress implementation, or an oversight in promoting pre-Prod to Prod, etc.\n\nContent Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks, including Cross Site Scripting (XSS) and data injection attacks. These attacks are used for everything from data theft to site defacement or distribution of malware. CSP provides a set of standard HTTP headers that allow website owners to declare approved sources of content that browsers should be allowed to load on that page \u2014 covered types are JavaScript, CSS, HTML frames, fonts, images and embeddable objects such as Java applets, ActiveX, audio and video files.
pscanrules.contentsecuritypolicymissing.ro.refs=https\://www.w3.org/TR/CSP2/\nhttps\://w3c.github.io/webappsec-csp/\nhttp\://caniuse.com/\#feat\=contentsecuritypolicy\nhttp\://content-security-policy.com/

pscanrules.cookiesamesite.name = Cookie without SameSite Attribute
pscanrules.cookiesamesite.none.name = Cookie with SameSite Attribute None
pscanrules.cookiesamesite.desc=A cookie has been set without the SameSite attribute, which means that the cookie can be sent as a result of a 'cross-site' request. \nThe SameSite attribute is an effective counter measure to cross-site request forgery, cross-site script inclusion, and timing attacks.
pscanrules.cookiesamesite.none.desc=A cookie has been set with its SameSite attribute set to "none", which means that the cookie can be sent as a result of a 'cross-site' request. \nThe SameSite attribute is an effective counter measure to cross-site request forgery, cross-site script inclusion, and timing attacks.
pscanrules.cookiesamesite.badval.name = Cookie with Invalid SameSite Attribute
pscanrules.cookiesamesite.badval.desc=A cookie has been set with an invalid SameSite attribute value, which means that the cookie can be sent as a result of a 'cross-site' request. \nThe SameSite attribute is an effective counter measure to cross-site request forgery, cross-site script inclusion, and timing attacks.
pscanrules.cookiesamesite.soln=Ensure that the SameSite attribute is set to either 'lax' or ideally 'strict' for all cookies.
pscanrules.cookiesamesite.refs=https\://tools.ietf.org/html/draft-ietf-httpbis-cookie-same-site

pscanrules.crossdomain.name=Cross-Domain Misconfiguration
pscanrules.crossdomain.desc=Web browser data loading may be possible, due to a Cross Origin Resource Sharing (CORS) misconfiguration on the web server
pscanrules.crossdomain.soln=Ensure that sensitive data is not available in an unauthenticated manner (using IP address white-listing, for instance).\nConfigure the "Access-Control-Allow-Origin" HTTP header to a more restrictive set of domains, or remove all CORS headers entirely, to allow the web browser to enforce the Same Origin Policy (SOP) in a more restrictive manner.
pscanrules.crossdomain.refs=https\://vulncat.fortify.com/en/detail?id\=desc.config.dotnet.html5_overly_permissive_cors_policy
pscanrules.crossdomain.extrainfo=The CORS misconfiguration on the web server permits cross-domain read requests from arbitrary third party domains, using unauthenticated APIs on this domain. Web browser implementations do not permit arbitrary third parties to read the response from authenticated APIs, however. This reduces the risk somewhat. This misconfiguration could be used by an attacker to access data that is available in an unauthenticated manner, but which uses some other form of security, such as IP address white-listing.

pscanrules.cookielooselyscoped.name=\u09b8\u09cd\u09ac\u09be\u09a7\u09c0\u09a8\u09ad\u09be\u09ac\u09c7 \u0995\u09c1\u0995\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df
pscanrules.cookielooselyscoped.desc=\u0995\u09c1\u0995\u09bf\u099c \u09a1\u09cb\u09ae\u09c7\u09a8 \u09ac\u09be \u09aa\u09a5 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4  \u0995\u09b0\u09be \u09af\u09c7\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 \u0964 \u098f\u0987 \u099a\u09c7\u0995 \u09b6\u09c1\u09a7\u09c1\u09ae\u09be\u09a4\u09cd\u09b0 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ac\u09cd\u09af\u09aa\u09cd\u09a4\u09bf\u09b0  \u09b8\u0999\u09cd\u0997\u09c7 \u09b8\u0982\u09b6\u09cd\u09b2\u09bf\u09b7\u09cd\u099f\u0964 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4\u09bf \u0986\u09ac\u09c7\u09a6\u09a8 \u0995\u09b0\u09be \u09b9\u09df \u098f\u0995\u099f\u09bf \u0995\u09c1\u0995\u09bf \u09a8\u09bf\u09b0\u09cd\u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 \u09af\u09be  \u09a1\u09cb\u09ae\u09c7\u09a8\u09c7 \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u0989\u09a6\u09be\u09b9\u09b0\u09a3\u09b8\u09cd\u09ac\u09b0\u09c2\u09aa, \u098f\u0995\u099f\u09bf \u0995\u09c1\u0995\u09bf \u0995\u09a0\u09cb\u09b0\u09ad\u09be\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u09b8\u09be\u09ac\u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7  \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u0995\u09b0\u09be  \u09af\u09be\u09ac\u09c7 \u09af\u09c7\u09ae\u09a8 www.nottrusted.com \u0985\u09a5\u09ac\u09be \u09b8\u09cd\u09ac\u09be\u09ad\u09be\u09ac\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u09af\u09c7\u09ae\u09a8 nottrusted.com \u0964\u09aa\u09b0\u09c7\u09b0\u099f\u09bf\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 nottrusted.com \u098f\u09b0 \u0995\u09cb\u09a8\u09cb  \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u09a7\u09c0\u09b0\u09c7 \u09a7\u09c0\u09b0\u09c7 \u0995\u09c1\u0995\u09bf\u0997\u09c1\u09b2\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4\u09bf\u0995\u09b0\u09be\u09a8\u09cb \u09b8\u09be\u09a7\u09be\u09b0\u09a8  \u09ae\u09c7\u0997\u09be-\u0985\u09cd\u09af\u09be\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8\u09c7 \u09af\u09c7\u09ae\u09a8 google.com \u098f\u09ac\u0982 live.com l \u0995\u09c1\u0995\u09bf\u099c \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df \u098f\u0995\u099f\u09bf \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u098f \u09af\u09c7\u09ae\u09a8 like.foo.bar \u09af\u09be \u09b6\u09c1\u09a7\u09c1\u09ae\u09be\u09a4\u09cd\u09b0 \u09ac\u09cd\u09b0\u09be\u0989\u099c\u09be\u09b0 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u0986\u09a6\u09be\u09a8 \u09aa\u09cd\u09b0\u09a6\u09be\u09a8 \u09b9\u09df\u0964\u09af\u09be\u0987 \u09b9\u09cb\u0995,\u0995\u09c1\u0995\u09bf \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995\u098f\u09b0 \u09ae\u09a4\u09cb \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u09c7 \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df \u09af\u09be \u09b9\u09df\u09a4\u09cb \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995 \u0995\u09c7\u0987 \u09a6\u09c7\u09df\u09be \u0985\u09a5\u09ac\u09be \u0985\u09ad\u09bf\u09ad\u09be\u09ac\u0995\u09c7\u09b0 \u0989\u09aa\u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u0995\u09c7\u0964
pscanrules.cookielooselyscoped.soln=\u09b8\u09ac\u09b8\u09ae\u09af\u09bc \u0995\u09c1\u0995\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u09cd\u09a4 \u09b9\u09df \u098f\u0995\u099f\u09bf FQDN (\u09aa\u09c1\u09b0\u09cb\u09aa\u09c1\u09b0\u09bf \u09af\u09cb\u0997\u09cd\u09af \u09a1\u09cb\u09ae\u09c7\u09a8 \u09a8\u09be\u09ae) \u098f
pscanrules.cookielooselyscoped.refs=https\://tools.ietf.org/html/rfc6265\#section-4.1\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html\nhttp\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanrules.cookielooselyscoped.extrainfo=\u09a4\u09c1\u09b2\u09a8\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u09ae\u09c2\u09b2 \u09a1\u09cb\u09ae\u09c7\u0987\u09a8\u099f\u09be \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09c3\u09a4 \u09b9\u09df\u09c7\u099b\u09bf\u09b2 {0}{1}
pscanrules.cookielooselyscoped.extrainfo.cookie={0\u0981}\n

pscanrules.informationdisclosuredebugerrors.name=\u09a4\u09cd\u09b0\u09c1\u099f\u09bf\u09af\u09c1\u0995\u09cd\u09a4 \u09ac\u09be\u09b0\u09cd\u09a4\u09be\u09df \u09ad\u09c1\u09b2 \u0996\u09c1\u099c\u09a4\u09c7-\u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09df\u0964
pscanrules.informationdisclosuredebugerrors.desc=\u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09af\u09bc\u09be\u09df \u09b8\u09be\u09a7\u09be\u09b0\u09a3 \u09a4\u09cd\u09b0\u09c1\u099f\u09bf \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09a8\u09bf\u09df\u09c7 \u09b9\u09be\u099c\u09bf\u09b0  \u09b9\u09df  \u09af\u09be \u0985\u09cd\u09af\u09be\u09aa\u09be\u099a\u09bf\u098f\u09b0 \u09ae\u09a4\u09cb \u09aa\u09cd\u09b2\u09cd\u09af\u09be\u099f\u09ab\u09b0\u09cd\u09ae \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ab\u09bf\u09b0\u09c7 \u0986\u09b8\u09c7 \u09af\u09c7\u09ae\u09a8  ASP.NET \u098f\u09ac\u0982 \u0993\u09af\u09bc\u09c7\u09ac \u09b8\u09be\u09b0\u09cd\u09ad\u09be\u09b0 ,\u0986\u0987\u0986\u0987\u098f\u09b8\u0964
pscanrules.informationdisclosuredebugerrors.soln=\u0989\u09a4\u09cd\u09aa\u09be\u09a6\u09a8 \u0995\u09b0\u09be\u09b0 \u0986\u0997\u09c7  \u09a1\u09bf\u09ac\u09be\u0997\u09bf\u0982 \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09a8\u09bf\u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09df \u0995\u09b0\u09c1\u09a8\u0964

pscanrules.informationdisclosureinurl.name=Information Disclosure - Sensitive Information in URL
pscanrules.informationdisclosureinurl.desc=Url \u098f\u09a7\u09be\u09b0\u09a8\u0995\u09c3\u09a4 \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u09ab\u09be\u09b8 \u0995\u09b0\u09a4\u09c7 \u0985\u09a8\u09c1\u09b0\u09cb\u09a7\u099f\u09bf \u0995\u09b0\u09be \u09b9\u09df \u0964\u098f\u099f\u09bf PCI \u098f\u09ac\u0982  \u09b8\u09be\u0982\u0997\u09a0\u09a8\u09bf\u0995 \u09b8\u09ae\u09cd\u09ae\u09a4\u09bf \u09a8\u09c0\u09a4\u09bf \u09b2\u0999\u09cd\u0998\u09a8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964\u0986\u09aa\u09a8\u09bf \u09b8\u09cd\u099f\u09cd\u09b0\u09bf\u0982 \u09a4\u09be\u09b2\u09bf\u0995\u09be \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u0985\u09a5\u09ac\u09be \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ae\u09be\u09a8 \u09ae\u09c1\u099b\u09c7 \u09ab\u09c7\u09b2\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964
pscanrules.informationdisclosureinurl.otherinfo.sensitiveinfo=The URL contains potentially sensitive information. The following string was found via the pattern\: {0}\n{1}
pscanrules.informationdisclosureinurl.otherinfo.cc=Url-\u099f\u09bf \u0995\u09cd\u09b0\u09c7\u09a1\u09bf\u099f \u0995\u09be\u09b0\u09cd\u09a1\u09c7\u09b0 \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7 \u09a6\u09c7\u0996\u09be \u09af\u09be\u09df\u0964
pscanrules.informationdisclosureinurl.otherinfo.email=Url-\u099f\u09bf \u0987-\u09ae\u09c7\u0987\u09b2 \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanrules.informationdisclosureinurl.otherinfo.ssn=Url-\u099f\u09bf  \u09ae\u09a8\u09c7 \u09b9\u09af\u09bc \u0986\u09ae\u09be\u09a6\u09c7\u09b0 \u09b8\u09be\u09ae\u09be\u099c\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be\u09b0 \u09b8\u0982\u0996\u09cd\u09af\u09be\u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7
pscanrules.informationdisclosureinurl.soln=URIs \u098f \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u098f\u09b0\u09bf\u0993\u09a8\u09be\u0964

pscanrules.informationdisclosurereferrer.name=\u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09af\u09bc-\u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae\u09c7
pscanrules.informationdisclosurereferrer.desc=HTTP \u09b6\u09bf\u09b0\u09cb\u09b2\u09c7\u0996\u099f\u09bf \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u09b8\u09cd\u09aa\u09b0\u09cd\u09b6\u0995\u09be\u09a4\u09b0 \u09aa\u09cd\u09af\u09be\u09b0\u09be\u09ae\u09bf\u099f\u09be\u09b0 \u0986\u09b0\u09c7\u0995\u099f\u09bf \u09a1\u09cb\u09ae\u09c7\u0987\u09a8 \u09ab\u09be\u0981\u09b8 \u0995\u09b0\u09c7 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 \u09aa\u09bf\u09b8\u09bf\u0986\u0987 \u0993 \u0985\u09a8\u09cd\u09af\u09a4\u09ae \u09b8\u09be\u0982\u0997\u09a0\u09a8\u09bf\u0995 \u0995\u09ae\u09aa\u09cd\u09b2\u09be\u09af\u09bc\u09c7\u09a8\u09cd\u09b8 \u09a8\u09c0\u09a4\u09bf \u09ad\u0999\u09cd\u0997 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964\u0964 \u0986\u09aa\u09a8\u09bf \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ae\u09be\u09a8 \u09af\u09cb\u0997 \u09ac\u09be \u0985\u09aa\u09b8\u09be\u09b0\u09a3 \u0995\u09b0\u09c7  \u098f\u0987 \u099a\u09c7\u0995 \u099c\u09a8\u09cd\u09af \u09b8\u09cd\u099f\u09cd\u09b0\u09bf\u0982 \u09a4\u09be\u09b2\u09bf\u0995\u09be \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u0964
pscanrules.informationdisclosurereferrer.otherinfo.sensitiveinfo=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanrules.informationdisclosurereferrer.otherinfo.cc=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u0995\u09cd\u09b0\u09c7\u09a1\u09bf\u099f \u0995\u09be\u09b0\u09cd\u09a1  \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanrules.informationdisclosurereferrer.otherinfo.email=\u0987-\u09ae\u09c7\u0987\u09b2 \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb HTTP \u09b6\u09bf\u09b0\u09cb\u09a8\u09be\u09ae \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0\u09c7\u09b0  \u09ae\u09be\u09a0\u09c7 \u09b0\u09af\u09bc\u09c7\u099b\u09c7\u0964
pscanrules.informationdisclosurereferrer.otherinfo.ssn=\u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u09b0\u09c7\u09ab\u09be\u09b0\u09be\u09b0 \u09b9\u09c7\u09a1\u09be\u09b0\u09c7\u09b0 \u0995\u09cd\u09b7\u09c7\u09a4\u09cd\u09b0\u09c7 URL \u0986\u09ae\u09be\u09a6\u09c7\u09b0 \u09b8\u09be\u09ae\u09be\u099c\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be\u09b0  \u09a4\u09a5\u09cd\u09af \u09a7\u09be\u09b0\u09a3 \u0995\u09b0\u09c7\u0964
pscanrules.informationdisclosurereferrer.soln=URIs \u098f \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09a4\u09a5\u09cd\u09af \u098f\u09b0\u09bf\u0993\u09a8\u09be\u0964
pscanrules.informationdisclosurereferrer.bin.field=Bank Identification Number\:
pscanrules.informationdisclosurereferrer.brand.field=Brand\:
pscanrules.informationdisclosurereferrer.category.field=Category\:
pscanrules.informationdisclosurereferrer.issuer.field=Issuer\:

pscanrules.informationdisclosuresuspiciouscomments.name=\u09b8\u09a8\u09cd\u09a6\u09c7\u09b9\u099c\u09a8\u0995 \u09ae\u09a8\u09cd\u09a4\u09ac\u09cd\u09af\u09c7- \u09a4\u09a5\u09cd\u09af \u09aa\u09cd\u09b0\u0995\u09be\u09b6 \u0995\u09b0\u09be \u09b9\u09af\u09bc
pscanrules.informationdisclosuresuspiciouscomments.desc=The response appears to contain suspicious comments which may help an attacker. Note\: Matches made within script blocks or files are against the entire content not only comments.
pscanrules.informationdisclosuresuspiciouscomments.otherinfo=The following pattern was used\: {0} and was detected in the element starting with\: "{1}", see evidence field for the suspicious comment/snippet.
pscanrules.informationdisclosuresuspiciouscomments.otherinfo2=The following pattern was used\: {0} and was detected {2} times, the first in the element starting with\: "{1}", see evidence field for the suspicious comment/snippet.
pscanrules.informationdisclosuresuspiciouscomments.soln=\ \u09b8\u09ac \u09ae\u09a8\u09cd\u09a4\u09ac\u09cd\u09af \u09b8\u09b0\u09be\u09a8 \u09af\u09be \u098f\u09ae\u09a8 \u09a4\u09a5\u09cd\u09af \u09a6\u09c7\u09df \u09af\u09c7 \u098f\u099f\u09be \u09b9\u09be\u09ae\u09b2\u09be\u0995\u09be\u09b0\u09c0\u0995\u09c7 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u098f\u09ac\u0982 \u09af\u09c7\u0995\u09cb\u09a8\u09cb \u099a\u09bf\u09a8\u09cd\u09b9\u09bf\u09a4 \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u09a0\u09bf\u0995 \u0995\u09b0\u09a4\u09c7\u09aa\u09be\u09b0\u09c7 \u09af\u09be \u09a4\u09be\u09b0\u09be \u09b0\u09c7\u09ab\u09be\u09b0 \u0995\u09b0\u09c7\u0964

pscanrules.insecureauthentication.name=\u09a6\u09c1\u09b0\u09cd\u09ac\u09b2 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a3 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf
pscanrules.insecureauthentication.desc=\u098f\u0995\u099f\u09bf \u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u09b8\u0982\u09af\u09cb\u0997\u09c7 HTTP \u09aa\u09cd\u09b0\u09be\u09a5\u09ae\u09bf\u0995 \u0985\u09a5\u09ac\u09be \u09aa\u09b0\u09bf\u09aa\u0995\u09cd\u0995 \u09b8\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a8 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09c3\u09a4 \u09b9\u09df\u09c7\u099b\u09bf\u09b2\u0964\u09aa\u09b0\u09bf\u099a\u09df \u09aa\u09a4\u09cd\u09b0\u0997\u09c1\u09b2\u09cb \u0995\u09c7\u0989 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u098f\u09ac\u0982 \u09aa\u09a1\u09bc\u09a4\u09c7  \u09aa\u09be\u09b0\u09ac\u09c7 \u098f\u0987 \u09a8\u09c7\u099f\u0993\u09df\u09be\u09b0\u09cd\u0995 \u098f \u0985\u09cd\u09af\u09be\u0995\u09cd\u09b8\u09c7\u09b8 \u09a8\u09bf\u09df\u09c7\u0964
pscanrules.insecureauthentication.soln=\ \u09b8\u0982\u09af\u09cb\u0997 \u09b0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09cb \u098f\u0987\u099a\u099f\u09bf\u099f\u09bf\u09aa\u09bf \u0985\u09a5\u09ac\u09be \u09b6\u0995\u09cd\u09a4\u09bf\u09b6\u09be\u09b2\u09c0 \u09b6\u09a8\u09be\u0995\u09cd\u09a4\u0995\u09b0\u09a8 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanrules.insecureauthentication.refs=https\://cheatsheetseries.owasp.org/cheatsheets/Authentication_Cheat_Sheet.html

pscanrules.insecurejsfviewstate.name=\u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6 JSF ViewState
pscanrules.insecurejsfviewstate.desc=\u098f\u0987 URL \u099f\u09bf\u09b0 \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09df\u09be \u098f\u0995\u099f\u09bf viewstate \u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7 \u09af\u09be\u09b0 \u0995\u09cb\u09a8\u09cb \u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f\u09cb\u0997\u09cd\u09b0\u09be\u09ab\u09bf\u0995 \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be \u09a8\u09c7\u0987\u0964
pscanrules.insecurejsfviewstate.soln=Viewstate \u0995\u09c7 \u09a8\u09bf\u09b0\u09be\u09aa\u09a6 \u0995\u09b0\u09cb Maac  \u098f\u09b0\u09b8\u09be\u09a5\u09c7 \u09af\u09be \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09bf\u09ac\u09c7\u09b6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f\u0964
pscanrules.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanrules.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] \u0985\u09a8\u09bf\u09b0\u09be\u09aa\u09a6\u0964

pscanrules.noanticsrftokens.name=Absence of Anti-CSRF Tokens
pscanrules.noanticsrftokens.desc=No Anti-CSRF tokens were found in a HTML submission form.
pscanrules.noanticsrftokens.alert.extrainfo=\ \u09a8\u09bf\u099a\u09c7\u09b0 HTML \u09ab\u09b0\u09cd\u09ae\u09c7 \u0995\u09cb\u09a8\u09cb  \u098f\u09a8\u09cd\u099f\u09bf-CSRF \u099f\u09cb\u0995\u09c7\u09a8 \u09aa\u09be\u0993\u09df\u09be \u09af\u09be\u09df\u09a8\u09bf\u0964
pscanrules.noanticsrftokens.extrainfo.annotation=\u098f\u099f\u09bf \u09b8\u09a4\u09b0\u09cd\u0995\u09c0\u0995\u09b0\u09a8\u09ac\u09be\u09b0\u09cd\u09a4\u09be \u09af\u09be\u09b0  \u09ab\u09b0\u09cd\u09ae\u09c7 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09be\u09aa\u09a4\u09cd\u09a4\u09be \u0987\u0999\u09cd\u0997\u09bf\u09a4 \u0986\u099b\u09c7 \u09af\u09be \u0987\u0999\u09cd\u0997\u09bf\u09a4 \u09a6\u09c7\u09af\u09bc \u09af\u09c7 \u098f\u099f\u09be\u09b0 \u0995\u09cb\u09a8\u09cb \u098f\u09a8\u09cd\u099f\u09bf-CSRF\u099f\u09cb\u0995\u09c7\u09a8\u09c7\u09b0 \u09a6\u09b0\u0995\u09be\u09b0 \u09a8\u09c7\u0987\u0964\u099f\u09bf\u0995\u09be\u099f\u09bf \u09b8\u09a0\u09bf\u0995 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u098f\u099f\u09bf \u09a8\u09bf\u099c\u09c7 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09be \u0989\u099a\u09bf\u09a4\u0964

pscanrules.timestampdisclosure.name=Timestamp Disclosure
pscanrules.timestampdisclosure.desc=A timestamp was disclosed by the application/web server
pscanrules.timestampdisclosure.soln=Manually confirm that the timestamp data is not sensitive, and that the data cannot be aggregated to disclose exploitable patterns.
pscanrules.timestampdisclosure.refs=http\://projects.webappsec.org/w/page/13246936/Information%20Leakage
pscanrules.timestampdisclosure.extrainfo={0}, which evaluates to\: {1}

pscanrules.usernameidor.name = Username Hash Found
pscanrules.usernameidor.desc = A hash of a username ({0}) was found in the response. This may indicate that the application is subject to an Insecure Direct Object Reference (IDOR) vulnerability. Manual testing will be required to see if this discovery can be abused.
pscanrules.usernameidor.otherinfo = The hash was an {0}, with value\: {1} 
pscanrules.usernameidor.soln = Use per user or session indirect object references (create a temporary mapping at time of use). Or, ensure that each use of a direct object reference is tied to an authorization check to ensure the user is authorized for the requested object. 
pscanrules.usernameidor.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/05-Authorization_Testing/04-Testing_for_Insecure_Direct_Object_References.html

pscanrules.xaspnetversion.name = X-AspNet-Version Response Header
pscanrules.xaspnetversion.desc =  Server leaks information via "X-AspNet-Version"/"X-AspNetMvc-Version" HTTP response header field(s).
pscanrules.xaspnetversion.soln = Configure the server so it will not return those headers.
pscanrules.xaspnetversion.extrainfo = An attacker can use this information to exploit known vulnerabilities.
pscanrules.xaspnetversion.refs = https\://www.troyhunt.com/shhh-dont-let-your-response-headers/\nhttps\://blogs.msdn.microsoft.com/varunm/2013/04/23/remove-unwanted-http-response-headers/

pscanrules.xdebugtoken.name=X-Debug-Token Information Leak
pscanrules.xdebugtoken.desc=The response contained an X-Debug-Token or X-Debug-Token-Link header. This indicates that Symfony's Profiler may be in use and exposing sensitive data.
pscanrules.xdebugtoken.otherinfo=By accessing a URL in the form http\://target_host/_profiler/token_value (i.e.\: http\://example.com/_profiler_/123ab4), you may gain access to the profiler and further leaked information.
pscanrules.xdebugtoken.refs=https\://symfony.com/doc/current/cookbook/profiler/profiling_data.html\nhttps\://symfony.com/blog/new-in-symfony-2-4-quicker-access-to-the-profiler-when-working-on-an-api
pscanrules.xdebugtoken.soln=Limit access to Symfony's Profiler, either via authentication/authorization or limiting inclusion of the header to specific clients (by IP, etc.).

pscanrules.xpoweredbyheaderinfoleak.name=Server Leaks Information via "X-Powered-By" HTTP Response Header Field(s)
pscanrules.xpoweredbyheaderinfoleak.desc=The web/application server is leaking information via one or more "X-Powered-By" HTTP response headers. Access to such information may facilitate attackers identifying other frameworks/components your web application is reliant upon and the vulnerabilities such components may be subject to.
pscanrules.xpoweredbyheaderinfoleak.refs=http\://blogs.msdn.com/b/varunm/archive/2013/04/23/remove-unwanted-http-response-headers.aspx\nhttp\://www.troyhunt.com/2012/02/shhh-dont-let-your-response-headers.html
pscanrules.xpoweredbyheaderinfoleak.soln=Ensure that your web server, application server, load balancer, etc. is configured to suppress "X-Powered-By" headers.
pscanrules.xpoweredbyheaderinfoleak.extrainfo=
pscanrules.xpoweredbyheaderinfoleak.otherinfo.msg=The following X-Powered-By headers were also found\:\r\n

pscanrules.xcontenttypeoptions.name = X-Content-Type-Options Header Missing
pscanrules.xcontenttypeoptions.desc = The Anti-MIME-Sniffing header X-Content-Type-Options was not set to 'nosniff'. This allows older versions of Internet Explorer and Chrome to perform MIME-sniffing on the response body, potentially causing the response body to be interpreted and displayed as a content type other than the declared content type. Current (early 2014) and legacy versions of Firefox will use the declared content type (if one is set), rather than performing MIME-sniffing.
pscanrules.xcontenttypeoptions.otherinfo = This issue still applies to error type pages (401, 403, 500, etc.) as those pages are often still affected by injection issues, in which case there is still concern for browsers sniffing pages away from their actual content type.\nAt "High" threshold this scan rule will not alert on client or server error responses.
pscanrules.xcontenttypeoptions.refs = http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx\nhttps\://owasp.org/www-community/Security_Headers
pscanrules.xcontenttypeoptions.soln = Ensure that the application/web server sets the Content-Type header appropriately, and that it sets the X-Content-Type-Options header to 'nosniff' for all web pages.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that does not perform MIME-sniffing at all, or that can be directed by the web application/web server to not perform MIME-sniffing.

pscanrules.applicationerrors.name = Application Error Disclosure
pscanrules.applicationerrors.desc = This page contains an error/warning message that may disclose sensitive information like the location of the file that produced the unhandled exception. This information can be used to launch further attacks against the web application. The alert could be a false positive if the error message is found inside a documentation page.
pscanrules.applicationerrors.soln = Review the source code of this page. Implement custom error pages. Consider implementing a mechanism to provide a unique error reference/identifier to the client (browser) while logging the details on the server side and not exposing them to the user.

pscanrules.cachecontrol.name = Re-examine Cache-control Directives
pscanrules.cachecontrol.desc = The cache-control header has not been set properly or is missing, allowing the browser and proxies to cache content. For static assets like css, js, or image files this might be intended, however, the resources should be reviewed to ensure that no sensitive content will be cached.
pscanrules.cachecontrol.soln = For secure content, ensure the cache-control HTTP header is set with "no-cache, no-store, must-revalidate". If an asset should be cached consider setting the directives "public, max-age, immutable".
pscanrules.cachecontrol.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html\#web-content-caching\nhttps\://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cache-Control

pscanrules.contenttypemissing.name = Content-Type Header Missing
pscanrules.contenttypemissing.name.empty = Content-Type Header Empty
pscanrules.contenttypemissing.desc = The Content-Type header was either missing or empty.
pscanrules.contenttypemissing.soln=Ensure each page is setting the specific and appropriate content-type value for the content being delivered.
pscanrules.contenttypemissing.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx

pscanrules.cookiehttponly.name = Cookie No HttpOnly Flag
pscanrules.cookiehttponly.desc=A cookie has been set without the HttpOnly flag, which means that the cookie can be accessed by JavaScript. If a malicious script can be run on this page then the cookie will be accessible and can be transmitted to another site. If this is a session cookie then session hijacking may be possible.
pscanrules.cookiehttponly.soln=Ensure that the HttpOnly flag is set for all cookies.
pscanrules.cookiehttponly.refs=https\://owasp.org/www-community/HttpOnly

pscanrules.cookiesecureflag.name = Cookie Without Secure Flag
pscanrules.cookiesecureflag.desc=A cookie has been set without the secure flag, which means that the cookie can be accessed via unencrypted connections.
pscanrules.cookiesecureflag.soln=Whenever a cookie contains sensitive information or is a session token, then it should always be passed using an encrypted channel. Ensure that the secure flag is set for cookies containing such sensitive information.
pscanrules.cookiesecureflag.refs=https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html

pscanrules.crossdomainscriptinclusion.name = Cross-Domain JavaScript Source File Inclusion
pscanrules.crossdomainscriptinclusion.desc=The page includes one or more script files from a third-party domain.
pscanrules.crossdomainscriptinclusion.soln=Ensure JavaScript source files are loaded from only trusted sources, and the sources can't be controlled by end users of the application.

pscanrules.csp.name=CSP
pscanrules.csp.desc=Content Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks. Including (but not limited to) Cross Site Scripting (XSS), and data injection attacks. These attacks are used for everything from data theft to site defacement or distribution of malware. CSP provides a set of standard HTTP headers that allow website owners to declare approved sources of content that browsers should be allowed to load on that page \u2014 covered types are JavaScript, CSS, HTML frames, fonts, images and embeddable objects such as Java applets, ActiveX, audio and video files.
pscanrules.csp.otherinfo.extended=\n\nThe directive(s)\: {0} are among the directives that do not fallback to default-src, missing/excluding them is the same as allowing anything.
pscanrules.csp.refs=http\://www.w3.org/TR/CSP2/\nhttp\://www.w3.org/TR/CSP/\nhttp\://caniuse.com/\#search\=content+security+policy\nhttp\://content-security-policy.com/\nhttps\://github.com/shapesecurity/salvation\nhttps\://developers.google.com/web/fundamentals/security/csp\#policy_applies_to_a_wide_variety_of_resources
pscanrules.csp.soln=Ensure that your web server, application server, load balancer, etc. is properly configured to set the Content-Security-Policy header.
pscanrules.csp.notices.name=Notices
pscanrules.csp.notices.errors=Errors\:
pscanrules.csp.notices.warnings=Warnings\:
pscanrules.csp.notices.infoitems=Info Items\:
pscanrules.csp.scriptsrc.unsafe.name=script-src unsafe-inline
pscanrules.csp.scriptsrc.unsafe.otherinfo=script-src includes unsafe-inline.
pscanrules.csp.scriptsrc.unsafe.hashes.name=script-src unsafe-hashes
pscanrules.csp.scriptsrc.unsafe.hashes.refs=https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-script/
pscanrules.csp.scriptsrc.unsafe.hashes.otherinfo=script-src includes unsafe-hashes, an attacker will be able to use any of the code covered by such hashes.
pscanrules.csp.stylesrc.unsafe.name=style-src unsafe-inline
pscanrules.csp.stylesrc.unsafe.otherinfo=style-src includes unsafe-inline.
pscanrules.csp.stylesrc.unsafe.hashes.name=style-src unsafe-hashes
pscanrules.csp.stylesrc.unsafe.hashes.refs=https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-style/
pscanrules.csp.stylesrc.unsafe.hashes.otherinfo=style-src includes unsafe-hashes, an attacker will be able to use any of the code covered by such hashes.
pscanrules.csp.wildcard.name=Wildcard Directive
pscanrules.csp.wildcard.otherinfo=The following directives either allow wildcard sources (or ancestors), are not defined, or are overly broadly defined\: \n{0}
pscanrules.csp.xcsp.name=X-Content-Security-Policy
pscanrules.csp.xcsp.otherinfo=The header X-Content-Security-Policy was found on this response. While it is a good sign that CSP is implemented to some degree the policy specified in this header has not been analyzed by ZAP. To ensure full support by modern browsers ensure that the Content-Security-Policy header is defined and attached to responses.
pscanrules.csp.xwkcsp.name=X-WebKit-CSP
pscanrules.csp.xwkcsp.otherinfo=The header X-WebKit-CSP was found on this response. While it is a good sign that CSP is implemented to some degree the policy specified in this header has not been analyzed by ZAP. To ensure full support by modern browsers ensure that the Content-Security-Policy header is defined and attached to responses.
pscanrules.csp.malformed.name=Malformed Policy (Non-ASCII)
pscanrules.csp.malformed.otherinfo=A non-ASCII character was encountered while attempting to parse the policy, thus rendering it invalid (no further evaluation occurred). The following invalid characters were collected\: {0}

pscanrules.mixedcontent.name = Secure Pages Include Mixed Content
pscanrules.mixedcontent.name.inclscripts = Secure Pages Include Mixed Content (Including Scripts)
pscanrules.mixedcontent.desc=The page includes mixed content, that is content accessed via HTTP instead of HTTPS.
pscanrules.mixedcontent.soln=A page that is available over SSL/TLS must be comprised completely of content which is transmitted over SSL/TLS.\nThe page must not contain any content that is transmitted over unencrypted HTTP.\n This includes content from third party sites.
pscanrules.mixedcontent.refs=https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html

pscanrules.infoprivateaddressdisclosure.name = Private IP Disclosure
pscanrules.infoprivateaddressdisclosure.desc = A private IP (such as 10.x.x.x, 172.x.x.x, 192.168.x.x) or an Amazon EC2 private hostname (for example, ip-10-0-56-78) has been found in the HTTP response body. This information might be helpful for further attacks targeting internal systems.
pscanrules.infoprivateaddressdisclosure.soln = Remove the private IP address from the HTTP response body.  For comments, use JSP/ASP/PHP comment instead of HTML/JavaScript comment which can be seen by client browsers.
pscanrules.infoprivateaddressdisclosure.refs = https\://tools.ietf.org/html/rfc1918

pscanrules.infosessionidurl.name = Session ID in URL Rewrite
pscanrules.infosessionidurl.desc = URL rewrite is used to track user session ID. The session ID may be disclosed via cross-site referer header. In addition, the session ID might be stored in browser history or server logs.
pscanrules.infosessionidurl.soln = For secure content, put session ID in a cookie. To be even more secure consider using a combination of cookie and URL rewrite.
pscanrules.infosessionidurl.refs = http\://seclists.org/lists/webappsec/2002/Oct-Dec/0111.html
pscanrules.infosessionidurl.referrer.alert = Referer Exposes Session ID
pscanrules.infosessionidurl.referrer.desc = A hyperlink pointing to another host name was found. As session ID URL rewrite is used, it may be disclosed in referer header to external hosts.
pscanrules.infosessionidurl.referrer.soln = This is a risk if the session ID is sensitive and the hyperlink refers to an external or third party host. For secure content, put session ID in secured session cookie.

pscanrules.viewstate.name=Viewstate
pscanrules.viewstate.soln=\u09b8\u09b0\u09ac\u09b0\u09be\u09b9\u0995\u09c3\u09a4 \u09a4\u09a5\u09cd\u09af\u09c7\u09b0 \u0997\u09cb\u09aa\u09a8\u09c0\u09af\u09bc\u09a4\u09be \u09ac\u099c\u09be\u09af\u09bc \u0986\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09af\u09be\u099a\u09be\u0987 \u0995\u09b0\u09c1\u09a8\u0964
pscanrules.viewstate.oldver.name=\u09aa\u09c1\u09b0\u09a8\u09cb Asp.Net \u09b8\u0982\u09b8\u09cd\u0995\u09b0\u09a3 \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09be \u09b9\u099a\u09cd\u099b\u09c7
pscanrules.viewstate.oldver.desc=***\u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995***\n\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u09b8\u0982\u09b8\u09cd\u0995\u09b0\u09a3 1.0 \u09ac\u09be 1.1\u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u0964
pscanrules.viewstate.oldver.soln=\u099c\u09a1\u09bc\u09bf\u09a4 \u0995\u09be\u09a0\u09be\u09ae\u09cb \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09c1\u09a8 \u09af\u09be \u098f\u0996\u09a8\u0993 \u09ae\u09be\u0987\u0995\u09cd\u09b0\u09cb\u09b8\u09ab\u099f \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b8\u09ae\u09b0\u09cd\u09a5\u09bf\u09a4\u0964
pscanrules.viewstate.nomac.unsure.name=Viewstate \u099b\u09be\u09a1\u09bc\u09be \u09ae\u09cd\u09af\u09be\u0995 \u09b8\u09cd\u09ac\u09be\u0995\u09cd\u09b7\u09b0 (\u0985\u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4)\u0964
pscanrules.viewstate.nomac.unsure.desc=***\u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995***\n\u09b9\u09af\u09bc\u09a4\u09cb \u0995\u09cb\u09a8\u0993 \u09ae\u09cd\u09af\u09be\u0995 \u099b\u09be\u09a1\u09bc\u09be\u0987 \u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanrules.viewstate.nomac.unsure.soln=\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u09c7 \u09b8\u09ac \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09df MAC \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09c1\u09a8
pscanrules.viewstate.nomac.unsure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanrules.viewstate.nomac.sure.name=Viewstate \u099b\u09be\u09a1\u09bc\u09be \u09ae\u09cd\u09af\u09be\u0995 \u09b8\u09cd\u09ac\u09be\u0995\u09cd\u09b7\u09b0 (\u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4)\u0964
pscanrules.viewstate.nomac.sure.desc=***\u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995***\n\u0995\u09cb\u09a8\u0993 \u09ae\u09cd\u09af\u09be\u0995 \u099b\u09be\u09a1\u09bc\u09be\u0987 \u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
pscanrules.viewstate.nomac.sure.soln=\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u09c7 \u09b8\u09ac \u09aa\u09c3\u09b7\u09cd\u09a0\u09be\u09df MAC \u09b8\u09c7\u099f \u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7 \u0995\u09bf\u09a8\u09be \u09a4\u09be \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u0995\u09b0\u09c1\u09a8
pscanrules.viewstate.nomac.sure.refs=http\://msdn.microsoft.com/en-us/library/ff649308.aspx
pscanrules.viewstate.split.name=\n\u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u09ad\u09be\u0997 \u09a6\u09c7\u0996\u09c1\u09a8
pscanrules.viewstate.split.desc=***\u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09ae\u09c1\u09b2\u0995***\n\u098f\u0987 \u0993\u09af\u09bc\u09c7\u09ac\u09b8\u09be\u0987\u099f\u099f\u09bf ASP.NET \u098f\u09b0 viewstate \u09ac\u09cd\u09af\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u098f\u09ac\u0982 \u098f\u09b0 \u09ae\u09c2\u09b2\u09cd\u09af \u09ac\u09bf\u09ad\u09bf\u09a8\u09cd\u09a8 \u0985\u0982\u09b6\u09c7 \u09ac\u09bf\u09ad\u0995\u09cd\u09a4\u0964
pscanrules.viewstate.split.soln=\u0995\u09c7\u0989 \u09a8\u09be \u0995\u09c7\u0989- \u099a\u09b2\u09ae\u09be\u09a8 \u09b8\u09be\u09b0\u09cd\u09ad\u09be\u09b0 \u0995\u09a8\u09ab\u09bf\u0997\u09be\u09b0\u09c7\u09b6\u09a8 \u099f\u09bf\u0989\u09a8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 \u0995\u09be\u09b0\u09a3 \u098f\u099f\u09bf \u09a1\u09bf\u09ab\u09b2\u09cd\u099f \u09b8\u09c7\u099f\u09bf\u0982 \u09a8\u09af\u09bc\u0964
pscanrules.viewstate.content.email.name=\u0987-\u09ae\u09c7\u0987\u09b2 Viewstate \u098f\u09aa\u09be\u0993\u09af\u09bc\u09be \u09af\u09be\u09af\u09bc\u0964
pscanrules.viewstate.content.email.desc=\u09a8\u09bf\u09ae\u09cd\u09a8\u09ac\u09b0\u09cd\u09a3\u09bf\u09a4 IP \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af viewstate \u09ae\u09be\u09a0\u09c7 \u09a7\u09be\u09b0\u09be\u09ac\u09be\u09b9\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u0996\u09c1\u0981\u099c\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u09af\u09be\u099a\u09cd\u099b\u09c7\u0964
pscanrules.viewstate.content.email.pattern.source=\u0986\u0987\u09aa\u09bf \u09a8\u0995\u09b6\u09be- http\://www.regular-expressions.info/regexbuddy/email.html
pscanrules.viewstate.content.ip.name=\u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u0986\u0987\u09aa\u09bf \u0985\u09cd\u09af\u09be\u09a1\u09cd\u09b0\u09c7\u09b8 Viewstate \u09a4\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u09af\u09be\u09af\u09bc\u0964
pscanrules.viewstate.content.ip.desc=\u09a8\u09bf\u09ae\u09cd\u09a8\u09ac\u09b0\u09cd\u09a3\u09bf\u09a4 IP \u09a0\u09bf\u0995\u09be\u09a8\u09be\u0997\u09c1\u09b2\u09cb \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af viewstate \u09ae\u09be\u09a0\u09c7 \u09a7\u09be\u09b0\u09be\u09ac\u09be\u09b9\u09bf\u0995\u09ad\u09be\u09ac\u09c7 \u0996\u09c1\u0981\u099c\u09c7 \u09aa\u09be\u0993\u09af\u09bc\u09be \u09af\u09be\u099a\u09cd\u099b\u09c7\u0964
pscanrules.viewstate.content.ip.pattern.source=\u0986\u0987\u09aa\u09bf \u09a8\u0995\u09b6\u09be- http\://www.regular-expressions.info/examples.html
