pscanrules.anticlickjacking.compliance.malformed.setting.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u304c\u5b58\u5728\u3057\u307e\u3059\u304c\u3001\u5024\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.anticlickjacking.compliance.malformed.setting.name = X-Frame-Options \u306e\u8a2d\u5b9a\u304c\u4e0d\u6b63
pscanrules.anticlickjacking.compliance.malformed.setting.refs = https\://datatracker.ietf.org/doc/html/rfc7034\#section-2.1
pscanrules.anticlickjacking.compliance.malformed.setting.soln = \u30b5\u30a4\u30c8\u304c\u8fd4\u3059\u3059\u3079\u3066\u306eWeb\u30da\u30fc\u30b8\u3067 X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u306b\u9069\u5207\u306a\u5024\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30da\u30fc\u30b8\u304c\u540c\u4e00\u30aa\u30ea\u30b8\u30f3\u306e\u30da\u30fc\u30b8\u306b\u306e\u307f\u57cb\u3081\u8fbc\u307e\u308c\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3057\u3066\u3044\u308b\u5834\u5408 (\u4f8b\: \u540c\u3058\u30b5\u30a4\u30c8\u5185\u306eiframe) \u306f SAMEORIGIN \u3092\u3001\u30da\u30fc\u30b8\u304c\u4e00\u5207\u30d5\u30ec\u30fc\u30e0\u306b\u57cb\u3081\u8fbc\u307e\u308c\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u306f DENY \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3088\u308a\u67d4\u8edf\u306a\u5236\u5fa1\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Content Security Policy \u306e\u300cframe-ancestors\u300d\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b9f\u88c5\u3092\u63a8\u5968\u3057\u307e\u3059\u3002
pscanrules.anticlickjacking.compliance.meta.desc = X-Frame-Options (XFO) \u306eMETA\u30bf\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002META\u30bf\u30b0\u306b\u3088\u308b XFO \u306e\u5b9a\u7fa9\u306f\u3001\u4ed5\u69d8 (RFC 7034) \u3067\u660e\u793a\u7684\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.anticlickjacking.compliance.meta.name = META\u30bf\u30b0\u3067\u5b9a\u7fa9\u3055\u308c\u305f X-Frame-Options (\u4ed5\u69d8\u975e\u6e96\u62e0)
pscanrules.anticlickjacking.compliance.meta.refs = https\://datatracker.ietf.org/doc/html/rfc7034\#section-4
pscanrules.anticlickjacking.compliance.meta.soln = X-Frame-Options \u304c\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u4ecb\u3057\u3066\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3042\u308b\u3044\u306f\u3001Content Security Policy \u306e "frame-ancestors" \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b9f\u88c5\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.anticlickjacking.incInCsp = Content-Security-Policy \u306b 'frame-ancestors' \u8981\u7d20\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u308c\u304c X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u3088\u308a\u512a\u5148\u3055\u308c\u307e\u3059\u3002\u305d\u306e\u305f\u3081\u3001\u3053\u306e\u8106\u5f31\u6027\u306f\u4f4e\u30ea\u30b9\u30af\u3068\u3057\u3066\u5831\u544a\u3055\u308c\u307e\u3057\u305f\u3002
pscanrules.anticlickjacking.missing.desc = \u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306f\u300c\u30af\u30ea\u30c3\u30af\u30b8\u30e3\u30c3\u30ad\u30f3\u30b0\u300d\u653b\u6483\u304b\u3089\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002Content-Security-Policy \u306e 'frame-ancestors' \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3001\u307e\u305f\u306f X-Frame-Options \u306e\u3044\u305a\u308c\u304b\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.anticlickjacking.missing.name = \u30af\u30ea\u30c3\u30af\u30b8\u30e3\u30c3\u30ad\u30f3\u30b0\u5bfe\u7b56\u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u5982
pscanrules.anticlickjacking.missing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/X-Frame-Options
pscanrules.anticlickjacking.missing.soln = \u73fe\u4ee3\u306eWeb\u30d6\u30e9\u30a6\u30b6\u306f Content-Security-Policy \u304a\u3088\u3073 X-Frame-Options HTTP\u30d8\u30c3\u30c0\u30fc\u306b\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u3059\u3002\u30b5\u30a4\u30c8/\u30a2\u30d7\u30ea\u304c\u8fd4\u3059\u3059\u3079\u3066\u306eWeb\u30da\u30fc\u30b8\u3067\u3001\u3053\u308c\u3089\u306e\u3044\u305a\u308c\u304b\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30da\u30fc\u30b8\u304c\u540c\u4e00\u30b5\u30fc\u30d0\u30fc\u306e\u30da\u30fc\u30b8\u304b\u3089\u306e\u307f\u30d5\u30ec\u30fc\u30e0\u306b\u57cb\u3081\u8fbc\u307e\u308c\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3059\u308b\u5834\u5408 (\u4f8b\: \u540c\u4e00\u30b5\u30a4\u30c8\u5185\u306eiframe) \u306f SAMEORIGIN \u3092\u3001\u30da\u30fc\u30b8\u304c\u4e00\u5207\u30d5\u30ec\u30fc\u30e0\u306b\u57cb\u3081\u8fbc\u307e\u308c\u308b\u3053\u3068\u3092\u60f3\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f DENY \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3088\u308a\u67d4\u8edf\u306a\u5236\u5fa1\u306b\u306f\u3001Content Security Policy \u306e\u300cframe-ancestors\u300d\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b9f\u88c5\u3092\u63a8\u5968\u3057\u307e\u3059\u3002
pscanrules.anticlickjacking.multiple.header.desc = X-Frame-Options (XFO) \u30d8\u30c3\u30c0\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u8907\u6570\u306eXFO\u30d8\u30c3\u30c0\u30fc\u3092\u542b\u3080\u30ec\u30b9\u30dd\u30f3\u30b9\u306f\u3001\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u3067\u4e88\u6e2c\u53ef\u80fd\u306a\u65b9\u6cd5\u3067\u51e6\u7406\u3055\u308c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.anticlickjacking.multiple.header.name = \u8907\u6570\u306eX-Frame-Options\u30d8\u30c3\u30c0\u30fc\u30a8\u30f3\u30c8\u30ea\u30fc
pscanrules.anticlickjacking.multiple.header.refs = https\://datatracker.ietf.org/doc/html/rfc7034
pscanrules.anticlickjacking.multiple.header.soln = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u5358\u4e00\u306eX-Frame-Options\u30d8\u30c3\u30c0\u30fc\u306e\u307f\u304c\u5b58\u5728\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.anticlickjacking.name = \u30af\u30ea\u30c3\u30af\u30b8\u30e3\u30c3\u30ad\u30f3\u30b0\u5bfe\u7b56\u30d8\u30c3\u30c0\u30fc

pscanrules.applicationerrors.desc = \u3053\u306e\u30da\u30fc\u30b8\u306b\u306f\u3001\u672a\u51e6\u7406\u4f8b\u5916\u3092\u767a\u751f\u3055\u305b\u305f\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u6240\u306a\u3069\u306e\u6a5f\u5bc6\u60c5\u5831\u3092\u958b\u793a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u30a8\u30e9\u30fc/\u8b66\u544a\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u60c5\u5831\u306f\u653b\u6483\u8005\u306b\u3088\u3063\u3066Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3078\u306e\u3055\u3089\u306a\u308b\u653b\u6483\u306b\u60aa\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30da\u30fc\u30b8\u5185\u306b\u8a18\u8f09\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u8aa4\u691c\u77e5\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.applicationerrors.name = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30a8\u30e9\u30fc\u306e\u9732\u898b
pscanrules.applicationerrors.soln = \u3053\u306e\u30da\u30fc\u30b8\u306e\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30ab\u30b9\u30bf\u30e0\u30a8\u30e9\u30fc\u30da\u30fc\u30b8\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30b5\u30fc\u30d0\u30fc\u5074\u3067\u8a73\u7d30\u3092\u8a18\u9332\u3057\u3064\u3064\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u516c\u958b\u3059\u308b\u3053\u3068\u306a\u304f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 (\u30d6\u30e9\u30a6\u30b6) \u306b\u4e00\u610f\u306e\u30a8\u30e9\u30fc\u53c2\u7167/\u8b58\u5225\u5b50\u3092\u63d0\u4f9b\u3059\u308b\u4ed5\u7d44\u307f\u306e\u5b9f\u88c5\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.authenticationcredentialscaptured.alert.basicauth.extrainfo = [{0}] [{1}] \u306f\u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f [{2}] \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30e6\u30fc\u30b6\u30fc\u540d [{3}] \u3068\u30d1\u30b9\u30ef\u30fc\u30c9 [{4}] \u304c\u508d\u53d7\u53ef\u80fd\u3067\u3059\u3002
pscanrules.authenticationcredentialscaptured.alert.digestauth.extrainfo = [{0}] [{1}] \u306f\u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f [{2}] \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30e6\u30fc\u30b6\u30fc\u540d [{3}] \u3068\u8ffd\u52a0\u60c5\u5831 [{4}] \u304c\u508d\u53d7\u53ef\u80fd\u3067\u3059\u3002
pscanrules.authenticationcredentialscaptured.desc = \u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3078\u306e\u30a2\u30af\u30bb\u30b9\u6a29\u3092\u6301\u3064\u653b\u6483\u8005\u306f\u3001\u8a8d\u8a3c\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u53d6\u5f97\u53ef\u80fd\u3067\u3059\u3002Basic\u8a8d\u8a3c\u3067\u306f\u3001\u653b\u6483\u8005\u306f\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30c8\u30e9\u30d5\u30a3\u30c3\u30af\u3092\u76e3\u8996\u3057\u3066Basic\u8a8d\u8a3c\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u508d\u53d7\u3057\u3001base64\u3067\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5bb9\u6613\u306b\u30c7\u30b3\u30fc\u30c9\u3067\u304d\u307e\u3059\u3002Digest\u8a8d\u8a3c\u3067\u306f\u3001\u653b\u6483\u8005\u306f\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u53d6\u5f97\u3067\u304d\u3001\u30cf\u30c3\u30b7\u30e5\u5024 (nonce\u3092\u542b\u3080) \u306e\u89e3\u8aad\u3084Man-in-the-Middle\u653b\u6483\u306b\u3088\u308a\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3082\u53d6\u5f97\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.authenticationcredentialscaptured.name = \u8a8d\u8a3c\u60c5\u5831\u304c\u53d6\u5f97\u3055\u308c\u307e\u3057\u305f
pscanrules.authenticationcredentialscaptured.refs = https\://owasp.org/www-community/attacks/Brute_force_attack\nhttps\://en.wikipedia.org/wiki/Digest_access_authentication
pscanrules.authenticationcredentialscaptured.soln = HTTPS\u3092\u4f7f\u7528\u3057\u3001\u30e6\u30fc\u30b6\u30fcID\u3084\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u65b9\u6cd5\u3067\u9001\u4fe1\u3057\u306a\u3044\u3001\u5b89\u5168\u306a\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u7279\u306b\u3001\u7c21\u5358\u306b\u7834\u3089\u308c\u308b\u5358\u7d14\u306a\u96e3\u8aad\u5316\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3042\u308bBasic\u8a8d\u8a3c\u306e\u4f7f\u7528\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.bigredirects.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u3001\u5927\u304d\u306a\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u4f34\u3046\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3067\u5fdc\u7b54\u3057\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3092\u9001\u4fe1\u3057\u305f\u306b\u3082\u304b\u304b\u308f\u3089\u305a\u3001\u672c\u6587\u30b3\u30f3\u30c6\u30f3\u30c4  (\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u3092\u7279\u5b9a\u3067\u304d\u308b\u60c5\u5831\u306a\u3069) \u3082\u8fd4\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u5506\u3057\u307e\u3059\u3002
pscanrules.bigredirects.extrainfo = Location\u30d8\u30c3\u30c0\u30fcURI\u306e\u9577\u3055\: {0} [{1}]\u3002\n\u4e88\u6e2c\u3055\u308c\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u30b5\u30a4\u30ba\: {2}\u3002\n\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u306e\u9577\u3055\: {3}\u3002
pscanrules.bigredirects.multi.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u3001\u8907\u6570\u306e\u30ea\u30f3\u30af\u3092\u542b\u3080\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3067\u5fdc\u7b54\u3057\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3092\u9001\u4fe1\u3057\u305f\u306b\u3082\u304b\u304b\u308f\u3089\u305a\u3001\u672c\u6587\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u30ea\u30f3\u30af (\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u3092\u7279\u5b9a\u3067\u304d\u308b\u60c5\u5831\u3001\u7ba1\u7406\u30d1\u30cd\u30eb\u3078\u306e\u30ea\u30f3\u30af\u306a\u3069) \u3082\u8fd4\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u5506\u3057\u307e\u3059
pscanrules.bigredirects.multi.extrainfo = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b "HREF" \u304c {0}\u4ef6\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002
pscanrules.bigredirects.multi.name = \u8907\u6570\u306e HREF \u3092\u542b\u3080\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3092\u691c\u51fa (\u6a5f\u5bc6\u60c5\u5831\u6f0f\u6d29\u306e\u53ef\u80fd\u6027)
pscanrules.bigredirects.name = \u30b5\u30a4\u30ba\u306e\u5927\u304d\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3092\u691c\u51fa (\u6a5f\u5bc6\u60c5\u5831\u6f0f\u6d29\u306e\u53ef\u80fd\u6027)
pscanrules.bigredirects.soln = \u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u5fdc\u7b54\u3092\u4ecb\u3057\u3066\u6a5f\u5bc6\u60c5\u5831\u304c\u6f0f\u6d29\u3057\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u5fdc\u7b54\u306b\u306f\u3001\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u307b\u3068\u3093\u3069\u542b\u307e\u308c\u306a\u3044\u3088\u3046\u306b\u3059\u3079\u304d\u3067\u3059\u3002

pscanrules.cachecontrol.desc = Cache-Control\u30d8\u30c3\u30c0\u30fc\u304c\u9069\u5207\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u6b20\u843d\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30d6\u30e9\u30a6\u30b6\u3084\u30d7\u30ed\u30ad\u30b7\u306b\u3088\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002CSS\u3001JavaScript\u3001\u753b\u50cf\u306a\u3069\u306e\u30d1\u30c3\u30b7\u30d6\u30ea\u30bd\u30fc\u30b9\u3067\u306f\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u9069\u5207\u306a\u5834\u5408\u3082\u3042\u308a\u307e\u3059\u304c\u3001\u6a5f\u5bc6\u60c5\u5831\u3092\u542b\u3080\u30da\u30fc\u30b8\u304c\u30ad\u30e3\u30c3\u30b7\u30e5\u3055\u308c\u306a\u3044\u3088\u3046\u3001\u3059\u3079\u3066\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.cachecontrol.name = Cache-control\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3092\u518d\u78ba\u8a8d\u3059\u308b
pscanrules.cachecontrol.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html\#web-content-caching\nhttps\://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Cache-Control\nhttps\://grayduck.mn/2021/09/13/cache-control-recommendations/
pscanrules.cachecontrol.soln = \u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u306f\u3001Cache-control HTTP\u30d8\u30c3\u30c0\u30fc\u306b "no-cache, no-store, must-revalidate" \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30a2\u30bb\u30c3\u30c8\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001"public, max-age, immutable" \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u8a2d\u5b9a\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.charsetmismatch.desc = \u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u3001HTTP Content-Type\u30d8\u30c3\u30c0\u30fc\u3067\u5ba3\u8a00\u3055\u308c\u305f\u6587\u5b57\u30bb\u30c3\u30c8\u3068\u3001HTML/XML\u306e\u672c\u6587\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u6587\u5b57\u30bb\u30c3\u30c8\u304c\u7570\u306a\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u7279\u5b9a\u3057\u307e\u3059\u3002\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4\u306b\u3088\u308a\u3001Web\u30d6\u30e9\u30a6\u30b6\u306f\u671b\u307e\u3057\u304f\u306a\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u63a8\u6e2c\u30e2\u30fc\u30c9\u306b\u5165\u308a\u3001\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u6b63\u3057\u3044\u6587\u5b57\u30bb\u30c3\u30c8\u3092\u5224\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002\n\n\u653b\u6483\u8005\u306f\u30da\u30fc\u30b8\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u5236\u5fa1\u3057\u3066\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u89e3\u91c8\u3092\u60aa\u7528\u3067\u304d\u307e\u3059\u3002\u4f8b\u3068\u3057\u3066\u3001\u30da\u30fc\u30b8\u5148\u982d\u3092\u5236\u5fa1\u53ef\u80fd\u306a\u653b\u6483\u8005\u304cUTF-7\u30a8\u30f3\u30b3\u30fc\u30c9\u30c6\u30ad\u30b9\u30c8\u3067\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u6ce8\u5165\u3057\u3001\u7279\u5b9a\u306e\u30d6\u30e9\u30a6\u30b6\u306b\u305d\u306e\u30c6\u30ad\u30b9\u30c8\u3092\u5b9f\u884c\u3055\u305b\u308b\u653b\u6483\u304c\u6319\u3052\u3089\u308c\u307e\u3059\u3002
pscanrules.charsetmismatch.extrainfo.html.header_metacharset_mismatch = HTTP\u30d8\u30c3\u30c0\u30fc\u3068META\u6587\u5b57\u30bb\u30c3\u30c8\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u9593\u3067\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4\u304c\u3042\u308a\u307e\u3057\u305f\: [{0}] \u3068 [{1}] \u306f\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
pscanrules.charsetmismatch.extrainfo.html.header_metacontentype_mismatch = HTTP\u30d8\u30c3\u30c0\u30fc\u3068META\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u9593\u3067\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4\u304c\u3042\u308a\u307e\u3057\u305f\: [{0}] \u3068 [{1}] \u306f\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
pscanrules.charsetmismatch.extrainfo.html.metacontenttype_metacharset_mismatch = META\u6587\u5b57\u30bb\u30c3\u30c8\u3068META\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u9593\u3067\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4\u304c\u3042\u308a\u307e\u3057\u305f\: [{0}] \u3068 [{1}] \u306f\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
pscanrules.charsetmismatch.extrainfo.xml = HTTP \u30d8\u30c3\u30c0\u30fc\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8 [{0}] \u3068 XML\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u6307\u5b9a [{1}] \u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.charsetmismatch.name = \u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4
pscanrules.charsetmismatch.name.header_metacharset_mismatch = \u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4 (\u30d8\u30c3\u30c0\u30fc\u3068 META \u6587\u5b57\u30bb\u30c3\u30c8)
pscanrules.charsetmismatch.name.header_metacontentype_mismatch = \u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4 (\u30d8\u30c3\u30c0\u30fc\u3068 META Content-Type \u6587\u5b57\u30bb\u30c3\u30c8)
pscanrules.charsetmismatch.name.metacontenttype_metacharset_mismatch = \u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4 (META Charset \u3068 META Content-Type \u6587\u5b57\u30bb\u30c3\u30c8)
pscanrules.charsetmismatch.refs = https\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanrules.charsetmismatch.soln = HTTP\u30d8\u30c3\u30c0\u30fc\u3001HTML\u306e meta \u30bf\u30b0\u3001\u307e\u305f\u306fXML\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u5185\u306e\u3059\u3079\u3066\u306e\u30c6\u30ad\u30b9\u30c8\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u306f\u3001UTF-8\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.contentsecuritypolicymissing.desc = Content Security Policy (CSP) \u306f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (XSS) \u3084\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u653b\u6483\u306a\u3069\u306e\u7279\u5b9a\u306e\u653b\u6483\u3092\u691c\u51fa\u30fb\u8efd\u6e1b\u3059\u308b\u305f\u3081\u306e\u8ffd\u52a0\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6a5f\u69cb\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u653b\u6483\u306f\u3001\u30c7\u30fc\u30bf\u7a83\u53d6\u3001\u30b5\u30a4\u30c8\u6539\u3056\u3093\u3001\u30de\u30eb\u30a6\u30a7\u30a2\u914d\u5e03\u306a\u3069\u69d8\u3005\u306a\u60aa\u610f\u306e\u3042\u308b\u6d3b\u52d5\u306b\u5229\u7528\u3055\u308c\u307e\u3059\u3002CSP\u306fWeb\u30b5\u30a4\u30c8\u7ba1\u7406\u8005\u304c\u30d6\u30e9\u30a6\u30b6\u306b\u5bfe\u3057\u3066\u30da\u30fc\u30b8\u4e0a\u3067\u8aad\u307f\u8fbc\u307f\u8a31\u53ef\u3059\u308b\u30ea\u30bd\u30fc\u30b9\u306e\u4fe1\u983c\u3067\u304d\u308b\u30bd\u30fc\u30b9\u3092\u5ba3\u8a00\u3059\u308b\u305f\u3081\u306e\u6a19\u6e96HTTP\u30d8\u30c3\u30c0\u30fc\u7fa4\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u5236\u5fa1\u5bfe\u8c61\u306b\u306f\u3001JavaScript\u3001CSS\u3001\u30d5\u30ec\u30fc\u30e0\u3001\u30d5\u30a9\u30f3\u30c8\u3001\u753b\u50cf\u3001\u30e1\u30c7\u30a3\u30a2\u30d5\u30a1\u30a4\u30eb\u306a\u3069\u306e\u5404\u7a2e\u30ea\u30bd\u30fc\u30b9\u304c\u542b\u307e\u308c\u307e\u3059\u3002
pscanrules.contentsecuritypolicymissing.name = Content Security Policy (CSP) \u30d8\u30c3\u30c0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044
pscanrules.contentsecuritypolicymissing.obs.desc = X-Content-Security-Policy \u304a\u3088\u3073 X-WebKit-CSP \u30d8\u30c3\u30c0\u30fc\u306f\u3001\u3082\u306f\u3084\u63a8\u5968\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.contentsecuritypolicymissing.obs.name = \u5ec3\u6b62\u3055\u308c\u305fContent Security Policy (CSP) \u30d8\u30c3\u30c0\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
pscanrules.contentsecuritypolicymissing.refs = https\://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/CSP\nhttps\://cheatsheetseries.owasp.org/cheatsheets/Content_Security_Policy_Cheat_Sheet.html\nhttps\://www.w3.org/TR/CSP/\nhttps\://w3c.github.io/webappsec-csp/\nhttps\://web.dev/articles/csp\nhttps\://caniuse.com/\#feat\=contentsecuritypolicy\nhttps\://content-security-policy.com/
pscanrules.contentsecuritypolicymissing.ro.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b Content-Security-Policy-Report-Only \u30d8\u30c3\u30c0\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u308c\u306fCSP\u30dd\u30ea\u30b7\u30fc\u306e\u30c6\u30b9\u30c8\u6bb5\u968e\u3067\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u304c\u3001\u672c\u756a\u74b0\u5883\u3067\u306f\u901a\u5e38\u3001\u5f37\u5236\u30e2\u30fc\u30c9 (Content-Security-Policy) \u3078\u306e\u79fb\u884c\u304c\u63a8\u5968\u3055\u308c\u307e\u3059\u3002\u30b9\u30c6\u30fc\u30b8\u30f3\u30b0\u74b0\u5883\u304b\u3089\u672c\u756a\u74b0\u5883\u3078\u306e\u79fb\u884c\u6642\u306e\u8a2d\u5b9a\u898b\u843d\u3068\u3057\u306e\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002\n\nContent Security Policy (CSP) \u306f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (XSS) \u3084\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u653b\u6483\u306a\u3069\u306e\u7279\u5b9a\u306e\u653b\u6483\u3092\u691c\u51fa\u30fb\u8efd\u6e1b\u3059\u308b\u305f\u3081\u306e\u8ffd\u52a0\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6a5f\u69cb\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u653b\u6483\u306f\u3001\u30c7\u30fc\u30bf\u7a83\u53d6\u3001\u30b5\u30a4\u30c8\u6539\u3056\u3093\u3001\u30de\u30eb\u30a6\u30a7\u30a2\u914d\u5e03\u306a\u3069\u69d8\u3005\u306a\u60aa\u610f\u306e\u3042\u308b\u6d3b\u52d5\u306b\u5229\u7528\u3055\u308c\u307e\u3059\u3002CSP\u306f\u3001Web\u30b5\u30a4\u30c8\u7ba1\u7406\u8005\u304c\u30d6\u30e9\u30a6\u30b6\u306b\u5bfe\u3057\u3066\u30da\u30fc\u30b8\u4e0a\u3067\u8aad\u307f\u8fbc\u307f\u8a31\u53ef\u3059\u308b\u30ea\u30bd\u30fc\u30b9\u306e\u4fe1\u983c\u3067\u304d\u308b\u30bd\u30fc\u30b9\u3092\u5ba3\u8a00\u3059\u308b\u305f\u3081\u306e\u6a19\u6e96HTTP\u30d8\u30c3\u30c0\u30fc\u7fa4\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u5236\u5fa1\u5bfe\u8c61\u306b\u306f\u3001JavaScript\u3001CSS\u3001\u30d5\u30ec\u30fc\u30e0\u3001\u30d5\u30a9\u30f3\u30c8\u3001\u753b\u50cf\u3001\u5404\u7a2e\u30e1\u30c7\u30a3\u30a2\u30d5\u30a1\u30a4\u30eb\u306a\u3069\u304c\u542b\u307e\u308c\u307e\u3059\u3002
pscanrules.contentsecuritypolicymissing.ro.name = Content Security Policy (CSP) Report-Only \u30d8\u30c3\u30c0\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f
pscanrules.contentsecuritypolicymissing.ro.refs = https\://www.w3.org/TR/CSP2/\nhttps\://w3c.github.io/webappsec-csp/\nhttps\://caniuse.com/\#feat\=contentsecuritypolicy\nhttps\://content-security-policy.com/
pscanrules.contentsecuritypolicymissing.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001Content-Security-Policy\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.contenttypemissing.desc = Content-Type\u30d8\u30c3\u30c0\u30fc\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u304b\u3001\u7a7a\u3067\u3057\u305f\u3002
pscanrules.contenttypemissing.name = Content-Type\u30d8\u30c3\u30c0\u30fc\u304c\u3042\u308a\u307e\u305b\u3093
pscanrules.contenttypemissing.name.empty = Content-Type\u30d8\u30c3\u30c0\u30fc\u304c\u7a7a
pscanrules.contenttypemissing.refs = https\://learn.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v\=vs.85)
pscanrules.contenttypemissing.soln = \u5404\u30da\u30fc\u30b8\u304c\u914d\u4fe1\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u5bfe\u3057\u3066\u3001\u5177\u4f53\u7684\u3067\u9069\u5207\u306aContent-Type\u5024\u3092\u8a2d\u5b9a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.cookiehttponly.desc = Cookie\u304cHttpOnly\u30d5\u30e9\u30b0\u306a\u3057\u3067\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001Cookie\u306fJavaScript\u304b\u3089\u8aad\u307f\u53d6\u308a\u53ef\u80fd\u3068\u306a\u308a\u307e\u3059\u3002XSS (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0) \u653b\u6483\u306a\u3069\u3067\u60aa\u610f\u306e\u3042\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u30da\u30fc\u30b8\u4e0a\u3067\u5b9f\u884c\u3055\u308c\u305f\u5834\u5408\u3001\u653b\u6483\u8005\u306fCookie\u306e\u5024\u3092\u53d6\u5f97\u3057\u3066\u5916\u90e8\u30b5\u30fc\u30d0\u30fc\u306b\u9001\u4fe1\u3067\u304d\u307e\u3059\u3002\u7279\u306b\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306e\u5834\u5408\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u653b\u6483\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u304c\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4e57\u3063\u53d6\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.cookiehttponly.name = Cookie\u306bHttpOnly\u30d5\u30e9\u30b0\u304c\u306a\u3044
pscanrules.cookiehttponly.refs = https\://owasp.org/www-community/HttpOnly
pscanrules.cookiehttponly.soln = \u3059\u3079\u3066\u306eCookie\u306bHttpOnly\u30d5\u30e9\u30b0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.cookielooselyscoped.desc = \u30af\u30c3\u30ad\u30fc\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u307e\u305f\u306f\u30d1\u30b9\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u3067\u30b9\u30b3\u30fc\u30d7\u3092\u9650\u5b9a\u3059\u308b\u4e8b\u304c\u3067\u304d\u307e\u3059\u3002\n\u3053\u306e\u691c\u67fb\u306f\u3001\u30b9\u30b3\u30fc\u30d7\u306b\u30c9\u30e1\u30a4\u30f3\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3092\u5bfe\u8c61\u3068\u3057\u3066\u3044\u307e\u3059\u3002\u30af\u30c3\u30ad\u30fc\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30c9\u30e1\u30a4\u30f3\u30b9\u30b3\u30fc\u30d7\u306f\u3001\u3069\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u30af\u30c3\u30ad\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u304b\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002\n\u30c9\u30e1\u30a4\u30f3\u30b9\u30b3\u30fc\u30d7\u306f\u3001\u4f8b\u3048\u3070\u3001 "www.nottrusted.com" \u306e\u3088\u3046\u306b\u3001\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u307e\u3067\u53b3\u5bc6\u306b\u6307\u5b9a\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u3001 "nottrusted.com" \u306e\u3088\u3046\u306b\u4e0a\u4f4d\u306e\u30c9\u30e1\u30a4\u30f3\u3092\u6307\u5b9a\u3057\u3066\u5e83\u3044\u30b9\u30b3\u30fc\u30d7\u3068\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u5f8c\u8005\u306e\u5834\u5408\u3001  "nottrusted.com" \u306e\u3044\u305a\u308c\u306e\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u306b\u304a\u3044\u3066\u3082\u3001\u30af\u30c3\u30ad\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n"google.com" \u3084 "live.com" \u306e\u3088\u3046\u306a\u5de8\u5927\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u304a\u3044\u3066\u306f\u3001\u5927\u62b5\u30af\u30c3\u30ad\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u306f\u5e83\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.cookielooselyscoped.extrainfo = \u6bd4\u8f03\u306b\u4f7f\u7528\u3057\u305f\u5143\u306e\u30c9\u30e1\u30a4\u30f3\uff1a\n{0}\n{1}
pscanrules.cookielooselyscoped.extrainfo.cookie = {0}
pscanrules.cookielooselyscoped.name = \u30b9\u30b3\u30fc\u30d7\u304c\u5e83\u3044\u30af\u30c3\u30ad\u30fc
pscanrules.cookielooselyscoped.refs = https\://datatracker.ietf.org/doc/html/rfc6265\#section-4.1\nhttps\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html\nhttps\://code.google.com/archive/p/browsersec/wikis/Part2.wiki
pscanrules.cookielooselyscoped.soln = \u30af\u30c3\u30ad\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u306f\u5e38\u306b FQDN (\u5b8c\u5168\u4fee\u98fe\u30c9\u30e1\u30a4\u30f3\u540d) \u306b\u3057\u3066\u4e0b\u3055\u3044\u3002

pscanrules.cookiesamesite.badval.desc = Cookie\u306b\u7121\u52b9\u306aSameSite\u5c5e\u6027\u5024\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002SameSite\u5c5e\u6027\u306e\u6709\u52b9\u306a\u5024\u306f "Strict"\u3001"Lax"\u3001"None" \u306e\u307f\u3067\u3001\u7121\u52b9\u306a\u5024\u306e\u5834\u5408\u3001\u30d6\u30e9\u30a6\u30b6\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u52d5\u4f5c (\u901a\u5e38\u306fLax) \u3092\u9069\u7528\u3059\u308b\u304b\u3001Cookie\u3092\u300c\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u300d\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u9001\u4fe1\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u9069\u5207\u306aSameSite\u8a2d\u5b9a\u306f\u3001CSRF (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea)\u3001XSSI (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u30a4\u30f3\u30af\u30eb\u30fc\u30c9)\u3001\u304a\u3088\u3073\u30bf\u30a4\u30df\u30f3\u30b0\u653b\u6483\u306b\u5bfe\u3059\u308b\u52b9\u679c\u7684\u306a\u9632\u5fa1\u7b56\u3068\u306a\u308a\u307e\u3059\u3002
pscanrules.cookiesamesite.badval.name = \u7121\u52b9\u306aSameSite\u5c5e\u6027\u3092\u6301\u3064Cookie
pscanrules.cookiesamesite.desc = SameSite \u5c5e\u6027\u304c\u306a\u3044Cookie\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u305f\u3081\u3001\u305d\u306eCookie\u306f\u300c\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u300d\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u7d50\u679c\u3068\u3057\u3066\u9001\u4fe1\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002SameSite\u5c5e\u6027\u306f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3\u3001\u304a\u3088\u3073\u30bf\u30a4\u30df\u30f3\u30b0\u653b\u6483\u306b\u5bfe\u3059\u308b\u52b9\u679c\u7684\u306a\u5bfe\u7b56\u3067\u3059\u3002
pscanrules.cookiesamesite.name = SameSite\u5c5e\u6027\u306e\u306a\u3044Cookie
pscanrules.cookiesamesite.none.desc = Cookie\u306eSameSite\u5c5e\u6027\u304c "none" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001Cookie\u306f\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3082\u9001\u4fe1\u3055\u308c\u308b\u305f\u3081\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a9\u30fc\u30b8\u30a7\u30ea (CSRF)\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c8\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 (XSSI)\u3001\u30bf\u30a4\u30df\u30f3\u30b0\u653b\u6483\u306a\u3069\u306e\u30ea\u30b9\u30af\u304c\u9ad8\u307e\u308a\u307e\u3059\u3002SameSite\u5c5e\u6027\u306f\u901a\u5e38\u3001\u3053\u308c\u3089\u306e\u653b\u6483\u306b\u5bfe\u3059\u308b\u52b9\u679c\u7684\u306a\u5bfe\u7b56\u3068\u306a\u308a\u307e\u3059\u304c\u3001"none" \u8a2d\u5b9a\u3067\u306f\u305d\u306e\u4fdd\u8b77\u52b9\u679c\u304c\u7121\u52b9\u5316\u3055\u308c\u307e\u3059\u3002
pscanrules.cookiesamesite.none.name = SameSite\u5c5e\u6027\u304cNone\u306eCookie
pscanrules.cookiesamesite.refs = https\://datatracker.ietf.org/doc/html/draft-ietf-httpbis-cookie-same-site
pscanrules.cookiesamesite.soln = \u3059\u3079\u3066\u306eCookie\u306b\u3064\u3044\u3066\u3001SameSite\u5c5e\u6027\u3092 'lax' \u307e\u305f\u306f\u3001\u7406\u60f3\u7684\u306b\u306f 'strict' \u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.cookiesecureflag.desc = secure \u30d5\u30e9\u30b0\u306e\u306a\u3044Cookie\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u305f\u3081\u3001\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u63a5\u7d9a\u3092\u4ecb\u3057\u3066Cookie\u306b\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.cookiesecureflag.name = secure\u30d5\u30e9\u30b0\u306e\u306a\u3044Cookie
pscanrules.cookiesecureflag.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/06-Session_Management_Testing/02-Testing_for_Cookies_Attributes.html
pscanrules.cookiesecureflag.soln = Cookie\u306b\u6a5f\u5bc6\u60c5\u5831\u3084\u30bb\u30c3\u30b7\u30e7\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u542b\u307e\u308c\u308b\u5834\u5408\u306f\u3001\u5e38\u306b\u6697\u53f7\u5316\u3055\u308c\u305f\u30c1\u30e3\u30cd\u30eb\u3092\u4f7f\u7528\u3057\u3066\u53d7\u3051\u6e21\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u305d\u306e\u3088\u3046\u306a\u6a5f\u5bc6\u60c5\u5831\u3092\u542b\u3080Cookie\u306b\u306f\u3001secure\u30d5\u30e9\u30b0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.crossdomain.desc = Web\u30b5\u30fc\u30d0\u30fc\u4e0a\u306eCORS (\u30af\u30ed\u30b9\u30aa\u30ea\u30b8\u30f3\u30ea\u30bd\u30fc\u30b9\u5171\u6709) \u306e\u8a2d\u5b9a\u30df\u30b9\u306b\u3088\u308a\u3001Web\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u30c7\u30fc\u30bf\u8aad\u307f\u8fbc\u307f\u304c\u53ef\u80fd\u306b\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.crossdomain.extrainfo = Web\u30b5\u30fc\u30d0\u30fc\u306eCORS\u8a2d\u5b9a\u306b\u4e0d\u5099\u304c\u3042\u308a\u3001\u4efb\u610f\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u3053\u306e\u30c9\u30e1\u30a4\u30f3\u306e\u975e\u8a8d\u8a3cAPI\u306b\u5bfe\u3059\u308b\u30af\u30ed\u30b9\u30aa\u30ea\u30b8\u30f3\u8aad\u307f\u53d6\u308a\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u305f\u3060\u3057\u3001Web\u30d6\u30e9\u30a6\u30b6\u306e\u5b9f\u88c5\u306b\u3088\u308a\u3001\u4efb\u610f\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u304c\u8cc7\u683c\u60c5\u5831\u3092\u4f34\u3046API\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u306f\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30ea\u30b9\u30af\u306f\u3042\u308b\u7a0b\u5ea6\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u4e0d\u5099\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u306f\u8a8d\u8a3c\u306a\u3057\u3067\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3060\u304c\u3001IP\u30a2\u30c9\u30ec\u30b9\u8a31\u53ef\u30ea\u30b9\u30c8\u306a\u3069\u306e\u4ed6\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u5236\u5fa1\u306b\u4f9d\u5b58\u3057\u3066\u3044\u308b\u30c7\u30fc\u30bf\u3092\u3001\u88ab\u5bb3\u8005\u306e\u30d6\u30e9\u30a6\u30b6\u3092\u7d4c\u7531\u3057\u3066\u53d6\u5f97\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.crossdomain.name = \u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3\u8a2d\u5b9a\u30df\u30b9
pscanrules.crossdomain.refs = https\://vulncat.fortify.com/en/detail?category\=HTML5&subcategory\=Overly%20Permissive%20CORS%20Policy
pscanrules.crossdomain.soln = \u6a5f\u5bc6\u30c7\u30fc\u30bf\u306b\u5bfe\u3057\u3066\u9069\u5207\u306a\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u5b9f\u88c5\u3057\u3001IP\u30a2\u30c9\u30ec\u30b9\u8a31\u53ef\u30ea\u30b9\u30c8\u306a\u3069\u306e\u88dc\u5b8c\u7684\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u5236\u5fa1\u306e\u307f\u306b\u4f9d\u5b58\u3057\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u300cAccess-Control-Allow-Origin\u300dHTTP\u30d8\u30c3\u30c0\u30fc\u3092\u5fc5\u8981\u6700\u5c0f\u9650\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u5236\u9650\u3059\u308b\u304b\u3001\u30af\u30ed\u30b9\u30aa\u30ea\u30b8\u30f3\u30a2\u30af\u30bb\u30b9\u304c\u4e0d\u8981\u306a\u5834\u5408\u306fCORS\u30d8\u30c3\u30c0\u30fc\u3092\u5b8c\u5168\u306b\u524a\u9664\u3057\u3066\u3001Web\u30d6\u30e9\u30a6\u30b6\u306eSame Origin Policy (SOP) \u306b\u3088\u308b\u53b3\u683c\u306a\u5236\u5fa1\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.crossdomainscriptinclusion.desc = \u3053\u306e\u30da\u30fc\u30b8\u306b\u306f\u30011\u3064\u4ee5\u4e0a\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u30d5\u30a1\u30a4\u30eb\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.crossdomainscriptinclusion.name = \u30af\u30ed\u30b9\u30c9\u30e1\u30a4\u30f3JavaScript\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u30a4\u30f3\u30af\u30eb\u30fc\u30b8\u30e7\u30f3
pscanrules.crossdomainscriptinclusion.soln = JavaScript\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u4fe1\u983c\u3067\u304d\u308b\u30bd\u30fc\u30b9\u304b\u3089\u306e\u307f\u8aad\u307f\u8fbc\u307e\u308c\u3001\u304b\u3064\u3001\u305d\u306e\u30bd\u30fc\u30b9\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30a8\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.csp.both.desc = \u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u306f\u3001\u30d8\u30c3\u30c0\u30fc\u3068META\u30bf\u30b0\u306e\u4e21\u65b9\u3067\u6307\u5b9a\u3055\u308c\u305fCSP\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002\u3053\u308c\u3089\u306e\u30dd\u30ea\u30b7\u30fc\u3092\u7d71\u5408\u3057\u3066\u5206\u6790\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3057\u305f\u304c\u3063\u3066\u3001\u500b\u5225\u306b\u8a55\u4fa1\u3055\u308c\u307e\u3057\u305f\u3002
pscanrules.csp.both.name = \u30d8\u30c3\u30c0\u30fc\u3068META
pscanrules.csp.desc = Content Security Policy (CSP) \u306f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (XSS) \u3084\u30b3\u30fc\u30c9\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u653b\u6483\u306a\u3069\u306e\u7279\u5b9a\u306e\u653b\u6483\u3092\u691c\u51fa\u30fb\u8efd\u6e1b\u3059\u308b\u305f\u3081\u306e\u8ffd\u52a0\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6a5f\u69cb\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u653b\u6483\u306f\u3001\u30c7\u30fc\u30bf\u7a83\u53d6\u3001\u30b5\u30a4\u30c8\u6539\u3056\u3093\u3001\u30de\u30eb\u30a6\u30a7\u30a2\u914d\u5e03\u306a\u3069\u69d8\u3005\u306a\u60aa\u610f\u306e\u3042\u308b\u6d3b\u52d5\u306b\u5229\u7528\u3055\u308c\u307e\u3059\u3002CSP\u306f\u3001Web\u30b5\u30a4\u30c8\u7ba1\u7406\u8005\u304c\u30d6\u30e9\u30a6\u30b6\u306b\u5bfe\u3057\u3066\u30da\u30fc\u30b8\u4e0a\u3067\u8aad\u307f\u8fbc\u307f\u8a31\u53ef\u3059\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u4fe1\u983c\u3067\u304d\u308b\u30bd\u30fc\u30b9\u3092\u5ba3\u8a00\u3059\u308b\u305f\u3081\u306e\u6a19\u6e96HTTP\u30d8\u30c3\u30c0\u30fc\u7fa4\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u5236\u5fa1\u5bfe\u8c61\u306b\u306f\u3001JavaScript\u3001CSS\u3001\u30d5\u30ec\u30fc\u30e0\u3001\u30d5\u30a9\u30f3\u30c8\u3001\u753b\u50cf\u3001\u304a\u3088\u3073\u5404\u7a2e\u30e1\u30c7\u30a3\u30a2\u30d5\u30a1\u30a4\u30eb\u306a\u3069\u306e\u57cb\u3081\u8fbc\u307f\u30ea\u30bd\u30fc\u30b9\u304c\u542b\u307e\u308c\u307e\u3059\u3002
pscanrules.csp.malformed.name = \u4e0d\u6b63\u306a\u30dd\u30ea\u30b7\u30fc (\u975eASCII)
pscanrules.csp.malformed.otherinfo = \u30dd\u30ea\u30b7\u30fc\u306e\u89e3\u6790\u4e2d\u306b\u975eASCII\u6587\u5b57\u304c\u691c\u51fa\u3055\u308c\u305f\u305f\u3081\u3001\u30dd\u30ea\u30b7\u30fc\u304c\u7121\u52b9\u306b\u306a\u308a\u307e\u3057\u305f (\u4ee5\u964d\u306e\u8a55\u4fa1\u306f\u4e2d\u6b62\u3055\u308c\u307e\u3057\u305f)\u3002\u691c\u51fa\u3055\u308c\u305f\u7121\u52b9\u306a\u6587\u5b57\: {0}
pscanrules.csp.meta.bad.directive.desc = meta\u8981\u7d20\u3067\u6307\u5b9a\u3055\u308c\u305fCSP\u30dd\u30ea\u30b7\u30fc\u306b\u3001meta\u8981\u7d20\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044 sandbox \u307e\u305f\u306f frame-ancestors \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.csp.meta.bad.directive.name = META\u30dd\u30ea\u30b7\u30fc\u306e\u4e0d\u6b63\u306a\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6
pscanrules.csp.name = CSP
pscanrules.csp.nofallback.desc = Content Security Policy\u3067default-src\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306b\u3088\u308b\u30d5\u30a9\u30fc\u30eb\u30d0\u30c3\u30af\u304c\u9069\u7528\u3055\u308c\u306a\u3044\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u308c\u3089\u306e\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u304c\u672a\u5b9a\u7fa9\u306e\u5834\u5408\u3001\u4efb\u610f\u306e\u30bd\u30fc\u30b9\u304b\u3089\u306e\u30ea\u30bd\u30fc\u30b9\u8aad\u307f\u8fbc\u307f\u304c\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
pscanrules.csp.nofallback.name = CSP\u91cd\u8981\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u5b9a\u7fa9\u6f0f\u308c
pscanrules.csp.nofallback.otherinfo = \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\: {0} \u306fdefault-src\u306b\u30d5\u30a9\u30fc\u30eb\u30d0\u30c3\u30af\u3057\u306a\u3044\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306b\u542b\u307e\u308c\u307e\u3059\u3002
pscanrules.csp.notices.errors = \u30a8\u30e9\u30fc\:
pscanrules.csp.notices.infoitems = \u60c5\u5831\u9805\u76ee\:
pscanrules.csp.notices.name = \u901a\u77e5
pscanrules.csp.notices.warnings = \u8b66\u544a\:
pscanrules.csp.refs = https\://www.w3.org/TR/CSP/\nhttps\://caniuse.com/\#search\=content+security+policy\nhttps\://content-security-policy.com/\nhttps\://github.com/HtmlUnit/htmlunit-csp\nhttps\://web.dev/articles/csp\#resource-options
pscanrules.csp.scriptsrc.unsafe.eval.name = script-src unsafe-eval
pscanrules.csp.scriptsrc.unsafe.eval.otherinfo = script-src\u306bunsafe-eval\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.csp.scriptsrc.unsafe.hashes.name = script-src unsafe-hashes
pscanrules.csp.scriptsrc.unsafe.hashes.otherinfo = script-src\u306bunsafe-hashes\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u3053\u308c\u3089\u306e\u30cf\u30c3\u30b7\u30e5\u3067\u30ab\u30d0\u30fc\u3055\u308c\u3066\u3044\u308b\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u3092\u5229\u7528\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
pscanrules.csp.scriptsrc.unsafe.hashes.refs = https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-script/
pscanrules.csp.scriptsrc.unsafe.name = script-src unsafe-inline
pscanrules.csp.scriptsrc.unsafe.otherinfo = script-src\u306bunsafe-inline\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.csp.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001Content-Security-Policy\u30d8\u30c3\u30c0\u30fc\u3092\u6b63\u3057\u304f\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u9069\u5207\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.csp.stylesrc.unsafe.hashes.name = style-src unsafe-hashes
pscanrules.csp.stylesrc.unsafe.hashes.otherinfo = style-src\u306bunsafe-hashes\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u3053\u308c\u3089\u306e\u30cf\u30c3\u30b7\u30e5\u3067\u30ab\u30d0\u30fc\u3055\u308c\u3066\u3044\u308b\u4efb\u610f\u306e\u30b3\u30fc\u30c9\u3092\u5229\u7528\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
pscanrules.csp.stylesrc.unsafe.hashes.refs = https\://www.w3.org/TR/CSP3/\#unsafe-hashes-usage\nhttps\://content-security-policy.com/examples/allow-inline-style/
pscanrules.csp.stylesrc.unsafe.name = style-src unsafe-inline
pscanrules.csp.stylesrc.unsafe.otherinfo = style-src\u306bunsafe-inline\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.csp.wildcard.name = \u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6
pscanrules.csp.wildcard.otherinfo = \u4ee5\u4e0b\u306e\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306f\u3001\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u30bd\u30fc\u30b9 (\u307e\u305f\u306f\u305d\u306e\u7956\u5148) \u3092\u8a31\u53ef\u3057\u3066\u3044\u308b\u304b\u3001\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u904e\u5ea6\u306b\u5e83\u7bc4\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u3059\uff1a\n{0}
pscanrules.csp.xcsp.name = X-Content-Security-Policy
pscanrules.csp.xcsp.otherinfo = \u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u975e\u63a8\u5968\u306eX-Content-Security-Policy\u30d8\u30c3\u30c0\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002CSP\u304c\u5b9f\u88c5\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u306f\u826f\u3044\u3053\u3068\u3067\u3059\u304c\u3001\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u3067\u6307\u5b9a\u3055\u308c\u305f\u30dd\u30ea\u30b7\u30fc\u306fZAP\u306b\u3088\u308b\u89e3\u6790\u5bfe\u8c61\u5916\u3067\u3059\u3002\u73fe\u4ee3\u306e\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u5b8c\u5168\u30b5\u30dd\u30fc\u30c8\u3092\u78ba\u4fdd\u3059\u308b\u305f\u3081\u3001\u6a19\u6e96\u306eContent-Security-Policy\u30d8\u30c3\u30c0\u30fc\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.csp.xwkcsp.name = X-WebKit-CSP
pscanrules.csp.xwkcsp.otherinfo = \u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u975e\u63a8\u5968\u306eX-WebKit-CSP\u30d8\u30c3\u30c0\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002CSP\u304c\u5b9f\u88c5\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u306f\u826f\u3044\u3053\u3068\u3067\u3059\u304c\u3001\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u3067\u6307\u5b9a\u3055\u308c\u305f\u30dd\u30ea\u30b7\u30fc\u306fZAP\u306b\u3088\u308b\u89e3\u6790\u5bfe\u8c61\u5916\u3067\u3059\u3002\u73fe\u4ee3\u306e\u30d6\u30e9\u30a6\u30b6\u3067\u306e\u5b8c\u5168\u30b5\u30dd\u30fc\u30c8\u3092\u78ba\u4fdd\u3059\u308b\u305f\u3081\u3001\u6a19\u6e96\u306eContent-Security-Policy\u30d8\u30c3\u30c0\u30fc\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.desc = \u30ea\u30ea\u30fc\u30b9\u7248\u306e\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

pscanrules.directorybrowsing.desc = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u5185\u5bb9\u4e00\u89a7\u3092\u95b2\u89a7\u3067\u304d\u307e\u3059\u3002\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u4e00\u89a7\u306f\u3001\u96a0\u3055\u308c\u305f\u30b9\u30af\u30ea\u30d7\u30c8\u3001\u30a4\u30f3\u30af\u30eb\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u3001\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306a\u3069\u3092\u516c\u958b\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u3001\u3053\u308c\u3089\u306b\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u3068\u6a5f\u5bc6\u60c5\u5831\u304c\u660e\u3089\u304b\u306b\u306a\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.directorybrowsing.extrainfo = Web\u30b5\u30fc\u30d0\u30fc\u3092\u7279\u5b9a\u3057\u307e\u3057\u305f\: {0}
pscanrules.directorybrowsing.name = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0
pscanrules.directorybrowsing.refs = https\://cwe.mitre.org/data/definitions/548.html
pscanrules.directorybrowsing.soln = Web\u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30d6\u30e9\u30a6\u30b8\u30f3\u30b0\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.hashdisclosure.desc = Web\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u30cf\u30c3\u30b7\u30e5\u304c\u516c\u958b\u3055\u308c\u307e\u3057\u305f\u3002
pscanrules.hashdisclosure.name = \u30cf\u30c3\u30b7\u30e5\u306e\u9732\u898b
pscanrules.hashdisclosure.refs = https\://openwall.info/wiki/john/sample-hashes
pscanrules.hashdisclosure.soln = \u8a8d\u8a3c\u60c5\u5831\u3084\u305d\u306e\u4ed6\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u4fdd\u8b77\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30cf\u30c3\u30b7\u30e5\u304c\u3001\u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u3084\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u3088\u3063\u3066\u6f0f\u6d29\u3057\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u901a\u5e38\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30cf\u30c3\u30b7\u30e5\u304c\u30a6\u30a7\u30d6\u30d6\u30e9\u30a6\u30b6\u304b\u3089\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3067\u3042\u308b\u5fc5\u8981\u306f\u3042\u308a\u307e\u305b\u3093\u3002

pscanrules.heartbleed.desc = OpenSSL 1.0.1 \u306e TLS \u304a\u3088\u3073 DTLS \u5b9f\u88c5\u306f\u30011.0.1g \u3088\u308a\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u304a\u3044\u3066\u3001Heartbeat Extension \u30d1\u30b1\u30c3\u30c8\u3092\u9069\u5207\u306b\u51e6\u7406\u3057\u307e\u305b\u3093\u3002\u3053\u306e\u305f\u3081\u3001\u7d30\u5de5\u3055\u308c\u305f\u30d1\u30b1\u30c3\u30c8\u306b\u3088\u3063\u3066\u30d0\u30c3\u30d5\u30a1\u306e\u904e\u5270\u8aad\u307f\u8fbc\u307f\u304c\u5f15\u304d\u8d77\u3053\u3055\u308c\u3001\u30ea\u30e2\u30fc\u30c8\u306e\u653b\u6483\u8005\u304c\u30d7\u30ed\u30bb\u30b9\u30e1\u30e2\u30ea\u304b\u3089\u6a5f\u5bc6\u60c5\u5831\u3092\u53d6\u5f97\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.heartbleed.extrainfo = {0} \u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u5831\u544a\u3055\u308c\u305f\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4fee\u6b63\u304c\u30d0\u30c3\u30af\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u3001\u305d\u306e\u5834\u5408\u3001\u3053\u306e\u554f\u984c\u306f\u8aa4\u691c\u77e5 (false positive) \u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u4f8b\u3048\u3070Red Hat\u3067\u3088\u304f\u898b\u3089\u308c\u307e\u3059\u3002
pscanrules.heartbleed.name = Heartbleed OpenSSL \u306e\u8106\u5f31\u6027 (\u6307\u6a19)
pscanrules.heartbleed.refs = https\://nvd.nist.gov/vuln/detail/CVE-2014-0160
pscanrules.heartbleed.soln = OpenSSL \u3092 1.0.1g \u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u66f4\u65b0\u3057\u3001HTTPS \u8a3c\u660e\u66f8\u3092\u518d\u767a\u884c\u3057\u3066\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u975e\u5bfe\u79f0\u79d8\u5bc6\u9375\u3068\u3001\u5171\u6709\u79d8\u5bc6\u9375\u304c\u4fb5\u5bb3\u3055\u308c\u305f\u6050\u308c\u304c\u3042\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3001\u3053\u308c\u3089\u3092\u5909\u66f4\u3057\u3066\u4e0b\u3055\u3044\u3002

pscanrules.infoprivateaddressdisclosure.desc = \u30d7\u30e9\u30a4\u30d9\u30fc\u30c8IP\u30a2\u30c9\u30ec\u30b9 (10.x.x.x\u3001172.x.x.x\u3001192.168.x.x\u306a\u3069) \u307e\u305f\u306fAmazon EC2\u306e\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u30db\u30b9\u30c8\u540d (ip-10-0-56-78\u306a\u3069) \u304c\u3001HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u5185\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u306e\u60c5\u5831\u306f\u3001\u5185\u90e8\u30b7\u30b9\u30c6\u30e0\u3092\u6a19\u7684\u3068\u3057\u305f\u3055\u3089\u306a\u308b\u653b\u6483\u306b\u5f79\u7acb\u3064\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 
pscanrules.infoprivateaddressdisclosure.name = \u30d7\u30e9\u30a4\u30d9\u30fc\u30c8IP\u306e\u9732\u898b
pscanrules.infoprivateaddressdisclosure.refs = https\://datatracker.ietf.org/doc/html/rfc1918
pscanrules.infoprivateaddressdisclosure.soln = HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u304b\u3089\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8IP\u30a2\u30c9\u30ec\u30b9\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30b3\u30e1\u30f3\u30c8\u306b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30d6\u30e9\u30a6\u30b6\u304b\u3089\u898b\u3048\u3066\u3057\u307e\u3046HTML/JavaScript\u306e\u30b3\u30e1\u30f3\u30c8\u3067\u306f\u306a\u304f\u3001JSP/ASP/PHP\u306e\u30b3\u30e1\u30f3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.informationdisclosuredebugerrors.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306bASP.NET\u306e\u3088\u3046\u306a\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3084\u3001IIS\u3001Apache\u306e\u3088\u3046\u306a\u30a6\u30a7\u30d6\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u8fd4\u3055\u308c\u308b\u4e00\u822c\u7684\u306a\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002\u4e00\u822c\u7684\u306a\u30c7\u30d0\u30c3\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30ea\u30b9\u30c8\u306f\u8a2d\u5b9a\u53ef\u80fd\u3067\u3059\u3002
pscanrules.informationdisclosuredebugerrors.name = \u60c5\u5831\u6f0f\u6d29 - \u30c7\u30d0\u30c3\u30b0\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8
pscanrules.informationdisclosuredebugerrors.soln = \u672c\u756a\u74b0\u5883\u306b\u30d7\u30c3\u30b7\u30e5\u3059\u308b\u524d\u306b\u3001\u30c7\u30d0\u30c3\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.informationdisclosureinurl.desc = \u30ea\u30af\u30a8\u30b9\u30c8\u306eURL\u306b\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002URL\u306b\u542b\u307e\u308c\u308b\u60c5\u5831\u306f\u3001Web\u30b5\u30fc\u30d0\u30fc\u30ed\u30b0\u3001\u30d7\u30ed\u30ad\u30b7\u30ed\u30b0\u3001\u30d6\u30e9\u30a6\u30b6\u5c65\u6b74\u3001\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u306a\u3069\u306b\u8a18\u9332\u3055\u308c\u3001\u610f\u56f3\u3057\u306a\u3044\u60c5\u5831\u6f0f\u6d29\u306e\u539f\u56e0\u3068\u306a\u308a\u307e\u3059\u3002\u3053\u308c\u306fPCI DSS\u3084\u591a\u304f\u306e\u7d44\u7e54\u306e\u30b3\u30f3\u30d7\u30e9\u30a4\u30a2\u30f3\u30b9\u30dd\u30ea\u30b7\u30fc\u306b\u9055\u53cd\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30c1\u30a7\u30c3\u30af\u3067\u691c\u51fa\u3059\u308b\u6587\u5b57\u5217\u306f\u3001\u74b0\u5883\u306b\u5fdc\u3058\u3066\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u53ef\u80fd\u3067\u3059\u3002
pscanrules.informationdisclosureinurl.name = \u60c5\u5831\u6f0f\u6d29 - URL\u5185\u306e\u6a5f\u5bc6\u60c5\u5831
pscanrules.informationdisclosureinurl.otherinfo.cc = URL\u306b\u30af\u30ec\u30b8\u30c3\u30c8\u30ab\u30fc\u30c9\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosureinurl.otherinfo.email = URL\u306b\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.informationdisclosureinurl.otherinfo.sensitiveinfo = URL\u306b\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u4ee5\u4e0b\u306e\u6587\u5b57\u5217\u304c\u30d1\u30bf\u30fc\u30f3\u306b\u3088\u3063\u3066\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\: {0}\n{1}
pscanrules.informationdisclosureinurl.otherinfo.ssn = URL\u306b\u7c73\u56fd\u793e\u4f1a\u4fdd\u969c\u756a\u53f7\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosureinurl.soln = URI\u3067\u6a5f\u5bc6\u60c5\u5831\u3092\u6e21\u3055\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.informationdisclosurereferrer.bin.field = \u9280\u884c\u8b58\u5225\u756a\u53f7\:
pscanrules.informationdisclosurereferrer.brand.field = \u30d6\u30e9\u30f3\u30c9\:
pscanrules.informationdisclosurereferrer.category.field = \u30ab\u30c6\u30b4\u30ea\:
pscanrules.informationdisclosurereferrer.desc = HTTP\u30d8\u30c3\u30c0\u30fc (\u4e3b\u306bReferer\u30d8\u30c3\u30c0\u30fc) \u3092\u901a\u3058\u3066\u3001\u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u53ef\u80fd\u6027\u306e\u3042\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u4ed6\u30c9\u30e1\u30a4\u30f3\u306b\u9001\u4fe1\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u901a\u5e38\u3001\u5916\u90e8\u30b5\u30a4\u30c8\u3078\u306e\u30ea\u30f3\u30af\u3084\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30ea\u30bd\u30fc\u30b9\u306e\u8aad\u307f\u8fbc\u307f\u6642\u306b\u767a\u751f\u3057\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u60c5\u5831\u6f0f\u6d29\u306f\u3001PCI DSS\u3084\u591a\u304f\u306e\u7d44\u7e54\u306e\u30b3\u30f3\u30d7\u30e9\u30a4\u30a2\u30f3\u30b9\u30dd\u30ea\u30b7\u30fc\u306b\u9055\u53cd\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30c1\u30a7\u30c3\u30af\u3067\u691c\u51fa\u3059\u308b\u6587\u5b57\u5217\u306f\u3001\u74b0\u5883\u306b\u5fdc\u3058\u3066\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u53ef\u80fd\u3067\u3059\u3002
pscanrules.informationdisclosurereferrer.issuer.field = \u767a\u884c\u5143\:
pscanrules.informationdisclosurereferrer.name = \u60c5\u5831\u6f0f\u6d29 - HTTP Referrer\u30d8\u30c3\u30c0\u30fc\u5185\u306e\u6a5f\u5bc6\u60c5\u5831
pscanrules.informationdisclosurereferrer.otherinfo.cc = HTTP\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u306eURL\u306b\u30af\u30ec\u30b8\u30c3\u30c8\u30ab\u30fc\u30c9\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosurereferrer.otherinfo.email = HTTP\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u306eURL\u306b\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.informationdisclosurereferrer.otherinfo.sensitiveinfo = HTTP\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u306eURL\u306b\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosurereferrer.otherinfo.ssn = HTTP\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u306eURL\u306b\u7c73\u56fd\u793e\u4f1a\u4fdd\u969c\u756a\u53f7\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosurereferrer.soln = URI\u3067\u6a5f\u5bc6\u60c5\u5831\u3092\u6e21\u3055\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.informationdisclosuresuspiciouscomments.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u653b\u6483\u8005\u3092\u52a9\u3051\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u7591\u308f\u3057\u3044\u30b3\u30e1\u30f3\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.informationdisclosuresuspiciouscomments.name = \u60c5\u5831\u6f0f\u6d29 - \u7591\u308f\u3057\u3044\u30b3\u30e1\u30f3\u30c8
pscanrules.informationdisclosuresuspiciouscomments.otherinfo = \u30d1\u30bf\u30fc\u30f3 "{0}" \u304c\u30b3\u30e1\u30f3\u30c8\u3068\u601d\u308f\u308c\u308b\u7b87\u6240\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\: "{1}"\u3002\u7591\u308f\u3057\u3044\u30b3\u30e1\u30f3\u30c8/\u30b9\u30cb\u30da\u30c3\u30c8\u306b\u3064\u3044\u3066\u306f\u3001\u8a3c\u62e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.informationdisclosuresuspiciouscomments.otherinfo2 = \u30d1\u30bf\u30fc\u30f3 "{0}" \u304c {2} \u56de\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u6700\u521d\u306e\u691c\u51fa\u7b87\u6240\u306f\u30b3\u30e1\u30f3\u30c8\u5185\u3067\u3001\u5185\u5bb9\u306f "{1}" \u3067\u3059\u3002\u7591\u308f\u3057\u3044\u30b3\u30e1\u30f3\u30c8/\u30b9\u30cb\u30da\u30c3\u30c8\u306b\u3064\u3044\u3066\u306f\u3001\u8a3c\u62e0\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.informationdisclosuresuspiciouscomments.soln = \u653b\u6483\u8005\u3092\u52a9\u3051\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u60c5\u5831\u3092\u8fd4\u3059\u3059\u3079\u3066\u306e\u30b3\u30e1\u30f3\u30c8\u3092\u524a\u9664\u3057\u3001\u305d\u308c\u3089\u304c\u8a00\u53ca\u3057\u3066\u3044\u308b\u6839\u672c\u7684\u306a\u554f\u984c\u3092\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.infosessionidurl.desc = URL\u30ea\u30e9\u30a4\u30c8\u304c\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u8ffd\u8de1\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30bb\u30c3\u30b7\u30e7\u30f3ID\u306f\u3001\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u306eReferer\u30d8\u30c3\u30c0\u30fc\u3092\u4ecb\u3057\u3066\u958b\u793a\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3055\u3089\u306b\u3001\u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u30d6\u30e9\u30a6\u30b6\u306e\u5c65\u6b74\u3084\u30b5\u30fc\u30d0\u30fc\u30ed\u30b0\u306b\u4fdd\u5b58\u3055\u308c\u308b\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002
pscanrules.infosessionidurl.name = URL\u30ea\u30e9\u30a4\u30c8\u5185\u306e\u30bb\u30c3\u30b7\u30e7\u30f3ID
pscanrules.infosessionidurl.referrer.alert = Referer\u304c\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u516c\u958b
pscanrules.infosessionidurl.referrer.desc = \u5225\u306e\u30db\u30b9\u30c8\u540d\u3092\u6307\u3059\u30cf\u30a4\u30d1\u30fc\u30ea\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u30bb\u30c3\u30b7\u30e7\u30f3ID\u306eURL\u30ea\u30e9\u30a4\u30c8\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30ea\u30d5\u30a1\u30e9\u30fc\u30d8\u30c3\u30c0\u30fc\u3067\u5916\u90e8\u30db\u30b9\u30c8\u306b\u958b\u793a\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.infosessionidurl.referrer.soln = \u30bb\u30c3\u30b7\u30e7\u30f3ID\u304c\u6a5f\u5bc6\u60c5\u5831\u3067\u3042\u308a\u3001\u30cf\u30a4\u30d1\u30fc\u30ea\u30f3\u30af\u304c\u5916\u90e8\u307e\u305f\u306f\u7b2c\u4e09\u8005\u306e\u30db\u30b9\u30c8\u3092\u53c2\u7167\u3057\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u308c\u306f\u30ea\u30b9\u30af\u3068\u306a\u308a\u307e\u3059\u3002\u5b89\u5168\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u3064\u3044\u3066\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092\u5b89\u5168\u306a\u30bb\u30c3\u30b7\u30e7\u30f3Cookie\u306b\u683c\u7d0d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.infosessionidurl.refs = https\://seclists.org/webappsec/2002/q4/111
pscanrules.infosessionidurl.soln = \u5b89\u5168\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u3064\u3044\u3066\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3ID\u3092Cookie\u306b\u683c\u7d0d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3055\u3089\u306b\u5b89\u5168\u6027\u3092\u9ad8\u3081\u308b\u306b\u306f\u3001Cookie\u3068URL\u30ea\u30e9\u30a4\u30c8\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.insecureauthentication.desc = \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4fdd\u8b77\u3055\u308c\u3066\u3044\u306a\u3044\u63a5\u7d9a\u3092\u4ecb\u3057\u3066 HTTP \u306eBASIC\u8a8d\u8a3c\u307e\u305f\u306f\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u8a8d\u8a3c\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3078\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306a\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u8a8d\u8a3c\u60c5\u5831\u304c\u508d\u53d7\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.insecureauthentication.name = \u8106\u5f31\u306a\u8a8d\u8a3c\u65b9\u6cd5
pscanrules.insecureauthentication.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Authentication_Cheat_Sheet.html
pscanrules.insecureauthentication.soln = HTTPS\u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3092\u4fdd\u8b77\u3059\u308b\u304b\u3001\u3088\u308a\u5f37\u529b\u306a\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.insecureformload.desc = \u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u3001HTTPS\u30d5\u30a9\u30fc\u30e0\u3092\u30db\u30b9\u30c8\u3057\u3066\u3044\u308b\u5b89\u5168\u3067\u306a\u3044HTTP\u30da\u30fc\u30b8\u3092\u63a2\u3057\u307e\u3059\u3002\u554f\u984c\u306f\u3001\u5b89\u5168\u3067\u306a\u3044HTTP\u30da\u30fc\u30b8\u304c\u4e2d\u9593\u8005\u653b\u6483 (MITM) \u306b\u3088\u3063\u3066\u5bb9\u6613\u306b\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u3055\u308c\u3001\u5b89\u5168\u306aHTTPS\u30d5\u30a9\u30fc\u30e0\u304c\u7f6e\u304d\u63db\u3048\u3089\u308c\u305f\u308a\u3001\u306a\u308a\u3059\u307e\u3055\u308c\u305f\u308a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u3053\u3068\u3067\u3059\u3002
pscanrules.insecureformload.extrainfo = HTTP\u7d4c\u7531\u306e\u4ee5\u4e0b\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u3001HTTPS\u30d5\u30a9\u30fc\u30e0\u306e action \u5c5e\u6027\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\uff1a\n\n{0}\n\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059\uff1a\n\n{1}
pscanrules.insecureformload.name = \u30d5\u30a9\u30fc\u30e0\u9001\u4fe1\u306b\u304a\u3051\u308bHTTP\u304b\u3089HTTPS\u3078\u306e\u5b89\u5168\u3067\u306a\u3044\u9077\u79fb
pscanrules.insecureformload.soln = \u5b89\u5168\u306a\u30d5\u30a9\u30fc\u30e0\u3092\u30db\u30b9\u30c8\u3059\u308b\u30e9\u30f3\u30c7\u30a3\u30f3\u30b0\u30da\u30fc\u30b8\u306b\u306fHTTPS\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.insecureformpost.desc = \u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u3001HTTPS (\u6697\u53f7\u5316) \u30da\u30fc\u30b8\u5185\u306b\u914d\u7f6e\u3055\u308c\u305fHTTP (\u975e\u6697\u53f7\u5316) \u9001\u4fe1\u5148\u3092\u6301\u3064\u30d5\u30a9\u30fc\u30e0\u3092\u691c\u51fa\u3057\u307e\u3059\u3002\u3053\u306e\u6df7\u5728\u30b3\u30f3\u30c6\u30f3\u30c4\u554f\u984c\u306b\u3088\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u6697\u53f7\u5316\u3055\u308c\u305f\u30da\u30fc\u30b8\u3067\u5165\u529b\u3057\u305f\u30c7\u30fc\u30bf\u304c\u3001\u5b9f\u969b\u306b\u306f\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u7d4c\u8def\u3067\u9001\u4fe1\u3055\u308c\u308b\u5371\u967a\u304c\u3042\u308a\u307e\u3059\u3002\u30e6\u30fc\u30b6\u30fc\u306f\u5b89\u5168\u306a\u74b0\u5883\u3067\u30c7\u30fc\u30bf\u3092\u9001\u4fe1\u3057\u3066\u3044\u308b\u3068\u8aa4\u8a8d\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.insecureformpost.extrainfo = HTTPS\u7d4c\u7531\u306e\u4ee5\u4e0b\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u3001HTTP\u30d5\u30a9\u30fc\u30e0\u306e action \u5c5e\u6027\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\uff1a\n\n{0}\n\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059\uff1a\n\n{1}
pscanrules.insecureformpost.name = \u30d5\u30a9\u30fc\u30e0\u9001\u4fe1\u306b\u304a\u3051\u308bHTTPS\u304b\u3089HTTP\u3078\u306e\u5b89\u5168\u3067\u306a\u3044\u9077\u79fb
pscanrules.insecureformpost.soln = \u6a5f\u5bc6\u30c7\u30fc\u30bf\u306f\u5b89\u5168\u306aHTTPS\u30c1\u30e3\u30cd\u30eb\u3067\u306e\u307f\u9001\u4fe1\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.insecurejsfviewstate.desc = \u6b21\u306e URL \u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u6697\u53f7\u5316\u4fdd\u8b77\u3092\u6301\u305f\u306a\u3044 ViewState \u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.insecurejsfviewstate.extrainfo = JSF ViewState [{0}] \u306f\u5b89\u5168\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
pscanrules.insecurejsfviewstate.name = \u5b89\u5168\u3067\u306a\u3044JSF ViewState
pscanrules.insecurejsfviewstate.refs = https\://www.trustwave.com/hubfs/21158977/Web/Library/Advisories_txt/14213_twsl2010-001.txt
pscanrules.insecurejsfviewstate.soln = \u74b0\u5883\u306b\u7279\u5316\u3057\u305f MAC \u3067 VIEWSTATE \u3092\u4fdd\u8b77\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.linktarget.desc = \u3053\u306e\u30da\u30fc\u30b8\u306e\u30ea\u30f3\u30af\u306b\u306f\u30ea\u30d0\u30fc\u30b9\u30bf\u30d6\u30ca\u30d3\u30f3\u30b0\u306e\u8106\u5f31\u6027\u304c\u3042\u308a\u307e\u3059\u3002target \u5c5e\u6027\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001rel \u5c5e\u6027\u306b "noopener" \u3068 "noreferrer" \u306e\u4e21\u65b9\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30ea\u30f3\u30af\u5148\u306e\u30da\u30fc\u30b8\u304b\u3089\u5143\u306e\u30da\u30fc\u30b8\u304c\u4e0d\u6b63\u306b\u64cd\u4f5c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.linktarget.name = \u30ea\u30d0\u30fc\u30b9\u30fb\u30bf\u30d6\u30ca\u30d3\u30f3\u30b0
pscanrules.linktarget.refs = https\://owasp.org/www-community/attacks/Reverse_Tabnabbing\nhttps\://dev.to/ben/the-targetblank-vulnerability-by-example\nhttps\://mathiasbynens.github.io/rel-noopener/\nhttps\://medium.com/@jitbit/target-blank-the-most-underestimated-vulnerability-ever-96e328301f4c
pscanrules.linktarget.soln = target \u5c5e\u6027\u3092\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u3082\u3057\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001rel\="noopener noreferrer" \u5c5e\u6027\u3082\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.mixedcontent.desc = \u30da\u30fc\u30b8\u306b\u306f\u3001HTTP\u7d4c\u7531\u3067\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3001\u3064\u307e\u308a\u6df7\u5728\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.mixedcontent.name = \u30bb\u30ad\u30e5\u30a2\u306a\u30da\u30fc\u30b8\u306b\u6df7\u5728\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u542b\u307e\u308c\u308b
pscanrules.mixedcontent.name.inclscripts = \u30bb\u30ad\u30e5\u30a2\u306a\u30da\u30fc\u30b8\u306b\u6df7\u5728\u30b3\u30f3\u30c6\u30f3\u30c4 (\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u542b\u3080) \u304c\u542b\u307e\u308c\u308b
pscanrules.mixedcontent.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html
pscanrules.mixedcontent.soln = SSL/TLS\u3067\u5229\u7528\u53ef\u80fd\u306a\u30da\u30fc\u30b8\u306f\u3001SSL/TLS\u3067\u9001\u4fe1\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u307f\u3067\u69cb\u6210\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044HTTP\u3067\u9001\u4fe1\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u3001\u305d\u306e\u30da\u30fc\u30b8\u306b\u542b\u3081\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002\n\u3053\u308c\u306f\u3001\u7b2c\u4e09\u8005\u30b5\u30a4\u30c8\u304b\u3089\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3082\u540c\u69d8\u3067\u3059\u3002

pscanrules.modernapp.desc = \u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u73fe\u4ee3\u7684\u306aWeb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u3088\u3046\u3067\u3059\u3002\u81ea\u52d5\u7684\u306b\u63a2\u7d22\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001Ajax\u30b9\u30d1\u30a4\u30c0\u30fc\u304c\u6a19\u6e96\u306e\u30b9\u30d1\u30a4\u30c0\u30fc\u3088\u308a\u3082\u52b9\u679c\u7684\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u9ad8\u3044\u3067\u3059\u3002
pscanrules.modernapp.name = \u30e2\u30c0\u30f3Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
pscanrules.modernapp.other.links = \u5f93\u6765\u306ehref\u5c5e\u6027\u3092\u6301\u305f\u306a\u3044\u30ea\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30e2\u30c0\u30f3Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002
pscanrules.modernapp.other.nolinks = \u30b9\u30af\u30ea\u30d7\u30c8\u306f\u5b58\u5728\u3059\u308b\u3082\u306e\u306e\u3001\u30ea\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30e2\u30c0\u30f3Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3042\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002
pscanrules.modernapp.other.noscript = noScript \u30bf\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304cJavaScript\u304c\u6709\u52b9\u306a\u5834\u5408\u3068\u7121\u52b9\u306a\u5834\u5408\u3067\u52d5\u4f5c\u304c\u7570\u306a\u308b\u3053\u3068\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002
pscanrules.modernapp.other.self = target \u5c5e\u6027\u304c _self \u306e\u30ea\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30e2\u30c0\u30f3\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u3067\u30d5\u30eb\u30da\u30fc\u30b8\u306e\u30ea\u30ed\u30fc\u30c9\u3092\u5f37\u5236\u3059\u308b\u305f\u3081\u306b\u3088\u304f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
pscanrules.modernapp.soln = \u3053\u308c\u306f\u60c5\u5831\u30a2\u30e9\u30fc\u30c8\u3067\u3042\u308b\u305f\u3081\u3001\u5909\u66f4\u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002

pscanrules.name = \u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb

pscanrules.noanticsrftokens.alert.extrainfo = HTML \u30d5\u30a9\u30fc\u30e0 {1} \u306b\u65e2\u77e5\u306eAnti-CSRF\u30c8\u30fc\u30af\u30f3 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
pscanrules.noanticsrftokens.desc = HTML \u9001\u4fe1\u30d5\u30a9\u30fc\u30e0\u3067Anti-CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
pscanrules.noanticsrftokens.extrainfo.annotation = \u3053\u306e\u30d5\u30a9\u30fc\u30e0\u306b\u306fAnti-CSRF\u30c8\u30fc\u30af\u30f3\u3092\u5fc5\u8981\u3068\u3057\u306a\u3044\u3053\u3068\u3092\u793a\u3059\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6ce8\u91c8\u304c\u3042\u308b\u305f\u3081\u3001\u3053\u308c\u306f\u60c5\u5831\u30ec\u30d9\u30eb\u306e\u30a2\u30e9\u30fc\u30c8\u3067\u3059\u3002\n\u3053\u306e\u6ce8\u91c8\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u3001\u624b\u52d5\u3067\u30c6\u30b9\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.noanticsrftokens.name = Anti-CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044

pscanrules.payloader.desc = \u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306b\u304a\u3051\u308b\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
pscanrules.payloader.name = \u30ea\u30ea\u30fc\u30b9\u7248\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u7528\u30ab\u30b9\u30bf\u30e0\u30da\u30a4\u30ed\u30fc\u30c9

pscanrules.pii.bin.field = \u9280\u884c\u8b58\u5225\u756a\u53f7\:
pscanrules.pii.brand.field = \u30d6\u30e9\u30f3\u30c9\:
pscanrules.pii.category.field = \u30ab\u30c6\u30b4\u30ea\:
pscanrules.pii.desc = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u3001\u30af\u30ec\u30b8\u30c3\u30c8\u30ab\u30fc\u30c9\u756a\u53f7\u3001\u793e\u4f1a\u4fdd\u969c\u756a\u53f7\u306a\u3069\u306e\u500b\u4eba\u60c5\u5831\u3001\u304a\u3088\u3073\u985e\u4f3c\u306e\u6a5f\u5bc6\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.pii.extrainfo = \u30af\u30ec\u30b8\u30c3\u30c8\u30ab\u30fc\u30c9\u306e\u7a2e\u985e\u3092\u691c\u51fa\: {0}
pscanrules.pii.issuer.field = \u767a\u884c\u5143\:
pscanrules.pii.name = \u500b\u4eba\u8b58\u5225\u7528\u60c5\u5831\u306e\u6f0f\u6d29
pscanrules.pii.soln = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u500b\u4eba\u60c5\u5831 (PII) \u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u304b\u3092\u78ba\u8a8d\u3057\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6a5f\u5bc6\u60c5\u5831\u3092\u6f0f\u6d29\u3055\u305b\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.polyfillcdnscript.desc1 = \u30da\u30fc\u30b8\u306b\u306f 'polyfill' \u30c9\u30e1\u30a4\u30f3\u304b\u3089\u8aad\u307f\u8fbc\u307e\u308c\u305f1\u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u30d5\u30a1\u30a4\u30eb\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\n\u3053\u308c\u3089\u306f polyfill.js \u30e9\u30a4\u30d6\u30e9\u30ea\u3068\u306f\u7121\u95a2\u4fc2\u3067\u3042\u308a\u3001\u60aa\u610f\u306e\u3042\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u914d\u4fe1\u3059\u308b\u3053\u3068\u304c\u77e5\u3089\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.polyfillcdnscript.desc2 = \u3053\u306e\u30da\u30fc\u30b8\u306b\u60aa\u610f\u306e\u3042\u308b 'polyfill' \u30c9\u30e1\u30a4\u30f3\u3078\u306e\u53c2\u7167\u3092\u542b\u3080\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\n\u3053\u308c\u3089\u306e\u30c9\u30e1\u30a4\u30f3\u306f\u6b63\u898f\u306epolyfill.js\u30e9\u30a4\u30d6\u30e9\u30ea\u3068\u306f\u7121\u95a2\u4fc2\u3067\u3001\u30de\u30eb\u30a6\u30a7\u30a2\u3084\u60aa\u610f\u306e\u3042\u308b\u30b3\u30fc\u30c9\u3092\u914d\u4fe1\u3059\u308b\u653b\u6483\u30a4\u30f3\u30d5\u30e9\u3068\u3057\u3066\u77e5\u3089\u308c\u3066\u3044\u307e\u3059\u3002\n\u30b3\u30e1\u30f3\u30c8\u5185\u306e\u7121\u5bb3\u306a\u53c2\u7167\u304b\u3001\u5b9f\u969b\u306b\u305d\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u8aad\u307f\u8fbc\u3093\u3067\u3044\u308b\u304b\u3092\u81f3\u6025\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.polyfillcdnscript.name = \u60aa\u610f\u306e\u3042\u308b\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u914d\u4fe1\u3055\u308c\u305f\u30b9\u30af\u30ea\u30d7\u30c8 (polyfill)
pscanrules.polyfillcdnscript.refs = https\://sansec.io/research/polyfill-supply-chain-attack\nhttps\://x.com/triblondon/status/1761852117579427975
pscanrules.polyfillcdnscript.soln = \u3059\u3079\u3066\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u3001\u516c\u5f0f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u57fa\u3065\u3044\u305f\u65e2\u77e5\u306e\u5b89\u5168\u306a\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.retrievedfromcache.desc = \u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u5171\u6709\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u914d\u4fe1\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u30c7\u30fc\u30bf\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u30fc\u56fa\u6709\u306e\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u610f\u56f3\u3057\u306a\u3044\u60c5\u5831\u6f0f\u6d29\u304c\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u7279\u306b\u6df1\u523b\u306a\u30b1\u30fc\u30b9\u3067\u306f\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u60c5\u5831\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u4e57\u3063\u53d6\u308a\u304c\u767a\u751f\u3059\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u554f\u984c\u306f\u4e3b\u306b\u3001\u4f01\u696d\u3084\u6559\u80b2\u6a5f\u95a2\u306e\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u306b\u8a2d\u7f6e\u3055\u308c\u305f\u30d7\u30ed\u30ad\u30b7\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc\u3067\u767a\u751f\u3057\u307e\u3059\u3002
pscanrules.retrievedfromcache.extrainfo.http11ageheader = Age \u30d8\u30c3\u30c0\u30fc\u306e\u5b58\u5728\u306f\u3001HTTP/1.1\u306b\u6e96\u62e0\u3057\u305f\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u793a\u3057\u307e\u3059\u3002
pscanrules.retrievedfromcache.name = \u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u53d6\u5f97
pscanrules.retrievedfromcache.refs = https\://datatracker.ietf.org/doc/html/rfc7234\nhttps\://datatracker.ietf.org/doc/html/rfc7231\nhttps\://www.rfc-editor.org/rfc/rfc9110.html
pscanrules.retrievedfromcache.soln = \u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u6a5f\u5bc6\u60c5\u5831\u3001\u500b\u4eba\u60c5\u5831\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u30fc\u56fa\u6709\u306e\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u304b\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u6a5f\u5bc6\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u4ee5\u4e0b\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u308b\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u306e\u30a2\u30af\u30bb\u30b9\u3092\u9632\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\uff1a\nCache-Control\: no-cache, no-store, must-revalidate, private\nPragma\: no-cache\nExpires\: 0\n\u3053\u306e\u8a2d\u5b9a\u306f\u3001HTTP/1.0\u304a\u3088\u3073HTTP/1.1\u6e96\u62e0\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u4fdd\u5b58\u305b\u305a\u3001\u540c\u69d8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u3082\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u306e\u914d\u4fe1\u3092\u884c\u308f\u306a\u3044\u3088\u3046\u6307\u793a\u3057\u307e\u3059\u3002

pscanrules.serverheader.rule.name = HTTP\u30b5\u30fc\u30d0\u30fc\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc

pscanrules.serverheaderinfoleak.desc = Web\u30b5\u30fc\u30d0\u30fc\u304c "Server" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3067\u30b5\u30fc\u30d0\u30fc\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u60c5\u5831\u3092\u958b\u793a\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u60c5\u5831\u306b\u3088\u308a\u3001\u653b\u6483\u8005\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u7a2e\u985e\u3092\u7279\u5b9a\u3057\u3001\u65e2\u77e5\u306e\u8106\u5f31\u6027\u3092\u72d9\u3063\u305f\u653b\u6483\u3092\u6e96\u5099\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3067\u3082\u3001\u3053\u306e\u60c5\u5831\u306f\u653b\u6483\u8005\u306e\u5075\u5bdf\u6d3b\u52d5\u3092\u652f\u63f4\u3057\u3001\u653b\u6483\u5bfe\u8c61\u306e\u7d5e\u308a\u8fbc\u307f\u306b\u5229\u7528\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u901a\u5e38\u3001\u3053\u306e\u60c5\u5831\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u3068\u3063\u3066\u4e0d\u8981\u3067\u3042\u308a\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4e0a\u306e\u30ea\u30b9\u30af\u3092\u4e0d\u5fc5\u8981\u306b\u5897\u5927\u3055\u305b\u307e\u3059\u3002
pscanrules.serverheaderinfoleak.general.refs = https\://httpd.apache.org/docs/current/mod/core.html\#servertokens\nhttps\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff648552(v\=pandp.10)\nhttps\://www.troyhunt.com/shhh-dont-let-your-response-headers/
pscanrules.serverheaderinfoleak.general.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001"Server" \u30d8\u30c3\u30c0\u30fc\u3092\u975e\u8868\u793a\u306b\u3059\u308b\u304b\u3001\u6c4e\u7528\u7684\u306a\u8a73\u7d30\u60c5\u5831\u3092\u63d0\u4f9b\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.serverheaderinfoleak.name = \u30b5\u30fc\u30d0\u30fc\u304c "Server" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u901a\u3058\u3066\u3001Web\u30b5\u30fc\u30d0\u30fc\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u6f0f\u6d29\u3055\u305b\u3066\u3044\u307e\u3059\u3002

pscanrules.serverheaderversioninfoleak.desc = Web\u30b5\u30fc\u30d0\u30fc\u304c "Server" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3067\u30d0\u30fc\u30b8\u30e7\u30f3\u60c5\u5831\u3092\u958b\u793a\u3057\u3066\u3044\u307e\u3059\u3002\u653b\u6483\u8005\u306f\u3053\u306e\u60c5\u5831\u3092\u5229\u7528\u3057\u3066\u30b5\u30fc\u30d0\u30fc\u306e\u5177\u4f53\u7684\u306a\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u7279\u5b9a\u3057\u3001\u305d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u5b58\u5728\u3059\u308b\u65e2\u77e5\u306e\u8106\u5f31\u6027\u3092\u72d9\u3063\u305f\u653b\u6483\u3092\u5b9f\u884c\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.serverheaderversioninfoleak.name = \u30b5\u30fc\u30d0\u30fc\u304c "Server" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u901a\u3058\u3066\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u60c5\u5831\u3092\u6f0f\u6d29\u3055\u305b\u3066\u3044\u307e\u3059\u3002

pscanrules.stricttransportsecurity.compliance.malformed.content.desc = HTTP Strict Transport Security (HSTS) \u30d8\u30c3\u30c0\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u4e88\u671f\u3057\u306a\u3044\u30b3\u30f3\u30c6\u30f3\u30c4 (\u304a\u305d\u3089\u304f\u30ab\u30fc\u30ea\u30fc\u30af\u30a9\u30fc\u30c8) \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u5370\u5237\u53ef\u80fd\u306aASCII\u6587\u5b57\u3067\u3042\u308b\u3053\u3068\u304c\u671f\u5f85\u3055\u308c\u307e\u3059\u3002
pscanrules.stricttransportsecurity.compliance.malformed.content.name = Strict-Transport-Security\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u5f62\u5f0f\u304c\u4e0d\u6b63\u3067\u3059 (\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093)
pscanrules.stricttransportsecurity.compliance.malformed.content.refs = https\://datatracker.ietf.org/doc/html/rfc6797
pscanrules.stricttransportsecurity.compliance.malformed.content.soln = \u3053\u306e\u5236\u5fa1\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001\u9069\u5207\u306a\u30b3\u30f3\u30c6\u30f3\u30c4\u3067 Strict-Transport-Security \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.compliance.max.age.malformed.desc = HSTS\u30d8\u30c3\u30c0\u30fc\u306b\u69cb\u6587\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002max-age \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u540d\u306b\u4e0d\u6b63\u306a\u5f15\u7528\u7b26\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059 (\u5024\u306f\u5f15\u7528\u7b26\u3067\u56f2\u3081\u307e\u3059\u304c\u3001\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u540d\u81ea\u4f53\u306b\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093)\u3002\u3053\u306e\u69cb\u6587\u30a8\u30e9\u30fc\u306b\u3088\u308a\u3001HSTS\u30dd\u30ea\u30b7\u30fc\u304c\u6b63\u3057\u304f\u89e3\u91c8\u3055\u308c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\nHTTP Strict Transport Security (HSTS) \u306f\u3001\u30d6\u30e9\u30a6\u30b6\u306b\u5bfe\u3057\u3066HTTPS\u63a5\u7d9a\u306e\u307f\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u5f37\u5236\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u3002\u69cb\u6587\u30a8\u30e9\u30fc\u306b\u3088\u308a\u3053\u306e\u4fdd\u8b77\u6a5f\u80fd\u304c\u7121\u52b9\u5316\u3055\u308c\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.stricttransportsecurity.compliance.max.age.malformed.name = Strict-Transport-Security\u306e Max-Age \u304c\u4e0d\u6b63\u3067\u3059 (\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093)
pscanrules.stricttransportsecurity.compliance.max.age.malformed.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.1
pscanrules.stricttransportsecurity.compliance.max.age.malformed.soln = \u3053\u306e\u5236\u5fa1\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001\u9069\u5207\u306a\u5f62\u5f0f\u3067 Strict-Transport-Security \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.compliance.max.age.missing.desc = HSTS\u30d8\u30c3\u30c0\u30fc\u306b max-age \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u304b\u3001\u5024\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002max-age\u306fHSTS\u30dd\u30ea\u30b7\u30fc\u306e\u6709\u52b9\u671f\u9593\u3092\u79d2\u5358\u4f4d\u3067\u6307\u5b9a\u3059\u308b\u5fc5\u9808\u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u3067\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u5834\u5408\u3001HSTS\u30dd\u30ea\u30b7\u30fc\u5168\u4f53\u304c\u7121\u52b9\u3068\u306a\u308a\u3001\u30d6\u30e9\u30a6\u30b6\u306b\u3088\u308bHTTPS\u5f37\u5236\u6a5f\u80fd\u304c\u52d5\u4f5c\u3057\u307e\u305b\u3093\u3002\nHTTP Strict Transport Security (HSTS) \u306f\u3001\u30d6\u30e9\u30a6\u30b6\u306b\u5bfe\u3057\u3066HTTPS\u63a5\u7d9a\u306e\u307f\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u5f37\u5236\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u3002\u9069\u5207\u306a\u8a2d\u5b9a\u306e\u305f\u3081\u3001max-age \u30c7\u30a3\u30ec\u30af\u30c6\u30a3\u30d6\u306e\u8ffd\u52a0\u304c\u5fc5\u8981\u3067\u3059\u3002
pscanrules.stricttransportsecurity.compliance.max.age.missing.name = Strict-Transport-Security\u306bMax-Age\u304c\u3042\u308a\u307e\u305b\u3093 (\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093)
pscanrules.stricttransportsecurity.compliance.max.age.missing.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.2
pscanrules.stricttransportsecurity.compliance.max.age.missing.soln = \u3053\u306e\u5236\u5fa1\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001\u9069\u5207\u306a max-age \u5024\u3067 Strict-Transport-Security \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.compliance.meta.desc = HTTP Strict Transport Security (HSTS) \u306eMETA\u30bf\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002META\u30bf\u30b0\u306b\u3088\u308bHTTP Strict Transport Security (HSTS) \u306e\u5b9a\u7fa9\u306f\u3001\u4ed5\u69d8 (RFC 6797) \u3067\u660e\u78ba\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.stricttransportsecurity.compliance.meta.name = Strict-Transport-Security\u304cMETA\u30bf\u30b0\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u3059 (\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093)
pscanrules.stricttransportsecurity.compliance.meta.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.5
pscanrules.stricttransportsecurity.compliance.meta.soln = HTTP Strict Transport Security (HSTS) \u3092 META \u30bf\u30b0\u3067\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.compliance.multiple.header.desc = \u8907\u6570\u306eHSTS\u30d8\u30c3\u30c0\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002RFC 6797\u4ed5\u69d8\u3067\u306f\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u5185\u306eHSTS\u30d8\u30c3\u30c0\u30fc\u306f1\u3064\u306e\u307f\u3068\u898f\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u8907\u6570\u306e\u30d8\u30c3\u30c0\u30fc\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u30d6\u30e9\u30a6\u30b6\u306f\u6700\u521d\u306e\u30d8\u30c3\u30c0\u30fc\u306e\u307f\u3092\u51e6\u7406\u3057\u3001\u6b8b\u308a\u3092\u7121\u8996\u3059\u308b\u305f\u3081\u3001\u610f\u56f3\u3057\u305fHSTS\u30dd\u30ea\u30b7\u30fc\u304c\u9069\u7528\u3055\u308c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\nHTTP Strict Transport Security (HSTS) \u306f\u3001\u30d6\u30e9\u30a6\u30b6\u306bHTTPS\u63a5\u7d9a\u306e\u4f7f\u7528\u3092\u5f37\u5236\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u3002\u9069\u5207\u306a\u52d5\u4f5c\u306e\u305f\u3081\u3001HSTS\u30d8\u30c3\u30c0\u30fc\u30921\u3064\u306b\u7d71\u5408\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.stricttransportsecurity.compliance.multiple.header.name = Strict-Transport-Security\u306e\u30d8\u30c3\u30c0\u30fc\u304c\u8907\u6570\u5b58\u5728\u3057\u307e\u3059 (\u4ed5\u69d8\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093)
pscanrules.stricttransportsecurity.compliance.multiple.header.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.1
pscanrules.stricttransportsecurity.compliance.multiple.header.soln = \u30b9\u30bf\u30c3\u30af\u5185\u306e\u5358\u4e00\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8 (\u30b3\u30fc\u30c9\u3001Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069) \u306e\u307f\u304c\u3001HTTP Strict-Transport-Security (HSTS) \u30d8\u30c3\u30c0\u30fc\u3092\u8a2d\u5b9a\u307e\u305f\u306f\u8ffd\u52a0\u3059\u308b\u3088\u3046\u306b\u5fb9\u5e95\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.desc = HTTP Strict Transport Security (HSTS) \u306f\u3001Web\u30b5\u30fc\u30d0\u30fc\u304c\u30d6\u30e9\u30a6\u30b6\u306a\u3069\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306bHTTPS\u63a5\u7d9a\u306e\u307f\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u6307\u793a\u3059\u308bWeb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u3002HSTS\u306b\u3088\u308a\u3001\u30d6\u30e9\u30a6\u30b6\u306f\u8a72\u5f53\u30b5\u30a4\u30c8\u306b\u5bfe\u3057\u3066HTTP\u63a5\u7d9a\u3092\u81ea\u52d5\u7684\u306bHTTPS\u63a5\u7d9a\u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u3001\u4e2d\u9593\u8005\u653b\u6483\u3084\u30d7\u30ed\u30c8\u30b3\u30eb\u30c0\u30a6\u30f3\u30b0\u30ec\u30fc\u30c9\u653b\u6483\u3092\u9632\u304e\u307e\u3059\u3002HSTS\u306fIETF\u6a19\u6e96\u30c8\u30e9\u30c3\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u3068\u3057\u3066RFC 6797\u3067\u4ed5\u69d8\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.stricttransportsecurity.max.age.desc = HSTS\u30d8\u30c3\u30c0\u30fc\u306b max-age\=0 \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u304a\u308a\u3001HSTS\u4fdd\u8b77\u304c\u7121\u52b9\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001\u30d6\u30e9\u30a6\u30b6\u306f\u65e2\u5b58\u306eHSTS\u30dd\u30ea\u30b7\u30fc\u3092\u5373\u5ea7\u306b\u524a\u9664\u3057\u3001\u4ee5\u964d\u306eHTTP\u63a5\u7d9a\u3092\u8a31\u53ef\u3059\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u901a\u5e38\u3001\u8a2d\u5b9a\u30df\u30b9\u304b\u30c6\u30b9\u30c8\u74b0\u5883\u3067\u306e\u610f\u56f3\u7684\u306a\u7121\u52b9\u5316\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002\nHTTP Strict Transport Security (HSTS) \u306f\u3001\u30d6\u30e9\u30a6\u30b6\u306bHTTPS\u63a5\u7d9a\u306e\u4f7f\u7528\u3092\u5f37\u5236\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u304c\u3001max-age\=0 \u306b\u3088\u308a\u3001\u3053\u306e\u4fdd\u8b77\u6a5f\u80fd\u304c\u5b8c\u5168\u306b\u505c\u6b62\u3057\u307e\u3059\u3002
pscanrules.stricttransportsecurity.max.age.name = Strict-Transport-Security\u304c\u7121\u52b9
pscanrules.stricttransportsecurity.max.age.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-6.2
pscanrules.stricttransportsecurity.max.age.soln = \u3053\u306e\u5236\u5fa1\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001\u9069\u5207\u306a max-age \u5024\u3067 Strict-Transport-Security \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.name = Strict-Transport-Security\u30d8\u30c3\u30c0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
pscanrules.stricttransportsecurity.plain.resp.desc = HSTS\u30d8\u30c3\u30c0\u30fc\u304cHTTP (\u975e\u6697\u53f7\u5316) \u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30d6\u30e9\u30a6\u30b6\u306fHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u5185\u306eHSTS\u30d8\u30c3\u30c0\u30fc\u3092\u7121\u8996\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4ed5\u69d8\u306b\u3088\u308a\u3001\u4e2d\u9593\u8005\u653b\u6483\u306b\u3088\u308b\u507d\u306eHSTS\u30dd\u30ea\u30b7\u30fc\u6ce8\u5165\u3092\u9632\u3050\u305f\u3081\u3067\u3059\u3002\u305d\u306e\u305f\u3081\u3001\u73fe\u5728\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308bHSTS\u4fdd\u8b77\u306f\u5168\u304f\u6a5f\u80fd\u3057\u3066\u3044\u307e\u305b\u3093\u3002\nHTTP Strict Transport Security (HSTS) \u306f\u3001\u30d6\u30e9\u30a6\u30b6\u306bHTTPS\u63a5\u7d9a\u306e\u4f7f\u7528\u3092\u5f37\u5236\u3059\u308b\u30e1\u30ab\u30cb\u30ba\u30e0\u3067\u3059\u304c\u3001HTTPS\u63a5\u7d9a\u3067\u306e\u307f\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002
pscanrules.stricttransportsecurity.plain.resp.name = HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u306b Strict-Transport-Security \u30d8\u30c3\u30c0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\n\n
pscanrules.stricttransportsecurity.plain.resp.refs = https\://datatracker.ietf.org/doc/html/rfc6797\#section-8.1
pscanrules.stricttransportsecurity.plain.resp.soln = \u3053\u306e\u5236\u5fa1\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001HTTPS\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u5bfe\u3057\u3066 Strict-Transport-Security \u3092\u8a2d\u5b9a\u3059\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.stricttransportsecurity.refs = https\://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\nhttps\://owasp.org/www-community/Security_Headers\nhttps\://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\nhttps\://caniuse.com/stricttransportsecurity\nhttps\://datatracker.ietf.org/doc/html/rfc6797
pscanrules.stricttransportsecurity.rule.name = Strict-Transport-Security\u30d8\u30c3\u30c0\u30fc
pscanrules.stricttransportsecurity.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001HTTP Strict-Transport-Security \u3092\u5f37\u5236\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.timestampdisclosure.desc = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3/Web\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u3001\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u304c\u958b\u793a\u3055\u308c\u307e\u3057\u305f\u3002
pscanrules.timestampdisclosure.extrainfo = {0} \u306f\u3001 {1} \u3068\u8a55\u4fa1\u3055\u308c\u307e\u3059\u3002
pscanrules.timestampdisclosure.name = \u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u306e\u9732\u898b
pscanrules.timestampdisclosure.refs = https\://cwe.mitre.org/data/definitions/200.html
pscanrules.timestampdisclosure.soln = \u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u30c7\u30fc\u30bf\u306b\u6a5f\u5bc6\u6027\u304c\u306a\u3044\u3053\u3068\u3001\u307e\u305f\u3001\u60aa\u7528\u53ef\u80fd\u306a\u30d1\u30bf\u30fc\u30f3\u3092\u660e\u3089\u304b\u306b\u3059\u308b\u305f\u3081\u306b\u30c7\u30fc\u30bf\u3092\u96c6\u7d04\u3067\u304d\u306a\u3044\u3053\u3068\u3092\u624b\u52d5\u3067\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usercontrolledcharset.desc = \u3053\u306e\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u5165\u529b (\u30af\u30a8\u30ea\u30b9\u30c8\u30ea\u30f3\u30b0\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3084POST\u30c7\u30fc\u30bf)\u3092\u7528\u3044\u3066\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u6587\u5b57\u30bb\u30c3\u30c8\u6307\u5b9a (Content-Type \u30d8\u30c3\u30c0\u30fc\u3084 meta \u30bf\u30b0)\u304c\u5236\u5fa1\u3067\u304d\u3066\u3057\u307e\u3046\u7b87\u6240\u3092\u691c\u51fa\u3057\u307e\u3059\u3002\u6587\u5b57\u30bb\u30c3\u30c8\u306f\u3001\u672c\u6765\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5074\u3067\u30d1\u30c3\u30b7\u30d6\u306b\u6307\u5b9a\u3055\u308c\u308b\u3079\u304d\u3067\u3059\u3002\u653b\u6483\u8005\u304c\u6587\u5b57\u30bb\u30c3\u30c8\u3092\u610f\u56f3\u7684\u306b\u5909\u66f4\u3067\u304d\u308b\u5834\u5408 (\u4f8b\: UTF-7\u3092\u6307\u5b9a)\u3001\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u3088\u308bHTML\u306e\u89e3\u91c8\u3092\u4e0d\u6b63\u306b\u64cd\u4f5c\u3057\u3001\u30b5\u30fc\u30d0\u30fc\u5074\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u5bfe\u7b56\u3092\u56de\u907f\u3057\u3066XSS (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0) \u306a\u3069\u306e\u653b\u6483\u3092\u5b9f\u884c\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001\u653b\u6483\u30da\u30a4\u30ed\u30fc\u30c9\u3092UTF-7\u3067\u30a8\u30f3\u30b3\u30fc\u30c9\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001\u591a\u304f\u306e\u30b5\u30fc\u30d0\u30fc\u5074XSS\u30d5\u30a3\u30eb\u30bf\u30fc\u3092\u30d0\u30a4\u30d1\u30b9\u3057\u3066\u3001\u30da\u30fc\u30b8\u306b\u60aa\u610f\u306e\u3042\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u57cb\u3081\u8fbc\u3080\u3053\u3068\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002
pscanrules.usercontrolledcharset.extrainfo = [{0}] \u30bf\u30b0\u306e [{1}] \u5c5e\u6027\u3002\n\n\u898b\u3064\u304b\u3063\u305f\u30e6\u30fc\u30b6\u30fc\u5165\u529b\uff1a\n{2}\={3}\n\n\u3053\u308c\u306b\u3088\u308a\u5236\u5fa1\u3055\u308c\u3066\u3044\u305f\u6587\u5b57\u30b3\u30fc\u30c9\u5024\uff1a\n{4}
pscanrules.usercontrolledcharset.name = \u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u53ef\u80fd\u306a\u6587\u5b57\u30b3\u30fc\u30c9
pscanrules.usercontrolledcharset.soln = \u3059\u3079\u3066\u306e\u6587\u5b57\u30b3\u30fc\u30c9\u5ba3\u8a00\u3067UTF-8\u3092\u5f37\u5236\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u6587\u5b57\u30b3\u30fc\u30c9\u5ba3\u8a00\u306b\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001\u8a31\u53ef\u30ea\u30b9\u30c8\u306e\u307f\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u5fb9\u5e95\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usercontrolledcookie.desc = \u3053\u306e\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u5165\u529b (\u30af\u30a8\u30ea\u30b9\u30c8\u30ea\u30f3\u30b0\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3084POST\u30c7\u30fc\u30bf) \u306b\u3088\u3063\u3066\u3001Cookie\u306e\u5024\u304c\u4e0d\u6b63\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u7b87\u6240 (Cookie\u30dd\u30a4\u30ba\u30cb\u30f3\u30b0) \u3092\u691c\u51fa\u3057\u307e\u3059\u3002\u653b\u6483\u8005\u304c\u3053\u306e\u554f\u984c\u3092\u60aa\u7528\u3057\u3066Cookie\u306e\u5024\u3092\u4efb\u610f\u306b\u64cd\u4f5c\u3067\u304d\u308b\u5834\u5408\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6539\u3056\u3093\u3084\u6a29\u9650\u6607\u683c\u306a\u3069\u3001\u69d8\u3005\u306a\u653b\u6483\u306b\u3064\u306a\u304c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u554f\u984c\u306f\u3001\u5e38\u306b\u76f4\u63a5\u7684\u306a\u8106\u5f31\u6027\u3068\u3057\u3066\u60aa\u7528\u3067\u304d\u308b\u3068\u306f\u9650\u308a\u307e\u305b\u3093\u3002\u3057\u304b\u3057\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u7528\u3044\u3066Cookie\u306e\u5024\u3092\u8a2d\u5b9a\u3067\u304d\u308b\u3053\u3068\u81ea\u4f53\u304c\u3001\u4e00\u822c\u7684\u306b\u4e0d\u9069\u5207\u306a\u5b9f\u88c5 (\u30d0\u30b0) \u3068\u898b\u306a\u3055\u308c\u307e\u3059\u3002\n
pscanrules.usercontrolledcookie.extrainfo = {0}\u3053\u308c\u306f\u4ee5\u4e0b\u306e\u5834\u6240\u3067\u7279\u5b9a\u3055\u308c\u307e\u3057\u305f\uff1a\n\n{1}\n\n\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u306f\u4ee5\u4e0b\u306eCookie\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\uff1a\n{2}\n\n\u898b\u3064\u304b\u3063\u305f\u30e6\u30fc\u30b6\u30fc\u5165\u529b\uff1a\n{3}\={4}
pscanrules.usercontrolledcookie.extrainfo.get = \u653b\u6483\u8005\u304cURL\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u901a\u3058\u3066Cookie\u306e\u5024\u3092\u6c5a\u67d3\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30bb\u30df\u30b3\u30ed\u30f3\u3092\u6ce8\u5165\u3057\u3066\u3001Cookie\u306e\u5024\u3092\u8ffd\u52a0\u3067\u304d\u308b\u304b\u8a66\u3057\u3066\u304f\u3060\u3055\u3044\u3002(\u4f8b\: name\=controlledValue;name\=anotherValue;)
pscanrules.usercontrolledcookie.extrainfo.post = \u653b\u6483\u8005\u306f\u3001POST\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4ecb\u3057\u3066Cookie\u306e\u5024\u3092\u6c5a\u67d3\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u304c\u3088\u308a\u6df1\u523b\u306a\u554f\u984c\u3067\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u30c6\u30b9\u30c8\u3059\u308b\u306b\u306f\u3001POST\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u30af\u30a8\u30ea\u6587\u5b57\u5217\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u542b\u3081\u3001\u305d\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092GET\u3068\u3057\u3066\u518d\u9001\u4fe1\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\u4f8b\: https\://nottrusted.com/page?value\=maliciousInput
pscanrules.usercontrolledcookie.name = Cookie\u30dd\u30a4\u30ba\u30cb\u30f3\u30b0
pscanrules.usercontrolledcookie.refs = https\://en.wikipedia.org/wiki/HTTP_cookie\nhttps\://cwe.mitre.org/data/definitions/565.html
pscanrules.usercontrolledcookie.soln = \u30e6\u30fc\u30b6\u30fc\u5165\u529b\u306b\u3088\u3063\u3066Cookie\u306e\u540d\u524d\u3084\u5024\u3092\u5236\u5fa1\u3055\u305b\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092Cookie\u306e\u5024\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u540d\u524d\u3068\u5024\u306e\u533a\u5207\u308a\u6587\u5b57\u3068\u3057\u3066\u6a5f\u80fd\u3059\u308b\u30bb\u30df\u30b3\u30ed\u30f3\u3092\u5fc5\u305a\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usercontrolledhtmlattributes.desc = \u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u3001\u30af\u30a8\u30ea\u6587\u5b57\u5217\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3084POST\u30c7\u30fc\u30bf\u306b\u542b\u307e\u308c\u308b\u30e6\u30fc\u30b6\u30fc\u63d0\u4f9b\u306e\u5165\u529b\u3092\u8abf\u3079\u3066\u3001\u7279\u5b9a\u306eHTML\u5c5e\u6027\u5024\u304c\u5236\u5fa1\u3055\u308c\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u5834\u6240\u3092\u7279\u5b9a\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u3001XSS (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0) \u306e\u30db\u30c3\u30c8\u30b9\u30dd\u30c3\u30c8\u691c\u51fa\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u60aa\u7528\u53ef\u80fd\u6027\u3092\u5224\u65ad\u3059\u308b\u306b\u306f\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30a2\u30ca\u30ea\u30b9\u30c8\u306b\u3088\u308b\u3055\u3089\u306a\u308b\u30ec\u30d3\u30e5\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
pscanrules.usercontrolledhtmlattributes.extrainfo = \u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u53ef\u80fd\u306aHTML\u5c5e\u6027\u5024\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u7279\u6b8a\u6587\u5b57\u3092\u633f\u5165\u3057\u3066\u3001XSS\u304c\u53ef\u80fd\u304b\u3069\u3046\u304b\u3092\u8a66\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u4ee5\u4e0b\u306eURL\u306e\u30da\u30fc\u30b8\uff1a\n\n{0}\n\n\u304c\u3001\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u4ee5\u4e0b\u306b\u542b\u3093\u3067\u3044\u308b\u3088\u3046\u3067\u3059\uff1a\n[{1}] \u30bf\u30b0\u306e [{2}] \u5c5e\u6027\n\n\u898b\u3064\u304b\u3063\u305f\u30e6\u30fc\u30b6\u30fc\u5165\u529b\uff1a\n{3}\={4}\n\n\u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u3059\u308b\u5024\uff1a\n{5}
pscanrules.usercontrolledhtmlattributes.name = \u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u53ef\u80fd\u306aHTML\u8981\u7d20\u5c5e\u6027 (XSS\u306e\u53ef\u80fd\u6027)
pscanrules.usercontrolledhtmlattributes.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Input_Validation_Cheat_Sheet.html
pscanrules.usercontrolledhtmlattributes.soln = HTML\u5c5e\u6027\u306b\u66f8\u304d\u8fbc\u3080\u524d\u306b\u3001\u3059\u3079\u3066\u306e\u5165\u529b\u3092\u691c\u8a3c\u3057\u3001\u51fa\u529b\u3092\u30b5\u30cb\u30bf\u30a4\u30ba (\u7121\u5bb3\u5316) \u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usercontrolledjavascriptevent.desc = \u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u3001\u30af\u30a8\u30ea\u6587\u5b57\u5217\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3084POST\u30c7\u30fc\u30bf\u306b\u542b\u307e\u308c\u308b\u30e6\u30fc\u30b6\u30fc\u63d0\u4f9b\u306e\u5165\u529b\u3092\u8abf\u3079\u3066\u3001\u7279\u5b9a\u306eHTML\u5c5e\u6027\u5024\u304c\u5236\u5fa1\u3055\u308c\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u5834\u6240\u3092\u7279\u5b9a\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u3001XSS (\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0) \u306e\u30db\u30c3\u30c8\u30b9\u30dd\u30c3\u30c8\u691c\u51fa\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u60aa\u7528\u53ef\u80fd\u6027\u3092\u5224\u65ad\u3059\u308b\u306b\u306f\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30a2\u30ca\u30ea\u30b9\u30c8\u306b\u3088\u308b\u3055\u3089\u306a\u308b\u30ec\u30d3\u30e5\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
pscanrules.usercontrolledjavascriptevent.extrainfo = \u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u53ef\u80fd\u306aJavaScript\u30a4\u30d9\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u60aa\u7528\u53ef\u80fd\u6027\u306f\u624b\u52d5\u3067\u5224\u65ad\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u4ee5\u4e0b\u306eURL\u306b\u3042\u308b\u30da\u30fc\u30b8\uff1a\n\n{0}\n\n\u306b\u306f\u3001\u653b\u6483\u8005\u304c\u5236\u5fa1\u3067\u304d\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u4ee5\u4e0b\u306eJavaScript\u30a4\u30d9\u30f3\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\uff1a\n\n[{1}] \u30a4\u30d9\u30f3\u30c8\u306e\u4ee5\u4e0b\u306e\u30c7\u30fc\u30bf\u3067\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\uff1a\n{2}\n\n\u898b\u3064\u304b\u3063\u305f\u30e6\u30fc\u30b6\u30fc\u5165\u529b\uff1a\n{3}
pscanrules.usercontrolledjavascriptevent.name = \u30e6\u30fc\u30b6\u30fc\u304c\u5236\u5fa1\u53ef\u80fd\u306aJavaScript\u30a4\u30d9\u30f3\u30c8 (XSS)
pscanrules.usercontrolledjavascriptevent.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Input_Validation_Cheat_Sheet.html
pscanrules.usercontrolledjavascriptevent.soln = JavaScript\u306e\u30a4\u30d9\u30f3\u30c8\u30cf\u30f3\u30c9\u30e9\u306b\u66f8\u304d\u8fbc\u3080\u524d\u306b\u3001\u3059\u3079\u3066\u306e\u5165\u529b\u3092\u691c\u8a3c\u3057\u3001\u51fa\u529b\u3092\u30b5\u30cb\u30bf\u30a4\u30ba (\u7121\u5bb3\u5316) \u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usercontrolledopenredirect.desc = \u30aa\u30fc\u30d7\u30f3\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306f\u91cd\u8981\u306aWeb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8106\u5f31\u6027\u306e1\u3064\u3067\u3059 (OWASP Top 10\u306b\u9577\u5e74\u63b2\u8f09)\u3002\u3053\u306e\u30c1\u30a7\u30c3\u30af\u3067\u306f\u3001\u30af\u30a8\u30ea\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068POST\u30c7\u30fc\u30bf\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u3092\u5206\u6790\u3057\u3001\u30aa\u30fc\u30d7\u30f3\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u53ef\u80fd\u6027\u304c\u3042\u308b\u7b87\u6240\u3092\u7279\u5b9a\u3057\u307e\u3059\u3002\u30aa\u30fc\u30d7\u30f3\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30e6\u30fc\u30b6\u30fc\u5165\u529b (\u4f8b\uff1ahttps\://nottrusted.com) \u306b\u3088\u3063\u3066\u5916\u90e8\u30b5\u30a4\u30c8\u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u5148\u5236\u5fa1\u3092\u8a31\u53ef\u3059\u308b\u969b\u306b\u767a\u751f\u3057\u307e\u3059\u3002\u3053\u306e\u8106\u5f31\u6027\u306f301/302\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3092\u60aa\u7528\u3057\u305f\u30b9\u30d1\u30e0\u3084\u30d5\u30a3\u30c3\u30b7\u30f3\u30b0\u653b\u6483\u3067\u3088\u304f\u5229\u7528\u3055\u308c\u307e\u3059\u3002\n\n\u653b\u6483\u4f8b\uff1a\u653b\u6483\u8005\u304c\u4ee5\u4e0b\u306e\u3088\u3046\u306a\u30ea\u30f3\u30af\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u9001\u4fe1\nhttps\://example.com/example.php?url\=https\://malicious.example.com\n\n\u6ce8\u610f\uff1a\u3053\u306e\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u3067\u306f\u3001\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u5143\u3068\u8ee2\u9001\u5148\u306e\u30c9\u30e1\u30a4\u30f3\u90e8\u5206\u3092\u6bd4\u8f03\u3057\u3066\u3044\u307e\u3059\u3002\u5f71\u97ff\u5ea6\u306e\u691c\u8a3c\u306b\u306f\u624b\u52d5\u30c6\u30b9\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.usercontrolledopenredirect.extrainfo.common = {0}\n\n\u898b\u3064\u304b\u3063\u305f\u30e6\u30fc\u30b6\u30fc\u5165\u529b\uff1a\n\n{1}\={2}\n\n\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\uff1a\n\n{3}
pscanrules.usercontrolledopenredirect.extrainfo.get = \u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3059\u308b301\u307e\u305f\u306f302\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u30d8\u30c3\u30c0\u30fc\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
pscanrules.usercontrolledopenredirect.extrainfo.post = POST\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u5236\u5fa1\u3055\u308c\u308b\u30aa\u30fc\u30d7\u30f3\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002POST\u30ea\u30af\u30a8\u30b9\u30c8\u306f\u76f4\u63a5\u30ea\u30f3\u30af\u3067\u306e\u60aa\u7528\u304c\u56f0\u96e3\u3067\u3059\u304c\u3001\u540c\u3058\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092GET\u30af\u30a8\u30ea\u3068\u3057\u3066\u9001\u4fe1\u53ef\u80fd\u304b\u30c6\u30b9\u30c8\u3059\u308b\u3053\u3068\u3067\u3001\u3088\u308a\u6df1\u523b\u306a\u8106\u5f31\u6027\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059\u3002GET\u306e\u5834\u5408\u3001URL\u3092\u76f4\u63a5\u30e1\u30fc\u30eb\u3084\u30e1\u30c3\u30bb\u30fc\u30b8\u3067\u9001\u4fe1\u3067\u304d\u308b\u305f\u3081\u3001\u30d5\u30a3\u30c3\u30b7\u30f3\u30b0\u653b\u6483\u306e\u30ea\u30b9\u30af\u304c\u9ad8\u307e\u308a\u307e\u3059\u3002\n\u30c6\u30b9\u30c8\u4f8b\: POST\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092GET\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306b\u5909\u63db\nhttps\://nottrusted.com/page?url\=https\://lookout.net\n\n\u4ee5\u4e0b\u306eURL\u3078\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3001301/302\u30ec\u30b9\u30dd\u30f3\u30b9\u306e location \u30d8\u30c3\u30c0\u30fc\u306b\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u304c\u53cd\u6620\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\uff1a
pscanrules.usercontrolledopenredirect.name = \u5916\u90e8\u30b5\u30a4\u30c8\u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
pscanrules.usercontrolledopenredirect.refs = https\://cheatsheetseries.owasp.org/cheatsheets/Unvalidated_Redirects_and_Forwards_Cheat_Sheet.html\nhttps\://cwe.mitre.org/data/definitions/601.html
pscanrules.usercontrolledopenredirect.soln = \u30aa\u30fc\u30d7\u30f3\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u8106\u5f31\u6027\u3092\u56de\u907f\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30d6\u30e9\u30a6\u30b6\u306b302 HTTP\u30b3\u30fc\u30c9 (\u30ea\u30c0\u30a4\u30ec\u30af\u30c8) \u3092\u9001\u4fe1\u3059\u308b\u524d\u306b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30b9\u30af\u30ea\u30d7\u30c8/\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u691c\u8a3c\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\u76f8\u5bfeURI\u307e\u305f\u306f\u4fe1\u983c\u3067\u304d\u308b\u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u306b\u306e\u307f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3059\u308b\u3001\u5b89\u5168\u306a\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u6a5f\u80fd\u3092\u5b9f\u88c5\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.usernameidor.desc = \u5fdc\u7b54\u306b\u30e6\u30fc\u30b6\u30fc\u540d ({0}) \u306e\u30cf\u30c3\u30b7\u30e5\u5024\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u4e0d\u9069\u5207\u306a\u76f4\u63a5\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u53c2\u7167 (IDOR) \u306e\u8106\u5f31\u6027\u304c\u3042\u308b\u53ef\u80fd\u6027\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u767a\u898b\u304c\u60aa\u7528\u53ef\u80fd\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3059\u308b\u306b\u306f\u3001\u624b\u52d5\u3067\u306e\u30c6\u30b9\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
pscanrules.usernameidor.name = \u30e6\u30fc\u30b6\u30fc\u540d\u30cf\u30c3\u30b7\u30e5\u306e\u691c\u51fa
pscanrules.usernameidor.otherinfo = \u30cf\u30c3\u30b7\u30e5\u306f {0} \u3067\u3001\u5024\u306f {1} \u3067\u3057\u305f\u3002
pscanrules.usernameidor.refs = https\://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/05-Authorization_Testing/04-Testing_for_Insecure_Direct_Object_References.html
pscanrules.usernameidor.soln = Per-user \u307e\u305f\u306f per-session indirect \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u53c2\u7167\u3092\u4f7f\u7528\u3059\u308b (\u4f7f\u7528\u6642\u306b\u4e00\u6642\u7684\u306a\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u4f5c\u6210\u3059\u308b) \u304b\u3001\u76f4\u63a5\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u53c2\u7167\u3092\u4f7f\u7528\u3059\u308b\u969b\u306b\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u8981\u6c42\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u8a8d\u53ef\u30c1\u30a7\u30c3\u30af\u3068\u5fc5\u305a\u7d10\u4ed8\u3051\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.viewstate.content.email.desc = \u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u304c ViewState \u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
pscanrules.viewstate.content.email.name = ViewState \u304b\u3089\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
pscanrules.viewstate.content.email.pattern.source = \u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u30d1\u30bf\u30fc\u30f3 - https\://www.regular-expressions.info/email.html
pscanrules.viewstate.content.ip.desc = IP\u30a2\u30c9\u30ec\u30b9\u304c ViewState \u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\n\n
pscanrules.viewstate.content.ip.name = ViewState \u304b\u3089\u6f5c\u5728\u7684\u306aIP\u30a2\u30c9\u30ec\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
pscanrules.viewstate.content.ip.pattern.source = IP\u30a2\u30c9\u30ec\u30b9\u306e\u30d1\u30bf\u30fc\u30f3 - https\://www.regular-expressions.info/ip.html
pscanrules.viewstate.name = Viewstate
pscanrules.viewstate.nomac.sure.desc = \u3053\u306e\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u306f\u3001ASP.NET\u306e ViewState \u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u304c\u3001MAC\u304c\u3042\u308a\u307e\u305b\u3093\u3002\n\n
pscanrules.viewstate.nomac.sure.name = MAC\u7f72\u540d\u306a\u3057\u306eViewstate (\u78ba\u4fe1\u5ea6\: \u9ad8)
pscanrules.viewstate.nomac.sure.refs = https\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff649308(v\=pandp.10)
pscanrules.viewstate.nomac.sure.soln = \u3053\u306e\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u306e\u3059\u3079\u3066\u306e\u30da\u30fc\u30b8\u3067\u3001MAC\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.viewstate.nomac.unsure.desc = \u3053\u306e\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u306f\u3001ASP.NET\u306e ViewState \u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u304c\u3001MAC\u304c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.viewstate.nomac.unsure.name = MAC\u7f72\u540d\u306a\u3057\u306eViewstate (\u78ba\u4fe1\u5ea6\: \u4f4e)
pscanrules.viewstate.nomac.unsure.refs = https\://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff649308(v\=pandp.10)
pscanrules.viewstate.nomac.unsure.soln = \u3053\u306e\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u306e\u3059\u3079\u3066\u306e\u30da\u30fc\u30b8\u3067\u3001MAC\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.viewstate.oldver.desc = \u3053\u306e\u30a6\u30a7\u30d6\u30b5\u30a4\u30c8\u306fASP.NET\u30d0\u30fc\u30b8\u30e7\u30f31.0\u307e\u305f\u306f1.1\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002
pscanrules.viewstate.oldver.name = \u53e4\u3044ASP.NET\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059
pscanrules.viewstate.oldver.soln = \u4f7f\u7528\u3057\u3066\u3044\u308b\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u304c\u3001\u307e\u3060Microsoft\u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.viewstate.soln = \u63d0\u4f9b\u3055\u308c\u305f\u60c5\u5831\u304c\u6a5f\u5bc6\u60c5\u5831\u3067\u306f\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.viewstate.split.desc = ASP.NET\u306e ViewState \u304c\u8907\u6570\u306e\u30c1\u30e3\u30f3\u30af\u306b\u5206\u5272\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.viewstate.split.name = \u5206\u5272\u3055\u308c\u305f ViewState \u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059
pscanrules.viewstate.split.soln = \u306a\u3057 - \u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u610f\u56f3\u7684\u306a\u8a2d\u5b9a\u8abf\u6574\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

pscanrules.xaspnetversion.desc = "X-AspNet-Version"/"X-AspNetMvc-Version" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u60c5\u5831\u6f0f\u6d29
pscanrules.xaspnetversion.extrainfo = \u3053\u306e\u60c5\u5831\u3092\u5229\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u653b\u6483\u8005\u306f\u65e2\u77e5\u306e\u8106\u5f31\u6027\u3092\u60aa\u7528\u3067\u304d\u307e\u3059\u3002
pscanrules.xaspnetversion.name = X-AspNet-Version \u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc
pscanrules.xaspnetversion.refs = https\://www.troyhunt.com/shhh-dont-let-your-response-headers/\nhttps\://learn.microsoft.com/en-us/archive/blogs/varunm/remove-unwanted-http-response-headers
pscanrules.xaspnetversion.soln = \u30b5\u30fc\u30d0\u30fc\u304c\u3053\u308c\u3089\u306e\u30d8\u30c3\u30c0\u30fc\u3092\u8fd4\u3055\u306a\u3044\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.xbackendserver.desc = \u30b5\u30fc\u30d0\u30fc\u304c\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u30b7\u30b9\u30c6\u30e0\u306b\u95a2\u3059\u308b\u60c5\u5831 (\u30db\u30b9\u30c8\u540d\u3084IP\u30a2\u30c9\u30ec\u30b9\u306a\u3069) \u3092\u6f0f\u6d29\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u60c5\u5831\u3092\u624b\u306b\u3057\u305f\u653b\u6483\u8005\u306f\u3001\u4ed6\u306e\u30b7\u30b9\u30c6\u30e0\u3092\u653b\u6483\u3057\u305f\u308a\u3001\u305d\u308c\u3089\u306e\u30b7\u30b9\u30c6\u30e0\u3092\u3088\u308a\u76f4\u63a5\u7684\u304b\u3064\u52b9\u7387\u7684\u306b\u653b\u6483\u3057\u305f\u308a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.xbackendserver.name = X-Backend-Server \u30d8\u30c3\u30c0\u30fc\u306b\u3088\u308b\u60c5\u5831\u6f0f\u6d29
pscanrules.xbackendserver.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304c\u3001X-Backend-Server\u30d8\u30c3\u30c0\u30fc\u3092\u6291\u5236\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.xchromeloggerdata.desc = \u30b5\u30fc\u30d0\u30fc\u304c X-ChromeLogger-Data (\u307e\u305f\u306f X-ChromePhp-Data) \u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u4ecb\u3057\u3066\u60c5\u5831\u3092\u6f0f\u6d29\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u30d8\u30c3\u30c0\u30fc\u306e\u5185\u5bb9\u306f\u958b\u767a\u8005\u306b\u3088\u3063\u3066\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3067\u304d\u307e\u3059\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30d5\u30a1\u30a4\u30eb\u30b7\u30b9\u30c6\u30e0\u4e0a\u306e\u5834\u6240\u3084 vhost \u5ba3\u8a00\u306a\u3069\u304c\u898b\u3064\u304b\u308b\u3053\u3068\u3082\u73cd\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
pscanrules.xchromeloggerdata.name = X-ChromeLogger-Data (XCOLD) \u30d8\u30c3\u30c0\u30fc\u306b\u3088\u308b\u60c5\u5831\u6f0f\u6d29
pscanrules.xchromeloggerdata.otherinfo.error = \u30d8\u30c3\u30c0\u30fc\u306e\u5024\u304cBase64\u30c7\u30b3\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\:
pscanrules.xchromeloggerdata.otherinfo.msg = \u4ee5\u4e0b\u306f\u3001\u5024\u3092Base64\u30c7\u30b3\u30fc\u30c9\u3057\u3088\u3046\u3068\u3057\u305f\u7d50\u679c\u3067\u3059\uff1a
pscanrules.xchromeloggerdata.refs = https\://craig.is/writing/chrome-logger
pscanrules.xchromeloggerdata.soln = \u672c\u756a\u74b0\u5883\u3067\u306f\u3001\u653b\u6483\u8005\u304c\u60aa\u7528\u53ef\u80fd\u306a\u60c5\u5831\u3092\u516c\u958b\u3059\u308b\u3053\u306e\u6a5f\u80fd\u3092\u7121\u52b9\u5316\u3059\u308b\u3053\u3068\u3092\u63a8\u5968\u3057\u307e\u3059\u3002\u6a5f\u80fd\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001\u53b3\u683c\u306a\u6a29\u9650\u78ba\u8a8d\u3092\u5b9f\u88c5\u3057\u3001\u7ba1\u7406\u8005\u307e\u305f\u306f\u30b5\u30dd\u30fc\u30c8\u62c5\u5f53\u8005\u306b\u3088\u308b\u30c8\u30e9\u30d6\u30eb\u30b7\u30e5\u30fc\u30c6\u30a3\u30f3\u30b0\u7528\u9014\u306b\u9650\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4e00\u822c\u30e6\u30fc\u30b6\u30fc\u306b\u306f\u516c\u958b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002

pscanrules.xcontenttypeoptions.desc = MIME\u63a8\u6e2c\u9632\u6b62\u30d8\u30c3\u30c0\u30fc X-Content-Type-Options \u304c 'nosniff' \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001\u30d6\u30e9\u30a6\u30b6\u304cContent-Type\u30d8\u30c3\u30c0\u30fc\u3092\u7121\u8996\u3057\u3066\u30d5\u30a1\u30a4\u30eb\u5185\u5bb9\u304b\u3089\u63a8\u6e2c\u3067MIME\u30bf\u30a4\u30d7\u3092\u6c7a\u5b9a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u653b\u6483\u8005\u304c\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u3092\u610f\u56f3\u3057\u306a\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7 (JavaScript\u3001HTML\u306a\u3069) \u3068\u3057\u3066\u5b9f\u884c\u3055\u305b\u3001XSS\u653b\u6483\u3092\u5b9f\u884c\u3059\u308b\u624b\u6cd5\u306b\u60aa\u7528\u3055\u308c\u308b\u6050\u308c\u304c\u3042\u308a\u307e\u3059\u3002\u73fe\u4ee3\u306e\u30d6\u30e9\u30a6\u30b6\u3067\u3082\u3001\u3053\u306e\u8a2d\u5b9a\u304c\u306a\u3044\u5834\u5408\u306fMIME\u63a8\u6e2c\u304c\u5b9f\u884c\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.xcontenttypeoptions.name = X-Content-Type-Options\u30d8\u30c3\u30c0\u30fc\u304c\u3042\u308a\u307e\u305b\u3093
pscanrules.xcontenttypeoptions.otherinfo = \u3053\u306e\u554f\u984c\u306f\u30a8\u30e9\u30fc\u30da\u30fc\u30b8 (401\u3001403\u3001500\u306a\u3069) \u306b\u3082\u4f9d\u7136\u3068\u3057\u3066\u95a2\u9023\u3057\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u30da\u30fc\u30b8\u306f\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u554f\u984c\u306e\u5f71\u97ff\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u591a\u304f\u3001\u305d\u306e\u5834\u5408\u3001\u30d6\u30e9\u30a6\u30b6\u304c\u672c\u6765\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30bf\u30a4\u30d7\u3068\u306f\u7570\u306a\u308b\u30da\u30fc\u30b8\u3068\u3057\u3066\u8a8d\u8b58\u3057\u3066\u3057\u307e\u3046\u61f8\u5ff5\u304c\u4f9d\u7136\u3068\u3057\u3066\u6b8b\u308a\u307e\u3059\u3002\n\u300c\u9ad8 (High)\u300d\u3057\u304d\u3044\u5024\u3067\u306f\u3001\u3053\u306e\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u307e\u305f\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u30a8\u30e9\u30fc\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u30a2\u30e9\u30fc\u30c8\u3092\u767a\u5831\u3057\u307e\u305b\u3093\u3002
pscanrules.xcontenttypeoptions.refs = https\://learn.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v\=vs.85)\nhttps\://owasp.org/www-community/Security_Headers
pscanrules.xcontenttypeoptions.soln = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3084Web\u30b5\u30fc\u30d0\u30fc\u304c\u3001Content-Type\u30d8\u30c3\u30c0\u30fc\u3092\u9069\u5207\u306b\u8a2d\u5b9a\u3057\u3001\u3059\u3079\u3066\u306eWeb\u30da\u30fc\u30b8\u3067X-Content-Type-Options\u30d8\u30c3\u30c0\u30fc\u3092 'nosniff' \u306b\u8a2d\u5b9a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u53ef\u80fd\u3067\u3042\u308c\u3070\u3001\u30a8\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc\u304cMIME\u63a8\u6e2c\u3092\u4e00\u5207\u884c\u308f\u306a\u3044\u3001\u307e\u305f\u306fWeb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3084Web\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066MIME\u63a8\u6e2c\u3092\u884c\u308f\u306a\u3044\u3088\u3046\u306b\u6307\u793a\u3067\u304d\u308b\u3001\u6a19\u6e96\u306b\u6e96\u62e0\u3057\u305f\u6700\u65b0\u306eWeb\u30d6\u30e9\u30a6\u30b6\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.xdebugtoken.desc = X-Debug-Token \u307e\u305f\u306f X-Debug-Token-Link \u30d8\u30c3\u30c0\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u3053\u308c\u306f\u3001Symfony \u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u6a5f\u5bc6\u60c5\u5831\u304c\u6f0f\u6d29\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u3053\u3068\u3092\u793a\u5506\u3057\u3066\u3044\u307e\u3059\u3002
pscanrules.xdebugtoken.name = X-Debug-Token \u30d8\u30c3\u30c0\u30fc\u306b\u3088\u308b\u60c5\u5831\u6f0f\u6d29
pscanrules.xdebugtoken.otherinfo = https\://target_host/_profiler/token_value (\u4f8b\: https\://example.com/_profiler_/123ab4) \u306e\u5f62\u5f0f\u3067URL\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3053\u3068\u3067\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3001\u3055\u3089\u306b\u60c5\u5831\u304c\u6f0f\u6d29\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n
pscanrules.xdebugtoken.refs = https\://symfony.com/doc/current/profiler.html\nhttps\://symfony.com/blog/new-in-symfony-2-4-quicker-access-to-the-profiler-when-working-on-an-api
pscanrules.xdebugtoken.soln = Symfony\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u3001\u8a8d\u8a3c\u3084\u8a8d\u53ef\u3001\u307e\u305f\u306f\u7279\u5b9a\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 (IP\u306a\u3069) \u3078\u306e\u30d8\u30c3\u30c0\u30fc\u306e\u30a4\u30f3\u30af\u30eb\u30fc\u30c9\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u5236\u9650\u3057\u307e\u3059\u3002

pscanrules.xpoweredbyheaderinfoleak.desc = \u30b5\u30fc\u30d0\u30fc\u304c1\u3064\u4ee5\u4e0a\u306e "X-Powered-By" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u3092\u4ecb\u3057\u3066\u60c5\u5831\u3092\u6f0f\u6d29\u3057\u3066\u3044\u307e\u3059\u3002\n\n\u3053\u306e\u60c5\u5831\u306b\u30a2\u30af\u30bb\u30b9\u3057\u305f\u653b\u6483\u8005\u306f\u3001Web\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4f9d\u5b58\u3057\u3066\u3044\u308b\u4ed6\u306e\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u3084\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u7279\u5b9a\u3057\u3001\u305d\u308c\u3089\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u62b1\u3048\u308b\u8106\u5f31\u6027\u3092\u60aa\u7528\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.xpoweredbyheaderinfoleak.name = \u30b5\u30fc\u30d0\u30fc\u304c "X-Powered-By" HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u30d5\u30a3\u30fc\u30eb\u30c9\u7d4c\u7531\u3067\u60c5\u5831\u3092\u6f0f\u6d29
pscanrules.xpoweredbyheaderinfoleak.otherinfo.msg = \u4ee5\u4e0b\u306eX-Powered-By\u30d8\u30c3\u30c0\u30fc\u3082\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\uff1a
pscanrules.xpoweredbyheaderinfoleak.refs = https\://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/01-Information_Gathering/08-Fingerprint_Web_Application_Framework\nhttps\://www.troyhunt.com/shhh-dont-let-your-response-headers/
pscanrules.xpoweredbyheaderinfoleak.soln = Web\u30b5\u30fc\u30d0\u30fc\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u30fc\u306a\u3069\u304cX-Powered-By\u30d8\u30c3\u30c0\u30fc\u3092\u6291\u5236\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.zapversion.desc = \u73fe\u5728\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c6\u30b9\u30c8\u306b\u4f7f\u7528\u3057\u3066\u3044\u308bZAP\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u53e4\u304f\u3001\u3059\u3067\u306b\u66f4\u65b0\u304c\u505c\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\n\u3053\u306e\u30ea\u30b9\u30af\u30ec\u30d9\u30eb\u306f\u3001ZAP\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3069\u306e\u7a0b\u5ea6\u53e4\u3044\u304b\u306b\u57fa\u3065\u3044\u3066\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanrules.zapversion.name = \u53e4\u3044ZAP\u30d0\u30fc\u30b8\u30e7\u30f3
pscanrules.zapversion.otherinfo = ZAP\u306e\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u306f {0} \u3067\u3059
pscanrules.zapversion.refs = https\://www.zaproxy.org/download/
pscanrules.zapversion.soln = \u6700\u65b0\u7248\u306eZAP\u3092 https\://www.zaproxy.org/download/ \u304b\u3089\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u3066\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
