#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanrules.desc=R\u00e8gles d'analyse passive

pscanrules.headerxssprotectionscanner.name=Protection XSS du navigateur Internet non activ\u00e9e
pscanrules.headerxssprotectionscanner.desc=La protection XSS du navigateur Internet n'est pas activ\u00e9e, ou est d\u00e9sactiv\u00e9e par la configuration de l'en-t\u00eate de r\u00e9ponse HTTP 'X-XSS-Protection' sur le serveur web
pscanrules.headerxssprotectionscanner.refs=https\://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet\nhttps\://blog.veracode.com/2014/03/guidelines-for-setting-security-headers/
pscanrules.headerxssprotectionscanner.extrainfo=L'en-t\u00eate de r\u00e9ponse HTTP X-XSS-Protection autorise le serveur internet \u00e0 activer ou d\u00e9sactiver le m\u00e9canisme de protection XSS du navigateur internet. Les valeurs suivantes tenteraient d'activer la protection\:\nX-XSS-Protection\: 1; mode \= block\nX-XSS-Protection\: 1; report \= http\://www.example.com/xss\nLes valeurs suivantes d\u00e9sactiveraient cette protection\:\nX-XSS-Protection\: 0\nL'en-t\u00eate de r\u00e9ponse HTTP X-XSS-Protection est actuellement support\u00e9e par Internet Explorer, Chrome et Safari (WebKit). \nNotez que cette alerte n'est d\u00e9clench\u00e9e que si le corps de r\u00e9ponse pouvaient contenir une charge utile XSS (avec un type de contenu texte, d'une longueur diff\u00e9rente de z\u00e9ro).
pscanrules.headerxssprotectionscanner.soln=Assurez-vous que le filtre XSS du navigateur internet est activ\u00e9, en renseignant l'en-t\u00eate de r\u00e9ponse HTTP X-XSS-Protection \u00e0 '1'.

pscanrules.xframeoptionsscanner.name=En-t\u00eate X-Frame-Options pas renseign\u00e9
pscanrules.xframeoptionsscanner.incInCsp=La Content-Security-Policy comprend un \u00e9l\u00e9ment \u00ab\u00a0frame-ancestors\u00a0\u00bb ayant priorit\u00e9 sur l\u2019en-t\u00eate X-Frame-Options, ce qui explique cette alerte avec un risque FAIBLE.  
pscanrules.xframeoptionsscanner.missing.name=En-t\u00eate X-Frame-Options non renseign\u00e9
pscanrules.xframeoptionsscanner.missing.desc=L'en-t\u00eate X-Frame-Options n'est pas incluse dans la r\u00e9ponse HTTP pour prot\u00e9ger contre les attaques de 'ClickJacking'.
pscanrules.xframeoptionsscanner.missing.refs=http\://blogs.msdn.com/b/ieinternals/archive/2010/03/30/combating-clickjacking-with-x-frame-options.aspx
pscanrules.xframeoptionsscanner.missing.soln=La plupart des navigateurs internet modernes supportent l'en-t\u00eate HTTP X-Frame-Options. Assurez-vous que celle-ci est renseign\u00e9e sur toutes les pages internet retourn\u00e9es par votre site (si cette page ne doit \u00eatre encadr\u00e9e que par des pages de votre serveur (p.ex. fait partie d'un FRAMESET), alors utilisez la valeur SAMEORIGIN, sinon choisissez la valeur DENY quand la page n'est jamais encadr\u00e9e. ALLOW-FROM permet \u00e0 des sites sp\u00e9cifiques d'encadrer la page, pour autant que le navigateur le supporte).
pscanrules.xframeoptionsscanner.multiple.header.name=Entr\u00e9es d\u2019en-t\u00eate X-Frame-Options multiples
pscanrules.xframeoptionsscanner.multiple.header.desc=Des en-t\u00eates X-Frame-Options (XFO) ont \u00e9t\u00e9 retrouv\u00e9s, une r\u00e9ponse avec plusieurs entr\u00e9es d\u2019en-t\u00eate XFO ne peut pas \u00eatre trait\u00e9e comme pr\u00e9vu par tous les user-agents.
pscanrules.xframeoptionsscanner.multiple.header.refs=https\://tools.ietf.org/html/rfc7034
pscanrules.xframeoptionsscanner.multiple.header.soln=Faire en sorte que seulement un seul en-t\u00eate X-Frame-Options soit pr\u00e9sent dans la r\u00e9ponse.
pscanrules.xframeoptionsscanner.compliance.meta.name=X-Frame-Options d\u00e9finis via META (Non conforme \u00e0 la sp\u00e9cification)
pscanrules.xframeoptionsscanner.compliance.meta.desc=Une balise META X-Frame-Options (XFO) a \u00e9t\u00e9 trouv\u00e9e, d\u00e9finir XFO via une balise META est explicitement non pris en charge par les sp\u00e9cifications (RFC 7034).
pscanrules.xframeoptionsscanner.compliance.meta.refs=https\://tools.ietf.org/html/rfc7034\#section-4
pscanrules.xframeoptionsscanner.compliance.meta.soln=S\u2019assurer que X-Frame-Options sont d\u00e9finis via un champ d\u2019en-t\u00eate de r\u00e9ponse.
pscanrules.xframeoptionsscanner.compliance.malformed.setting.name=Mauvaise configuration X-Frame-Options
pscanrules.xframeoptionsscanner.compliance.malformed.setting.desc=Un en-t\u00eate X-Frame-Options \u00e9tait pr\u00e9sent dans la r\u00e9ponse, mais la valeur n\u2019\u00e9tait pas correctement d\u00e9finie.
pscanrules.xframeoptionsscanner.compliance.malformed.setting.refs=https\://tools.ietf.org/html/rfc7034\#section-2.1
pscanrules.xframeoptionsscanner.compliance.malformed.setting.soln=Assurez-vous de la bonne configuration des en-t\u00eates HTTP X-Frame-Options sur toutes les pages internet retourn\u00e9es par votre site (si cette page ne doit \u00eatre encadr\u00e9e que par des pages de votre serveur (p.ex. fait partie d'un FRAMESET), alors utilisez la valeur SAMEORIGIN, sinon choisissez la valeur DENY quand la page n'est jamais encadr\u00e9e. ALLOW-FROM permet \u00e0 des sites sp\u00e9cifiques d'encadrer la page, pour autant que le navigateur le supporte).

pscanrules.xcontenttypeoptionsscanner.name=En-t\u00eate X-Content-Type-Options manquant
pscanrules.xcontenttypeoptionsscanner.desc=L'en-t\u00eate X-Content-Type-Options contre le sniffing MIME n'est pas renseign\u00e9 \u00e0 'nosniff'. Ceci permet \u00e0 de vielles versions d'Internet Explorer et de Chrome de pratiquer le sniffing MIME sur le corps de r\u00e9ponse, conduisant potentiellement \u00e0 l'interpr\u00e9tation et l'affichage du contenu dans un autre type que celui d\u00e9clar\u00e9. A l'heure actuelle (d\u00e9but 2014), les anciennes versions de Firefox utiliseront le type de contenu d\u00e9clar\u00e9 (au cas o\u00f9 un type est d\u00e9termin\u00e9), plut\u00f4t qu'analyser le MIME.
pscanrules.xcontenttypeoptionsscanner.otherinfo=Ce probl\u00e8me s'applique toujours aux pages de type erreur (401, 403, 500, etc.), car ces pages sont encore souvent touch\u00e9es par des probl\u00e8mes d'injection, auquel cas il est encore possible que les navigateurs interpr\u00e9tent des pages autrement que selon leur type de contenu r\u00e9el.
pscanrules.xcontenttypeoptionsscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers
pscanrules.xcontenttypeoptionsscanner.soln=Assurez-vous que l'application ou le serveur internet renseigne l'en-t\u00eate Content-Type correctement, et que l'en-t\u00eate X-Content-Type-Options prenne la valeur 'nosniff' pour toutes les pages internet.\nSi possible, assurez-vous que l'utilisateur utilise un navigateur moderne et conforme aux standards, qui ne pratique pas du tout le sniffing MIME, ou qui puisse \u00eatre command\u00e9 par l'application ou le serveur internet de mani\u00e8re \u00e0 ne pas pratiquer le sniffing MIME.

pscanrules.applicationerrorscanner.name=Divulgation par erreur dans l'application
pscanrules.applicationerrorscanner.desc=Cette page contient un message d\u2019erreur/avertissement qui peut divulguer des informations sensibles, comme l\u2019emplacement du fichier qui a produit l\u2019exception non g\u00e9r\u00e9e. Cette information peut servir \u00e0 lancer d'autres attaques contre l\u2019application web. L\u2019alerte pourrait \u00eatre un faux positif si le message d\u2019erreur se trouve \u00e0 l\u2019int\u00e9rieur d\u2019une page de documentation.
pscanrules.applicationerrorscanner.soln=Examinez le code source de cette page. Mettez en place des pages d\u2019erreur personnalis\u00e9es. Envisagez d\u2019impl\u00e9menter un m\u00e9canisme fournissant une r\u00e9f\u00e9rence/identificateur unique de l'erreur au client (navigateur), tout en journalisant les d\u00e9tails du c\u00f4t\u00e9 serveur, les cachant ainsi \u00e0 l\u2019utilisateur.

pscanrules.cachecontrolscanner.name=En-t\u00eates HTTP Pragma et Cache-control incomplets ou absents
pscanrules.cachecontrolscanner.desc=Les en-t\u00eates HTTP cache-control et pragma n\u2019ont pas \u00e9t\u00e9 d\u00e9finis correctement ou manquent, permettant au navigateur et aux proxys de mettre en cache le contenu.
pscanrules.cachecontrolscanner.soln=Chaque fois que possible, assurez-vous que l'en-t\u00eate HTTP cache-control est renseign\u00e9e \u00e0 no-cache, no-store, must-revalidate, private; et que l\u2019en-t\u00eate pragma HTTP est renseign\u00e9e \u00e0 no-cache.
pscanrules.cachecontrolscanner.refs=https\://www.owasp.org/index.php/Session_Management_Cheat_Sheet\#Web_Content_Caching

pscanrules.contenttypemissingscanner.name=En-t\u00eate Content-Type manquant
pscanrules.contenttypemissingscanner.name.empty=En-t\u00eate Content-Type vide
pscanrules.contenttypemissingscanner.desc=L\u2019en-t\u00eate Content-Type est manquant ou vide.
pscanrules.contenttypemissingscanner.soln=S\u2019assurer que chaque page d\u00e9finit la valeur du Content-Type sp\u00e9cifique et appropri\u00e9e pour le contenu d\u00e9livr\u00e9.
pscanrules.contenttypemissingscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx

pscanrules.cookiehttponlyscanner.name=Cookie No HttpOnly Flag
pscanrules.cookiehttponlyscanner.desc=Un cookie a \u00e9t\u00e9 d\u00e9fini sans le flag HttpOnly, ce qui signifie que le cookie peut \u00eatre accessible via JavaScript. Si un script malveillant peut \u00eatre ex\u00e9cut\u00e9 sur cette page, alors le cookie sera accessible et pourra \u00eatre transmis \u00e0 un autre site. Si il s\u2019agit d\u2019un cookie de session, alors le d\u00e9tournement de session pourra \u00eatre possible.
pscanrules.cookiehttponlyscanner.soln=Veiller que le flag HttpOnly soit d\u00e9fini pour tous les cookies.
pscanrules.cookiehttponlyscanner.refs=http\://www.owasp.org/index.php/HttpOnly

pscanrules.cookiesecureflagscanner.name=Cookie sans indicateur s\u00fbr
pscanrules.cookiesecureflagscanner.desc=Un cookie a \u00e9t\u00e9 d\u00e9fini sans le flag s\u00e9curis\u00e9, ce qui signifie que le cookie est accessible via des connexions non chiffr\u00e9es.
pscanrules.cookiesecureflagscanner.soln=Chaque fois qu\u2019un cookie contient des informations sensibles ou est un jeton de session, il doit toujours \u00eatre pass\u00e9 \u00e0 l\u2019aide d\u2019un canal chiffr\u00e9. Veiller \u00e0 ce que l\u2019indicateur s\u00e9curis\u00e9 (secure flag) soit d\u00e9fini pour les cookies contenant des informations sensibles.
pscanrules.cookiesecureflagscanner.refs=http\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OWASP-SM-002)

pscanrules.crossdomainscriptinclusionscanner.name=Inclusion de fichier source JavaScript inter-domaine
pscanrules.crossdomainscriptinclusionscanner.desc=La page inclut un ou plusieurs fichiers de script d\u2019un autre domaine.
pscanrules.crossdomainscriptinclusionscanner.soln=S\u2019assurer que les fichiers source JavaScript soient charg\u00e9s uniquement \u00e0 partir de sources fiables, et que les sources ne peuvent \u00eatre contr\u00f4l\u00e9s par les utilisateurs de l\u2019application.

pscanrules.mixedcontentscanner.name=Pages s\u00e9curis\u00e9es incluent un contenu mixte
pscanrules.mixedcontentscanner.name.inclscripts=Pages s\u00e9curis\u00e9es incluant un contenu mixte (y compris les Scripts)
pscanrules.mixedcontentscanner.desc=La page inclut du contenu mixte, qui est contenu accessible via HTTP au lieu de HTTPS.
pscanrules.mixedcontentscanner.soln=Une page qui est disponible par SSL/TLS doit \u00eatre compos\u00e9e enti\u00e8rement de contenu transmis via SSL/TLS.\nLa page ne doit contenir aucun contenu transmis via HTTP non crypt\u00e9.\nCela inclut le contenu des sites tiers.
pscanrules.mixedcontentscanner.refs=https\://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet

pscanrules.passwordautocompletescanner.name=Saisie semi-automatique du mot de passe dans le navigateur
pscanrules.passwordautocompletescanner.desc=L\u2019attribut AUTOCOMPLETE n'est pas d\u00e9sactiv\u00e9 sur un \u00e9l\u00e9ment HTML de type FORM/INPUT contenant une entr\u00e9e de type de mot de passe.  Les mots de passe peuvent donc \u00eatre stock\u00e9s dans les navigateurs et r\u00e9cup\u00e9r\u00e9s.
pscanrules.passwordautocompletescanner.soln=D\u00e9sactiver l\u2019attribut AUTOCOMPLETE dans les FORMs ou les INPUTs contenant des entr\u00e9es de mot de passe en utilisant AUTOCOMPLETE\='OFF'.
pscanrules.passwordautocompletescanner.refs=http\://www.w3schools.com/tags/att_input_autocomplete.asp\nhttps\://msdn.microsoft.com/en-us/library/ms533486%28v\=vs.85%29.aspx

pscanrules.testinfoprivateaddressdisclosure.name=Divulgation d'IP priv\u00e9
pscanrules.testinfoprivateaddressdisclosure.desc=Une adresse IP priv\u00e9e comme 10.x.x.x, 172.x.x.x, 192.168.x.x a \u00e9t\u00e9 trouv\u00e9e dans le corps de la r\u00e9ponse HTTP. Cette information pourrait \u00eatre utile pour d'autres attaques ciblant les syst\u00e8mes internes.
pscanrules.testinfoprivateaddressdisclosure.soln=Supprimez l\u2019adresse IP priv\u00e9e du corps de r\u00e9ponse HTTP. Pour des commentaires, utilisez un commentaire JSP/ASP au lieu d'un commentaire HTML/JavaScript, qui peut \u00eatre vu par les navigateurs clients.
pscanrules.testinfoprivateaddressdisclosure.refs=https\://tools.ietf.org/html/rfc1918

pscanrules.testinfosessionidurl.name=ID de session dans la r\u00e9\u00e9criture d\u2019URL
pscanrules.testinfosessionidurl.desc=La r\u00e9\u00e9criture d'URL est utilis\u00e9e pour tracer les ID de session utilisateur. L\u2019ID de session peut \u00eatre diffus\u00e9 via l\u2019en-t\u00eate referer multisite. En outre, l'ID de session pourrait \u00eatre stock\u00e9 dans l\u2019historique du navigateur ou les journaux serveur.
pscanrules.testinfosessionidurl.soln=Pour s\u00e9curiser des contenus, mettez l\u2019ID de session dans un cookie. Pour \u00eatre encore plus s\u00fbr, envisagez la combinaison d'un cookie et de la r\u00e9\u00e9criture d\u2019URL.
pscanrules.testinfosessionidurl.refs=http\://seclists.org/lists/webappsec/2002/Oct-Dec/0111.html
pscanrules.testinfosessionidurl.referrer.alert=Le referer expose l'ID de session
pscanrules.testinfosessionidurl.referrer.desc=Un lien hypertexte pointant vers le nom d\u2019h\u00f4te a \u00e9t\u00e9 trouv\u00e9. Comme la r\u00e9\u00e9criture d\u2019URL avec l\u2019ID de session est utilis\u00e9e, il peut \u00eatre divulgu\u00e9e dans un en-t\u00eate referer aux h\u00f4tes externes.
pscanrules.testinfosessionidurl.referrer.soln=Il s\u2019agit d\u2019un risque si l\u2019ID de session est sensible et que le lien hypertexte renvoie \u00e0 un h\u00f4te externe ou tiers. Pour s\u00e9curiser des contenus, mettre l'ID de session dans le cookie de session s\u00e9curis\u00e9.

