# Strings used by the add-on
tips.button.allTips = Todos los consejos
tips.button.nextTip = Pr\u00f3ximo Consejo
tips.desc = Consejos y trucos
tips.dialog.title = Consejos y trucos

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = Instale las reglas de escaneo activo y pasivo beta para encontrar m\u00e1s problemas potenciales.\nTambi\u00e9n existen reglas de escaneo alfa activo y pasivo, pero pueden ser menos estables.
tips.tip.add.002 = \u00bfQuiere programar ZAP en un lenguaje de programaci\u00f3n que no sea Java Script y Zest?\nConsulte ZAP Marketplace para conocer otros idiomas como Python y Ruby.\nSi su lenguaje de secuencias de comandos preferido a\u00fan no est\u00e1 disponible, p\u00f3ngase en contacto; es bastante f\u00e1cil agregar soporte para otros idiomas.
tips.tip.add.003 = Instale el SAML Add-on desde la Tienda de ZAP para detectar, mostrar, editar y esconder pedidos SAML.
tips.tip.add.004 = Hay un gran n\u00famero de archivos \u201cfuzzy\u201d disponibles en la tienda de ZAP, en los apartados 'Lista de Directorio*\u2019, 'Archivos Fuzzdb\u2019 y 'Archivos SVN Digger'.
tips.tip.add.005 = Hay un repositorio de scripts ZAP en https\://github.com/zaproxy/community-scripts\nSi clona una copia local, puede agregarlas todas a ZAP a trav\u00e9s del panel de opciones de scripts.\nTambi\u00e9n puedes cargar tus propios scripts mediante pull requests\: \u00a1cuantos m\u00e1s, mejor\!
tips.tip.add.007 = Instala el complemento de secuencia desde el Mercado de ZAP para escanear p\u00e1ginas que se deben visitar en un orden espec\u00edfico para que se pueda acceder a su funcionalidad completa.
tips.tip.add.008 = Instala el complemento accessControl desde el Mercado de ZAP para automatizar las pruebas del control de acceso de su aplicaci\u00f3n.
tips.tip.add.009 = Puedes importar direcciones URL contenidas en un archivo de texto usando el complemento importurls disponible en el Mercado de ZAP


# Automation tips
tips.tip.aut.001 = ZAP es excelente para la automatizaci\u00f3n, pero es m\u00e1s f\u00e1cil probar primero las funciones en la interfaz de usuario del escritorio y luego convertirlas a un script.
tips.tip.aut.002 = ZAP tiene una potente API que cubre casi todas las funciones disponibles en la interfaz de usuario de escritorio.
tips.tip.aut.003 = De manera predeterminada, no puede conectarse a ZAP en otra m\u00e1quina, deber\u00e1 cambiar las configuraciones para permitir conexiones remotas.

# General tips
tips.tip.gen.001 = Guarde su sesi\u00f3n ZAP al comienzo en lugar de al final - la sesi\u00f3n es almacenada en un db que ser\u00e1 actualizado todo el tiempo, con lo cual no tendr\u00e1 que guardarla otra vez.
tips.tip.gen.002 = Intente diferentes configuraciones de UI a trav\u00e9s de los botones en la barra principal de herramientas.
tips.tip.gen.003 = Haz clic derecho en todas partes.\nResalta el texto y haz clic derecho sobre \u00e9l.\nGran parte de la funcionalidad ZAP depende del contexto y se accede mejor de esta manera.
tips.tip.gen.004 = Use los atajos del teclado para acelerar sus pruebas - puede definir sus propias combinaciones con 'Opciones/Teclado\u2019, que tambi\u00e9n le permite generar una versi\u00f3n imprimible del listado de atajos.
tips.tip.gen.005 = Si est\u00e1s obteniendo demasiados falsos positivos, intenta cambiar el umbral de esa regla de an\u00e1lisis a Alto.\nPero tambi\u00e9n puedes informarnos del problema a trav\u00e9s del Grupo de usuarios de ZAP  para que podamos investigarlo; est\u00e1n vinculados desde el men\u00fa "En l\u00ednea".
tips.tip.gen.007 = Agregue su aplicaci\u00f3n de destino a un contexto usando el men\u00fa de "clic derecho"\: "Incluir en contexto".\nEsto le permite decirle a ZAP m\u00e1s sobre el objetivo, como la autenticaci\u00f3n, los usuarios y la tecnolog\u00eda que utiliza.
tips.tip.gen.008 = ZAP puede mostrar, interceptar e incluso borrar mensajes del lado del cliente, incluidos postMessages\: haga clic con el bot\u00f3n derecho en un sub\u00e1rbol en el \u00e1rbol de Sitios y seleccione un submen\u00fa adecuado en "Monitorear clientes".\nFuerce una actualizaci\u00f3n del navegador y sus p\u00e1ginas abiertas se mostrar\u00e1n en la pesta\u00f1a 'Clientes' junto con todos los mensajes del lado del cliente que generen.
tips.tip.gen.009 = Los scripts de Zest son una excelente manera de automatizar tareas.\nZest es el lenguaje de macros gr\u00e1fico de ZAP, pero proporciona funciones de programaci\u00f3n como condicionales y bucles.\nUtilice el bot\u00f3n 'Grabar un nuevo script Zest...' en la barra de herramientas principal para grabar r\u00e1pidamente un nuevo script Zest.\nTambi\u00e9n puede hacer clic derecho en las solicitudes para agregarlas a los scripts de Zest.
tips.tip.gen.010 = ZAP puede buscar actualizaciones autom\u00e1ticamente; act\u00edvelo a trav\u00e9s de la pantalla 'Opciones/Buscar actualizaciones'.\nSi no desea que esto suceda autom\u00e1ticamente, aseg\u00farese de buscar actualizaciones manualmente con frecuencia a trav\u00e9s del bot\u00f3n principal de la barra de herramientas "Administrar complementos", ya que continuamente agregamos nuevas funciones y solucionamos problemas.
tips.tip.gen.011 = Haga click en el bot\u00f3n \u201cEquipo\u201d en la parte derecha de varias pesta\u00f1as para acceder r\u00e1pidamente la configuraci\u00f3n de esa secci\u00f3n. 
tips.tip.gen.012 = Hay muchos recursos enlazados al men\u00fa 'Online\u2019, incluyendo la p\u00e1gina principal de ZAP, grupos de Usuarios y Desarrolladores
tips.tip.gen.013 = \u00bfQuieres charlar con alguien sobre ZAP?\nMuchos de los desarrolladores principales de ZAP pasan el rato en el canal irc Libera Chat \#zaproxy\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP tiene p\u00e1ginas de ayuda completas a las que se puede acceder a trav\u00e9s del men\u00fa 'Ayuda/Gu\u00eda del usuario de ZAP'.\nLa tecla F1 tambi\u00e9n abrir\u00e1 las p\u00e1ginas de ayuda y lo llevar\u00e1 directamente a la secci\u00f3n correspondiente a la pesta\u00f1a seleccionada.
tips.tip.gen.015 = \u00bfNuevo en ZAP?\nLea la gu\u00eda "Introducci\u00f3n a ZAP" accesible a trav\u00e9s del men\u00fa "Ayuda".
tips.tip.gen.016 = La mayor\u00eda de las pesta\u00f1as de ZAP ahora est\u00e1n ocultas de forma predeterminada para que la interfaz de usuario est\u00e9 menos abarrotada.\nPuede mostrar y ocultar todas las pesta\u00f1as mediante los botones de la barra de herramientas principal.\nTambi\u00e9n puedes "fijar" cualquier pesta\u00f1a que desees para que permanezca visible incluso despu\u00e9s de reiniciar.
tips.tip.gen.017 = Puede reordenar las columnas de la tabla arrastr\u00e1ndolas y solt\u00e1ndolas.\nTambi\u00e9n puede seleccionar qu\u00e9 columnas se muestran mediante el icono justo encima de la barra de desplazamiento en el lado derecho de cada tabla.
tips.tip.gen.018 = Marcas de exploraci\u00f3n manual\: las p\u00e1ginas encontradas por los spider o por la exploraci\u00f3n forzada agregar\u00e1n un icono en el \u00e1rbol de sitios. Este icono desaparecer\u00e1 cuando visites esas p\u00e1ginas de manera manual.
tips.tip.gen.019 = Puedes iniciar navegadores que usen de manera autom\u00e1tica el proxy a trav\u00e9s de ZAP y que no necesiten tener el certificado de ZAP agregado, a trav\u00e9s del bot\u00f3n 'Exploraci\u00f3n manual'.
tips.tip.gen.020 = La p\u00e1gina de opciones de Reemplazo le permite reemplazar r\u00e1pida y f\u00e1cilmente el texto en cualquier parte de un mensaje HTTP(S).

# HUD tips
tips.tip.hud.001 = El Heads Up Display (HUD) trae toda la funcionalidad clave de ZAP a su navegador.
tips.tip.hud.002 = Completa el tutorial del (HUD) Heads Up Display\: Ense\u00f1a todas las funciones de HUD.
tips.tip.hud.003 = El HUD se actualiza constantemente\: comparta comentarios, solicita funciones y plantee problemas a trav\u00e9s de https\://github.com/zaproxy/zap-hud

# Obscure features
tips.tip.obs.001 = Las solicitudes POST tienen un men\u00fa de 'clic derecho' para generar un formulario de prueba anti CSRF.
tips.tip.obs.002 = El bot\u00f3n 'bombilla' de los campos 'Mostrar/Habilitar\u2019 de la barra de herramientas principal har\u00e1 visibles los campos escondidos y le permitir\u00e1 editar los campos deshabilitados.
tips.tip.obs.003 = \u00bfSu aplicaci\u00f3n utiliza tokens anti CSRF?\nAseg\u00farese de haber configurado ZAP para manejarlos a trav\u00e9s de la pantalla 'Opciones/Escaneo activo'.
tips.tip.obs.004 = Puede comparar dos pedidos o respuestas seleccionando ambos, 'click derecho\u2019 y seleccionando uno de los \u00edtems del men\u00fa 'Comparar 2...'.
tips.tip.obs.005 = Puede indicarle a ZAP que acceda a una aplicaci\u00f3n utilizando un usuario espec\u00edfico.\nPara hacer eso, necesita agregar su aplicaci\u00f3n a un Contexto y luego definir la autenticaci\u00f3n y los detalles del usuario.
tips.tip.obs.006 = La pesta\u00f1a B\u00fasqueda le permite encontrar cuerdas en resultados Fuzz - soporta expresiones regex y emparejamiento inverso.
tips.tip.obs.007 = Puede buscar texto en cualquier \u00e1rea de texto incluyendo las pesta\u00f1as Pedido y Respuesta, usando el men\u00fa de \u2018click derecho' \u2018Encontrar\u2026\u2019.  
tips.tip.obs.008 = Puede cambiar el sombreado de sintaxis usado para las pesta\u00f1as Pedido, Respuesta y Consola de Secuencia a trav\u00e9s de los men\u00faes \u2018Syntax\u2019 haciendo 'click derecho'.
tips.tip.obs.009 = Puedes indicarle a ZAP que cargue todos los scripts en un conjunto de directorios a trav\u00e9s de la p\u00e1gina Opci\u00f3n de scripts.\nConsulta la ayuda para obtener detalles sobre la estructura del directorio.
tips.tip.obs.010 = Puede exportar todas las URLs grabadas por ZAP usando el men\u00fa de nivel superior\: \u201cReportar / Exportar todas las URLs a un Archivo\u2026\u201d
tips.tip.obs.011 = Puedes invocar herramientas de terceros como sqlmap y nmap desde ZAP, transmitiendo una amplia gama de informaci\u00f3n contextual.\nSimplemente, configura las aplicaciones que deses invocar en la pantalla "Opciones/Aplicaciones".
tips.tip.obs.012 = Soporte para Docker - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = Consejos y trucos
