# Strings used by the add-on
tips.button.allTips = \u6240\u6709\u63d0\u793a
tips.button.nextTip = \u4e0b\u4e00\u4e2a\u63d0\u793a
tips.desc = \u63d0\u793a\u548c\u6280\u5de7
tips.dialog.title = \u63d0\u793a\u548c\u6280\u5de7

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = Install the beta active and passive scan rules to find more potential issues.\nThere are also alpha active and passive scan rules but obviously they may be less stable.
tips.tip.add.002 = Want to script ZAP in a scripting language other than Java Script and Zest?\nCheck the ZAP Marketplace for other languages like python and ruby.\nIf your preferred scripting language isnt yet available then get in touch - its fairly easy to add support for other languages.
tips.tip.add.003 = \u4ece ZAP \u5e02\u573a\u5b89\u88c5 SAML \u9644\u52a0\u7ec4\u4ef6\u4ee5\u68c0\u6d4b\u3001\u663e\u793a\u3001\u7f16\u8f91\u548c\u6a21\u7cca\u6d4b\u8bd5 SAML \u8bf7\u6c42\u3002
tips.tip.add.004 = ZAP \u5e02\u573a\u7684\u201c\u76ee\u5f55\u5217\u8868 *\u201d\u3001\u201cFuzzdb \u6587\u4ef6\u201d\u548c\u201cSVN Digger \u6587\u4ef6\u201d\u9644\u52a0\u7ec4\u4ef6\u4e2d\u63d0\u4f9b\u4e86\u5927\u91cf\u6a21\u7cca\u6d4b\u8bd5\u6587\u4ef6\u3002
tips.tip.add.005 = There is a repository of ZAP scripts at https\://github.com/zaproxy/community-scripts\nIf you clone a local copy then you can add all of them to ZAP via the Scripts Option pane.\nYou can also upload your own scripts via pull requests - the more the better\! 
tips.tip.add.007 = \u4eceZAP\u5e02\u573a\u5b89\u88c5Sequence\u9644\u52a0\u7ec4\u4ef6\uff0c\u7528\u5b83\u6765\u626b\u63cf\u5fc5\u987b\u6309\u7279\u5b9a\u987a\u5e8f\u8bbf\u95ee\u7684\u9875\u9762\uff0c\u4ee5\u83b7\u5f97\u5168\u90e8\u529f\u80fd\u3002
tips.tip.add.008 = \u4ece ZAP \u5e02\u573a\u5b89\u88c5 accessControl \u9644\u52a0\u7ec4\u4ef6\u4ee5\u81ea\u52a8\u6d4b\u8bd5\u5e94\u7528\u7a0b\u5e8f\u7684\u8bbf\u95ee\u63a7\u5236\u3002
tips.tip.add.009 = \u60a8\u53ef\u4ee5\u4f7f\u7528 ZAP \u5e02\u573a\u4e0a\u63d0\u4f9b\u7684 importurls \u9644\u52a0\u7ec4\u4ef6\u5bfc\u5165\u5305\u542b\u5728\u6587\u672c\u6587\u4ef6\u4e2d\u7684 URL


# Automation tips
tips.tip.aut.001 = ZAP \u975e\u5e38\u9002\u5408\u81ea\u52a8\u5316\uff0c\u4f46\u5b83\u66f4\u5bb9\u6613\u5148\u5728\u684c\u9762 UI \u4e2d\u6d4b\u8bd5\u529f\u80fd\uff0c\u7136\u540e\u5c06\u5b83\u4eec\u8f6c\u6362\u4e3a\u811a\u672c\u3002
tips.tip.aut.002 = ZAP \u6709\u4e00\u4e2a\u5f3a\u5927\u7684 API\uff0c\u6db5\u76d6\u4e86\u684c\u9762 UI \u4e2d\u51e0\u4e4e\u6240\u6709\u53ef\u7528\u7684\u529f\u80fd\u3002
tips.tip.aut.003 = \u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff0c\u60a8\u65e0\u6cd5\u8fde\u63a5\u5230\u53e6\u4e00\u53f0\u673a\u5668\u4e0a\u7684 ZAP\uff0c\u60a8\u9700\u8981\u66f4\u6539\u914d\u7f6e\u4ee5\u5141\u8bb8\u8fdc\u7a0b\u8fde\u63a5\u3002

# General tips
tips.tip.gen.001 = \u5728\u5f00\u59cb\u6d4b\u8bd5\u65f6\u4fdd\u5b58\u60a8\u7684ZAP\u4f1a\u8bdd\uff0c\u800c\u4e0d\u662f\u5728\u7ed3\u675f\u65f6-\u4f1a\u8bdd\u4f1a\u50a8\u5b58\u5728\u6570\u636e\u5e93\u4e2d\uff0c\u5b83\u5c06\u4efb\u4f55\u65f6\u95f4\u90fd\u5c06\u66f4\u65b0\uff0c\u56e0\u6b64\u60a8\u4e0d\u5fc5\u518d\u4fdd\u5b58\u5b83
tips.tip.gen.002 = \u901a\u8fc7\u4e3b\u5de5\u5177\u680f\u4e0a\u7684\u6309\u94ae\u5c1d\u8bd5\u4e0d\u540c\u7684UI\u5e03\u5c40
tips.tip.gen.003 = Right click everywhere.\nHighlight text and right click it.\nA lot of ZAP functionality is context sensitive as best accessed this way.
tips.tip.gen.004 = \u4f7f\u7528\u952e\u76d8\u5feb\u6377\u952e\u52a0\u901f\u60a8\u7684\u6d4b\u8bd5\u901f\u5ea6-\u60a8\u53ef\u4ee5\u901a\u8fc7"\u9009\u9879/\u952e\u76d8"\u5b9a\u4e49\u60a8\u81ea\u5df1\u7684\u7ec4\u5408\uff0c\u8fd9\u4f1a\u751f\u6210\u53ef\u6253\u5370\u7684\u5feb\u6377\u5217\u8868\u3002
tips.tip.gen.005 = If you are getting too many false positives try changing the threshold for that scan rule to High.\nBut also report the problem to us via the ZAP Users Group or Issues so we can investigate it - both of which are linked off the 'Online' menu
tips.tip.gen.007 = Add your target application to a Context using the 'right click' menu\: 'Include in Context'.\nThis allows you tell ZAP more about the target, such as the authentication, the users and the technology it uses.
tips.tip.gen.008 = ZAP can display, intercept and even fuzz client side messages including postMessages - 'right click' a subtree in the Sites tree and select a suitable submenu under 'Monitor clients'.\nForce a browser refresh and your open pages will be displayed in the 'Clients' tab along with all of the client side messages they generate.
tips.tip.gen.009 = Zest scripts are a great way to automate tasks.\nZest is ZAP's graphical macro language, but provides programming features like conditionals and loops.\nUse the 'Record a new Zest script...' button on the main toolbar to quickly record a new Zest script.\nYou can also 'right click' requests to add them to Zest scripts.
tips.tip.gen.010 = ZAP can automatically check for updates - turn it on via the 'Options / Check for Updates' screen.\nIf you dont want it to happen automatically then make sure you manually check for updates frequently via the 'Manage Add-ons' main toolbar button as we continually add new features and fix issues.
tips.tip.gen.011 = \u5355\u51fb\u8bb8\u591a\u9009\u9879\u5361\u53f3\u4fa7\u7684\u201c\u9f7f\u8f6e\u201d\u56fe\u6807\u53ef\u5feb\u901f\u8bbf\u95ee\u8be5\u529f\u80fd\u7684\u8bbe\u7f6e\u3002
tips.tip.gen.012 = \u6709\u5927\u91cf\u7684\u8d44\u6e90\u94fe\u63a5\u5230\u5728\u7ebf\u83dc\u5355\uff0c\u5305\u62ecZAP\u4e3b\u9875\uff0c\u7528\u6237\u7ec4\u548c\u5f00\u53d1\u7ec4\u3002
tips.tip.gen.013 = Want to chat to someone about ZAP?\nMany of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP has comprehensive help pages accessible via the 'Help / ZAP User Guide' menu.\nThe F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.015 = New to ZAP?\nRead the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = The majority of ZAP's tabs are now hidden by default so that the UI is less cluttered.\nYou can show and hide all of the tabs via buttons on the main toolbar.\nYou can also 'pin' any tab you like so that it stays visible even after a restart.
tips.tip.gen.017 = You can reorder table columns by dragging and dropping them.\nYou can also select which columns are show via the icon just above the scroll bar on the right hand side of each table.
tips.tip.gen.018 = \u624b\u52a8\u6d4f\u89c8\u6307\u793a\u5668 - Spider\u722c\u866b\u548c\u5f3a\u5236\u6d4f\u89c8\u5668\u627e\u5230\u7684\u9875\u9762\u5728\u7ad9\u70b9\u6811\u4e2d\u7528\u76f8\u5173\u56fe\u6807\u6807\u8bb0\u3002 \u5f53\u60a8\u624b\u52a8\u8bbf\u95ee\u8be5\u9875\u9762\u65f6\uff0c\u8be5\u56fe\u6807\u4f1a\u6d88\u5931\u3002
tips.tip.gen.019 = \u60a8\u53ef\u4ee5\u542f\u52a8\u901a\u8fc7 ZAP \u81ea\u52a8\u4ee3\u7406\u7684\u6d4f\u89c8\u5668\uff0c\u4e0d\u9700\u8981\u901a\u8fc7\u201c\u624b\u52a8\u6d4f\u89c8\u201d\u6309\u94ae\u6dfb\u52a0 ZAP \u8bc1\u4e66\u3002
tips.tip.gen.020 = \u66ff\u6362\u5668\uff08Replacer\uff09 \u9009\u9879\u9875\u9762\u5141\u8bb8\u60a8\u5feb\u901f\u8f7b\u677e\u5730\u66ff\u6362 HTTP(S) \u6d88\u606f\u4e2d\u4efb\u4f55\u4f4d\u7f6e\u7684\u6587\u672c\u3002

# HUD tips
tips.tip.hud.001 = \u5e73\u89c6\u663e\u793a\u5668\uff08HUD\uff09\u5c06\u6240\u6709\u5173\u952e\u7684 ZAP \u529f\u80fd\u5e26\u5165\u60a8\u7684\u6d4f\u89c8\u5668\u3002
tips.tip.hud.002 = \u5b8c\u6210\u5e73\u89c6\u663e\u793a\u5668\u6559\u7a0b - \u5b83\u6db5\u76d6\u4e86 HUD \u7684\u6240\u6709\u529f\u80fd\u3002
tips.tip.hud.003 = HUD \u4e0d\u65ad\u66f4\u65b0 - \u901a\u8fc7 https\://github.com/zaproxy/zap-hud \u5206\u4eab\u53cd\u9988\u3001\u529f\u80fd\u8bf7\u6c42\u548c\u63d0\u51fa\u95ee\u9898

# Obscure features
tips.tip.obs.001 = POST \u8bf7\u6c42\u6709\u4e00\u4e2a\u201c\u53f3\u952e\u5355\u51fb\u201d\u83dc\u5355\uff0c\u7528\u4e8e\u751f\u6210 \u9632-CSRF \u6d4b\u8bd5\u8868\u5355\u3002
tips.tip.obs.002 = \u4e3b\u5de5\u5177\u680f\u4e0a\u7684\u201c\u663e\u793a/\u542f\u7528 \u201d\u5b57\u6bb5 \u201c\u706f\u6ce1\u201d \u6309\u94ae\u5c06\u4f7f\u9690\u85cf\u5b57\u6bb5\u53ef\u89c1\uff0c\u5e76\u5141\u8bb8\u60a8\u7f16\u8f91\u7981\u7528\u7684\u5b57\u6bb5\u3002
tips.tip.obs.003 = Does your application use anti CSRF tokens?\nMake sure you have configured ZAP to handle them via the 'Options / Active Scan' screen.
tips.tip.obs.004 = \u60a8\u53ef\u4ee5\u901a\u8fc7 "\u53f3\u952e\u5355\u51fb" \u5e76\u9009\u62e9 "\u6bd4\u8f83 2..." \u83dc\u5355\u9879\u4e2d\u7684\u4e00\u9879\u6765\u6bd4\u8f83\u4e24\u4e2a\u8bf7\u6c42\u6216\u54cd\u5e94\u3002
tips.tip.obs.005 = You can tell ZAP to access an app using a specified user.\nTo do that you need to add your app to a Context and then define the authentication and user details.
tips.tip.obs.006 = \u201c\u641c\u7d22\u201d\u9009\u9879\u5361\u5141\u8bb8\u60a8\u5728 Fuzz \u7ed3\u679c\u4e2d\u67e5\u627e\u5b57\u7b26\u4e32 - \u5b83\u652f\u6301\u6b63\u5219\u8868\u8fbe\u5f0f\u548c\u53cd\u5411\u5339\u914d\u3002
tips.tip.obs.007 = \u60a8\u53ef\u4ee5\u4f7f\u7528\u201c\u53f3\u952e\u5355\u51fb\u201d\u201c\u67e5\u627e...\u201d\u83dc\u5355\u5728\u4efb\u4f55\u6587\u672c\u533a\u57df\uff08\u5305\u62ec\u201c\u8bf7\u6c42\u201d\u548c\u201c\u54cd\u5e94\u201d\u9009\u9879\u5361\uff09\u4e2d\u641c\u7d22\u6587\u672c\u3002
tips.tip.obs.008 = \u60a8\u53ef\u4ee5\u901a\u8fc7\u201c\u53f3\u952e\u5355\u51fb\u201d\u201c\u8bed\u6cd5\u201d\u83dc\u5355\u66f4\u6539\u7528\u4e8e\u8bf7\u6c42\u3001\u54cd\u5e94\u548c\u811a\u672c\u63a7\u5236\u53f0\u9009\u9879\u5361\u7684\u8bed\u6cd5\u9ad8\u4eae\u663e\u793a\u3002
tips.tip.obs.009 = You can tell ZAP to load all of the scripts in a set of directories via the Scripts Option page.\nSee the help for details of the directory structure.
tips.tip.obs.010 = \u60a8\u53ef\u4ee5\u4f7f\u7528\u9876\u7ea7\u83dc\u5355\u5bfc\u51fa ZAP \u8bb0\u5f55\u7684\u6240\u6709 URL\uff1a\u201c\u62a5\u544a/\u5c06\u6240\u6709 URL \u5bfc\u51fa\u5230\u6587\u4ef6...\u201d
tips.tip.obs.011 = You can invoke 3rd party tools like sqlmap and nmap from within ZAP, passing across a wide range of contextual information.\nJust configure the applications you want to invoke in the "Options / Applications" screen. 
tips.tip.obs.012 = Docker \u652f\u6301 - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u63d0\u793a\u548c\u6280\u5de7
