# Strings used by the add-on
tips.desc					= Dicas e Truques
tips.button.allTips			= Todas as dicas
tips.button.nextTip			= Pr\u00f3xima dica
tips.dialog.title			= Dicas e Truques
tips.topmenu.help.tips		= Dicas e Truques

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001 = Salve sua sess\u00e3o ZAP no in\u00edcio de um teste em vez de ao final - a sess\u00e3o \u00e9 armazenada em um banco de dados que ser\u00e1 atualizado o tempo todo para que voc\u00ea n\u00e3o tenha que salv\u00e1-lo novamente.
tips.tip.gen.002 = Tente diferentes layouts de IU atrav\u00e9s dos bot\u00f5es na barra de ferramentas principal.
tips.tip.gen.003 = Clique com o bot\u00e3o direito em todos os lugares. Destaque o texto e clique com o bot\u00e3o direito nele. Muitas das funcionalidades do ZAP s\u00e3o sens\u00edveis ao contexto e podem ser acessadas dessa maneira.
tips.tip.gen.004 = Use os atalhos do teclado para acelerar seus testes - voc\u00ea pode definir suas pr\u00f3prias combina\u00e7\u00f5es via 'Op\u00e7\u00f5es/Teclado', que tamb\u00e9m gera cheatsheets de atalhos para impress\u00e3o.
tips.tip.gen.005 = Se voc\u00ea estiver obtendo muitos falsos positivos, tente alterar o limite dessa regra de varredura para Alto. Mas tamb\u00e9m relate o problema para n\u00f3s atrav\u00e9s do Grupo de usu\u00e1rios ZAP ou problemas para que possamos investig\u00e1-lo - ambos os quais est\u00e3o vinculados a partir do menu 'Online'
tips.tip.gen.007 = Adicione sua aplica\u00e7\u00e3o-alvo a um Contexto usando o menu do 'bot\u00e3o direito'\: 'Incluir no Contexto'. Isso permite que voc\u00ea informe ao ZAP mais sobre o alvo, como a autentica\u00e7\u00e3o, os usu\u00e1rios e a tecnologia que ele usa.
tips.tip.gen.008 = O ZAP pode exibir, interceptar e at\u00e9 mesmo difundir mensagens do lado do cliente, incluindo postMessages - 'clique com o bot\u00e3o direito' em uma sub\u00e1rvore na \u00e1rvore de sites e selecione um submenu adequado em 'Monitorar clientes'. Force uma atualiza\u00e7\u00e3o do navegador e suas p\u00e1ginas abertas ser\u00e3o exibidas na guia 'Clientes' junto com todas as mensagens do lado do cliente que eles geram.
tips.tip.gen.009 = Os scripts Zest s\u00e3o uma \u00f3tima maneira de automatizar tarefas. Zest \u00e9 a linguagem gr\u00e1fica de macro do ZAP, mas fornece recursos de programa\u00e7\u00e3o como condicionais e loops. Use o bot\u00e3o 'Gravar um novo script Zest...' na barra de ferramentas principal para gravar rapidamente um novo script Zest. Voc\u00ea tamb\u00e9m pode 'clicar com o bot\u00e3o direito' em solicita\u00e7\u00f5es para adicion\u00e1-las aos scripts Zest.
tips.tip.gen.010 = O ZAP pode verificar automaticamente se h\u00e1 atualiza\u00e7\u00f5es - ligue-o na tela 'Op\u00e7\u00f5es / Verificar atualiza\u00e7\u00f5es'. Se voc\u00ea n\u00e3o quiser que isso aconte\u00e7a automaticamente, certifique-se de verificar manualmente as atualiza\u00e7\u00f5es com frequ\u00eancia por meio do bot\u00e3o 'Gerenciar Complementos' da barra de ferramentas principal, conforme continuamente adicionamos novos recursos e corrigimos problemas.
tips.tip.gen.011 = Clique no \u00edcone de 'engrenagem' no lado direito de muitas guias para acessar rapidamente a configura\u00e7\u00e3o desse recurso.
tips.tip.gen.012 = H\u00e1 muitos recursos vinculados a partir do menu 'Online', incluindo os grupos ZAP Homepage, User and Developer
tips.tip.gen.013 = Quer conversar com algu\u00e9m sobre o ZAP?\n\
\n\
Muitos dos principais desenvolvedores ZAP frequentam o canal Libera Chat \#zaproxy irc\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = O ZAP tem p\u00e1ginas de ajuda abrangentes acess\u00edveis atrav\u00e9s do menu "Ajuda / Guia do Usu\u00e1rio do OWASP ZAP". A tecla F1 tamb\u00e9m abrir\u00e1 as p\u00e1ginas de ajuda e o levar\u00e1 diretamente \u00e0 se\u00e7\u00e3o relevante para a guia selecionada.
tips.tip.gen.015 = Novo no ZAP?\n\
\n\
Leia o guia 'Introdu\u00e7\u00e3o ao ZAP' acess\u00edvel atrav\u00e9s do menu 'Ajuda'.
tips.tip.gen.016 = A maioria das guias do ZAP agora est\u00e3o ocultas por padr\u00e3o para que a interface do usu\u00e1rio fique menos desorganizada. Voc\u00ea pode mostrar e ocultar todas as guias por meio de bot\u00f5es na barra de ferramentas principal. Voc\u00ea tamb\u00e9m pode 'fixar' qualquer guia que desejar para que permane\u00e7a vis\u00edvel mesmo ap\u00f3s a reinicializa\u00e7\u00e3o.
tips.tip.gen.017 = Voc\u00ea pode reordenar as colunas da tabela arrastando e soltando-as. Voc\u00ea tamb\u00e9m pode selecionar quais colunas s\u00e3o mostradas atrav\u00e9s do \u00edcone logo acima da barra de rolagem no lado direito de cada tabela.
tips.tip.gen.018 = Indicador de navega\u00e7\u00e3o manual - as p\u00e1ginas encontradas pelos spiders e pelo navegador for\u00e7ado s\u00e3o sinalizadas na \u00e1rvore de sites com o \u00edcone relevante. Este \u00edcone desaparece quando voc\u00ea visita essa p\u00e1gina manualmente.
tips.tip.gen.019 = Voc\u00ea pode iniciar navegadores que fazem proxy automaticamente por meio do ZAP e n\u00e3o precisam ter o certificado ZAP adicionado por meio do bot\u00e3o 'Explorar Manual'.
tips.tip.gen.020 = A p\u00e1gina de op\u00e7\u00f5es do Replacer permite que voc\u00ea substitua texto de forma r\u00e1pida e f\u00e1cil em qualquer lugar em uma mensagem HTTP(S).

# HUD tips
tips.tip.hud.001 = O Heads Up Display traz todas as principais funcionalidades do ZAP para o seu navegador.
tips.tip.hud.002 = Conclua o tutorial Heads Up Display - ele cobre todos os recursos do HUD.
tips.tip.hud.003 = O HUD \u00e9 constantemente atualizado - compartilhe coment\u00e1rios, solicita\u00e7\u00f5es de recursos e levante problemas em https\://github.com/zaproxy/zap-hud

# Automation tips
tips.tip.aut.001 = O ZAP \u00e9 \u00f3timo para automa\u00e7\u00e3o, mas \u00e9 mais f\u00e1cil testar os recursos na UI da \u00e1rea de trabalho primeiro e depois convert\u00ea-los em um script.
tips.tip.aut.002 = O ZAP possui uma API poderosa que cobre quase todos os recursos dispon\u00edveis na UI da \u00c1rea de Trabalho.
tips.tip.aut.003 = Por padr\u00e3o, voc\u00ea n\u00e3o pode se conectar ao ZAP em outra m\u00e1quina, voc\u00ea precisar\u00e1 alterar as configura\u00e7\u00f5es para permitir conex\u00f5es remotas.

# Obscure features
tips.tip.obs.001 = As solicita\u00e7\u00f5es POST t\u00eam um menu de 'clique com o bot\u00e3o direito' para gerar um formul\u00e1rio de teste anti CSRF.
tips.tip.obs.002 = O bot\u00e3o 'Mostrar / ativar' campos 'l\u00e2mpada' na barra de ferramentas principal tornar\u00e1 os campos ocultos vis\u00edveis e permitir\u00e1 que voc\u00ea edite os campos desativados.
tips.tip.obs.003 = Sua aplica\u00e7\u00e3o usa tokens anti CSRF? Certifique-se de ter configurado o ZAP para lidar com eles por meio da tela 'Op\u00e7\u00f5es / Varredura Ativa'.
tips.tip.obs.004 = Voc\u00ea pode comparar 2 solicita\u00e7\u00f5es ou respostas selecionando-as, 'clicando com o bot\u00e3o direito' e selecionando um dos itens de menu 'Comparar 2...'
tips.tip.obs.005 = Voc\u00ea pode dizer ao ZAP para acessar uma apli\u00e7\u00e3o usando um usu\u00e1rio especificado. Para isso, voc\u00ea precisa adicionar sua aplica\u00e7\u00e3o a um Contexto e, em seguida, definir a autentica\u00e7\u00e3o e os detalhes do usu\u00e1rio.
tips.tip.obs.006 = A tab Pesquisar permite que voc\u00ea encontre string nos resultados do Fuzz - ele suporta express\u00f5es regex e correspond\u00eancia inversa.
tips.tip.obs.007 = Voc\u00ea pode procurar texto em qualquer \u00e1rea de texto, incluindo as guias Solicita\u00e7\u00e3o e Resposta, usando o menu 'clique com o bot\u00e3o direito' Localizar...'.
tips.tip.obs.008 = Voc\u00ea pode alterar o realce de sintaxe usado para as guias Request, Response e Script Console por meio dos menus de 'clique com o bot\u00e3o direito' 'Sintaxe'.
tips.tip.obs.009 = Voc\u00ea pode dizer ao ZAP para carregar todos os scripts em um conjunto de diret\u00f3rios atrav\u00e9s da p\u00e1gina Op\u00e7\u00e3o de scripts. Consulte a ajuda para obter detalhes sobre a estrutura do diret\u00f3rio.
tips.tip.obs.010 = Voc\u00ea pode exportar todas as URLs registradas pelo ZAP usando o menu de n\u00edvel superior\: "Relat\u00f3rio / Exportar todas as URLs para um arquivo..."
tips.tip.obs.011 = Voc\u00ea pode chamar ferramentas de terceiros como sqlmap e nmap de dentro do ZAP, transmitindo uma ampla gama de informa\u00e7\u00f5es contextuais. Basta configurar os aplicativos que voc\u00ea deseja chamar na tela "Op\u00e7\u00f5es/Aplicativos".
tips.tip.obs.012 = Suporte Docker - https\://www.zaproxy.org/docs/docker/

# Optional add-ons
tips.tip.add.001 = Instale as regras beta de varredura ativa e passiva para encontrar mais problemas potenciais. H\u00e1 tamb\u00e9m regras de varredura alfa ativa e passiva, mas obviamente podem ser menos est\u00e1veis.
tips.tip.add.002 = Deseja programar o ZAP em uma linguagem de script diferente do Java Script e do Zest? Verifique o ZAP Marketplace para outras linguagens como python e rubi. Se a sua linguagem de script preferida ainda n\u00e3o estiver dispon\u00edvel, entre em contato - \u00e9 bastante f\u00e1cil adicionar suporte para outras linguagens.
tips.tip.add.003 = Instale o suplemento SAML do ZAP Marketplace para detectar, mostrar, editar e embaralhar solicita\u00e7\u00f5es SAML.
tips.tip.add.004 = H\u00e1 um grande n\u00famero de arquivos fuzzing dispon\u00edveis no ZAP Marketplace nos add-ons 'Directory List *', 'Fuzzdb files' e 'SVN Digger files'.
tips.tip.add.005 = H\u00e1 um reposit\u00f3rio de scripts ZAP em https\://github.com/zaproxy/community-scripts. Se voc\u00ea clonar uma c\u00f3pia local, poder\u00e1 adicion\u00e1-los ao ZAP por meio do painel de op\u00e7\u00f5es de scripts. Voc\u00ea tamb\u00e9m pode enviar seus pr\u00f3prios scripts por meio de solicita\u00e7\u00f5es pull - quanto mais, melhor\!
tips.tip.add.007 = Instale o complemento de seq\u00fc\u00eancia do ZAP Marketplace para digitalizar p\u00e1ginas que devem ser visitadas em uma ordem espec\u00edfica para que toda a funcionalidade esteja acess\u00edvel.
tips.tip.add.008 = Instale o complemento accessControl a partir do ZAP Marketplace para automatizar o teste do controle de acesso do aplicativo.
tips.tip.add.009 = Voc\u00ea pode importar URLs contidas em um arquivo de texto usando o complemento importurls dispon\u00edvel no ZAP Marketplace
