# Strings used by the add-on
tips.button.allTips = \u3059\u3079\u3066\u306e\u30d2\u30f3\u30c8
tips.button.nextTip = \u6b21\u306e\u30d2\u30f3\u30c8
tips.desc = \u30d2\u30f3\u30c8\u3068\u30b3\u30c4
tips.dialog.title = \u30d2\u30f3\u30c8\u3068\u30b3\u30c4

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = \u30d9\u30fc\u30bf\u7248\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u304a\u3088\u3073\u30d1\u30c3\u30b7\u30d6\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3001\u3088\u308a\u591a\u304f\u306e\u6f5c\u5728\u7684\u306a\u8106\u5f31\u6027\u3092\u767a\u898b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30a2\u30eb\u30d5\u30a1\u7248\u306e\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u3082\u5229\u7528\u3067\u304d\u307e\u3059\u304c\u3001\u5b89\u5b9a\u6027\u304c\u52a3\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
tips.tip.add.002 = JavaScript \u3084 Zest \u4ee5\u5916\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u8a00\u8a9e\u3067ZAP\u3092\u30b9\u30af\u30ea\u30d7\u30c8\u5316\u3057\u305f\u3044\u3067\u3059\u304b\uff1f\nZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3067\u3001Python \u3084 Ruby \u306a\u3069\u306e\u4ed6\u306e\u8a00\u8a9e\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u304a\u597d\u307f\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u8a00\u8a9e\u304c\u307e\u3060\u5229\u7528\u3067\u304d\u306a\u3044\u5834\u5408\u306f\u3001\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002\u4ed6\u306e\u8a00\u8a9e\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u8ffd\u52a0\u3059\u308b\u306e\u306f\u6bd4\u8f03\u7684\u7c21\u5358\u3067\u3059\u3002
tips.tip.add.003 = ZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u304b\u3089 SAML \u30a2\u30c9\u30aa\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3001SAML \u30ea\u30af\u30a8\u30b9\u30c8\u306e\u691c\u51fa\u3001\u8868\u793a\u3001\u7de8\u96c6\u3001\u30d5\u30a1\u30b8\u30f3\u30b0\u3092\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.add.004 = ZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u306e\u300cDirectory List *\u300d\u3001\u300cFuzzdb files\u300d\u3001\u300cSVN Digger files\u300d\u30a2\u30c9\u30aa\u30f3\u306b\u306f\u3001\u591a\u6570\u306e\u30d5\u30a1\u30b8\u30f3\u30b0\u30d5\u30a1\u30a4\u30eb\u304c\u7528\u610f\u3055\u308c\u3066\u3044\u307e\u3059\u3002
tips.tip.add.005 = https\://github.com/zaproxy/community-scripts \u306bZAP\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u3042\u308a\u307e\u3059\u3002\n\u30ed\u30fc\u30ab\u30eb\u30b3\u30d4\u30fc\u3092\u30af\u30ed\u30fc\u30f3\u3059\u308c\u3070\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u30aa\u30d7\u30b7\u30e7\u30f3\u30da\u30a4\u30f3\u3092\u4ecb\u3057\u3066\u3059\u3079\u3066\u3092ZAP\u306b\u8ffd\u52a0\u3067\u304d\u307e\u3059\u3002\n\u30d7\u30eb\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u901a\u3058\u3066\u72ec\u81ea\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u591a\u3051\u308c\u3070\u591a\u3044\u307b\u3069\u826f\u3044\u3067\u3059\uff01
tips.tip.add.007 = \u7279\u5b9a\u306e\u9806\u5e8f\u3067\u30a2\u30af\u30bb\u30b9\u3057\u306a\u3044\u3068\u5168\u6a5f\u80fd\u304c\u5229\u7528\u3067\u304d\u306a\u3044\u30da\u30fc\u30b8\u3092\u30b9\u30ad\u30e3\u30f3\u3059\u308b\u306b\u306f\u3001ZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u304b\u3089 sequence \u30a2\u30c9\u30aa\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.add.008 = ZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u304b\u3089 accessControl \u30a2\u30c9\u30aa\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30a2\u30af\u30bb\u30b9\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30c6\u30b9\u30c8\u3092\u81ea\u52d5\u5316\u3057\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.add.009 = ZAP \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3067\u5229\u7528\u53ef\u80fd\u306a importurls \u30a2\u30c9\u30aa\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u30c6\u30ad\u30b9\u30c8\u30d5\u30a1\u30a4\u30eb\u306b\u542b\u307e\u308c\u308bURL\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u3059\u3002


# Automation tips
tips.tip.aut.001 = ZAP \u306f\u81ea\u52d5\u5316\u306b\u512a\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u307e\u305a\u30c7\u30b9\u30af\u30c8\u30c3\u30d7 UI \u3067\u6a5f\u80fd\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u30b9\u30af\u30ea\u30d7\u30c8\u5316\u3059\u308b\u65b9\u304c\u52b9\u7387\u7684\u3067\u3059\u3002
tips.tip.aut.002 = ZAP \u306b\u306f\u5f37\u529b\u306a API \u304c\u3042\u308a\u3001\u30c7\u30b9\u30af\u30c8\u30c3\u30d7 UI \u306e\u307b\u307c\u3059\u3079\u3066\u306e\u6a5f\u80fd\u3092\u5229\u7528\u3067\u304d\u307e\u3059\u3002
tips.tip.aut.003 = \u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u4ed6\u306e\u30de\u30b7\u30f3\u304b\u3089 ZAP \u306b\u63a5\u7d9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30ea\u30e2\u30fc\u30c8\u63a5\u7d9a\u3092\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u8a2d\u5b9a\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# General tips
tips.tip.gen.001 = ZAP\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30c6\u30b9\u30c8\u306e\u7d42\u308f\u308a\u3067\u306f\u306a\u304f\u3001\u958b\u59cb\u6642\u306b\u4fdd\u5b58\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u4fdd\u5b58\u3055\u308c\u3001\u5e38\u306b\u66f4\u65b0\u3055\u308c\u308b\u305f\u3081\u3001\u518d\u5ea6\u4fdd\u5b58\u3059\u308b\u5fc5\u8981\u306f\u3042\u308a\u307e\u305b\u3093\u3002
tips.tip.gen.002 = \u30e1\u30a4\u30f3\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u3055\u307e\u3056\u307e\u306aUI\u30ec\u30a4\u30a2\u30a6\u30c8\u3092\u8a66\u3057\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.gen.003 = \u3069\u3053\u3067\u3082\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\n\u30c6\u30ad\u30b9\u30c8\u3092\u9078\u629e\u3057\u3066\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nZAP \u306e\u591a\u304f\u306e\u6a5f\u80fd\u306f\u72b6\u6cc1\u306b\u5fdc\u3058\u3066\u5229\u7528\u3067\u304d\u3001\u3053\u308c\u304c\u6700\u3082\u52b9\u7387\u7684\u306a\u65b9\u6cd5\u3067\u3059\u3002
tips.tip.gen.004 = \u30ad\u30fc\u30dc\u30fc\u30c9\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u3067\u30c6\u30b9\u30c8\u3092\u52b9\u7387\u5316\u3057\u307e\u3057\u3087\u3046\u3002\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300c\u30ad\u30fc\u30dc\u30fc\u30c9\u300d\u3067\u72ec\u81ea\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u5b9a\u7fa9\u3067\u304d\u3001\u5370\u5237\u53ef\u80fd\u306a\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u4e00\u89a7\u3082\u751f\u6210\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.005 = \u507d\u967d\u6027\u304c\u591a\u3059\u304e\u308b\u5834\u5408\u306f\u3001\u8a72\u5f53\u3059\u308b\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb\u306e\u3057\u304d\u3044\u5024\u3092\u300c\u9ad8\u300d\u306b\u5909\u66f4\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\n\u307e\u305f\u3001ZAP \u30e6\u30fc\u30b6\u30fc\u30b0\u30eb\u30fc\u30d7\u307e\u305f\u306f Issues \u3067\u554f\u984c\u3092\u5831\u544a\u3057\u3066\u3044\u305f\u3060\u3051\u308c\u3070\u8abf\u67fb\u3044\u305f\u3057\u307e\u3059 - \u3069\u3061\u3089\u3082\u300c\u30aa\u30f3\u30e9\u30a4\u30f3\u300d\u30e1\u30cb\u30e5\u30fc\u304b\u3089\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.007 = \u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u30e1\u30cb\u30e5\u30fc\u306e\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u542b\u3081\u308b\u300d\u3092\u4f7f\u7528\u3057\u3066\u3001\u5bfe\u8c61\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u3053\u308c\u306b\u3088\u308a\u3001\u8a8d\u8a3c\u3001\u30e6\u30fc\u30b6\u30fc\u3001\u4f7f\u7528\u3057\u3066\u3044\u308b\u6280\u8853\u306a\u3069\u3001\u5bfe\u8c61\u306b\u3064\u3044\u3066ZAP\u306b\u3088\u308a\u591a\u304f\u306e\u60c5\u5831\u3092\u4f1d\u3048\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.008 = ZAP\u306f\u3001postMessage \u3092\u542b\u3080\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3001\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30c8\u3001\u3055\u3089\u306b\u306f\u30d5\u30a1\u30b8\u30f3\u30b0\u3067\u304d\u307e\u3059\u3002\u30b5\u30a4\u30c8\u30c4\u30ea\u30fc\u306e\u30b5\u30d6\u30c4\u30ea\u30fc\u3092\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u3057\u3001\u300c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u76e3\u8996\u300d\u306e\u4e0b\u306e\u9069\u5207\u306a\u30b5\u30d6\u30e1\u30cb\u30e5\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30d6\u30e9\u30a6\u30b6\u306e\u5f37\u5236\u66f4\u65b0\u3092\u884c\u3046\u3068\u3001\u958b\u3044\u3066\u3044\u308b\u30da\u30fc\u30b8\u304c\u300c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u300d\u30bf\u30d6\u306b\u8868\u793a\u3055\u308c\u3001\u305d\u308c\u3089\u304c\u751f\u6210\u3059\u308b\u3059\u3079\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u5074\u30e1\u30c3\u30bb\u30fc\u30b8\u3068\u3068\u3082\u306b\u8868\u793a\u3055\u308c\u307e\u3059\u3002
tips.tip.gen.009 = Zest\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u30bf\u30b9\u30af\u3092\u81ea\u52d5\u5316\u3059\u308b\u512a\u308c\u305f\u65b9\u6cd5\u3067\u3059\u3002\nZest\u306fZAP\u306e\u30b0\u30e9\u30d5\u30a3\u30ab\u30eb\u30de\u30af\u30ed\u8a00\u8a9e\u3067\u3059\u304c\u3001\u6761\u4ef6\u5206\u5c90\u3084\u30eb\u30fc\u30d7\u306a\u3069\u306e\u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u6a5f\u80fd\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\n\u30e1\u30a4\u30f3\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u300c\u65b0\u898fZest\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u8a18\u9332\u2026\u300d\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u65b0\u3057\u3044Zest\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u7d20\u65e9\u304f\u8a18\u9332\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u307e\u305f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u3057\u3066Zest\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u8ffd\u52a0\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.010 = ZAP\u306f\u81ea\u52d5\u7684\u306b\u66f4\u65b0\u3092\u30c1\u30a7\u30c3\u30af\u3067\u304d\u307e\u3059\u3002\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300c \u66f4\u65b0\u306e\u78ba\u8a8d\u300d\u753b\u9762\u3067\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u81ea\u52d5\u7684\u306b\u884c\u308f\u308c\u308b\u3053\u3068\u3092\u671b\u307e\u306a\u3044\u5834\u5408\u306f\u3001\u30e1\u30a4\u30f3\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u300c\u30a2\u30c9\u30aa\u30f3\u306e\u7ba1\u7406\u300d\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u3066\u5b9a\u671f\u7684\u306b\u624b\u52d5\u3067\u66f4\u65b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u65b0\u6a5f\u80fd\u306e\u8ffd\u52a0\u3084\u554f\u984c\u306e\u4fee\u6b63\u3092\u7d99\u7d9a\u7684\u306b\u884c\u3063\u3066\u3044\u308b\u305f\u3081\u3067\u3059\u3002
tips.tip.gen.011 = \u591a\u304f\u306e\u30bf\u30d6\u306e\u53f3\u5074\u306b\u3042\u308b\u300c\u6b6f\u8eca\u300d\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u305d\u306e\u6a5f\u80fd\u306e\u8a2d\u5b9a\u306b\u7d20\u65e9\u304f\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u3059\u3002 
tips.tip.gen.012 = \u300c\u30aa\u30f3\u30e9\u30a4\u30f3\u300d\u30e1\u30cb\u30e5\u30fc\u306b\u306f\u3001ZAP\u30db\u30fc\u30e0\u30da\u30fc\u30b8\u3001\u30e6\u30fc\u30b6\u30fc\u30b0\u30eb\u30fc\u30d7\u3001\u958b\u767a\u8005\u30b0\u30eb\u30fc\u30d7\u306a\u3069\u3001\u591a\u304f\u306e\u30ea\u30bd\u30fc\u30b9\u304c\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
tips.tip.gen.013 = ZAP \u306b\u3064\u3044\u3066\u8ab0\u304b\u3068\u8a71\u3057\u305f\u3044\u3067\u3059\u304b\uff1f\nZAP \u30b3\u30a2\u30c1\u30fc\u30e0\u306f Slack \u3067\u4ea4\u6d41\u3057\u3066\u3044\u307e\u3059\: https\://zaproxy.slack.com (https\://www.zaproxy.org/slack/invite)
tips.tip.gen.014 = ZAP\u306b\u306f\u3001\u300c\u30d8\u30eb\u30d7\u300d\u2192\u300c ZAP\u30e6\u30fc\u30b6\u30fc\u30ac\u30a4\u30c9\u300d\u30e1\u30cb\u30e5\u30fc\u304b\u3089\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u5305\u62ec\u7684\u306a\u30d8\u30eb\u30d7\u30da\u30fc\u30b8\u304c\u3042\u308a\u307e\u3059\u3002\nF1\u30ad\u30fc\u3092\u62bc\u3059\u3068\u3001\u30d8\u30eb\u30d7\u30da\u30fc\u30b8\u304c\u8868\u793a\u3055\u308c\u3001\u9078\u629e\u3057\u305f\u30bf\u30d6\u306e\u95a2\u9023\u30bb\u30af\u30b7\u30e7\u30f3\u306b\u76f4\u63a5\u79fb\u52d5\u3057\u307e\u3059\u3002
tips.tip.gen.015 = ZAP\u3092\u521d\u3081\u3066\u4f7f\u7528\u3057\u307e\u3059\u304b\uff1f\n\u300c\u30d8\u30eb\u30d7\u300d\u30e1\u30cb\u30e5\u30fc\u304b\u3089\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u300cGetting Started with ZAP\u300d\u30ac\u30a4\u30c9\u3092\u304a\u8aad\u307f\u304f\u3060\u3055\u3044\u3002 
tips.tip.gen.016 = ZAP\u306e\u30bf\u30d6\u306e\u5927\u90e8\u5206\u306f\u3001UI\u3092\u3059\u3063\u304d\u308a\u3055\u305b\u308b\u305f\u3081\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u975e\u8868\u793a\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002\n\u30e1\u30a4\u30f3\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u3059\u3079\u3066\u306e\u30bf\u30d6\u306e\u8868\u793a/\u975e\u8868\u793a\u3092\u5207\u308a\u66ff\u3048\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u307e\u305f\u3001\u4efb\u610f\u306e\u30bf\u30d6\u3092\u300c\u30d4\u30f3\u7559\u3081\u300d\u3057\u3066\u3001\u518d\u8d77\u52d5\u5f8c\u3082\u8868\u793a\u3055\u308c\u305f\u307e\u307e\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.017 = \u30c6\u30fc\u30d6\u30eb\u306e\u5217\u306f\u3001\u30c9\u30e9\u30c3\u30b0\u30a2\u30f3\u30c9\u30c9\u30ed\u30c3\u30d7\u3067\u4e26\u3079\u66ff\u3048\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u307e\u305f\u3001\u5404\u30c6\u30fc\u30d6\u30eb\u306e\u53f3\u5074\u306e\u30b9\u30af\u30ed\u30fc\u30eb\u30d0\u30fc\u306e\u3059\u3050\u4e0a\u306b\u3042\u308b\u30a2\u30a4\u30b3\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u8868\u793a\u3059\u308b\u5217\u3092\u9078\u629e\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.018 = \u624b\u52d5\u30d6\u30e9\u30a6\u30ba\u30a4\u30f3\u30b8\u30b1\u30fc\u30bf\u30fc - \u30b9\u30d1\u30a4\u30c0\u30fc\u3068\u5f37\u5236\u30d6\u30e9\u30a6\u30b6\u306b\u3088\u3063\u3066\u767a\u898b\u3055\u308c\u305f\u30da\u30fc\u30b8\u306f\u3001\u30b5\u30a4\u30c8\u30c4\u30ea\u30fc\u3067\u8a72\u5f53\u3059\u308b\u30a2\u30a4\u30b3\u30f3\u3067\u30d5\u30e9\u30b0\u304c\u7acb\u3066\u3089\u308c\u307e\u3059\u3002\u3053\u306e\u30a2\u30a4\u30b3\u30f3\u306f\u3001\u305d\u306e\u30da\u30fc\u30b8\u3092\u624b\u52d5\u3067\u8a2a\u554f\u3059\u308b\u3068\u6d88\u3048\u307e\u3059\u3002
tips.tip.gen.019 = ZAP \u3092\u901a\u3057\u3066\u81ea\u52d5\u7684\u306b\u30d7\u30ed\u30ad\u30b7\u3057\u3001ZAP \u8a3c\u660e\u66f8\u3092\u8ffd\u52a0\u3059\u308b\u5fc5\u8981\u306e\u306a\u3044\u30d6\u30e9\u30a6\u30b6\u3092\u300c\u624b\u52d5\u63a2\u7d22\u300d\u30dc\u30bf\u30f3\u3067\u8d77\u52d5\u3067\u304d\u307e\u3059\u3002
tips.tip.gen.020 = Replacer \u30aa\u30d7\u30b7\u30e7\u30f3\u30da\u30fc\u30b8\u3067\u306f\u3001HTTP(S) \u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u4efb\u610f\u306e\u30c6\u30ad\u30b9\u30c8\u3092\u7d20\u65e9\u304f\u7c21\u5358\u306b\u7f6e\u63db\u3067\u304d\u307e\u3059\u3002

# HUD tips
tips.tip.hud.001 = Heads Up Display \u306f\u3001ZAP\u306e\u4e3b\u8981\u6a5f\u80fd\u3092\u3059\u3079\u3066\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u7d71\u5408\u3057\u307e\u3059\u3002
tips.tip.hud.002 = Heads Up Display \u30c1\u30e5\u30fc\u30c8\u30ea\u30a2\u30eb\u3092\u5b8c\u4e86\u3057\u3066\u304f\u3060\u3055\u3044\u3002HUD \u306e\u3059\u3079\u3066\u306e\u6a5f\u80fd\u3092\u30ab\u30d0\u30fc\u3057\u3066\u3044\u307e\u3059\u3002
tips.tip.hud.003 = HUD \u306f\u7d99\u7d9a\u7684\u306b\u66f4\u65b0\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30d5\u30a3\u30fc\u30c9\u30d0\u30c3\u30af\u3001\u6a5f\u80fd\u30ea\u30af\u30a8\u30b9\u30c8\u3001\u554f\u984c\u5831\u544a\u306f https\://github.com/zaproxy/zap-hud \u3067\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002

# Obscure features
tips.tip.obs.001 = POST\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u306f\u3001Anti-CSRF \u30c6\u30b9\u30c8\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306e\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u30e1\u30cb\u30e5\u30fc\u304c\u3042\u308a\u307e\u3059\u3002
tips.tip.obs.002 = \u30e1\u30a4\u30f3\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u300c\u8868\u793a\u300d\u2192\u300c\u6709\u52b9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u300c\u96fb\u7403\u300d\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u975e\u8868\u793a\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u8868\u793a\u3055\u308c\u3001\u7121\u52b9\u5316\u3055\u308c\u305f\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u7de8\u96c6\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
tips.tip.obs.003 = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 Anti-CSRF \u30c8\u30fc\u30af\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u304b\uff1f\n\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300c\u30a2\u30af\u30c6\u30a3\u30d6\u30b9\u30ad\u30e3\u30f3\u300d\u753b\u9762\u3067\u305d\u308c\u3089\u3092\u51e6\u7406\u3059\u308b\u3088\u3046\u306b ZAP \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.obs.004 = 2\u3064\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u307e\u305f\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u6bd4\u8f03\u3059\u308b\u306b\u306f\u3001\u4e21\u65b9\u3092\u9078\u629e\u3057\u3001\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u3057\u3066\u300c2\u3064\u306e\u2026\u3092\u6bd4\u8f03\u300d\u30e1\u30cb\u30e5\u30fc\u9805\u76ee\u306e\u3044\u305a\u308c\u304b\u3092\u9078\u629e\u3057\u307e\u3059\u3002
tips.tip.obs.005 = \u6307\u5b9a\u3057\u305f\u30e6\u30fc\u30b6\u30fc\u3092\u4f7f\u7528\u3057\u3066\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3088\u3046ZAP\u306b\u6307\u793a\u3067\u304d\u307e\u3059\u3002\n\u305d\u306e\u305f\u3081\u306b\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u8ffd\u52a0\u3057\u3066\u304b\u3089\u3001\u8a8d\u8a3c\u3068\u30e6\u30fc\u30b6\u30fc\u306e\u8a73\u7d30\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
tips.tip.obs.006 = \u691c\u7d22\u30bf\u30d6\u3067\u306f\u3001\u30d5\u30a1\u30b8\u30f3\u30b0\u7d50\u679c\u5185\u306e\u6587\u5b57\u5217\u3092\u691c\u7d22\u3067\u304d\u307e\u3059\u3002\u6b63\u898f\u8868\u73fe\u3068\u9006\u30de\u30c3\u30c1\u30f3\u30b0\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059\u3002
tips.tip.obs.007 = \u30ea\u30af\u30a8\u30b9\u30c8\u30bf\u30d6\u3084\u30ec\u30b9\u30dd\u30f3\u30b9\u30bf\u30d6\u3092\u542b\u3080\u4efb\u610f\u306e\u30c6\u30ad\u30b9\u30c8\u30a8\u30ea\u30a2\u3067\u3001\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u306e\u300c\u691c\u7d22...\u300d\u30e1\u30cb\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u3066\u30c6\u30ad\u30b9\u30c8\u3092\u691c\u7d22\u3067\u304d\u307e\u3059\u3002  
tips.tip.obs.008 = \u30ea\u30af\u30a8\u30b9\u30c8\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u30b3\u30f3\u30bd\u30fc\u30eb\u30bf\u30d6\u3067\u4f7f\u7528\u3055\u308c\u308b\u69cb\u6587\u30cf\u30a4\u30e9\u30a4\u30c8\u306f\u3001\u300c\u53f3\u30af\u30ea\u30c3\u30af\u300d\u306e\u300c\u69cb\u6587\u300d\u30e1\u30cb\u30e5\u30fc\u3067\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
tips.tip.obs.009 = \u30b9\u30af\u30ea\u30d7\u30c8\u30aa\u30d7\u30b7\u30e7\u30f3\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001\u4e00\u9023\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u5185\u306e\u3059\u3079\u3066\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u30ed\u30fc\u30c9\u3059\u308b\u3088\u3046ZAP\u306b\u6307\u793a\u3067\u304d\u307e\u3059\u3002\n\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u69cb\u9020\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30d8\u30eb\u30d7\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
tips.tip.obs.010 = ZAP\u304c\u8a18\u9332\u3057\u305f\u3059\u3079\u3066\u306eURL\u306f\u3001\u30e1\u30a4\u30f3\u30e1\u30cb\u30e5\u30fc\u306e\u300c\u30ec\u30dd\u30fc\u30c8\u300d\u2192\u300c\u3059\u3079\u3066\u306eURL\u3092\u30d5\u30a1\u30a4\u30eb\u306b\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u2026\u300d\u3092\u4f7f\u7528\u3057\u3066\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3067\u304d\u307e\u3059\u3002
tips.tip.obs.011 = ZAP\u5185\u304b\u3089 sqlmap \u3084 nmap \u306a\u3069\u306e\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30c4\u30fc\u30eb\u3092\u547c\u3073\u51fa\u3057\u3001\u5e45\u5e83\u3044\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u60c5\u5831\u3092\u6e21\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u300d\u753b\u9762\u3067\u3001\u547c\u3073\u51fa\u3057\u305f\u3044\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8a2d\u5b9a\u3059\u308b\u3060\u3051\u3067\u3059\u3002
tips.tip.obs.012 = Docker \u30b5\u30dd\u30fc\u30c8 - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u30d2\u30f3\u30c8\u3068\u30b3\u30c4
