# Strings used by the add-on
tips.button.allTips = \u0412\u0441\u0435 \u0441\u043e\u0432\u0435\u0442\u044b 
tips.button.nextTip = \u0421\u043b\u0435\u0434\u0443\u044e\u0449\u0430\u044f \u043f\u043e\u0434\u0441\u043a\u0430\u0437\u043a\u0430
tips.desc = \u0421\u0435\u043a\u0440\u0435\u0442\u044b \u0438 \u0443\u043b\u043e\u0432\u043a\u0438
tips.dialog.title = \u0421\u0435\u043a\u0440\u0435\u0442\u044b \u0438 \u0443\u043b\u043e\u0432\u043a\u0438

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = Install the beta active and passive scan rules to find more potential issues.\nThere are also alpha active and passive scan rules but obviously they may be less stable.
tips.tip.add.002 = Want to script ZAP in a scripting language other than Java Script and Zest?\nCheck the ZAP Marketplace for other languages like python and ruby.\nIf your preferred scripting language isnt yet available then get in touch - its fairly easy to add support for other languages.
tips.tip.add.003 = \u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435 \u043d\u0430\u0434\u0441\u0442\u0440\u043e\u0439\u043a\u0443 SAML \u0438\u0437 ZAP Marketplace, \u0447\u0442\u043e\u0431\u044b \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0438\u0432\u0430\u0442\u044c, \u043e\u0442\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u044c, \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0438 \u0444\u0430\u0437\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0437\u0430\u043f\u0440\u043e\u0441\u044b SAML. 
tips.tip.add.004 = \u0412 ZAP Marketplace \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e \u0431\u043e\u043b\u044c\u0448\u043e\u0435 \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u0444\u0430\u0439\u043b\u043e\u0432 \u0444\u0430\u0437\u0437\u0438\u043d\u0433\u0430 \u0432 \u043d\u0430\u0434\u0441\u0442\u0440\u043e\u0439\u043a\u0430\u0445 \u00ab\u0421\u043f\u0438\u0441\u043e\u043a \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u043e\u0432 *\u00bb, \u00ab\u0424\u0430\u0439\u043b\u044b Fuzzdb\u00bb \u0438 \u00ab\u0424\u0430\u0439\u043b\u044b SVN Digger\u00bb. 
tips.tip.add.005 = There is a repository of ZAP scripts at https\://github.com/zaproxy/community-scripts\nIf you clone a local copy then you can add all of them to ZAP via the Scripts Option pane.\nYou can also upload your own scripts via pull requests - the more the better\! 
tips.tip.add.007 = \u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435 \u043d\u0430\u0434\u0441\u0442\u0440\u043e\u0439\u043a\u0443 \u043f\u043e\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u0438 \u0438\u0437 ZAP Marketplace, \u0447\u0442\u043e\u0431\u044b \u0441\u043a\u0430\u043d\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u044b, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043f\u043e\u0441\u0435\u0449\u0430\u0442\u044c, \u0432 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u043d\u043e\u043c \u043f\u043e\u0440\u044f\u0434\u043a\u0435, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b\u0430 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430 \u043f\u043e\u043b\u043d\u0430\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c. 
tips.tip.add.008 = \u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435 \u043d\u0430\u0434\u0441\u0442\u0440\u043e\u0439\u043a\u0443 accessControl \u0438\u0437 ZAP Marketplace, \u0447\u0442\u043e\u0431\u044b \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0442\u0435\u0441\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u044f. 
tips.tip.add.009 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0438\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c URL-\u0430\u0434\u0440\u0435\u0441\u0430, \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0449\u0438\u0435\u0441\u044f \u0432 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u043e\u043c \u0444\u0430\u0439\u043b\u0435, \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043d\u0430\u0434\u0441\u0442\u0440\u043e\u0439\u043a\u0438 importurls, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0439 \u043d\u0430 ZAP Marketplace. 


# Automation tips
tips.tip.aut.001 = ZAP \u043e\u0442\u043b\u0438\u0447\u043d\u043e \u043f\u043e\u0434\u0445\u043e\u0434\u0438\u0442 \u0434\u043b\u044f \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0437\u0430\u0446\u0438\u0438, \u043d\u043e \u0435\u0433\u043e \u043f\u0440\u043e\u0449\u0435 \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u043f\u0440\u043e\u0442\u0435\u0441\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0444\u0443\u043d\u043a\u0446\u0438\u0438 \u0432 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u043c \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0435 \u0440\u0430\u0431\u043e\u0447\u0435\u0433\u043e \u0441\u0442\u043e\u043b\u0430, \u0430 \u0437\u0430\u0442\u0435\u043c \u043f\u0440\u0435\u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u0442\u044c \u0438\u0445 \u0432 \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u0439. 
tips.tip.aut.002 = ZAP \u0438\u043c\u0435\u0435\u0442 \u043c\u043e\u0449\u043d\u044b\u0439 API, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043e\u0445\u0432\u0430\u0442\u044b\u0432\u0430\u0435\u0442 \u043f\u043e\u0447\u0442\u0438 \u0432\u0441\u0435 \u0444\u0443\u043d\u043a\u0446\u0438\u0438, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b\u0435 \u0432 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u043c \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0435 \u0440\u0430\u0431\u043e\u0447\u0435\u0433\u043e \u0441\u0442\u043e\u043b\u0430. 
tips.tip.aut.003 = \u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e \u0432\u044b \u043d\u0435 \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0438\u0442\u044c\u0441\u044f \u043a ZAP \u043d\u0430 \u0434\u0440\u0443\u0433\u043e\u043c \u043a\u043e\u043c\u043f\u044c\u044e\u0442\u0435\u0440\u0435, \u0432\u0430\u043c \u043d\u0443\u0436\u043d\u043e \u0431\u0443\u0434\u0435\u0442 \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u0438, \u0447\u0442\u043e\u0431\u044b \u0440\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044c \u0443\u0434\u0430\u043b\u0435\u043d\u043d\u044b\u0435 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f. 

# General tips
tips.tip.gen.001 = \u0421\u043e\u0445\u0440\u0430\u043d\u044f\u0439\u0442\u0435 \u0441\u0435\u0430\u043d\u0441 ZAP \u0432 \u043d\u0430\u0447\u0430\u043b\u0435 \u0442\u0435\u0441\u0442\u0430, \u0430 \u043d\u0435 \u0432 \u043a\u043e\u043d\u0446\u0435 - \u0441\u0435\u0430\u043d\u0441 \u0445\u0440\u0430\u043d\u0438\u0442\u0441\u044f \u0432 \u0431\u0430\u0437\u0435 \u0434\u0430\u043d\u043d\u044b\u0445, \n\u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0431\u0443\u0434\u0435\u0442 \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e \u043e\u0431\u043d\u043e\u0432\u043b\u044f\u0442\u044c\u0441\u044f, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u043d\u0435 \u043f\u0440\u0438\u0434\u0435\u0442\u0441\u044f \u0441\u043e\u0445\u0440\u0430\u043d\u044f\u0442\u044c \u0435\u0435 \u0441\u043d\u043e\u0432\u0430. 
tips.tip.gen.002 = \u041f\u043e\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0440\u0430\u0437\u043d\u044b\u0435 \u043c\u0430\u043a\u0435\u0442\u044b \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u0433\u043e \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \n\u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043a\u043d\u043e\u043f\u043e\u043a \u043d\u0430 \u0433\u043b\u0430\u0432\u043d\u043e\u0439 \u043f\u0430\u043d\u0435\u043b\u0438 \u0438\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u043e\u0432. 
tips.tip.gen.003 = Right click everywhere.\nHighlight text and right click it.\nA lot of ZAP functionality is context sensitive as best accessed this way.
tips.tip.gen.004 = \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0439\u0442\u0435 \u0441\u043e\u0447\u0435\u0442\u0430\u043d\u0438\u044f \u043a\u043b\u0430\u0432\u0438\u0448, \u0447\u0442\u043e\u0431\u044b \u0443\u0441\u043a\u043e\u0440\u0438\u0442\u044c \u0442\u0435\u0441\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 - \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0442\u044c \u0441\u0432\u043e\u0438 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043c\u0431\u0438\u043d\u0430\u0446\u0438\u0438 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u00ab\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b / \u041a\u043b\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0430\u00bb, \n\u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0442\u0430\u043a\u0436\u0435 \u0433\u0435\u043d\u0435\u0440\u0438\u0440\u0443\u0435\u0442 \u0440\u0430\u0441\u043f\u0435\u0447\u0430\u0442\u044b\u0432\u0430\u0435\u043c\u044b\u0435 \u0448\u043f\u0430\u0440\u0433\u0430\u043b\u043a\u0438 \u0441 \u0433\u043e\u0440\u044f\u0447\u0438\u043c\u0438 \u043a\u043b\u0430\u0432\u0438\u0448\u0430\u043c\u0438. 
tips.tip.gen.005 = If you are getting too many false positives try changing the threshold for that scan rule to High.\nBut also report the problem to us via the ZAP Users Group or Issues so we can investigate it - both of which are linked off the 'Online' menu
tips.tip.gen.007 = Add your target application to a Context using the 'right click' menu\: 'Include in Context'.\nThis allows you tell ZAP more about the target, such as the authentication, the users and the technology it uses.
tips.tip.gen.008 = ZAP can display, intercept and even fuzz client side messages including postMessages - 'right click' a subtree in the Sites tree and select a suitable submenu under 'Monitor clients'.\nForce a browser refresh and your open pages will be displayed in the 'Clients' tab along with all of the client side messages they generate.
tips.tip.gen.009 = Zest scripts are a great way to automate tasks.\nZest is ZAP's graphical macro language, but provides programming features like conditionals and loops.\nUse the 'Record a new Zest script...' button on the main toolbar to quickly record a new Zest script.\nYou can also 'right click' requests to add them to Zest scripts.
tips.tip.gen.010 = ZAP can automatically check for updates - turn it on via the 'Options / Check for Updates' screen.\nIf you dont want it to happen automatically then make sure you manually check for updates frequently via the 'Manage Add-ons' main toolbar button as we continually add new features and fix issues.
tips.tip.gen.011 = \u0429\u0435\u043b\u043a\u043d\u0438\u0442\u0435 \u0437\u043d\u0430\u0447\u043e\u043a \u0448\u0435\u0441\u0442\u0435\u0440\u0435\u043d\u043a\u0438 \u0441\u043f\u0440\u0430\u0432\u0430 \u043e\u0442 \u043c\u043d\u043e\u0433\u0438\u0445 \u0432\u043a\u043b\u0430\u0434\u043e\u043a, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u0441\u0442\u0440\u043e \u043f\u0435\u0440\u0435\u0439\u0442\u0438 \u043a \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0435 \u044d\u0442\u043e\u0439 \u0444\u0443\u043d\u043a\u0446\u0438\u0438. 
tips.tip.gen.012 = \u0415\u0441\u0442\u044c \u043c\u043d\u043e\u0433\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432, \u0441\u0432\u044f\u0437\u0430\u043d\u043d\u044b\u0445 \u0441 \u043c\u0435\u043d\u044e \u00ab\u041e\u043d\u043b\u0430\u0439\u043d\u00bb, \u0432\u043a\u043b\u044e\u0447\u0430\u044f \u0434\u043e\u043c\u0430\u0448\u043d\u044e\u044e \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0443 ZAP, \u0433\u0440\u0443\u043f\u043f\u044b \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u0435\u0439 \u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u043e\u0432. 
tips.tip.gen.013 = Want to chat to someone about ZAP?\nMany of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP has comprehensive help pages accessible via the 'Help / ZAP User Guide' menu.\nThe F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.015 = New to ZAP?\nRead the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = The majority of ZAP's tabs are now hidden by default so that the UI is less cluttered.\nYou can show and hide all of the tabs via buttons on the main toolbar.\nYou can also 'pin' any tab you like so that it stays visible even after a restart.
tips.tip.gen.017 = You can reorder table columns by dragging and dropping them.\nYou can also select which columns are show via the icon just above the scroll bar on the right hand side of each table.
tips.tip.gen.018 = \u0418\u043d\u0434\u0438\u043a\u0430\u0442\u043e\u0440 \u0440\u0443\u0447\u043d\u043e\u0433\u043e \u043f\u0440\u043e\u0441\u043c\u043e\u0442\u0440\u0430 - \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u044b, \u043d\u0430\u0439\u0434\u0435\u043d\u043d\u044b\u0435 \u043f\u0430\u0443\u043a\u0430\u043c\u0438 \u0438 \u043f\u0440\u0438\u043d\u0443\u0434\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u043c \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c, \u043f\u043e\u043c\u0435\u0447\u0430\u044e\u0442\u0441\u044f \u0432 \u0434\u0435\u0440\u0435\u0432\u0435 \u0441\u0430\u0439\u0442\u043e\u0432 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u043c \u0437\u043d\u0430\u0447\u043a\u043e\u043c. \u042d\u0442\u043e\u0442 \u0437\u043d\u0430\u0447\u043e\u043a \u0438\u0441\u0447\u0435\u0437\u0430\u0435\u0442, \u043a\u043e\u0433\u0434\u0430 \u0432\u044b \u043f\u043e\u0441\u0435\u0449\u0430\u0435\u0442\u0435 \u044d\u0442\u0443 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0443 \u0432\u0440\u0443\u0447\u043d\u0443\u044e. 
tips.tip.gen.019 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u0430\u043f\u0443\u0441\u043a\u0430\u0442\u044c \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u044b, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u043f\u0440\u043e\u043a\u0441\u0438-\u0441\u0435\u0440\u0432\u0435\u0440\u044b \u0447\u0435\u0440\u0435\u0437 ZAP \u0438 \u043d\u0435 \u043d\u0443\u0436\u0434\u0430\u044e\u0442\u0441\u044f \u0432 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 ZAP \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043a\u043d\u043e\u043f\u043a\u0438 \u00ab\u041e\u0431\u0437\u043e\u0440 \u0432\u0440\u0443\u0447\u043d\u0443\u044e\u00bb. 
tips.tip.gen.020 = \u0421\u0442\u0440\u0430\u043d\u0438\u0446\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u0432 Replacer \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u0431\u044b\u0441\u0442\u0440\u043e \u0438 \u043b\u0435\u0433\u043a\u043e \u0437\u0430\u043c\u0435\u043d\u044f\u0442\u044c \u0442\u0435\u043a\u0441\u0442 \u0432 \u043b\u044e\u0431\u043e\u043c \u043c\u0435\u0441\u0442\u0435 \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u044f HTTP (S). 

# HUD tips
tips.tip.hud.001 = Heads Up Display \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0438\u0432\u0430\u0435\u0442 \u0434\u043e\u0441\u0442\u0443\u043f \u043a\u043e \u0432\u0441\u0435\u043c \u043a\u043b\u044e\u0447\u0435\u0432\u044b\u043c \u0444\u0443\u043d\u043a\u0446\u0438\u044f\u043c ZAP \u0432 \u0432\u0430\u0448\u0435\u043c \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0435. 
tips.tip.hud.002 = \u041f\u0440\u043e\u0439\u0434\u0438\u0442\u0435 \u0440\u0443\u043a\u043e\u0432\u043e\u0434\u0441\u0442\u0432\u043e \u043f\u043e Heads Up Display - \u043e\u043d\u043e \u043e\u0445\u0432\u0430\u0442\u044b\u0432\u0430\u0435\u0442 \u0432\u0441\u0435 \u0444\u0443\u043d\u043a\u0446\u0438\u0438 HUD. 
tips.tip.hud.003 = HUD \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e \u043e\u0431\u043d\u043e\u0432\u043b\u044f\u0435\u0442\u0441\u044f - \u0434\u0435\u043b\u0438\u0442\u0435\u0441\u044c \u043e\u0442\u0437\u044b\u0432\u0430\u043c\u0438, \u0437\u0430\u043f\u0440\u043e\u0441\u0430\u043c\u0438 \u0444\u0443\u043d\u043a\u0446\u0438\u0439 \u0438 \u043f\u043e\u0434\u043d\u0438\u043c\u0430\u0439\u0442\u0435 \u0432\u043e\u043f\u0440\u043e\u0441\u044b \u0447\u0435\u0440\u0435\u0437 https\://github.com/zaproxy/zap-hud. 

# Obscure features
tips.tip.obs.001 = \u0412 \u0437\u0430\u043f\u0440\u043e\u0441\u0430\u0445 POST \u0435\u0441\u0442\u044c \u043c\u0435\u043d\u044e, \u0432\u044b\u0437\u044b\u0432\u0430\u0435\u043c\u043e\u0435 \u0449\u0435\u043b\u0447\u043a\u043e\u043c \u043f\u0440\u0430\u0432\u043e\u0439 \u043a\u043d\u043e\u043f\u043a\u0438 \u043c\u044b\u0448\u0438, \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0442\u0435\u0441\u0442\u043e\u0432\u043e\u0439 \u0444\u043e\u0440\u043c\u044b \u043f\u0440\u043e\u0442\u0438\u0432 CSRF. 
tips.tip.obs.002 = \u041a\u043d\u043e\u043f\u043a\u0430 "\u041f\u043e\u043a\u0430\u0437\u0430\u0442\u044c / \u0432\u043a\u043b\u044e\u0447\u0438\u0442\u044c" \u043f\u043e\u043b\u044f "\u043b\u0430\u043c\u043f\u043e\u0447\u043a\u0430" \u043d\u0430 \u0433\u043b\u0430\u0432\u043d\u043e\u0439 \u043f\u0430\u043d\u0435\u043b\u0438 \u0438\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u043e\u0432 \u0441\u0434\u0435\u043b\u0430\u0435\u0442 \u0441\u043a\u0440\u044b\u0442\u044b\u0435 \u043f\u043e\u043b\u044f \u0432\u0438\u0434\u0438\u043c\u044b\u043c\u0438 \u0438 \u043f\u043e\u0437\u0432\u043e\u043b\u0438\u0442 \u0432\u0430\u043c \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043e\u0442\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044b\u0435 \u043f\u043e\u043b\u044f. 
tips.tip.obs.003 = Does your application use anti CSRF tokens?\nMake sure you have configured ZAP to handle them via the 'Options / Active Scan' screen.
tips.tip.obs.004 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0441\u0440\u0430\u0432\u043d\u0438\u0442\u044c 2 \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0438\u043b\u0438 \u043e\u0442\u0432\u0435\u0442\u0430, \u0432\u044b\u0431\u0440\u0430\u0432 \u0438\u0445 \u043e\u0431\u0430, \u00ab\u0449\u0435\u043b\u043a\u043d\u0443\u0432 \u043f\u0440\u0430\u0432\u043e\u0439 \u043a\u043d\u043e\u043f\u043a\u043e\u0439 \u043c\u044b\u0448\u0438\u00bb \u0438 \u0432\u044b\u0431\u0440\u0430\u0432 \u043e\u0434\u0438\u043d \u0438\u0437 \u043f\u0443\u043d\u043a\u0442\u043e\u0432 \u043c\u0435\u043d\u044e \u00ab\u0421\u0440\u0430\u0432\u043d\u0438\u0442\u044c 2 ..\u00bb. 
tips.tip.obs.005 = You can tell ZAP to access an app using a specified user.\nTo do that you need to add your app to a Context and then define the authentication and user details.
tips.tip.obs.006 = \u0412\u043a\u043b\u0430\u0434\u043a\u0430 \u00ab\u041f\u043e\u0438\u0441\u043a\u00bb \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u043d\u0430\u0439\u0442\u0438 \u0441\u0442\u0440\u043e\u043a\u0443 \u0432 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0430\u0445 Fuzz - \u043e\u043d\u0430 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u044b\u0435 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f \u0438 \u043e\u0431\u0440\u0430\u0442\u043d\u043e\u0435 \u0441\u043e\u043f\u043e\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435. 
tips.tip.obs.007 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0438\u0441\u043a\u0430\u0442\u044c \u0442\u0435\u043a\u0441\u0442 \u0432 \u043b\u044e\u0431\u043e\u0439 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438, \u0432 \u0442\u043e\u043c \u0447\u0438\u0441\u043b\u0435 \u043d\u0430 \u0432\u043a\u043b\u0430\u0434\u043a\u0430\u0445 \u00ab\u0417\u0430\u043f\u0440\u043e\u0441\u00bb \u0438 \u00ab\u041e\u0442\u0432\u0435\u0442\u00bb, \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043c\u0435\u043d\u044e \u00ab\u041d\u0430\u0439\u0442\u0438 ...\u00bb, \u0449\u0435\u043b\u043a\u043d\u0443\u0432 \u043f\u0440\u0430\u0432\u043e\u0439 \u043a\u043d\u043e\u043f\u043a\u043e\u0439 \u043c\u044b\u0448\u0438. 
tips.tip.obs.008 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0432\u044b\u0434\u0435\u043b\u0435\u043d\u0438\u0435 \u0441\u0438\u043d\u0442\u0430\u043a\u0441\u0438\u0441\u0430, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u043c\u043e\u0435 \u0434\u043b\u044f \u0432\u043a\u043b\u0430\u0434\u043e\u043a \u041a\u043e\u043d\u0441\u043e\u043b\u044c \u0437\u0430\u043f\u0440\u043e\u0441\u0430, \u043e\u0442\u0432\u0435\u0442\u0430 \u0438 \u0441\u0446\u0435\u043d\u0430\u0440\u0438\u044f, \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043c\u0435\u043d\u044e \u00ab\u0421\u0438\u043d\u0442\u0430\u043a\u0441\u0438\u0441\u00bb, \u0449\u0435\u043b\u043a\u043d\u0443\u0432 \u043f\u0440\u0430\u0432\u043e\u0439 \u043a\u043d\u043e\u043f\u043a\u043e\u0439 \u043c\u044b\u0448\u0438. 
tips.tip.obs.009 = You can tell ZAP to load all of the scripts in a set of directories via the Scripts Option page.\nSee the help for details of the directory structure.
tips.tip.obs.010 = \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u044d\u043a\u0441\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0432\u0441\u0435 URL-\u0430\u0434\u0440\u0435\u0441\u0430, \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u043d\u044b\u0435 ZAP, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f \u043c\u0435\u043d\u044e \u0432\u0435\u0440\u0445\u043d\u0435\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f\: \u00ab\u041e\u0442\u0447\u0435\u0442 / \u042d\u043a\u0441\u043f\u043e\u0440\u0442 \u0432\u0441\u0435\u0445 URL-\u0430\u0434\u0440\u0435\u0441\u043e\u0432 \u0432 \u0444\u0430\u0439\u043b ...\u00bb 
tips.tip.obs.011 = You can invoke 3rd party tools like sqlmap and nmap from within ZAP, passing across a wide range of contextual information.\nJust configure the applications you want to invoke in the "Options / Applications" screen. 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u0421\u0435\u043a\u0440\u0435\u0442\u044b \u0438 \u0443\u043b\u043e\u0432\u043a\u0438
