# Strings used by the add-on
tips.desc					= \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438
tips.button.allTips			= \u0412\u0441\u0456 \u043f\u043e\u0440\u0430\u0434\u0438
tips.button.nextTip			= \u041d\u0430\u0441\u0442\u0443\u043f\u043d\u0430 \u043f\u043e\u0440\u0430\u0434\u0430
tips.dialog.title			= \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438
tips.topmenu.help.tips		= \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001 = \u0417\u0431\u0435\u0440\u0435\u0436\u0456\u0442\u044c \u0441\u0435\u0430\u043d\u0441 ZAP \u043d\u0430 \u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438, \u0430 \u043d\u0435 \u0432 \u043a\u0456\u043d\u0446\u0456 - \u0441\u0435\u0430\u043d\u0441 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0454\u0442\u044c\u0441\u044f \u0432 \u0431\u0430\u0437\u0456 \u0434\u0430\u043d\u0438\u0445, \u044f\u043a\u0430 \u0431\u0443\u0434\u0435 \u043f\u043e\u0441\u0442\u0456\u0439\u043d\u043e \u043e\u043d\u043e\u0432\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f, \u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u043d\u0435 \u0434\u043e\u0432\u0435\u0434\u0435\u0442\u044c\u0441\u044f \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0439\u043e\u0433\u043e \u0437\u043d\u043e\u0432\u0443.
tips.tip.gen.002 = \u0421\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0440\u0456\u0437\u043d\u0456 \u043c\u0430\u043a\u0435\u0442\u0438 \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043e\u043a \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432.
tips.tip.gen.003 = \u041d\u0430\u0442\u0438\u0441\u043d\u0456\u0442\u044c \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u0432\u0441\u044e\u0434\u0438.\n\
\n\
\u0412\u0438\u0434\u0456\u043b\u0456\u0442\u044c \u0442\u0435\u043a\u0441\u0442 \u0456 \u043d\u0430\u0442\u0438\u0441\u043d\u0456\u0442\u044c \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456.\n\
\n\
\u0411\u0430\u0433\u0430\u0442\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u0439 ZAP \u0454 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u043d\u043e-\u0437\u0430\u043b\u0435\u0436\u043d\u0438\u043c\u0438, \u0442\u043e\u043c\u0443 \u043d\u0430\u0439\u043a\u0440\u0430\u0449\u0435 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0443 \u0442\u0430\u043a\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431.
tips.tip.gen.004 = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u043a\u043b\u0430\u0432\u0456\u0448, \u0449\u043e\u0431 \u043f\u0440\u0438\u0448\u0432\u0438\u0434\u0448\u0438\u0442\u0438 \u0442\u0435\u0441\u0442\u0443\u0432\u0430\u043d\u043d\u044f - \u0432\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438 \u0432\u043b\u0430\u0441\u043d\u0456 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u00ab\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 / \u041a\u043b\u0430\u0432\u0456\u0430\u0442\u0443\u0440\u0430\u00bb, \u044f\u043a\u0430 \u0442\u0430\u043a\u043e\u0436 \u0433\u0435\u043d\u0435\u0440\u0443\u0454 \u0448\u0432\u0438\u0434\u043a\u0456 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457.
tips.tip.gen.005 = \u042f\u043a\u0449\u043e \u0432\u0438 \u043e\u0442\u0440\u0438\u043c\u0443\u0454\u0442\u0435 \u0437\u0430\u0431\u0430\u0433\u0430\u0442\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u043e\u0432\u0438\u0445 \u0441\u043f\u0440\u0430\u0446\u044c\u043e\u0432\u0443\u0432\u0430\u043d\u044c, \u0441\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0433\u0440\u0430\u043d\u0438\u0447\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430 \u0412\u0438\u0441\u043e\u043a\u0435.\n\
\n\
\u0410\u043b\u0435 \u0442\u0430\u043a\u043e\u0436 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u0442\u0435 \u043d\u0430\u043c \u043f\u0440\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443 \u0447\u0435\u0440\u0435\u0437 \u0433\u0440\u0443\u043f\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 ZAP \u0430\u0431\u043e \u00ab\u041f\u0440\u043e\u0431\u043b\u0435\u043c\u0438\u00bb, \u0449\u043e\u0431 \u043c\u0438 \u043c\u043e\u0433\u043b\u0438 \u0457\u0457 \u0434\u043e\u0441\u043b\u0456\u0434\u0438\u0442\u0438 \u2013 \u0446\u0456 \u043e\u0431\u0438\u0434\u0432\u0430 \u043f\u043e\u0441\u0438\u043b\u0430\u043d\u043d\u044f \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0456 \u0432 \u043c\u0435\u043d\u044e \u00ab\u041e\u043d\u043b\u0430\u0439\u043d\u00bb.
tips.tip.gen.007 = \u0414\u043e\u0434\u0430\u0439\u0442\u0435 \u0441\u0432\u0456\u0439 \u0446\u0456\u043b\u044c\u043e\u0432\u0438\u0439 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u0434\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443, \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0432\u0448\u0438 \u043c\u0435\u043d\u044e \u043a\u043b\u0430\u0446\u0430\u043d\u043d\u044f\u043c \u043d\u0430 \u043f\u0440\u0430\u0432\u0443 \u043a\u043b\u0430\u0432\u0456\u0448\u0443 \u043c\u0438\u0448\u0456 \u0442\u0430 \u0432\u0438\u0431\u0440\u0430\u0432\u0448\u0438 \u00ab\u0412\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0432 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u00bb.\n\
\n\
\u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u044c \u0432\u0430\u043c \u0440\u043e\u0437\u043f\u043e\u0432\u0456\u0441\u0442\u0438 ZAP \u0431\u0456\u043b\u044c\u0448\u0435 \u043f\u0440\u043e \u0446\u0456\u043b\u044c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u043f\u0440\u043e \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044e, \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0456 \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0456\u0457, \u044f\u043a\u0456 \u0432\u043e\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454.
tips.tip.gen.008 = ZAP \u043c\u043e\u0436\u0435 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438, \u043f\u0435\u0440\u0435\u0445\u043e\u043f\u043b\u044e\u0432\u0430\u0442\u0438 \u0442\u0430 \u043d\u0430\u0432\u0456\u0442\u044c \u0440\u043e\u0437\u043c\u0438\u0432\u0430\u0442\u0438 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0447\u0438 postMessages. \u041a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u043d\u0430 \u043f\u0456\u0434\u0434\u0435\u0440\u0435\u0432\u043e \u0432 \u0434\u0435\u0440\u0435\u0432\u0456 \u0441\u0430\u0439\u0442\u0456\u0432 \u0456 \u0432\u0438\u0431\u0435\u0440\u0456\u0442\u044c \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0435 \u043f\u0456\u0434\u043c\u0435\u043d\u044e \u0432 \u0440\u043e\u0437\u0434\u0456\u043b\u0456 \u00ab\u041c\u043e\u043d\u0456\u0442\u043e\u0440\u0438\u043d\u0433 \u043a\u043b\u0456\u0454\u043d\u0442\u0456\u0432\u00bb.\n\
\n\
\u041f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e \u043e\u043d\u043e\u0432\u0456\u0442\u044c \u0432\u0435\u0431-\u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0430\u0447, \u0456 \u0432\u0430\u0448\u0456 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438\u043c\u0443\u0442\u044c\u0441\u044f \u043d\u0430 \u0432\u043a\u043b\u0430\u0434\u0446\u0456 \u00ab\u041a\u043b\u0456\u0454\u043d\u0442\u0438\u00bb \u0440\u0430\u0437\u043e\u043c \u0456\u0437 \u0443\u0441\u0456\u043c\u0430 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f\u043c\u0438 \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0456 \u043a\u043b\u0456\u0454\u043d\u0442\u0430, \u044f\u043a\u0456 \u0432\u043e\u043d\u0438 \u0433\u0435\u043d\u0435\u0440\u0443\u044e\u0442\u044c.
tips.tip.gen.009 = Zest scripts are a great way to automate tasks.\n\
\n\
Zest is ZAP's graphical macro language, but provides programming features like conditionals and loops.\n\
\n\
Use the 'Record a new Zest script...' button on the main toolbar to quickly record a new Zest script.\n\
\n\
You can also 'right click' requests to add them to Zest scripts.
tips.tip.gen.010 = ZAP \u043c\u043e\u0436\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u0442\u0438 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u044c - \u0443\u0432\u0456\u043c\u043a\u043d\u0456\u0442\u044c \u0446\u044e \u0444\u0443\u043d\u043a\u0446\u0456\u044e \u043d\u0430 \u0435\u043a\u0440\u0430\u043d\u0456 \u00ab\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438/\u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0438\u0442\u0438 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u044c\u00bb.\n\
\n\
\u042f\u043a\u0449\u043e \u0432\u0438 \u043d\u0435 \u0445\u043e\u0447\u0435\u0442\u0435, \u0449\u043e\u0431 \u0446\u0435 \u0432\u0456\u0434\u0431\u0443\u0432\u0430\u043b\u043e\u0441\u044f \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0447\u0430\u0441\u0442\u043e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u0454\u0442\u0435 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u044c \u0432\u0440\u0443\u0447\u043d\u0443, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u0438  \u00ab\u041a\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f\u043c\u0438\u00bb, \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u043c\u0438 \u043f\u043e\u0441\u0442\u0456\u0439\u043d\u043e \u0434\u043e\u0434\u0430\u0454\u043c\u043e \u043d\u043e\u0432\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0442\u0430 \u0432\u0438\u0440\u0456\u0448\u0443\u0454\u043c\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438.
tips.tip.gen.011 = \u0429\u043e\u0431 \u0448\u0432\u0438\u0434\u043a\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u044c \u0446\u0456\u0454\u0457 \u0444\u0443\u043d\u043a\u0446\u0456\u0457, \u043a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u043f\u0456\u043a\u0442\u043e\u0433\u0440\u0430\u043c\u0443 \u0442\u0440\u0438\u0431, \u0440\u043e\u0437\u0442\u0430\u0448\u043e\u0432\u0430\u043d\u0443 \u043f\u0440\u0430\u0432\u043e\u0440\u0443\u0447 \u043d\u0430 \u0431\u0430\u0433\u0430\u0442\u044c\u043e\u0445 \u0432\u043a\u043b\u0430\u0434\u043a\u0430\u0445.
tips.tip.gen.012 = \u0423 \u043c\u0435\u043d\u044e \u00ab\u041e\u043d\u043b\u0430\u0439\u043d\u00bb \u0454 \u0431\u0430\u0433\u0430\u0442\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u0437\u043e\u043a\u0440\u0435\u043c\u0430 \u0434\u043e\u043c\u0430\u0448\u043d\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 ZAP, \u0433\u0440\u0443\u043f\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0456 \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0456\u0432.
tips.tip.gen.013 = Want to chat to someone about ZAP?\n\
\n\
Many of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP has comprehensive help pages accessible via the 'Help / OWASP ZAP User Guide' menu.\n\
\n\
The F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.015 = New to ZAP?\n\
\n\
Read the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = \u0411\u0456\u043b\u044c\u0448\u0456\u0441\u0442\u044c \u0432\u043a\u043b\u0430\u0434\u043e\u043a ZAP \u0442\u0435\u043f\u0435\u0440 \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u043e \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0443\u0432 \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0430\u0440\u0430\u0449\u0435\u043d\u0438\u043c. \n\
\n\
\u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u043e\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u043f\u0440\u0438\u0445\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0432\u0441\u0456 \u0432\u043a\u043b\u0430\u0434\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043e\u043a \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n\
\n\
\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u00ab\u0437\u0430\u043a\u0440\u0456\u043f\u0438\u0442\u0438\u00bb, \u0431\u0443\u0434\u044c-\u044f\u043a\u0443 \u0432\u043a\u043b\u0430\u0434\u043a\u0443, \u0449\u043e\u0431 \u0432\u043e\u043d\u0430 \u0437\u0430\u043b\u0438\u0448\u0430\u043b\u0430\u0441\u044f \u0432\u0438\u0434\u0438\u043c\u043e\u044e \u043d\u0430\u0432\u0456\u0442\u044c \u043f\u0456\u0441\u043b\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u043a\u0443.
tips.tip.gen.017 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u043f\u043e\u0440\u044f\u0434\u043e\u043a \u0441\u0442\u043e\u0432\u043f\u0446\u0456\u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0456, \u043f\u0435\u0440\u0435\u0442\u044f\u0433\u043d\u0443\u0432\u0448\u0438 \u0457\u0445.\n\
\n\
\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0438\u0431\u0440\u0430\u0442\u0438, \u044f\u043a\u0456 \u0441\u0442\u043e\u0432\u043f\u0446\u0456 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438\u043c\u0443\u0442\u044c\u0441\u044f, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043f\u0456\u043a\u0442\u043e\u0433\u0440\u0430\u043c\u0438 \u043d\u0430\u0434 \u0441\u043c\u0443\u0433\u043e\u044e \u043f\u0440\u043e\u043a\u0440\u0443\u0442\u043a\u0438 \u043f\u0440\u0430\u0432\u043e\u0440\u0443\u0447 \u0432\u0456\u0434 \u043a\u043e\u0436\u043d\u043e\u0457 \u0442\u0430\u0431\u043b\u0438\u0446\u0456.
tips.tip.gen.018 = Manual browse indicator - Pages found by the spiders and forced browser are flagged in the Sites tree with the relevant icon. This icon disappears when you visit that page manually.
tips.tip.gen.019 = You can launch browsers that automatically proxy through ZAP and do not need to have the ZAP certificate added via the 'Manual Explore' button.
tips.tip.gen.020 = The Replacer options page allows you to quickly and easily replace text anywhere in an HTTP(S) message.

# HUD tips
tips.tip.hud.001 = The Heads Up Display brings all of the key ZAP functionality into your browser.
tips.tip.hud.002 = Complete the Heads Up Display tutorial - it covers all of the HUD's features.
tips.tip.hud.003 = The HUD is constantly being updated - share feedback, feature requests and raise issues via https\://github.com/zaproxy/zap-hud

# Automation tips
tips.tip.aut.001 = ZAP is great for automation, but its easier to test features in the desktop UI first and then convert them to a script.
tips.tip.aut.002 = ZAP has a powerful API that covers nearly all of the features available in the desktop UI.
tips.tip.aut.003 = By default you cannot connect to ZAP on another machine, you will need to change the configs to allow remote connections.

# Obscure features
tips.tip.obs.001 = POST requests have a 'right click' menu for generating an anti CSRF test form.
tips.tip.obs.002 = The 'Show / enable' fields 'lightbulb' button on the main toolbar will make hidden fields visible and allow you to edit disabled fields.
tips.tip.obs.003 = Does your application use anti CSRF tokens?\n\
\n\
Make sure you have configured ZAP to handle them via the 'Options / Active Scan' screen.
tips.tip.obs.004 = You can compare 2 requests or responses by selecting them both, 'right clicking' and selecting one of the 'Compare 2..' menu items.
tips.tip.obs.005 = You can tell ZAP to access an app using a specified user.\n\
\n\
To do that you need to add your app to a Context and then define the authentication and user details.
tips.tip.obs.006 = The Search tab allows you to find string in Fuzz results - it supports regex expressions and inverse matching.
tips.tip.obs.007 = You can search for text in any text area, including the Request and Response tabs, using the 'right click' 'Find...' menu.  
tips.tip.obs.008 = You can change the syntax highlighting used for the Request, Response and Script Console tabs via the 'right click' 'Syntax' menus.
tips.tip.obs.009 = You can tell ZAP to load all of the scripts in a set of directories via the Scripts Option page.\n\
\n\
See the help for details of the directory structure.
tips.tip.obs.010 = You can export all of the URLs recorded by ZAP using the top level menu\: "Report / Export All URLs to a File..."
tips.tip.obs.011 = You can invoke 3rd party tools like sqlmap and nmap from within ZAP, passing across a wide range of contextual information.\n\
\n\
Just configure the applications you want to invoke in the "Options / Applications" screen. 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

# Optional add-ons
tips.tip.add.001 = Install the beta active and passive scan rules to find more potential issues.\n\
\n\
There are also alpha active and passive scan rules but obviously they may be less stable.
tips.tip.add.002 = Want to script ZAP in a scripting language other than Java Script and Zest?\n\
\n\
Check the ZAP Marketplace for other languages like python and ruby.\n\
\n\
If your preferred scripting language isnt yet available then get in touch - its fairly easy to add support for other languages.
tips.tip.add.003 = Install the SAML Add-on from the ZAP Marketplace to detect, show, edit and fuzz SAML requests.
tips.tip.add.004 = There are a large number of fuzzing files available in the ZAP Marketplace in the 'Directory List *', 'Fuzzdb files' and 'SVN Digger files' add-ons.
tips.tip.add.005 = There is a repository of ZAP scripts at https\://github.com/zaproxy/community-scripts\n\
\n\
If you clone a local copy then you can add all of them to ZAP via the Scripts Option pane.\n\
\n\
You can also upload your own scripts via pull requests - the more the better\! 
tips.tip.add.007 = Install the sequence add-on from the ZAP Marketplace to scan pages that must be visited in a specific order for the full functionality to be accessible.
tips.tip.add.008 = Install the accessControl add-on from the ZAP Marketplace to automate testing of your application's access control.
tips.tip.add.009 = You can import URLs contained in a text file using the importurls add-on available on the ZAP Marketplace
