# Strings used by the add-on
tips.button.allTips = \u0412\u0441\u0456 \u043f\u043e\u0440\u0430\u0434\u0438
tips.button.nextTip = \u041d\u0430\u0441\u0442\u0443\u043f\u043d\u0430 \u043f\u043e\u0440\u0430\u0434\u0430
tips.desc = \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438
tips.dialog.title = \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = \u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0431\u0435\u0442\u0430-\u0432\u0435\u0440\u0441\u0456\u0457 \u0430\u043a\u0442\u0438\u0432\u043d\u0438\u0445 \u0456 \u043f\u0430\u0441\u0438\u0432\u043d\u0438\u0445 \u043f\u0440\u0430\u0432\u0438\u043b \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u0449\u043e\u0431 \u0437\u043d\u0430\u0439\u0442\u0438 \u0431\u0456\u043b\u044c\u0448\u0435 \u043f\u043e\u0442\u0435\u043d\u0446\u0456\u0439\u043d\u0438\u0445 \u043f\u0440\u043e\u0431\u043b\u0435\u043c. \u0406\u0441\u043d\u0443\u044e\u0442\u044c \u0442\u0430\u043a\u043e\u0436 \u0430\u043b\u044c\u0444\u0430-\u0430\u043a\u0442\u0438\u0432\u043d\u0456 \u0442\u0430 \u043f\u0430\u0441\u0438\u0432\u043d\u0456 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f, \u0430\u043b\u0435, \u043e\u0447\u0435\u0432\u0438\u0434\u043d\u043e, \u0432\u043e\u043d\u0438 \u043c\u043e\u0436\u0443\u0442\u044c \u0431\u0443\u0442\u0438 \u043c\u0435\u043d\u0448 \u0441\u0442\u0430\u0431\u0456\u043b\u044c\u043d\u0438\u043c\u0438.
tips.tip.add.002 = \u0425\u043e\u0447\u0435\u0442\u0435 \u043d\u0430\u043f\u0438\u0441\u0430\u0442\u0438 \u0441\u043a\u0440\u0438\u043f\u0442 ZAP \u0456\u043d\u0448\u043e\u044e \u043c\u043e\u0432\u043e\u044e \u0441\u043a\u0440\u0438\u043f\u0442\u0456\u0432, \u043e\u043a\u0440\u0456\u043c Java Script \u0442\u0430 Zest?\n\u041f\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 ZAP Marketplace \u043d\u0430 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u0456\u043d\u0448\u0438\u0445 \u043c\u043e\u0432, \u0442\u0430\u043a\u0438\u0445 \u044f\u043a python \u0442\u0430 ruby.\n\u042f\u043a\u0449\u043e \u0432\u0430\u0448\u0430 \u0437\u0432\u0438\u0447\u043d\u0430 \u043c\u043e\u0432\u0430 \u0441\u043a\u0440\u0438\u043f\u0442\u0443 \u0449\u0435 \u043d\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430, \u0437\u0432'\u044f\u0436\u0456\u0442\u044c\u0441\u044f \u0437 \u043d\u0430\u043c\u0438 \u2014 \u0434\u043e\u0434\u0430\u0442\u0438 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0443 \u0456\u043d\u0448\u0438\u0445 \u043c\u043e\u0432 \u0434\u043e\u0441\u0438\u0442\u044c \u043f\u0440\u043e\u0441\u0442\u043e.
tips.tip.add.003 = \u0412\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f SAML \u0456\u0437 ZAP Marketplace, \u0449\u043e\u0431 \u0432\u0438\u044f\u0432\u043b\u044f\u0442\u0438, \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438, \u0440\u0435\u0434\u0430\u0433\u0443\u0432\u0430\u0442\u0438 \u0442\u0430 \u0440\u043e\u0437\u043c\u0438\u0432\u0430\u0442\u0438 \u0437\u0430\u043f\u0438\u0442\u0438 SAML.
tips.tip.add.004 = \u0423 ZAP Marketplace \u0454 \u0432\u0435\u043b\u0438\u043a\u0430 \u043a\u0456\u043b\u044c\u043a\u0456\u0441\u0442\u044c \u0444\u0430\u0439\u043b\u0456\u0432 \u0444\u0430\u0437\u0438\u043d\u0433\u0443, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0445 \u0443 \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f\u0445 "Directory List *", "Fuzzdb files" \u0456 "SVN Digger files".
tips.tip.add.005 = \u0421\u0445\u043e\u0432\u0438\u0449\u0435 \u0441\u043a\u0440\u0438\u043f\u0442\u0456\u0432 ZAP \u0437\u043d\u0430\u0445\u043e\u0434\u0438\u0442\u044c\u0441\u044f \u0437\u0430 \u0430\u0434\u0440\u0435\u0441\u043e\u044e https\://github.com/zaproxy/community-scripts.\n\u042f\u043a\u0449\u043e \u0432\u0438 \u043a\u043b\u043e\u043d\u0443\u0454\u0442\u0435 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0443 \u043a\u043e\u043f\u0456\u044e, \u0432\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0434\u043e\u0434\u0430\u0442\u0438 \u0432\u0441\u0456 \u0441\u043a\u0440\u0438\u043f\u0442\u0438 \u0434\u043e ZAP \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043f\u0430\u043d\u0435\u043b\u0456 Scripts Option.\n\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0432\u0430\u0442\u0438 \u0432\u043b\u0430\u0441\u043d\u0456 \u0441\u043a\u0440\u0438\u043f\u0442\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0437\u0430\u043f\u0438\u0442\u0456\u0432 \u043d\u0430 \u0432\u043d\u0435\u0441\u0435\u043d\u043d\u044f \u0437\u043c\u0456\u043d - \u0447\u0438\u043c \u0431\u0456\u043b\u044c\u0448\u0435, \u0442\u0438\u043c \u043a\u0440\u0430\u0449\u0435\!
tips.tip.add.007 = \u0412\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f \u043f\u043e\u0441\u043b\u0456\u0434\u043e\u0432\u043d\u043e\u0441\u0442\u0456 \u0437 ZAP Marketplace \u0434\u043b\u044f \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043e\u043a, \u044f\u043a\u0456 \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u0432\u0456\u0434\u0432\u0456\u0434\u0443\u0432\u0430\u0442\u0438 \u0432 \u043f\u0435\u0432\u043d\u043e\u043c\u0443 \u043f\u043e\u0440\u044f\u0434\u043a\u0443, \u0449\u043e\u0431 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043f\u043e\u0432\u043d\u043e\u0457 \u0444\u0443\u043d\u043a\u0446\u0456\u043e\u043d\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u0456.
tips.tip.add.008 = \u0412\u0441\u0442\u0430\u043d\u043e\u0432\u0456\u0442\u044c \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f AccessControl \u0437 ZAP Marketplace, \u0449\u043e\u0431 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0437\u0443\u0432\u0430\u0442\u0438 \u0442\u0435\u0441\u0442\u0443\u0432\u0430\u043d\u043d\u044f \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044e \u0434\u043e\u0441\u0442\u0443\u043f\u0443 \u0443 \u0432\u0430\u0448\u043e\u043c\u0443 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043a\u0443.
tips.tip.add.009 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0456\u043c\u043f\u043e\u0440\u0442\u0443\u0432\u0430\u0442\u0438 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u0449\u043e \u043c\u0456\u0441\u0442\u044f\u0442\u044c\u0441\u044f \u0432 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u043e\u043c\u0443 \u0444\u0430\u0439\u043b\u0456, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f importurls, \u044f\u043a\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0435 \u043d\u0430 ZAP Marketplace


# Automation tips
tips.tip.aut.001 = ZAP \u0447\u0443\u0434\u043e\u0432\u043e \u043f\u0456\u0434\u0445\u043e\u0434\u0438\u0442\u044c \u0434\u043b\u044f \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0437\u0430\u0446\u0456\u0457, \u0430\u043b\u0435 \u0441\u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043b\u0435\u0433\u0448\u0435 \u043f\u0440\u043e\u0442\u0435\u0441\u0442\u0443\u0432\u0430\u0442\u0438 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0432 \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0440\u043e\u0431\u043e\u0447\u043e\u0433\u043e \u0441\u0442\u043e\u043b\u0443, \u0430 \u043f\u043e\u0442\u0456\u043c \u043f\u0435\u0440\u0435\u0442\u0432\u043e\u0440\u0438\u0442\u0438 \u0457\u0445 \u043d\u0430 \u0441\u043a\u0440\u0438\u043f\u0442.
tips.tip.aut.002 = ZAP \u043c\u0430\u0454 \u043f\u043e\u0442\u0443\u0436\u043d\u0438\u0439 API, \u044f\u043a\u0438\u0439 \u043e\u0445\u043e\u043f\u043b\u044e\u0454 \u043c\u0430\u0439\u0436\u0435 \u0432\u0441\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0456 \u043d\u0430 \u0440\u043e\u0431\u043e\u0447\u043e\u043c\u0443 \u0441\u0442\u043e\u043b\u0456  \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430.
tips.tip.aut.003 = \u0417\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c \u0432\u0438 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0438\u0442\u0438\u0441\u044f \u0434\u043e ZAP \u043d\u0430 \u0456\u043d\u0448\u043e\u043c\u0443 \u043f\u0440\u0438\u0441\u0442\u0440\u043e\u0457, \u0432\u0430\u043c \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u0431\u0443\u0434\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u043a\u043e\u043d\u0444\u0456\u0433\u0443\u0440\u0430\u0446\u0456\u0457, \u0449\u043e\u0431 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u0438 \u0432\u0456\u0434\u0434\u0430\u043b\u0435\u043d\u0456 \u043f\u0456\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044f.

# General tips
tips.tip.gen.001 = \u0417\u0431\u0435\u0440\u0435\u0436\u0456\u0442\u044c \u0441\u0435\u0430\u043d\u0441 ZAP \u043d\u0430 \u043f\u043e\u0447\u0430\u0442\u043a\u0443 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0438, \u0430 \u043d\u0435 \u0432 \u043a\u0456\u043d\u0446\u0456 - \u0441\u0435\u0430\u043d\u0441 \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0454\u0442\u044c\u0441\u044f \u0432 \u0431\u0430\u0437\u0456 \u0434\u0430\u043d\u0438\u0445, \u044f\u043a\u0430 \u0431\u0443\u0434\u0435 \u043f\u043e\u0441\u0442\u0456\u0439\u043d\u043e \u043e\u043d\u043e\u0432\u043b\u044e\u0432\u0430\u0442\u0438\u0441\u044f, \u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u043d\u0435 \u0434\u043e\u0432\u0435\u0434\u0435\u0442\u044c\u0441\u044f \u0437\u0431\u0435\u0440\u0456\u0433\u0430\u0442\u0438 \u0439\u043e\u0433\u043e \u0437\u043d\u043e\u0432\u0443.
tips.tip.gen.002 = \u0421\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0440\u0456\u0437\u043d\u0456 \u043c\u0430\u043a\u0435\u0442\u0438 \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043e\u043a \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432.
tips.tip.gen.003 = \u041a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u0431\u0443\u0434\u044c-\u0434\u0435.\n\u0412\u0438\u0434\u0456\u043b\u0456\u0442\u044c \u0442\u0435\u043a\u0441\u0442 \u0456 \u043a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u0439\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456.\n\u0411\u0430\u0433\u0430\u0442\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u0439 ZAP \u0454 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u043d\u043e-\u0437\u0430\u043b\u0435\u0436\u043d\u0438\u043c\u0438, \u0442\u043e\u043c\u0443 \u043d\u0430\u0439\u043a\u0440\u0430\u0449\u0435 \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0443 \u0442\u0430\u043a\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431.
tips.tip.gen.004 = \u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u043a\u043b\u0430\u0432\u0456\u0448, \u0449\u043e\u0431 \u043f\u0440\u0438\u0448\u0432\u0438\u0434\u0448\u0438\u0442\u0438 \u0442\u0435\u0441\u0442\u0443\u0432\u0430\u043d\u043d\u044f - \u0432\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438 \u0432\u043b\u0430\u0441\u043d\u0456 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u00ab\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 / \u041a\u043b\u0430\u0432\u0456\u0430\u0442\u0443\u0440\u0430\u00bb, \u044f\u043a\u0430 \u0442\u0430\u043a\u043e\u0436 \u0433\u0435\u043d\u0435\u0440\u0443\u0454 \u0448\u0432\u0438\u0434\u043a\u0456 \u043a\u043e\u043c\u0431\u0456\u043d\u0430\u0446\u0456\u0457.
tips.tip.gen.005 = \u042f\u043a\u0449\u043e \u0432\u0438 \u043e\u0442\u0440\u0438\u043c\u0443\u0454\u0442\u0435 \u0437\u0430\u043d\u0430\u0434\u0442\u043e \u0431\u0430\u0433\u0430\u0442\u043e \u0445\u0438\u0431\u043d\u0438\u0445 \u043f\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0436\u0435\u043d\u044c, \u0441\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0433\u0440\u0430\u043d\u0438\u0447\u043d\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u043d\u044f \u0434\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f \u043d\u0430 \u0412\u0438\u0441\u043e\u043a\u0435.\n\u0410\u043b\u0435 \u0442\u0430\u043a\u043e\u0436 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u0442\u0435 \u043d\u0430\u043c \u043f\u0440\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443 \u0447\u0435\u0440\u0435\u0437 \u0433\u0440\u0443\u043f\u0443 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 ZAP \u0430\u0431\u043e \u0440\u043e\u0437\u0434\u0456\u043b "\u041f\u0440\u043e\u0431\u043b\u0435\u043c\u0438", \u0449\u043e\u0431 \u043c\u0438 \u043c\u043e\u0433\u043b\u0438 \u0457\u0457 \u0434\u043e\u0441\u043b\u0456\u0434\u0438\u0442\u0438 \u2014 \u043e\u0431\u0438\u0434\u0432\u0430 \u0446\u0456 \u043f\u0443\u043d\u043a\u0442\u0438 \u0437\u043d\u0430\u0445\u043e\u0434\u044f\u0442\u044c\u0441\u044f \u0443 \u043c\u0435\u043d\u044e "\u041e\u043d\u043b\u0430\u0439\u043d".
tips.tip.gen.007 = \u0414\u043e\u0434\u0430\u0439\u0442\u0435 \u0446\u0456\u043b\u044c\u043e\u0432\u0438\u0439 \u0434\u043e\u0434\u0430\u0442\u043e\u043a \u0434\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043c\u0435\u043d\u044e \u043f\u0440\u0430\u0432\u043e\u0457 \u043a\u043d\u043e\u043f\u043a\u0438 \u043c\u0438\u0448\u0456\: "\u0412\u043a\u043b\u044e\u0447\u0438\u0442\u0438 \u0434\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443".\n\u0426\u0435 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u044c \u0432\u0430\u043c \u0440\u043e\u0437\u043f\u043e\u0432\u0456\u0441\u0442\u0438 ZAP \u0431\u0456\u043b\u044c\u0448\u0435 \u043f\u0440\u043e \u0446\u0456\u043b\u044c, \u043d\u0430\u043f\u0440\u0438\u043a\u043b\u0430\u0434, \u043f\u0440\u043e \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044e, \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0456 \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0456\u0457, \u044f\u043a\u0456 \u0432\u043e\u043d\u0430 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454.
tips.tip.gen.008 = ZAP \u043c\u043e\u0436\u0435 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438, \u043f\u0435\u0440\u0435\u0445\u043e\u043f\u043b\u044e\u0432\u0430\u0442\u0438 \u0456 \u043d\u0430\u0432\u0456\u0442\u044c \u0440\u043e\u0437\u043c\u0438\u0432\u0430\u0442\u0438 \u043a\u043b\u0456\u0454\u043d\u0442\u0441\u044c\u043a\u0456 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f, \u0432\u043a\u043b\u044e\u0447\u0430\u044e\u0447\u0438 postMessages \u2014 \u043a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u043d\u0430 \u043f\u0456\u0434\u0434\u0435\u0440\u0435\u0432\u0456 \u0432 \u0434\u0435\u0440\u0435\u0432\u0456 \u0441\u0430\u0439\u0442\u0456\u0432 \u0456 \u0432\u0438\u0431\u0435\u0440\u0456\u0442\u044c \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0435 \u043f\u0456\u0434\u043c\u0435\u043d\u044e \u0432 \u0440\u043e\u0437\u0434\u0456\u043b\u0456 "\u041c\u043e\u043d\u0456\u0442\u043e\u0440\u0438\u043d\u0433 \u043a\u043b\u0456\u0454\u043d\u0442\u0456\u0432".\n\u041f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u043e \u043e\u043d\u043e\u0432\u0456\u0442\u044c \u0431\u0440\u0430\u0443\u0437\u0435\u0440, \u0456 \u0432\u0456\u0434\u043a\u0440\u0438\u0442\u0456 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0437\u044f\u0442\u044c\u0441\u044f \u043d\u0430 \u0432\u043a\u043b\u0430\u0434\u0446\u0456 "\u041a\u043b\u0456\u0454\u043d\u0442\u0438" \u0440\u0430\u0437\u043e\u043c \u0437 \u0443\u0441\u0456\u043c\u0430 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f\u043c\u0438, \u044f\u043a\u0456 \u0432\u043e\u043d\u0438 \u0433\u0435\u043d\u0435\u0440\u0443\u044e\u0442\u044c.
tips.tip.gen.009 = \u0421\u043a\u0440\u0438\u043f\u0442\u0438 Zest \u2014 \u0446\u0435 \u0447\u0443\u0434\u043e\u0432\u0438\u0439 \u0441\u043f\u043e\u0441\u0456\u0431 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0437\u0443\u0432\u0430\u0442\u0438 \u0437\u0430\u0432\u0434\u0430\u043d\u043d\u044f.\nZest \u2014 \u0446\u0435 \u0433\u0440\u0430\u0444\u0456\u0447\u043d\u0430 \u043c\u0430\u043a\u0440\u043e\u043c\u043e\u0432\u0430 ZAP, \u0430\u043b\u0435 \u0432\u043e\u043d\u0430 \u043d\u0430\u0434\u0430\u0454 \u0442\u0430\u043a\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443\u0432\u0430\u043d\u043d\u044f, \u044f\u043a \u0443\u043c\u043e\u0432\u043d\u0456 \u0443\u043c\u043e\u0432\u0438 \u0442\u0430 \u0446\u0438\u043a\u043b\u0438.\n\u0412\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0439\u0442\u0435 \u043a\u043d\u043e\u043f\u043a\u0443 "\u041d\u0430\u043f\u0438\u0441\u0430\u0442\u0438 \u043d\u043e\u0432\u0438\u0439 \u0441\u043a\u0440\u0438\u043f\u0442 Zest..." \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432, \u0449\u043e\u0431 \u0448\u0432\u0438\u0434\u043a\u043e \u043d\u0430\u043f\u0438\u0441\u0430\u0442\u0438 \u043d\u043e\u0432\u0438\u0439 \u0441\u043a\u0440\u0438\u043f\u0442 Zest.\n\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u043d\u0430\u0442\u0438\u0441\u043d\u0443\u0442\u0438 \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u043d\u0430 \u0437\u0430\u043f\u0438\u0442\u0430\u0445, \u0449\u043e\u0431 \u0434\u043e\u0434\u0430\u0442\u0438 \u0457\u0445 \u0434\u043e \u0441\u043a\u0440\u0438\u043f\u0442\u0456\u0432 Zest.
tips.tip.gen.010 = ZAP \u043c\u043e\u0436\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u0442\u0438 \u043d\u0430\u044f\u0432\u043d\u0456\u0441\u0442\u044c \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u044c \u2014 \u0443\u0432\u0456\u043c\u043a\u043d\u0456\u0442\u044c \u0446\u044e \u0444\u0443\u043d\u043a\u0446\u0456\u044e \u043d\u0430 \u0435\u043a\u0440\u0430\u043d\u0456 "\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 / \u041f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u0430 \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u044c".\n\u042f\u043a\u0449\u043e \u0432\u0438 \u043d\u0435 \u0445\u043e\u0447\u0435\u0442\u0435, \u0449\u043e\u0431 \u0446\u0435 \u0432\u0456\u0434\u0431\u0443\u0432\u0430\u043b\u043e\u0441\u044f \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e, \u043f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438 \u0447\u0430\u0441\u0442\u043e \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u044f\u0454\u0442\u0435 \u043e\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044f \u0432\u0440\u0443\u0447\u043d\u0443 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u0438 "\u041a\u0435\u0440\u0443\u0432\u0430\u043d\u043d\u044f \u0434\u043e\u043f\u043e\u0432\u043d\u0435\u043d\u043d\u044f\u043c\u0438" \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432, \u043e\u0441\u043a\u0456\u043b\u044c\u043a\u0438 \u043c\u0438 \u043f\u043e\u0441\u0442\u0456\u0439\u043d\u043e \u0434\u043e\u0434\u0430\u0454\u043c\u043e \u043d\u043e\u0432\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0442\u0430 \u0432\u0438\u043f\u0440\u0430\u0432\u043b\u044f\u0454\u043c\u043e \u043f\u043e\u043c\u0438\u043b\u043a\u0438.
tips.tip.gen.011 = \u0429\u043e\u0431 \u0448\u0432\u0438\u0434\u043a\u043e \u043e\u0442\u0440\u0438\u043c\u0430\u0442\u0438 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043d\u044c \u0446\u0456\u0454\u0457 \u0444\u0443\u043d\u043a\u0446\u0456\u0457, \u043a\u043b\u0430\u0446\u043d\u0456\u0442\u044c \u043f\u0456\u043a\u0442\u043e\u0433\u0440\u0430\u043c\u0443 \u0442\u0440\u0438\u0431, \u0440\u043e\u0437\u0442\u0430\u0448\u043e\u0432\u0430\u043d\u0443 \u043f\u0440\u0430\u0432\u043e\u0440\u0443\u0447 \u043d\u0430 \u0431\u0430\u0433\u0430\u0442\u044c\u043e\u0445 \u0432\u043a\u043b\u0430\u0434\u043a\u0430\u0445.
tips.tip.gen.012 = \u0423 \u043c\u0435\u043d\u044e \u00ab\u041e\u043d\u043b\u0430\u0439\u043d\u00bb \u0454 \u0431\u0430\u0433\u0430\u0442\u043e \u0440\u0435\u0441\u0443\u0440\u0441\u0456\u0432, \u0437\u043e\u043a\u0440\u0435\u043c\u0430 \u0434\u043e\u043c\u0430\u0448\u043d\u044f \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0430 ZAP, \u0433\u0440\u0443\u043f\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0456\u0432 \u0456 \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0456\u0432.
tips.tip.gen.013 = \u0425\u043e\u0447\u0435\u0442\u0435 \u043f\u043e\u0433\u043e\u0432\u043e\u0440\u0438\u0442\u0438 \u0437 \u043a\u0438\u043c\u043e\u0441\u044c \u043f\u0440\u043e ZAP?\n\u0411\u0430\u0433\u0430\u0442\u043e \u0437 \u043e\u0441\u043d\u043e\u0432\u043d\u0438\u0445 \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0456\u0432 ZAP \u0441\u043f\u0456\u043b\u043a\u0443\u044e\u0442\u044c\u0441\u044f \u043d\u0430 irc-\u043a\u0430\u043d\u0430\u043b\u0456 Libera Chat \#zaproxy\: https\://web.libera.chat/\#zaproxy.
tips.tip.gen.014 = ZAP has comprehensive help pages accessible via the 'Help / ZAP User Guide' menu.\nThe F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.015 = \u0412\u043f\u0435\u0440\u0448\u0435 \u0432 ZAP?\n\u041f\u0440\u043e\u0447\u0438\u0442\u0430\u0439\u0442\u0435 \u043f\u043e\u0441\u0456\u0431\u043d\u0438\u043a \u00ab\u041f\u043e\u0447\u0430\u0442\u043e\u043a \u0440\u043e\u0431\u043e\u0442\u0438 \u0437 ZAP\u00bb, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0438\u0439 \u0432 \u043c\u0435\u043d\u044e \u00ab\u0414\u043e\u0432\u0456\u0434\u043a\u0430\u00bb.
tips.tip.gen.016 = \u0411\u0456\u043b\u044c\u0448\u0456\u0441\u0442\u044c \u0432\u043a\u043b\u0430\u0434\u043e\u043a ZAP \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u043e \u0437\u0430 \u0437\u0430\u043c\u043e\u0432\u0447\u0443\u0432\u0430\u043d\u043d\u044f\u043c, \u0449\u043e\u0431 \u0456\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0431\u0443\u0432 \u043c\u0435\u043d\u0448 \u0437\u0430\u0445\u0430\u0440\u0430\u0449\u0435\u043d\u0438\u043c.\n\n\u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u043e\u043a\u0430\u0437\u0443\u0432\u0430\u0442\u0438 \u0430\u0431\u043e \u043f\u0440\u0438\u0445\u043e\u0432\u0443\u0432\u0430\u0442\u0438 \u0432\u0441\u0456 \u0432\u043a\u043b\u0430\u0434\u043a\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043e\u043a \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432.\n\n\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u00ab\u0437\u0430\u043a\u0440\u0456\u043f\u0438\u0442\u0438\u00bb \u0431\u0443\u0434\u044c-\u044f\u043a\u0443 \u0432\u043a\u043b\u0430\u0434\u043a\u0443, \u0449\u043e\u0431 \u0432\u043e\u043d\u0430 \u0437\u0430\u043b\u0438\u0448\u0430\u043b\u0430\u0441\u044f \u0432\u0438\u0434\u0438\u043c\u043e\u044e \u043d\u0430\u0432\u0456\u0442\u044c \u043f\u0456\u0441\u043b\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u043a\u0443.
tips.tip.gen.017 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u043f\u043e\u0440\u044f\u0434\u043e\u043a \u0441\u0442\u043e\u0432\u043f\u0446\u0456\u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0456, \u043f\u0435\u0440\u0435\u0442\u044f\u0433\u043d\u0443\u0432\u0448\u0438 \u0457\u0445.\n\n\u0412\u0438 \u0442\u0430\u043a\u043e\u0436 \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0438\u0431\u0440\u0430\u0442\u0438, \u044f\u043a\u0456 \u0441\u0442\u043e\u0432\u043f\u0446\u0456 \u0432\u0456\u0434\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u0438\u043c\u0443\u0442\u044c\u0441\u044f, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043f\u0456\u043a\u0442\u043e\u0433\u0440\u0430\u043c\u0438 \u043d\u0430\u0434 \u0441\u043c\u0443\u0433\u043e\u044e \u043f\u0440\u043e\u043a\u0440\u0443\u0442\u043a\u0438 \u043f\u0440\u0430\u0432\u043e\u0440\u0443\u0447 \u0432\u0456\u0434 \u043a\u043e\u0436\u043d\u043e\u0457 \u0442\u0430\u0431\u043b\u0438\u0446\u0456.
tips.tip.gen.018 = \u0406\u043d\u0434\u0438\u043a\u0430\u0442\u043e\u0440 \u0440\u0443\u0447\u043d\u043e\u0433\u043e \u043f\u0435\u0440\u0435\u0433\u043b\u044f\u0434\u0443 - \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0438, \u0437\u043d\u0430\u0439\u0434\u0435\u043d\u0456 \u043f\u0435\u0440\u0435\u0432\u0456\u0440\u043a\u043e\u044e \u0442\u0430 \u043f\u0440\u0438\u043c\u0443\u0441\u043e\u0432\u0438\u043c \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043e\u043c, \u043f\u043e\u0437\u043d\u0430\u0447\u0430\u044e\u0442\u044c\u0441\u044f \u0432 \u0432\u0443\u0437\u043b\u0456 \u0441\u0430\u0439\u0442\u0456\u0432 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u043d\u0438\u043c \u0437\u043d\u0430\u0447\u043a\u043e\u043c. \u0426\u0435\u0439 \u0437\u043d\u0430\u0447\u043e\u043a \u0437\u043d\u0438\u043a\u0430\u0454, \u043a\u043e\u043b\u0438 \u0432\u0438 \u0432\u0456\u0434\u0432\u0456\u0434\u0443\u0454\u0442\u0435 \u0441\u0442\u043e\u0440\u0456\u043d\u043a\u0443 \u0432\u0440\u0443\u0447\u043d\u0443.
tips.tip.gen.019 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u0430\u043f\u0443\u0441\u043a\u0430\u0442\u0438 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0438, \u044f\u043a\u0456 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u043d\u043e \u043f\u0440\u043e\u043a\u0441\u0456-\u0441\u0435\u0440\u0432\u0435\u0440\u0443\u044e\u0442\u044c \u0447\u0435\u0440\u0435\u0437 ZAP, \u0431\u0435\u0437 \u043f\u043e\u0442\u0440\u0435\u0431\u0438 \u0434\u043e\u0434\u0430\u0432\u0430\u0442\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0456\u043a\u0430\u0442 ZAP, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u0438 "\u0414\u043e\u0441\u043b\u0456\u0434\u0438\u0442\u0438 \u0432\u0440\u0443\u0447\u043d\u0443".
tips.tip.gen.020 = \u0421\u0442\u043e\u0440\u0456\u043d\u043a\u0430 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 \u0437\u0430\u043c\u0456\u043d\u044e\u0432\u0430\u0447\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0448\u0432\u0438\u0434\u043a\u043e \u0439 \u043b\u0435\u0433\u043a\u043e \u0437\u0430\u043c\u0456\u043d\u044e\u0432\u0430\u0442\u0438 \u0442\u0435\u043a\u0441\u0442 \u0431\u0443\u0434\u044c-\u0434\u0435 \u0432 \u043f\u043e\u0432\u0456\u0434\u043e\u043c\u043b\u0435\u043d\u043d\u044f\u0445 HTTP.

# HUD tips
tips.tip.hud.001 = Heads Up Display \u043d\u0430\u0434\u0430\u0454 \u0432\u0441\u044e \u043a\u043b\u044e\u0447\u043e\u0432\u0443 \u0444\u0443\u043d\u043a\u0446\u0456\u043e\u043d\u0430\u043b\u044c\u043d\u0456\u0441\u0442\u044c ZAP \u0443 \u0432\u0430\u0448\u043e\u043c\u0443 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0456.
tips.tip.hud.002 = \u0417\u0430\u0432\u0435\u0440\u0448\u0456\u0442\u044c \u043d\u0430\u0432\u0447\u0430\u043d\u043d\u044f Heads Up Display \u2014 \u0432\u043e\u043d\u043e \u043e\u0445\u043e\u043f\u043b\u044e\u0454 \u0432\u0441\u0456 \u0444\u0443\u043d\u043a\u0446\u0456\u0457 HUD.
tips.tip.hud.003 = HUD \u043f\u043e\u0441\u0442\u0456\u0439\u043d\u043e \u043e\u043d\u043e\u0432\u043b\u044e\u0454\u0442\u044c\u0441\u044f \u2014 \u0434\u0456\u043b\u0456\u0442\u044c\u0441\u044f \u0432\u0456\u0434\u0433\u0443\u043a\u0430\u043c\u0438, \u043f\u0440\u043e\u0445\u0430\u043d\u043d\u044f\u043c\u0438 \u043f\u0440\u043e \u0444\u0443\u043d\u043a\u0446\u0456\u0457 \u0442\u0430 \u043f\u0456\u0434\u0456\u0439\u043c\u0430\u0439\u0442\u0435 \u043f\u0438\u0442\u0430\u043d\u043d\u044f \u043d\u0430 https\://github.com/zaproxy/zap-hud.

# Obscure features
tips.tip.obs.001 = \u0423 POST-\u0437\u0430\u043f\u0438\u0442\u0430\u0445 \u0454 \u043c\u0435\u043d\u044e "\u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456" \u0434\u043b\u044f \u0441\u0442\u0432\u043e\u0440\u0435\u043d\u043d\u044f \u0444\u043e\u0440\u043c\u0438 \u0442\u0435\u0441\u0442\u0443 \u043d\u0430 \u0430\u043d\u0442\u0438-CSRF.
tips.tip.obs.002 = \u041a\u043d\u043e\u043f\u043a\u0430 "\u043b\u0430\u043c\u043f\u043e\u0447\u043a\u0430" "\u041f\u043e\u043a\u0430\u0437\u0430\u0442\u0438 / \u0443\u0432\u0456\u043c\u043a\u043d\u0443\u0442\u0438 \u043f\u043e\u043b\u044f"  \u043d\u0430 \u0433\u043e\u043b\u043e\u0432\u043d\u0456\u0439 \u043f\u0430\u043d\u0435\u043b\u0456 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0456\u0432 \u0437\u0440\u043e\u0431\u0438\u0442\u044c \u043f\u0440\u0438\u0445\u043e\u0432\u0430\u043d\u0456 \u043f\u043e\u043b\u044f \u0432\u0438\u0434\u0438\u043c\u0438\u043c\u0438 \u0442\u0430 \u0434\u043e\u0437\u0432\u043e\u043b\u0438\u0442\u044c \u0432\u0430\u043c \u0440\u0435\u0434\u0430\u0433\u0443\u0432\u0430\u0442\u0438 \u0432\u0438\u043c\u043a\u043d\u0435\u043d\u0456 \u043f\u043e\u043b\u044f.
tips.tip.obs.003 = \u0427\u0438 \u0432\u0438\u043a\u043e\u0440\u0438\u0441\u0442\u043e\u0432\u0443\u0454 \u0432\u0430\u0448\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430 \u0430\u043d\u0442\u0438-CSRF \u0442\u043e\u043a\u0435\u043d\u0438?\n\u041f\u0435\u0440\u0435\u043a\u043e\u043d\u0430\u0439\u0442\u0435\u0441\u044f, \u0449\u043e \u0432\u0438 \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0432\u0430\u043b\u0438 ZAP \u043d\u0430 \u0457\u0445 \u043e\u0431\u0440\u043e\u0431\u043a\u0443 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0435\u043a\u0440\u0430\u043d\u0430 "\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438 / \u0410\u043a\u0442\u0438\u0432\u043d\u0435 \u0441\u043a\u0430\u043d\u0443\u0432\u0430\u043d\u043d\u044f".
tips.tip.obs.004 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u043e\u0440\u0456\u0432\u043d\u044f\u0442\u0438 2 \u0437\u0430\u043f\u0438\u0442\u0438 \u0447\u0438 \u0432\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u0456, \u0432\u0438\u0431\u0440\u0430\u0432\u0448\u0438 \u0457\u0445 \u043e\u0431\u0438\u0434\u0432\u0430, \u043a\u043b\u0430\u0446\u043d\u0443\u0432\u0448\u0438 \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456 \u0442\u0430 \u0432\u0438\u0431\u0440\u0430\u0432\u0448\u0438 \u043e\u0434\u0438\u043d \u0456\u0437 \u043f\u0443\u043d\u043a\u0442\u0456\u0432 \u043c\u0435\u043d\u044e \u00ab\u041f\u043e\u0440\u0456\u0432\u043d\u044f\u0442\u0438 2..\u00bb.
tips.tip.obs.005 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0442\u0430\u043a, \u0449\u043e\u0431 ZAP \u043e\u0442\u0440\u0438\u043c\u0443\u0432\u0430\u0432 \u0434\u043e\u0441\u0442\u0443\u043f \u0434\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438 \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u0432\u043a\u0430\u0437\u0430\u043d\u043e\u0433\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430.\n\u0414\u043b\u044f \u0446\u044c\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0456\u0431\u043d\u043e \u0434\u043e\u0434\u0430\u0442\u0438 \u0441\u0432\u0456\u0439 \u0437\u0430\u0441\u0442\u043e\u0441\u0443\u043d\u043e\u043a \u0434\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443, \u0430 \u043f\u043e\u0442\u0456\u043c \u0432\u0438\u0437\u043d\u0430\u0447\u0438\u0442\u0438 \u0430\u0432\u0442\u0435\u043d\u0442\u0438\u0444\u0456\u043a\u0430\u0446\u0456\u044e \u0442\u0430 \u0434\u0430\u043d\u0456 \u043a\u043e\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430.
tips.tip.obs.006 = \u0412\u043a\u043b\u0430\u0434\u043a\u0430 "\u041f\u043e\u0448\u0443\u043a" \u0434\u043e\u0437\u0432\u043e\u043b\u044f\u0454 \u0437\u043d\u0430\u0439\u0442\u0438 \u0440\u044f\u0434\u043e\u043a \u0443 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\u0430\u0445 \u0444\u0430\u0437\u0438\u043d\u0433\u0443 \u2014 \u0432\u043e\u043d\u0430 \u043f\u0456\u0434\u0442\u0440\u0438\u043c\u0443\u0454 \u0440\u0435\u0433\u0443\u043b\u044f\u0440\u043d\u0456 \u0432\u0438\u0440\u0430\u0437\u0438 \u0442\u0430 \u0437\u0432\u043e\u0440\u043e\u0442\u043d\u0438\u0439 \u0437\u0431\u0456\u0433.
tips.tip.obs.007 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0448\u0443\u043a\u0430\u0442\u0438 \u0442\u0435\u043a\u0441\u0442 \u0443 \u0431\u0443\u0434\u044c-\u044f\u043a\u0456\u0439 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u0456\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0456, \u0437\u043e\u043a\u0440\u0435\u043c\u0430 \u0443 \u0432\u043a\u043b\u0430\u0434\u043a\u0430\u0445 "\u0417\u0430\u043f\u0438\u0442" \u0456 "\u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c", \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u043d\u043e\u0433\u043e \u043c\u0435\u043d\u044e "\u0417\u043d\u0430\u0439\u0442\u0438...", \u044f\u043a\u0435 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0454\u0442\u044c\u0441\u044f \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456.  
tips.tip.obs.008 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u043c\u0456\u043d\u0438\u0442\u0438 \u0432\u0438\u0434\u0456\u043b\u0435\u043d\u043d\u044f \u0441\u0438\u043d\u0442\u0430\u043a\u0441\u0438\u0441\u0443 \u0434\u043b\u044f \u0432\u043a\u043b\u0430\u0434\u043e\u043a "\u0417\u0430\u043f\u0438\u0442", "\u0412\u0456\u0434\u043f\u043e\u0432\u0456\u0434\u044c" \u0456 "Script Console" \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043c\u0435\u043d\u044e "\u0421\u0438\u043d\u0442\u0430\u043a\u0441\u0438\u0441", \u0449\u043e \u0432\u0456\u0434\u043a\u0440\u0438\u0432\u0430\u0454\u0442\u044c\u0441\u044f \u043f\u0440\u0430\u0432\u043e\u044e \u043a\u043d\u043e\u043f\u043a\u043e\u044e \u043c\u0438\u0448\u0456.
tips.tip.obs.009 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0437\u0440\u043e\u0431\u0438\u0442\u0438 \u0442\u0430\u043a, \u0449\u043e\u0431 ZAP \u0437\u0430\u0432\u0430\u043d\u0442\u0430\u0436\u0443\u0432\u0430\u0432 \u0432\u0441\u0456 \u0441\u043a\u0440\u0438\u043f\u0442\u0438 \u0432 \u043d\u0430\u0431\u0456\u0440 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0456\u0432 \u043d\u0430 \u0441\u0442\u043e\u0440\u0456\u043d\u0446\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456\u0432 \u0441\u043a\u0440\u0438\u043f\u0442\u0456\u0432.\n\u041f\u0435\u0440\u0435\u0433\u043b\u044f\u043d\u044c\u0442\u0435 \u0434\u043e\u0432\u0456\u0434\u043a\u0443, \u0449\u043e\u0431 \u0434\u0456\u0437\u043d\u0430\u0442\u0438\u0441\u044f \u0431\u0456\u043b\u044c\u0448\u0435 \u043f\u0440\u043e \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0443.
tips.tip.obs.010 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0435\u043a\u0441\u043f\u043e\u0440\u0442\u0443\u0432\u0430\u0442\u0438 \u0432\u0441\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438, \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u0456 ZAP, \u0437\u0430 \u0434\u043e\u043f\u043e\u043c\u043e\u0433\u043e\u044e \u043c\u0435\u043d\u044e \u0432\u0435\u0440\u0445\u043d\u044c\u043e\u0433\u043e \u0440\u0456\u0432\u043d\u044f\: "\u0417\u0432\u0456\u0442 / \u0415\u043a\u0441\u043f\u043e\u0440\u0442\u0443\u0432\u0430\u0442\u0438 \u0432\u0441\u0456 URL-\u0430\u0434\u0440\u0435\u0441\u0438 \u0434\u043e \u0444\u0430\u0439\u043b\u0443..."
tips.tip.obs.011 = \u0412\u0438 \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438 \u0456\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\u0438 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0456\u0445 \u0440\u043e\u0437\u0440\u043e\u0431\u043d\u0438\u043a\u0456\u0432, \u0442\u0430\u043a\u0456 \u044f\u043a sqlmap \u0456 nmap, \u0456\u0437 ZAP, \u043f\u0435\u0440\u0435\u0434\u0430\u044e\u0447\u0438 \u0448\u0438\u0440\u043e\u043a\u0438\u0439 \u0434\u0456\u0430\u043f\u0430\u0437\u043e\u043d \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u043d\u043e\u0457 \u0456\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0456\u0457.\n\u041f\u0440\u043e\u0441\u0442\u043e \u043d\u0430\u043b\u0430\u0448\u0442\u0443\u0439\u0442\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0438, \u044f\u043a\u0456 \u0432\u0438 \u0445\u043e\u0447\u0435\u0442\u0435 \u0432\u0438\u043a\u043b\u0438\u043a\u0430\u0442\u0438, \u043d\u0430 \u0435\u043a\u0440\u0430\u043d\u0456 \u00ab\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438/\u041f\u0440\u043e\u0433\u0440\u0430\u043c\u0438\u00bb.
tips.tip.obs.012 = \u041f\u0456\u0434\u0442\u0440\u0438\u043c\u043a\u0430 Docker - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u0430 \u043f\u0456\u0434\u043a\u0430\u0437\u043a\u0438
