# Strings used by the add-on
tips.button.allTips = T\u00fcm ipu\u00e7lar\u0131
tips.button.nextTip = Sonraki ipucu
tips.desc = \u0130pu\u00e7lar\u0131 ve p\u00fcf noktalar\u0131
tips.dialog.title = \u0130pu\u00e7lar\u0131 ve p\u00fcf noktalar\u0131

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = Install the beta active and passive scan rules to find more potential issues.\nThere are also alpha active and passive scan rules but obviously they may be less stable.
tips.tip.add.002 = Want to script ZAP in a scripting language other than Java Script and Zest?\nCheck the ZAP Marketplace for other languages like python and ruby.\nIf your preferred scripting language isnt yet available then get in touch - its fairly easy to add support for other languages.
tips.tip.add.003 = SAML y\u00fckleyin Add-on ZAP Marketplace, alg\u0131lamak g\u00f6steri d\u00fczenlemek ve t\u00fcylenme SAML istekleri.
tips.tip.add.004 = ZAP Pazarda mevcut t\u00fcylenme dosyalar\u0131n \u00e7ok say\u0131da 'Dizin listesi *', 'Fuzzdb dosyalar\u0131' ve 'SVN Digger dosyalar\u0131' eklentileri vard\u0131r.
tips.tip.add.005 = There is a repository of ZAP scripts at https\://github.com/zaproxy/community-scripts\nIf you clone a local copy then you can add all of them to ZAP via the Scripts Option pane.\nYou can also upload your own scripts via pull requests - the more the better\! 
tips.tip.add.007 = Dizisi y\u00fckleyin add-on ZAP Marketplace eri\u015filebilir olmas\u0131 i\u00e7in tam i\u015flevsellik i\u00e7in belirli bir s\u0131rayla gezilmesi gereken sayfalar\u0131 taramak i\u00e7in.
tips.tip.add.008 = AccessControl y\u00fckleyin add-on ZAP Marketplace uygulaman\u0131z\u0131n eri\u015fim kontrol\u00fc testini otomatik olarak.
tips.tip.add.009 = Sen importurls kullanarak bir metin dosyas\u0131nda bulunan URL'leri i\u00e7e aktarabilirsiniz eklenti mevcut ZAP Marketplace


# Automation tips
tips.tip.aut.001 = ZAP is great for automation, but its easier to test features in the desktop UI first and then convert them to a script.
tips.tip.aut.002 = ZAP has a powerful API that covers nearly all of the features available in the desktop UI.
tips.tip.aut.003 = By default you cannot connect to ZAP on another machine, you will need to change the configs to allow remote connections.

# General tips
tips.tip.gen.001 = Bir testin ba\u015f\u0131nda ziyade sonunda ZAP oturumu kaydet - oturumu al\u0131\u015fkanl\u0131k tekrar kaydetmek zorunda zaman t\u00fcm g\u00fcncellenecektir bir db saklan\u0131r.
tips.tip.gen.002 = Ana ara\u00e7 \u00e7ubu\u011fundaki d\u00fc\u011fmeleri arac\u0131l\u0131\u011f\u0131yla farkl\u0131 UI d\u00fczenleri deneyin.
tips.tip.gen.003 = Right click everywhere.\nHighlight text and right click it.\nA lot of ZAP functionality is context sensitive as best accessed this way.
tips.tip.gen.004 = Testinizi h\u0131zland\u0131rmak i\u00e7in klavye k\u0131sayollar\u0131n\u0131 kullan\u0131n - ayr\u0131ca yazd\u0131r\u0131labilir k\u0131sayol cheatsheets \u00fcretir 'Options / Klavye' \u00fczerinden kendi kombinasyonlar\u0131n\u0131 tan\u0131mlayabilirsiniz.
tips.tip.gen.005 = If you are getting too many false positives try changing the threshold for that scan rule to High.\nBut also report the problem to us via the ZAP Users Group or Issues so we can investigate it - both of which are linked off the 'Online' menu
tips.tip.gen.007 = Add your target application to a Context using the 'right click' menu\: 'Include in Context'.\nThis allows you tell ZAP more about the target, such as the authentication, the users and the technology it uses.
tips.tip.gen.008 = ZAP can display, intercept and even fuzz client side messages including postMessages - 'right click' a subtree in the Sites tree and select a suitable submenu under 'Monitor clients'.\nForce a browser refresh and your open pages will be displayed in the 'Clients' tab along with all of the client side messages they generate.
tips.tip.gen.009 = Zest scripts are a great way to automate tasks.\nZest is ZAP's graphical macro language, but provides programming features like conditionals and loops.\nUse the 'Record a new Zest script...' button on the main toolbar to quickly record a new Zest script.\nYou can also 'right click' requests to add them to Zest scripts.
tips.tip.gen.010 = ZAP can automatically check for updates - turn it on via the 'Options / Check for Updates' screen.\nIf you dont want it to happen automatically then make sure you manually check for updates frequently via the 'Manage Add-ons' main toolbar button as we continually add new features and fix issues.
tips.tip.gen.011 = H\u0131zl\u0131 bir \u015fekilde bu \u00f6zelli\u011fin ayar\u0131 eri\u015fmek i\u00e7in bir\u00e7ok sekmelerin sa\u011f taraftaki 'di\u015fli' simgesine t\u0131klay\u0131n. 
tips.tip.gen.012 = ZAP Anasayfa Kullan\u0131c\u0131 ve Geli\u015ftirici gruplar\u0131 dahil 'Online' men\u00fcs\u00fcn\u00fc, kapal\u0131 ba\u011flant\u0131l\u0131 kaynaklar\u0131n bir s\u00fcr\u00fc vard\u0131r
tips.tip.gen.013 = Want to chat to someone about ZAP?\nMany of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP has comprehensive help pages accessible via the 'Help / ZAP User Guide' menu.\nThe F1 key will also bring up the help pages and take you straight to the relevant section for the selected tab.
tips.tip.gen.015 = New to ZAP?\nRead the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = The majority of ZAP's tabs are now hidden by default so that the UI is less cluttered.\nYou can show and hide all of the tabs via buttons on the main toolbar.\nYou can also 'pin' any tab you like so that it stays visible even after a restart.
tips.tip.gen.017 = You can reorder table columns by dragging and dropping them.\nYou can also select which columns are show via the icon just above the scroll bar on the right hand side of each table.
tips.tip.gen.018 = Manual browse indicator - Pages found by the spiders and forced browser are flagged in the Sites tree with the relevant icon. This icon disappears when you visit that page manually.
tips.tip.gen.019 = You can launch browsers that automatically proxy through ZAP and do not need to have the ZAP certificate added via the 'Manual Explore' button.
tips.tip.gen.020 = The Replacer options page allows you to quickly and easily replace text anywhere in an HTTP(S) message.

# HUD tips
tips.tip.hud.001 = The Heads Up Display brings all of the key ZAP functionality into your browser.
tips.tip.hud.002 = Complete the Heads Up Display tutorial - it covers all of the HUD's features.
tips.tip.hud.003 = The HUD is constantly being updated - share feedback, feature requests and raise issues via https\://github.com/zaproxy/zap-hud

# Obscure features
tips.tip.obs.001 = POST requests have a 'right click' menu for generating an anti CSRF test form.
tips.tip.obs.002 = Ana ara\u00e7 \u00e7ubu\u011funda 'g\u00f6ster / etkinle\u015ftirmek' alanlar\u0131 'ampul' d\u00fc\u011fmesine gizli alanlar\u0131 g\u00f6r\u00fcn\u00fcr k\u0131lmak ve engelli alanlar\u0131 d\u00fczenlemek i\u00e7in izin verecektir.
tips.tip.obs.003 = Does your application use anti CSRF tokens?\nMake sure you have configured ZAP to handle them via the 'Options / Active Scan' screen.
tips.tip.obs.004 = Sen, 'sa\u011f t\u0131klayarak "ikisini de se\u00e7erek ve 2' kar\u015f\u0131la\u015ft\u0131r\u0131n .. 'men\u00fc \u00f6\u011felerinden birini se\u00e7erek 2 isteklerin veya yan\u0131tlar\u0131n kar\u015f\u0131la\u015ft\u0131rabilirsiniz.
tips.tip.obs.005 = You can tell ZAP to access an app using a specified user.\nTo do that you need to add your app to a Context and then define the authentication and user details.
tips.tip.obs.006 = Arama sekmesi Fuzz sonu\u00e7lar\u0131nda dize bulman\u0131z\u0131 sa\u011flar - bu regex ifadeler ve ters e\u015fle\u015ftirme destekler.
tips.tip.obs.007 = Sen sa\u011f klik 'Bul kullanarak Request ve Response sekmeler de dahil olmak \u00fczere herhangi bir metin alan\u0131nda metin, arayabilirsiniz ...' men\u00fcs\u00fcn\u00fc.  
tips.tip.obs.008 = Sen sa\u011f t\u0131klama 's\u00f6zdizimi' men\u00fcler arac\u0131l\u0131\u011f\u0131yla Request, M\u00fcdahale ve Senaryo Konsol sekmeler i\u00e7in kullan\u0131lan dizim de\u011fi\u015ftirebilirsiniz.
tips.tip.obs.009 = You can tell ZAP to load all of the scripts in a set of directories via the Scripts Option page.\nSee the help for details of the directory structure.
tips.tip.obs.010 = \u00dcst d\u00fczey men\u00fcs\u00fcn\u00fc kullanarak ZAP taraf\u0131ndan kaydedilen URL'lerin t\u00fcm verebilirsiniz\: "Rapor / Export Dosyaya t\u00fcm URL'ler ..."
tips.tip.obs.011 = You can invoke 3rd party tools like sqlmap and nmap from within ZAP, passing across a wide range of contextual information.\nJust configure the applications you want to invoke in the "Options / Applications" screen. 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u0130pu\u00e7lar\u0131 ve p\u00fcf noktalar\u0131
