# Strings used by the add-on
tips.button.allTips = \u6240\u6709\u63d0\u793a
tips.button.nextTip = \u4e0b\u4e00\u4e2a\u63d0\u793a
tips.desc = \u63d0\u793a\u548c\u6280\u5de7
tips.dialog.title = \u63d0\u793a\u548c\u6280\u5de7

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip

# Optional add-ons
tips.tip.add.001 = \u5b89\u88c5 beta\u7248 \u4e3b\u52a8\u548c\u88ab\u52a8\u626b\u63cf\u89c4\u5219\u4ee5\u53d1\u73b0\u66f4\u591a\u6f5c\u5728\u95ee\u9898\u3002\n\n\u8fd8\u6709 alpha\u7248 \u4e3b\u52a8\u548c\u88ab\u52a8\u626b\u63cf\u89c4\u5219\uff0c\u4f46\u663e\u7136\u5b83\u4eec\u53ef\u80fd\u66f4\u52a0\u4e0d\u7a33\u5b9a\u3002
tips.tip.add.002 = \u60f3\u7528 Java Script \u548c Zest \u4ee5\u5916\u7684\u811a\u672c\u8bed\u8a00\u7f16\u5199 ZAP \u811a\u672c\u5417\uff1f\n\n\u67e5\u770b ZAP \u5e02\u573a\u4ee5\u4e86\u89e3\u5176\u4ed6\u8bed\u8a00\uff0c\u4f8b\u5982 python \u548c ruby\u3002\n\n\u5982\u679c\u60a8\u9996\u9009\u7684\u811a\u672c\u8bed\u8a00\u5c1a\u4e0d\u53ef\u7528\uff0c\u8bf7\u8054\u7cfb - \u6dfb\u52a0\u5bf9\u5176\u4ed6\u8bed\u8a00\u7684\u652f\u6301\u76f8\u5f53\u5bb9\u6613\u3002
tips.tip.add.003 = \u4ece ZAP \u5e02\u573a\u5b89\u88c5 SAML \u9644\u52a0\u7ec4\u4ef6\u4ee5\u68c0\u6d4b\u3001\u663e\u793a\u3001\u7f16\u8f91\u548c\u6a21\u7cca\u6d4b\u8bd5 SAML \u8bf7\u6c42\u3002
tips.tip.add.004 = ZAP \u5e02\u573a\u7684\u201c\u76ee\u5f55\u5217\u8868 *\u201d\u3001\u201cFuzzdb \u6587\u4ef6\u201d\u548c\u201cSVN Digger \u6587\u4ef6\u201d\u9644\u52a0\u7ec4\u4ef6\u4e2d\u63d0\u4f9b\u4e86\u5927\u91cf\u6a21\u7cca\u6d4b\u8bd5\u6587\u4ef6\u3002
tips.tip.add.005 = ZAP \u811a\u672c\u5b58\u50a8\u5e93\u4f4d\u4e8e https\://github.com/zaproxy/community-scripts\n\n\u5982\u679c\u60a8\u514b\u9686\u672c\u5730\u526f\u672c\uff0c\u5219\u53ef\u4ee5\u901a\u8fc7\u201c\u811a\u672c\u9009\u9879\u201d\u7a97\u683c\u5c06\u5b83\u4eec\u5168\u90e8\u6dfb\u52a0\u5230 ZAP\u3002\n\n\u60a8\u8fd8\u53ef\u4ee5\u901a\u8fc7\u62c9\u53d6\u8bf7\u6c42\uff08pull request\uff09\u4e0a\u4f20\u81ea\u5df1\u7684\u811a\u672c - \u8d8a\u591a\u8d8a\u597d\uff01
tips.tip.add.007 = \u4eceZAP\u5e02\u573a\u5b89\u88c5Sequence\u9644\u52a0\u7ec4\u4ef6\uff0c\u7528\u5b83\u6765\u626b\u63cf\u5fc5\u987b\u6309\u7279\u5b9a\u987a\u5e8f\u8bbf\u95ee\u7684\u9875\u9762\uff0c\u4ee5\u83b7\u5f97\u5168\u90e8\u529f\u80fd\u3002
tips.tip.add.008 = \u4ece ZAP \u5e02\u573a\u5b89\u88c5 accessControl \u9644\u52a0\u7ec4\u4ef6\u4ee5\u81ea\u52a8\u6d4b\u8bd5\u5e94\u7528\u7a0b\u5e8f\u7684\u8bbf\u95ee\u63a7\u5236\u3002
tips.tip.add.009 = \u60a8\u53ef\u4ee5\u4f7f\u7528 ZAP \u5e02\u573a\u4e0a\u63d0\u4f9b\u7684 importurls \u9644\u52a0\u7ec4\u4ef6\u5bfc\u5165\u5305\u542b\u5728\u6587\u672c\u6587\u4ef6\u4e2d\u7684 URL


# Automation tips
tips.tip.aut.001 = ZAP \u975e\u5e38\u9002\u5408\u81ea\u52a8\u5316\uff0c\u4f46\u5b83\u66f4\u5bb9\u6613\u5148\u5728\u684c\u9762 UI \u4e2d\u6d4b\u8bd5\u529f\u80fd\uff0c\u7136\u540e\u5c06\u5b83\u4eec\u8f6c\u6362\u4e3a\u811a\u672c\u3002
tips.tip.aut.002 = ZAP \u6709\u4e00\u4e2a\u5f3a\u5927\u7684 API\uff0c\u6db5\u76d6\u4e86\u684c\u9762 UI \u4e2d\u51e0\u4e4e\u6240\u6709\u53ef\u7528\u7684\u529f\u80fd\u3002
tips.tip.aut.003 = \u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff0c\u60a8\u65e0\u6cd5\u8fde\u63a5\u5230\u53e6\u4e00\u53f0\u673a\u5668\u4e0a\u7684 ZAP\uff0c\u60a8\u9700\u8981\u66f4\u6539\u914d\u7f6e\u4ee5\u5141\u8bb8\u8fdc\u7a0b\u8fde\u63a5\u3002

# General tips
tips.tip.gen.001 = \u5728\u5f00\u59cb\u6d4b\u8bd5\u65f6\u4fdd\u5b58\u60a8\u7684ZAP\u4f1a\u8bdd\uff0c\u800c\u4e0d\u662f\u5728\u7ed3\u675f\u65f6-\u4f1a\u8bdd\u4f1a\u50a8\u5b58\u5728\u6570\u636e\u5e93\u4e2d\uff0c\u5b83\u5c06\u4efb\u4f55\u65f6\u95f4\u90fd\u5c06\u66f4\u65b0\uff0c\u56e0\u6b64\u60a8\u4e0d\u5fc5\u518d\u4fdd\u5b58\u5b83
tips.tip.gen.002 = \u901a\u8fc7\u4e3b\u5de5\u5177\u680f\u4e0a\u7684\u6309\u94ae\u5c1d\u8bd5\u4e0d\u540c\u7684UI\u5e03\u5c40
tips.tip.gen.003 = \u53f3\u952e\u5355\u51fb\u4efb\u4f55\u5730\u65b9\u3002\n\u9ad8\u4eae\u663e\u793a\u6587\u672c\u5e76\u53f3\u952e\u70b9\u51fb\u5b83\u3002\n\u8bb8\u591aZAP\u529f\u80fd\u662f\u4e0a\u4e0b\u6587\u654f\u611f\u7684\uff0c\u6700\u597d\u4ee5\u8fd9\u79cd\u65b9\u5f0f\u8bbf\u95ee\u3002
tips.tip.gen.004 = \u4f7f\u7528\u952e\u76d8\u5feb\u6377\u952e\u52a0\u901f\u60a8\u7684\u6d4b\u8bd5\u901f\u5ea6-\u60a8\u53ef\u4ee5\u901a\u8fc7"\u9009\u9879/\u952e\u76d8"\u5b9a\u4e49\u60a8\u81ea\u5df1\u7684\u7ec4\u5408\uff0c\u8fd9\u4f1a\u751f\u6210\u53ef\u6253\u5370\u7684\u5feb\u6377\u5217\u8868\u3002
tips.tip.gen.005 = \u5982\u679c\u60a8\u7684\u8bef\u62a5\u5f88\u591a\uff0c\u8bf7\u5c1d\u8bd5\u5c06\u8be5\u626b\u63cf\u89c4\u5219\u9608\u503c\u6539\u4e3a\u9ad8\u3002\u4e5f\u53ef\u4ee5\u901a\u8fc7ZAP\u7528\u6237\u7ec4\u6216\u95ee\u9898\u5411\u6211\u4eec\u62a5\u544a\u95ee\u9898\uff0c\u4ee5\u4fbf\u6211\u4eec\u5bf9\u5b83\u8fdb\u884c\u8c03\u67e5-\u8fd9\u4e24\u8005\u90fd\u8fde\u63a5\u5230\u201c\u8fde\u7ebf\u201d(Online)\u83dc\u5355
tips.tip.gen.007 = \u4f7f\u7528\u201c\u53f3\u952e\u5355\u51fb\u201d\u83dc\u5355\uff1a\u201c\u5305\u542b\u5728\u4e0a\u4e0b\u6587\u4e2d\u201d\u5c06\u76ee\u6807\u5e94\u7528\u7a0b\u5e8f\u6dfb\u52a0\u5230\u4e0a\u4e0b\u6587\u3002\n\u8fd9\u4f7f\u60a8\u53ef\u4ee5\u544a\u8bc9 ZAP \u6709\u5173\u76ee\u6807\u7684\u66f4\u591a\u4fe1\u606f\uff0c\u4f8b\u5982\u8eab\u4efd\u9a8c\u8bc1\u3001\u7528\u6237\u53ca\u5176\u4f7f\u7528\u7684\u6280\u672f\u3002
tips.tip.gen.008 = ZAP\u53ef\u4ee5\u663e\u793a\uff0c\u62e6\u622a\u751a\u81f3\u6a21\u7cca\u5ba2\u6237\u7684\u4fe1\u606f\uff0c\u5305\u62ecpostMessages-"\u5728\u7ad9\u70b9\u6811\u4e2d""\u53f3\u952e\u5355\u51fb\u201d\u4e00\u4e2a\u5b50\u6811\uff0c\u5e76\u5728\uff02\u76d1\u89c6\u5ba2\u6237\u7aef\uff02\u9009\u62e9\u4e00\u4e2a\u5408\u9002\u7684\u5b50\u83dc\u5355\u3002\u5f3a\u5236\u6d4f\u89c8\u5668\u5237\u65b0\uff0c\u5e76\u4e14\u6253\u5f00\u7684\u9875\u9762\u5c06\u663e\u793a\u5728"\u5ba2\u6237\u7aef"\u9009\u9879\u5361\u4e2d\uff0c\u4ee5\u53ca\u4ed6\u4eec\u751f\u6210\u7684\u6240\u6709\u5ba2\u6237\u7aef\u7684\u4fe1\u606f\u3002
tips.tip.gen.009 = Zest \u811a\u672c\u662f\u81ea\u52a8\u6267\u884c\u4efb\u52a1\u7684\u975e\u5e38\u597d\u7684\u65b9\u6cd5\u3002\n\nZest \u662f ZAP \u7684\u56fe\u5f62\u5b8f\u8bed\u8a00\uff0c\u4f46\u63d0\u4f9b\u4e86\u6761\u4ef6\u548c\u5faa\u73af\u7b49\u7f16\u7a0b\u529f\u80fd\u3002\n\n\u4f7f\u7528\u4e3b\u5de5\u5177\u680f\u4e0a\u7684 \u201c\u5f55\u5236\u65b0\u7684 Zest \u811a\u672c...\u201d \u6309\u94ae\u53ef\u4ee5\u5feb\u901f\u5f55\u5236\u65b0\u7684 Zest \u811a\u672c\u3002\n\n\u60a8\u8fd8\u53ef\u4ee5\u201c\u53f3\u952e\u5355\u51fb\u201d\u8bf7\u6c42\u4ee5\u5c06\u5b83\u4eec\u6dfb\u52a0\u5230 Zest \u811a\u672c\u4e2d\u3002
tips.tip.gen.010 = ZAP \u53ef\u4ee5\u81ea\u52a8\u68c0\u67e5\u66f4\u65b0 - \u901a\u8fc7\u201c\u9009\u9879/\u68c0\u67e5\u66f4\u65b0\u201d\u5c4f\u5e55\u6253\u5f00\u5b83\u3002\n\n\u5982\u679c\u60a8\u4e0d\u5e0c\u671b\u5b83\u81ea\u52a8\u8fd0\u884c\uff0c\u90a3\u4e48\u8bf7\u786e\u4fdd\u60a8\u7ecf\u5e38\u901a\u8fc7 \u201c\u7ba1\u7406\u52a0\u8f7d\u9879\u201d \u4e3b\u5de5\u5177\u680f\u6309\u94ae\u624b\u52a8\u68c0\u67e5\u66f4\u65b0\uff0c\u56e0\u4e3a\u6211\u4eec\u4f1a\u4e0d\u65ad\u6dfb\u52a0\u65b0\u529f\u80fd\u5e76\u4fee\u590d\u95ee\u9898\u3002
tips.tip.gen.011 = \u5355\u51fb\u8bb8\u591a\u9009\u9879\u5361\u53f3\u4fa7\u7684\u201c\u9f7f\u8f6e\u201d\u56fe\u6807\u53ef\u5feb\u901f\u8bbf\u95ee\u8be5\u529f\u80fd\u7684\u8bbe\u7f6e\u3002
tips.tip.gen.012 = \u6709\u5927\u91cf\u7684\u8d44\u6e90\u94fe\u63a5\u5230\u5728\u7ebf\u83dc\u5355\uff0c\u5305\u62ecZAP\u4e3b\u9875\uff0c\u7528\u6237\u7ec4\u548c\u5f00\u53d1\u7ec4\u3002
tips.tip.gen.013 = \u60f3\u548c\u67d0\u4eba\u804a\u804a ZAP\uff1f\n\n\u8bb8\u591a ZAP \u6838\u5fc3\u5f00\u53d1\u4eba\u5458\u90fd\u5728 Libera Chat \#zaproxy irc \u9891\u9053\u95f2\u901b\uff1ahttps\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP \u5177\u6709\u5168\u9762\u7684\u5e2e\u52a9\u9875\u9762\uff0c\u53ef\u901a\u8fc7 \u201c\u5e2e\u52a9/ZAP \u7528\u6237\u6307\u5357\u201d \u83dc\u5355\u8bbf\u95ee\u3002\n\nF1 \u952e\u8fd8\u5c06\u8c03\u51fa\u5e2e\u52a9\u9875\u9762\uff0c\u5e76\u76f4\u63a5\u5c06\u60a8\u5e26\u5230\u6240\u9009\u6807\u7b7e\u9875\u7684\u76f8\u5173\u90e8\u5206\u3002
tips.tip.gen.015 = ZAP \u7684\u65b0\u7528\u6237\uff1f\n\n\u53ef\u901a\u8fc7\u9605\u8bfb \u201c\u5e2e\u52a9\u201d \u83dc\u5355\u7684 \u201cZAP \u5165\u95e8\u201d \u6307\u5357\u6765\u5b66\u4e60\u3002
tips.tip.gen.016 = ZAP \u7684\u5927\u90e8\u5206\u6807\u7b7e\u9875\u73b0\u5728\u9ed8\u8ba4\u9690\u85cf\uff0c\u8fd9\u6837 UI \u5c31\u4e0d\u90a3\u4e48\u6df7\u4e71\u4e86\u3002\n\n\u60a8\u53ef\u4ee5\u901a\u8fc7\u4e3b\u5de5\u5177\u680f\u4e0a\u7684\u6309\u94ae\u663e\u793a\u548c\u9690\u85cf\u6240\u6709\u6807\u7b7e\u9875\u3002\n\n\u60a8\u8fd8\u53ef\u4ee5\u201c\u56fa\u5b9a\u201d\u60a8\u559c\u6b22\u7684\u4efb\u4f55\u6807\u7b7e\u9875\uff0c\u4ee5\u4fbf\u5373\u4f7f\u5728\u91cd\u65b0\u542f\u52a8\u540e\u5b83\u4e5f\u4fdd\u6301\u53ef\u89c1\u3002
tips.tip.gen.017 = \u53ef\u4ee5\u901a\u8fc7\u62d6\u653e\u6765\u91cd\u65b0\u6392\u5e8f\u5217\u8868\u3002\u60a8\u8fd8\u53ef\u4ee5\u901a\u8fc7\u5728\u6bcf\u4e2a\u8868\u7684\u53f3\u4fa7\u6eda\u52a8\u6761\u7684\u4e0a\u65b9\u7684\u56fe\u6807\u6765\u9009\u62e9\u663e\u793a\u54ea\u4e9b\u5217
tips.tip.gen.018 = \u624b\u52a8\u6d4f\u89c8\u6307\u793a\u5668 - Spider\u722c\u866b\u548c\u5f3a\u5236\u6d4f\u89c8\u5668\u627e\u5230\u7684\u9875\u9762\u5728\u7ad9\u70b9\u6811\u4e2d\u7528\u76f8\u5173\u56fe\u6807\u6807\u8bb0\u3002 \u5f53\u60a8\u624b\u52a8\u8bbf\u95ee\u8be5\u9875\u9762\u65f6\uff0c\u8be5\u56fe\u6807\u4f1a\u6d88\u5931\u3002
tips.tip.gen.019 = \u60a8\u53ef\u4ee5\u542f\u52a8\u901a\u8fc7 ZAP \u81ea\u52a8\u4ee3\u7406\u7684\u6d4f\u89c8\u5668\uff0c\u4e0d\u9700\u8981\u901a\u8fc7\u201c\u624b\u52a8\u6d4f\u89c8\u201d\u6309\u94ae\u6dfb\u52a0 ZAP \u8bc1\u4e66\u3002
tips.tip.gen.020 = \u66ff\u6362\u5668\uff08Replacer\uff09 \u9009\u9879\u9875\u9762\u5141\u8bb8\u60a8\u5feb\u901f\u8f7b\u677e\u5730\u66ff\u6362 HTTP(S) \u6d88\u606f\u4e2d\u4efb\u4f55\u4f4d\u7f6e\u7684\u6587\u672c\u3002

# HUD tips
tips.tip.hud.001 = \u5e73\u89c6\u663e\u793a\u5668\uff08HUD\uff09\u5c06\u6240\u6709\u5173\u952e\u7684 ZAP \u529f\u80fd\u5e26\u5165\u60a8\u7684\u6d4f\u89c8\u5668\u3002
tips.tip.hud.002 = \u5b8c\u6210\u5e73\u89c6\u663e\u793a\u5668\u6559\u7a0b - \u5b83\u6db5\u76d6\u4e86 HUD \u7684\u6240\u6709\u529f\u80fd\u3002
tips.tip.hud.003 = HUD \u4e0d\u65ad\u66f4\u65b0 - \u901a\u8fc7 https\://github.com/zaproxy/zap-hud \u5206\u4eab\u53cd\u9988\u3001\u529f\u80fd\u8bf7\u6c42\u548c\u63d0\u51fa\u95ee\u9898

# Obscure features
tips.tip.obs.001 = POST \u8bf7\u6c42\u6709\u4e00\u4e2a\u201c\u53f3\u952e\u5355\u51fb\u201d\u83dc\u5355\uff0c\u7528\u4e8e\u751f\u6210 \u9632-CSRF \u6d4b\u8bd5\u8868\u5355\u3002
tips.tip.obs.002 = \u4e3b\u5de5\u5177\u680f\u4e0a\u7684\u201c\u663e\u793a/\u542f\u7528 \u201d\u5b57\u6bb5 \u201c\u706f\u6ce1\u201d \u6309\u94ae\u5c06\u4f7f\u9690\u85cf\u5b57\u6bb5\u53ef\u89c1\uff0c\u5e76\u5141\u8bb8\u60a8\u7f16\u8f91\u7981\u7528\u7684\u5b57\u6bb5\u3002
tips.tip.obs.003 = \u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u662f\u5426\u4f7f\u7528 \u9632-CSRF \u4ee4\u724c\uff1f\n\n\u786e\u4fdd\u60a8\u5df2\u5c06 ZAP \u914d\u7f6e\u4e3a\u901a\u8fc7\u201c\u9009\u9879/\u4e3b\u52a8\u626b\u63cf\u201d\u5c4f\u5e55\u5904\u7406\u5b83\u4eec\u3002
tips.tip.obs.004 = \u60a8\u53ef\u4ee5\u901a\u8fc7 "\u53f3\u952e\u5355\u51fb" \u5e76\u9009\u62e9 "\u6bd4\u8f83 2..." \u83dc\u5355\u9879\u4e2d\u7684\u4e00\u9879\u6765\u6bd4\u8f83\u4e24\u4e2a\u8bf7\u6c42\u6216\u54cd\u5e94\u3002
tips.tip.obs.005 = \u60a8\u53ef\u4ee5\u544a\u8bc9 ZAP \u4f7f\u7528\u6307\u5b9a\u7528\u6237\u8bbf\u95ee\u5e94\u7528\u7a0b\u5e8f\u3002\n\n\u4e3a\u6b64\uff0c\u60a8\u9700\u8981\u5c06\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u6dfb\u52a0\u5230\u4e0a\u4e0b\u6587\u4e2d\uff0c\u7136\u540e\u5b9a\u4e49\u8eab\u4efd\u9a8c\u8bc1\u548c\u7528\u6237\u8be6\u7ec6\u4fe1\u606f\u3002
tips.tip.obs.006 = \u201c\u641c\u7d22\u201d\u9009\u9879\u5361\u5141\u8bb8\u60a8\u5728 Fuzz \u7ed3\u679c\u4e2d\u67e5\u627e\u5b57\u7b26\u4e32 - \u5b83\u652f\u6301\u6b63\u5219\u8868\u8fbe\u5f0f\u548c\u53cd\u5411\u5339\u914d\u3002
tips.tip.obs.007 = \u60a8\u53ef\u4ee5\u4f7f\u7528\u201c\u53f3\u952e\u5355\u51fb\u201d\u201c\u67e5\u627e...\u201d\u83dc\u5355\u5728\u4efb\u4f55\u6587\u672c\u533a\u57df\uff08\u5305\u62ec\u201c\u8bf7\u6c42\u201d\u548c\u201c\u54cd\u5e94\u201d\u9009\u9879\u5361\uff09\u4e2d\u641c\u7d22\u6587\u672c\u3002
tips.tip.obs.008 = \u60a8\u53ef\u4ee5\u901a\u8fc7\u201c\u53f3\u952e\u5355\u51fb\u201d\u201c\u8bed\u6cd5\u201d\u83dc\u5355\u66f4\u6539\u7528\u4e8e\u8bf7\u6c42\u3001\u54cd\u5e94\u548c\u811a\u672c\u63a7\u5236\u53f0\u9009\u9879\u5361\u7684\u8bed\u6cd5\u9ad8\u4eae\u663e\u793a\u3002
tips.tip.obs.009 = \u60a8\u53ef\u4ee5\u901a\u8fc7\u811a\u672c\u9009\u9879\u9875\u9762\u544a\u8bc9 ZAP \u52a0\u8f7d\u4e00\u7ec4\u76ee\u5f55\u4e2d\u7684\u6240\u6709\u811a\u672c\u3002\n\n\u6709\u5173\u76ee\u5f55\u7ed3\u6784\u7684\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u5e2e\u52a9\u3002
tips.tip.obs.010 = \u60a8\u53ef\u4ee5\u4f7f\u7528\u9876\u7ea7\u83dc\u5355\u5bfc\u51fa ZAP \u8bb0\u5f55\u7684\u6240\u6709 URL\uff1a\u201c\u62a5\u544a/\u5c06\u6240\u6709 URL \u5bfc\u51fa\u5230\u6587\u4ef6...\u201d
tips.tip.obs.011 = \u60a8\u53ef\u4ee5\u4ece ZAP \u4e2d\u8c03\u7528 sqlmap \u548c nmap \u7b49\u7b2c\u4e09\u65b9\u5de5\u5177\uff0c\u4f20\u9012\u8303\u56f4\u5e7f\u6cdb\u7684\u4e0a\u4e0b\u6587\u4fe1\u606f\u3002\n\n\u53ea\u9700\u5728 \u201c\u9009\u9879/\u5e94\u7528\u7a0b\u5e8f\u201d \u5c4f\u5e55\u4e2d\u914d\u7f6e\u60a8\u8981\u8c03\u7528\u7684\u5e94\u7528\u7a0b\u5e8f\u3002
tips.tip.obs.012 = Docker \u652f\u6301 - https\://www.zaproxy.org/docs/docker/

tips.topmenu.help.tips = \u63d0\u793a\u548c\u6280\u5de7
