# Strings used by the add-on
tips.desc					= Trucs et astuces
tips.button.allTips			= Tous les conseils
tips.button.nextTip			= Astuce suivante
tips.dialog.title			= Trucs et astuces
tips.topmenu.help.tips		= Trucs et astuces

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001 = Enregistrez votre session ZAP au d\u00e9but d'un test plut\u00f4t qu'\u00e0 la fin - la session est stock\u00e9e en base de donn\u00e9es, puis actualis\u00e9e en continu, de sorte que vous ne devez pas l'enregistrer r\u00e9guli\u00e8rement.
tips.tip.gen.002 = Essayez diff\u00e9rentes mises en page de l'interface utilisateur via les boutons de la barre d'outils principale.
tips.tip.gen.003 = Faites un clic droit partout dans ZAP. \n\
\n\
Surlignez un texte et faites un clic droit.\n\
\n\
De nombreuses fonctionnalit\u00e9s de ZAP sont accessibles par menu contextuel, qui offre l'acc\u00e8s le plus facile.
tips.tip.gen.004 = Utilisez les raccourcis clavier pour acc\u00e9l\u00e9rer vos tests - vous pouvez d\u00e9finir vos propres combinaisons via 'Options / clavier', qui permet aussi d'imprimer des pense-b\u00eates des raccourcis.
tips.tip.gen.005 = Si vous obtenez trop de faux positifs, essayezt en fixant \u00e0 Haut le seuil de cette r\u00e8gle d'analyse.\n\
\n\
Mais signalez-nous aussi le probl\u00e8me via le groupe d'utilisateurs de ZAP ou via le site des probl\u00e8mes, afin que nous puissions l'analyser - les deux sites figurent en liens dans le menu 'En ligne'
tips.tip.gen.007 = Ajoutez votre application cible dans un contexte en utilisant le menu contextuel par 'clic droit'\: 'Inclure dans le contexte'.\n\
\n\
Cela vous permet d'en dire plus \u00e0 ZAP sur la cible, comme l'authentification, les utilisateurs et la technologie utilis\u00e9e.
tips.tip.gen.008 = ZAP peut afficher, interceptern et m\u00eame robotiser les messages c\u00f4t\u00e9 client incorporant postMessages - faites un 'clic droit' sur une sous-arborescence dans l'arborescence des sites et s\u00e9lectionnez un sous-menu appropri\u00e9 sous 'Surveiller les clients'.\n\
\n\
Forcez une actualisation du navigateur et vos pages ouvertes seront affich\u00e9es dans l'onglet 'Clients', ainsi que tous les messages g\u00e9n\u00e9r\u00e9s c\u00f4t\u00e9 client.
tips.tip.gen.009 = Les scripts Zest sont un excellent moyen pour automatiser des t\u00e2ches.\n\
\n\
Zest est le langage de macro graphique de ZAP, mais il fournit des fonctionnalit\u00e9s de programmation comme les instructions conditionnelles et les boucles.\n\
\n\
Utilisez le bouton 'Enregistrer un nouveau script Zest...' de la barre d'outils principale pour enregistrer rapidement un nouveau script est.\n\
\n\
Vous pouvez \u00e9galement faire un 'clic droit'\u00bb sur les requ\u00eates pour les ajouter \u00e0 des scripts Zest.
tips.tip.gen.010 = ZAP peut v\u00e9rifier automatiquement les mises \u00e0 jour - activez-le via l'\u00e9cran 'Options / V\u00e9rifier les mises \u00e0 jour'.\n\
\n\
Si vous ne voulez pas de ces v\u00e9rifications automatiques, alors surveiller fr\u00e9quemment les mises \u00e0 jour via le bouton de la barre d'outils principale 'G\u00e9rer les accessoires', car nous ajoutons continuellement de nouvelles fonctionnalit\u00e9s et corrigeons les probl\u00e8mes.
tips.tip.gen.011 = Cliquez sur l'ic\u00f4ne \u00abgear\u00bb sur le c\u00f4t\u00e9 droit de nombreux onglets pour acc\u00e9der rapidement \u00e0 la configuration de la fonctionnalit\u00e9. 
tips.tip.gen.012 = De nombreuses ressources sont disponibles sous forme de liens dans le menu 'En ligne', notamment la page d'accueil ZAP, les groupes d'utilisateurs et de d\u00e9veloppeurs
tips.tip.gen.013 = Want to chat to someone about ZAP?\n\
\n\
Many of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP offre des pages d'aide compl\u00e8tes accessibles via le menu 'Aide / Guide utilisateur de OWASP ZAP'.\n\
\n\
La touche F1 va \u00e9galement faire appara\u00eetre les pages d'aide et vous am\u00e8ne directement \u00e0 la section pertinente pour l'onglet s\u00e9lectionn\u00e9.
tips.tip.gen.015 = New to ZAP?\n\
\n\
Read the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = La majorit\u00e9 des onglets de ZAP est d\u00e9sormais masqu\u00e9e par d\u00e9faut afin que l'interface utilisateur est moins encombr\u00e9.\n\
\n\
Vous pouvez afficher et masquer tous les onglets via des boutons sur la barre d'outils principale. \n\
\n\
Vous pouvez \u00e9galement \u00abverrouiller\u00bb n'importe quel onglet souhait\u00e9 afin qu'il reste visible m\u00eame apr\u00e8s un red\u00e9marrage.
tips.tip.gen.017 = Vous pouvez r\u00e9organiser les colonnes du tableau en faisant des glisser-d\u00e9poser des colonnes. \n\
\n\
Vous pouvez \u00e9galement s\u00e9lectionner les colonnes \u00e0 afficher via l'ic\u00f4ne juste au-dessus de la barre de d\u00e9filement sur le c\u00f4t\u00e9 droit de chaque table.
tips.tip.gen.018 = Manual browse indicator - Pages found by the spiders and forced browser are flagged in the Sites tree with the relevant icon. This icon disappears when you visit that page manually.
tips.tip.gen.019 = You can launch browsers that automatically proxy through ZAP and do not need to have the ZAP certificate added via the 'Manual Explore' button.
tips.tip.gen.020 = The Replacer options page allows you to quickly and easily replace text anywhere in an HTTP(S) message.

# HUD tips
tips.tip.hud.001 = The Heads Up Display brings all of the key ZAP functionality into your browser.
tips.tip.hud.002 = Complete the Heads Up Display tutorial - it covers all of the HUD's features.
tips.tip.hud.003 = The HUD is constantly being updated - share feedback, feature requests and raise issues via https\://github.com/zaproxy/zap-hud

# Automation tips
tips.tip.aut.001 = ZAP is great for automation, but its easier to test features in the desktop UI first and then convert them to a script.
tips.tip.aut.002 = ZAP has a powerful API that covers nearly all of the features available in the desktop UI.
tips.tip.aut.003 = By default you cannot connect to ZAP on another machine, you will need to change the configs to allow remote connections.

# Obscure features
tips.tip.obs.001 = POST requests have a 'right click' menu for generating an anti CSRF test form.
tips.tip.obs.002 = Le bouton \u00abampoule\u00bb 'Afficher / activer les champs' sur la barre d'outils principale permet de rendre visibles les champs masqu\u00e9s et vous permet d'\u00e9diter les champs d\u00e9sactiv\u00e9s.
tips.tip.obs.003 = Votre application utilise-t-elle des jetons anti-CSRF?\n\
\n\
Assurez-vous que vous avez configur\u00e9 ZAP dans l'\u00e9cran ' Options / Balayage actif' afin de traiter ces jetons.
tips.tip.obs.004 = Vous pouvez comparer 2 requ\u00eates ou r\u00e9ponses en les s\u00e9lectionnant toutes les deux, puis 'clic droit' et en s\u00e9lectionnant l'un des \u00e9l\u00e9ments de menu 'Comparer 2..'.
tips.tip.obs.005 = Vous pouvez demander \u00e0 ZAP d'acc\u00e9der \u00e0 une application \u00e0 l'aide d'un utilisateur sp\u00e9cifi\u00e9.\n\
\n\
Pour cela, vous devrez ajouter votre application \u00e0 un contexte, puis d\u00e9finir les d\u00e9tails de l'authentification et de l'utilisateur.
tips.tip.obs.006 = L'onglet 'Recherche' permet de rechercher une cha\u00eene dans les r\u00e9sultats de Fuzz - il prend en charge les expressions r\u00e9guli\u00e8res et la correspondance inverse.
tips.tip.obs.007 = Vous pouvez rechercher du texte dans n'importe quelle zone de texte, y compris dans les onglets requ\u00eates et r\u00e9ponses, en utilisant 'Rechercher...' du menu contextuel.  
tips.tip.obs.008 = Vous pouvez modifier la coloration syntaxique utilis\u00e9e pour les onglets Requ\u00eate, R\u00e9ponse et Console de Script via les menus 'Syntaxe' obtenus pas 'clic droit'.
tips.tip.obs.009 = Vous pouvez demander \u00e0 ZAP de charger tous les scripts ddepuis un ensemble de r\u00e9pertoires via la page Option de scripts.\n\
\n\
Consultez l'aide pour plus de d\u00e9tails sur la structure de r\u00e9pertoire.
tips.tip.obs.010 = Vous pouvez exporter toutes les URL enregistr\u00e9es par ZAP en utilisant le menu de niveau sup\u00e9rieur\: "Rapport / Exporter toutes les URL vers un fichier..."
tips.tip.obs.011 = Vous pouvez appeler des outils tiers comme sqlmap et nmap depuis ZAP, passant un large \u00e9ventail d'informations contextuelles.\n\
\n\
Il suffit de configurer les applications que vous souhaitez appeler dans l'\u00e9cran "Options / Applications". 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

# Optional add-ons
tips.tip.add.001 = Installez les r\u00e8gles d'analyse active et passive en version b\u00eata pour rechercher plus de probl\u00e8mes potentiels.\n\
\n\
Il y a aussi des r\u00e8gles de balayage actives et passives en version alpha, mais \u00e9videmment, elles seront probablement moins stables.
tips.tip.add.002 = Vous voulez un script ZAP dans un langage de script autre que Java Script et Zest?\n\
\n\
V\u00e9rifiez sur le march\u00e9 ZAP pour d'autres langages tels que python et ruby.\n\
\n\
Si votre langage de script pr\u00e9f\u00e9r\u00e9 n'est pas encore disponible, alors prenez contact - il est tr\u00e8s facile d'ajouter le support d'autres langages.
tips.tip.add.003 = Installez l'accessoire SAML depuis la foire aux modules de ZAP pour d\u00e9tecter, afficher, modifier et g\u00e9n\u00e9rer du bruit sur les requ\u00eates SAML.
tips.tip.add.004 = Il y a un grand nombre de fichiers de bruit disponibles sur la foire aux modules de ZAP, dans les accessoires 'Directory List *', 'Fuzzdb files' et 'SVN Digger files'.
tips.tip.add.005 = Il y a un d\u00e9p\u00f4t de scripts ZAP sur https\://github.com/zaproxy/community-script\n\
\n\
Si vous clonez une copie locale, alors vous pouvez ajouter tous les scripts \u00e0 ZAP via le volet Option de scripts.\n\
\n\
Vous pouvez \u00e9galement remonter vos propres scripts via des 'pull requests' - plus il y en a, mieux c'est\! 
tips.tip.add.007 = Installez l'accessoire Sequence depuis la foire aux modules de ZAP pour balayer des pages qui doivent \u00eatre visit\u00e9es dans un ordre sp\u00e9cifique afin que toutes les fonctions soient accessibles.
tips.tip.add.008 = Installez l'accessoire accessControl depuis la foire aux modules de ZAP pour automatiser les tests de contr\u00f4le d'acc\u00e8s de votre application.
tips.tip.add.009 = Vous pouvez importer des URLs contenues dans un fichier texte \u00e0 l'aide de l'accessoire importurls disponible sur la foire aux modules de ZAP
