# Strings used by the add-on
tips.desc					= \u09aa\u09b0\u09be\u09ae\u09b0\u09cd\u09b6 \u098f\u09ac\u0982 \u0995\u09cc\u09b6\u09b2
tips.button.allTips			= \u09b8\u0995\u09b2 \u09aa\u09b0\u09be\u09ae\u09b0\u09cd\u09b6 \u0997\u09c1\u09b2\u09be
tips.button.nextTip			= \u09aa\u09b0\u09c7\u09b0 \u09aa\u09b0\u09be\u09ae\u09b0\u09cd\u09b6 \u099f\u09bf
tips.dialog.title			= \u09aa\u09b0\u09be\u09ae\u09b0\u09cd\u09b6 \u098f\u09ac\u0982 \u0995\u09cc\u09b6\u09b2
tips.topmenu.help.tips		= \u09aa\u09b0\u09be\u09ae\u09b0\u09cd\u09b6 \u098f\u09ac\u0982 \u0995\u09cc\u09b6\u09b2

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001 = \u0986\u09aa\u09a8\u09be\u09b0 ZAP \u09b8\u09c7\u09b6\u09a8 \u099f\u09bf \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be\u09b0 \u09b6\u09c7\u09b7\u09c7\u09b0 \u09ac\u09a6\u09b2\u09c7 \u09b6\u09c1\u09b0\u09c1\u09a4\u09c7 \u09b8\u0982\u09b0\u0995\u09cd\u09b7\u09a8 \u0995\u09b0\u09c7 \u09b0\u09be\u0996\u09c1\u09a8 - \u098f\u0987 \u09b8\u09c7\u09b6\u09a8 \u099f\u09bf db \u09a4\u09c7 \u099c\u09ae\u09be \u09b9\u09ac\u09c7 \u09af\u09be \u09b8\u09ac\u09b8\u09ae\u09df \u09b9\u09be\u09b2\u09a8\u09be\u0997\u09be\u09a6\u0995\u09c3\u09a4 \u09b9\u09df\u09c7 \u09a5\u09be\u0995\u09c7 \u09af\u09c7\u09a8 \u0986\u09aa\u09a8\u09be\u0995\u09c7 \u098f\u099f\u09bf \u09aa\u09c1\u09a8\u09b0\u09be\u09df \u09b8\u0982\u09b0\u0995\u09cd\u09b7\u09a8 \u09a8\u09be \u0995\u09b0\u09a4\u09c7 \u09b9\u09df\u0964
tips.tip.gen.002 = \u09aa\u09cd\u09b0\u09a7\u09be\u09a8 \u099f\u09c1\u09b2\u09ac\u09be\u09b0\u09c7 \u09a5\u09be\u0995\u09be \u09ac\u09cb\u09a4\u09be\u09ae \u0997\u09c1\u09b2\u09be \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09ac\u09bf\u09ad\u09bf\u09a8\u09cd\u09a8 \u09a7\u09b0\u09a3\u09c7\u09b0 UI \u09b2\u09c7\u0986\u0989\u099f \u099a\u09c7\u09b7\u09cd\u099f\u09be \u0995\u09b0\u09c1\u09a8\u0964
tips.tip.gen.003 = \u09b8\u09ac\u099c\u09be\u09df\u0997\u09be\u09df \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c1\u09a8\u0964\n\
\u099f\u09c7\u0995\u09cd\u09b8\u099f \u0995\u09c7 \u09b9\u09be\u0987\u09b2\u09be\u0987\u099f \u0995\u09b0\u09c1\u09a8 \u098f\u09ac\u0982 \u09b8\u09c7\u099f\u09be\u09a4\u09c7 \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c1\u09a8\u0964\n\
ZAP \u098f\u09b0 \u09aa\u09cd\u09b0\u099a\u09c1\u09b0 \u09aa\u09b0\u09bf\u09ae\u09be\u09a3 \u0995\u09be\u09b0\u09cd\u09af\u0995\u09be\u09b0\u09bf\u09a4\u09be \u0995\u09a8\u09cd\u099f\u09c7\u0995\u09cd\u09b8\u099f \u09b8\u0982\u09ac\u09c7\u09a6\u09a8\u09b6\u09c0\u09b2 \u09b9\u0993\u09df\u09be\u09df \u098f\u09ad\u09be\u09ac\u09c7 \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6 \u0995\u09b0\u09be\u099f\u09be\u0987 \u0989\u09a4\u09cd\u09a4\u09ae \u0989\u09aa\u09be\u09df\u0964
tips.tip.gen.004 = \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u0997\u09a4\u09bf \u09a6\u09cd\u09b0\u09c1\u09a4 \u0995\u09b0\u09a4\u09c7 \u0995\u09bf\u09ac\u09cb\u09b0\u09cd\u09a1 \u09b6\u09b0\u09cd\u099f\u0995\u09be\u099f \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8 - \u0986\u09aa\u09a8\u09bf 'Options / Keyboard' \u098f\u09b0 \u09ae\u09be\u09a7\u09cd\u09af\u09ae\u09c7 \u09a8\u09bf\u099c\u09b8\u09cd\u09ac \u0995\u09c0 \u098f\u09b0 \u09b8\u09ae\u09be\u09b9\u09be\u09b0 \u099a\u09bf\u09b9\u09cd\u09a8\u09bf\u09a4 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09af\u09be \u09b8\u09be\u09a5\u09c7 \u09b8\u09be\u09a5\u09c7 \u09ae\u09c1\u09a6\u09cd\u09b0\u09a3\u09af\u09cb\u0997\u09cd\u09af \u099a\u09bf\u099f\u09b6\u09bf\u099f \u098f\u09b0 \u09b6\u09b0\u09cd\u099f\u0995\u09be\u099f \u0993 \u09a4\u09c8\u09b0\u09bf \u0995\u09b0\u09c7\u0964 
tips.tip.gen.005 = \u0986\u09aa\u09a8\u09bf \u09af\u09a6\u09bf \u0985\u09a8\u09c7\u0995 \u09ac\u09c7\u09b6\u09bf \u0987\u09a4\u09bf\u09ac\u09be\u099a\u0995 \u09ae\u09bf\u09a5\u09cd\u09af\u09be \u09aa\u09c7\u09a4\u09c7 \u09a5\u09be\u0995\u09c7\u09a8 \u09a4\u09be\u09b9\u09b2\u09c7 \u09b8\u09cd\u0995\u09cd\u09af\u09be\u09a8 \u09a8\u09bf\u09df\u09ae\u09c7\u09b0 \u09a5\u09cd\u09b0\u09c7\u09b8\u09b9\u09cb\u09b2\u09cd\u09a1 \u099f\u09bf \u0989\u099a\u09cd\u099a \u09ae\u09be\u09a8\u09c7 \u09aa\u09b0\u09bf\u09ac\u09b0\u09cd\u09a4\u09a8 \u0995\u09b0\u09c7 \u09a6\u09c7\u0996\u09c1\u09a8\u0964\n\
\u0995\u09bf\u09a8\u09cd\u09a4\u09c1 \u09b8\u09be\u09a5\u09c7 \u09b8\u09be\u09a5\u09c7 ZAP \u098f\u09b0 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0 \u0997\u09cd\u09b0\u09c1\u09aa \u098f \u09b8\u09c7\u0987 \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u09b8\u09ae\u09cd\u09aa\u09b0\u09cd\u0995\u09c7 \u098f\u0995\u099f\u09bf \u09aa\u09cd\u09b0\u09a4\u09bf\u09ac\u09c7\u09a6\u09a8 \u0995\u09b0\u09c1\u09a8 \u09af\u09c7\u09a8 \u0986\u09ae\u09b0\u09be \u09b8\u09c7\u099f\u09bf\u09b0 \u09a4\u09a6\u09a8\u09cd\u09a4 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09bf - \u09af\u09be\u09b0 \u0989\u09ad\u09df \u099f\u09bf\u0987 Online \u09ae\u09c7\u09a8\u09c1 \u09a4\u09c7 \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09be \u0986\u099b\u09c7
tips.tip.gen.007 = 'right click' \u09ae\u09c7\u09a8\u09c1 \u09a5\u09c7\u0995\u09c7  'Include in Context' \u0985\u09aa\u09b6\u09a8 \u099f\u09bf \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u098f\u0995\u099f\u09bf \u0995\u09a8\u099f\u09c7\u0995\u09cd\u09b8\u099f \u098f \u0986\u09aa\u09a8\u09be\u09b0 \u09b2\u0995\u09cd\u09b7\u09cd\u09af \u0995\u09b0\u09be \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8 \u099f\u09bf \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09c1\u09a8\u0964  \n\
\n\
\u098f\u099f\u09bf \u0986\u09aa\u09a8\u09be\u0995\u09c7 ZAP \u0995\u09c7 \u0986\u09aa\u09a8\u09be\u09b0 \u09b2\u0995\u09cd\u09b7\u09cd\u09af \u09b8\u09ae\u09cd\u09aa\u09b0\u09cd\u0995\u09c7 \u0986\u09b0\u0993 \u09ac\u09c7\u09b6\u09bf \u09ac\u09b2\u09a4\u09c7 \u09b8\u09ae\u09cd\u09ae\u09a4\u09bf \u09a6\u09c7\u09df, \u09af\u09c7\u09ae\u09a8 \u09b8\u09a4\u09cd\u09af \u09af\u09be\u099a\u09be\u0987\u09df\u09c7\u09b0 \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be, \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09bf \u098f\u09ac\u0982 \u09af\u09c7 \u09aa\u09cd\u09b0\u09af\u09c1\u0995\u09cd\u09a4\u09bf \u098f\u099f\u09bf \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964
tips.tip.gen.008 = ZAP \u0995\u09cd\u09b2\u09be\u09df\u09c7\u09a8\u09cd\u099f \u098f\u09b0 \u09a6\u09bf\u0995\u09c7\u09b0 \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u098f\u09ac\u0982 \u09b8\u09be\u09a5\u09c7 \u09b8\u09be\u09a5\u09c7 post\u09ac\u09be\u09b0\u09cd\u09a4\u09be \u0997\u09c1\u09b2\u09be\u0995\u09c7 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8, \u09ac\u09be\u09a7\u09be \u09a6\u09be\u09a8 \u098f\u09ae\u09a8\u0995\u09bf fuzz \u0993 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 - \u09b8\u09be\u0987\u099f \u099f\u09cd\u09b0\u09bf \u098f\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u09b8\u09be\u09ac\u099f\u09cd\u09b0\u09bf \u09a4\u09c7 \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c1\u09a8 \u098f\u09ac\u0982 'Monitor clients' \u098f\u09b0 \u09a8\u09bf\u099a\u09c7 \u098f\u0995\u099f\u09bf \u0989\u09aa\u09af\u09c1\u0995\u09cd\u09a4 \u09b8\u09be\u09ac\u09ae\u09c7\u09a8\u09c1 \u09a8\u09bf\u09b0\u09cd\u09ac\u09be\u099a\u09a8 \u0995\u09b0\u09c1\u09a8\u0964\n\
\n\
\u098f\u0995\u099f\u09bf \u09ac\u09cd\u09b0\u09be\u0989\u099c\u09be\u09b0 \u0995\u09c7 \u099c\u09cb\u09b0 \u09aa\u09c1\u09b0\u09cd\u09ac\u0995 \u09b0\u09bf\u09ab\u09cd\u09b0\u09c7\u09b6 \u0995\u09b0\u09be\u09a8 \u098f\u09ac\u0982 \u0986\u09aa\u09a8\u09be\u09b0 \u0996\u09cb\u09b2\u09be \u09aa\u09be\u09a4\u09be \u0997\u09c1\u09b2\u09be \u0995\u09cd\u09b2\u09be\u09df\u09c7\u09a8\u09cd\u099f \u099f\u09cd\u09af\u09be\u09ac\u09c7 \u09a6\u09c7\u0996\u09be\u09ac\u09c7 \u09b8\u09be\u09a5\u09c7 \u09a4\u09c8\u09b0\u09bf\u0995\u09c3\u09a4 \u09b8\u0995\u09b2 \u0995\u09cd\u09b2\u09be\u09df\u09c7\u09a8\u09cd\u099f \u098f\u09b0 \u09aa\u09be\u09b6\u09c7\u09b0 \u09a6\u09bf\u0995\u09c7\u09b0 \u09ac\u09be\u09b0\u09cd\u09a4\u09be \u0997\u09c1\u09b2\u09be\u0964
tips.tip.gen.009 = Zest \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0997\u09c1\u09b2\u09be \u09b8\u09cd\u09ac\u09df\u0982\u0995\u09cd\u09b0\u09bf\u09df \u0995\u09be\u099c \u0995\u09b0\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u098f\u0995\u099f\u09bf \u0985\u09a8\u09c7\u0995 \u0989\u09a4\u09cd\u09a4\u09ae \u0989\u09aa\u09be\u09df\u0964\n\
\n\
Zest \u09b9\u09b2 ZAP \u098f\u09b0 \u0997\u09cd\u09b0\u09be\u09ab\u09bf\u0995\u09cd\u09af\u09be\u09b2 \u09ae\u09cd\u09af\u09be\u0995\u09cd\u09b0 \u09ad\u09be\u09b7\u09be, \u0995\u09bf\u09a8\u09cd\u09a4\u09c1 \u098f\u099f\u09bf \u0995\u09a8\u09cd\u09a1\u09bf\u09b6\u09a8\u09be\u09b2 \u098f\u09ac\u0982 \u09b2\u09c1\u09aa \u098f\u09b0 \u09ae\u09a4\u09cb \u09aa\u09cd\u09b0\u09cb\u0997\u09cd\u09b0\u09be\u09ae\u09bf\u0982 \u09ac\u09c8\u09b6\u09bf\u09b7\u09cd\u099f \u09aa\u09cd\u09b0\u09a6\u09be\u09a8 \u0995\u09b0\u09c7\u0964\n\
\n\
\u09ae\u09c7\u0987\u09a8 \u099f\u09c1\u09b2\u09ac\u09be\u09b0\u09c7 \u09a5\u09be\u0995\u09be 'Record a new Zest script...' \u09ac\u09cb\u09a4\u09be\u09ae \u099f\u09bf \u09a6\u09cd\u09b0\u09c1\u09a4 \u098f\u0995\u099f\u09bf Zest \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u09b0\u09c7\u0995\u09b0\u09cd\u09a1 \u0995\u09b0\u09a4\u09c7 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c1\u09a8\u0964\n\
\n\
\u0986\u09aa\u09a8\u09bf \u0985\u09a8\u09c1\u09b0\u09cb\u09a7 \u09ac\u09cb\u09a4\u09be\u09ae \u098f \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c7 \u09a4\u09be\u09a6\u09c7\u09b0 \u0995\u09c7 Zest \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u098f \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964
tips.tip.gen.010 = ZAP \u09b8\u09cd\u09ac\u09df\u0982\u0995\u09cd\u09b0\u09bf\u09df \u09ad\u09be\u09ac\u09c7 \u09b9\u09be\u09b2\u09a8\u09be\u0997\u09be\u09a6 \u098f\u09b0 \u099c\u09a8\u09cd\u09af \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7 - 'Options / Check for Updates' \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09a8\u09c7\u09b0 \u09ae\u09be\u09a7\u09cd\u09af\u09ae\u09c7 \u09b8\u09c7\u099f\u09bf \u099a\u09be\u09b2\u09c1 \u0995\u09b0\u09c7 \u09b0\u09be\u0996\u09c1\u09a8\u0964 \n\
\n\
\u0986\u09aa\u09a8\u09bf \u09af\u09a6\u09bf \u09b8\u09cd\u09ac\u09df\u0982\u0995\u09cd\u09b0\u09bf\u09df \u09ad\u09be\u09ac\u09c7 \u098f\u099f\u09be \u0995\u09b0\u09a4\u09c7 \u09a8\u09be \u099a\u09be\u09a8 \u09a4\u09be\u09b9\u09b2\u09c7 \u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u09ad\u09be\u09ac\u09c7 \u09ae\u09be\u099d\u09c7 \u09ae\u09be\u099d\u09c7 \u09b9\u09be\u09b2\u09a8\u09be\u0997\u09be\u09a6\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u0995\u09b0\u09c1\u09a8 \u09aa\u09cd\u09b0\u09a7\u09be\u09a8 \u099f\u09c1\u09b2\u09ac\u09be\u09b0\u09c7 \u09a5\u09be\u0995\u09be 'Manage Add-ons' \u09ac\u09cb\u09a4\u09be\u09ae \u09a6\u09cd\u09ac\u09be\u09b0\u09be, \u09af\u09c7\u09b9\u09c7\u09a4\u09c1 \u0986\u09ae\u09b0\u09be \u0995\u09cd\u09b0\u09ae\u09be\u0997\u09a4 \u09a8\u09a4\u09c1\u09a8 \u09ac\u09c8\u09b6\u09bf\u09b7\u09cd\u099f \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09bf \u098f\u09ac\u0982 \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u09b8\u09ae\u09be\u09a7\u09be\u09a8 \u0995\u09b0\u09bf\u0964
tips.tip.gen.011 = \u099f\u09cd\u09af\u09be\u09ac \u0997\u09c1\u09b2\u09be\u09b0 \u09a1\u09be\u09a8 \u09aa\u09be\u09b6\u09c7\u09b0 \u09a6\u09bf\u0995\u09c7\u09b0 gear \u0986\u0987\u0995\u09a8\u09c7 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c1\u09a8 \u09a6\u09cd\u09b0\u09c1\u09a4\u09a4\u09be\u09b0 \u09b8\u09be\u09a5\u09c7 \u0990 \u09ac\u09c8\u09b6\u09bf\u09b7\u09cd\u099f\u09c7\u09b0 \u09b8\u09c7\u099f\u09bf\u0982 \u098f \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6 \u0995\u09b0\u09a4\u09c7\u0964
tips.tip.gen.012 = \u098f\u0996\u09be\u09a8\u09c7 \u09aa\u09cd\u09b0\u099a\u09c1\u09b0 \u09aa\u09b0\u09bf\u09ae\u09be\u09a3\u09c7 \u09b8\u0982\u09b8\u09cd\u09a5\u09be\u09a8 'Online' \u09ae\u09c7\u09a8\u09c1\u09a4\u09c7 \u09af\u09c1\u0995\u09cd\u09a4 \u0986\u099b\u09c7, \u09b8\u09be\u09a5\u09c7 \u0986\u099b\u09c7 ZAP \u098f\u09b0 \u09b9\u09cb\u09ae\u09aa\u09c7\u099c, \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0 \u098f\u09ac\u0982 \u09a1\u09c7\u09ad\u09c7\u09b2\u09aa\u09be\u09b0 \u09a6\u09b2 
tips.tip.gen.013 = Want to chat to someone about ZAP?\n\
\n\
Many of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP \u098f\u09b0 \u09ac\u09cd\u09af\u09be\u09aa\u0995 \u0986\u0995\u09be\u09b0\u09c7\u09b0 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u09aa\u09be\u09a4\u09be \u0986\u099b\u09c7 \u09af\u09be 'Help / OWASP ZAP User Guide' \u09ae\u09c7\u09a8\u09c1 \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6\u09af\u09cb\u0997\u09cd\u09af\u0964\n\
\n\
F1 \u0995\u09c0 \u099f\u09bf \u0993 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u09aa\u09be\u09a4\u09be \u099f\u09bf \u09a8\u09bf\u09df\u09c7 \u0986\u09b8\u09ac\u09c7 \u098f\u09ac\u0982 \u09b8\u09b0\u09be\u09b8\u09b0\u09bf \u0986\u09aa\u09a8\u09be\u0995\u09c7 \u09a8\u09bf\u09b0\u09cd\u09ac\u09be\u099a\u09bf\u09a4 \u099f\u09cd\u09af\u09be\u09ac\u09c7\u09b0 \u099c\u09a8\u09cd\u09af \u09b8\u09ae\u09cd\u09aa\u09b0\u09cd\u0995\u09bf\u09a4 \u09ac\u09bf\u09ad\u09be\u0997\u09c7 \u09a8\u09bf\u09df\u09c7 \u09af\u09be\u09ac\u09c7\u0964 
tips.tip.gen.015 = New to ZAP?\n\
\n\
Read the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = ZAP \u098f\u09b0 \u09ac\u09c7\u09b6\u09bf\u09b0\u09ad\u09be\u0997 \u099f\u09cd\u09af\u09be\u09ac\u0987 \u098f\u0996\u09a8 \u09a1\u09bf\u09ab\u09b2\u09cd\u099f \u09ad\u09be\u09ac\u09c7 \u09b2\u09c1\u0995\u09be\u09df\u09bf\u09a4 \u0986\u099b\u09c7 \u0995\u09be\u099c\u09c7\u0987 UI \u098f\u0996\u09a8 \u0985\u09a8\u09c7\u0995 \u0995\u09ae \u098f\u09b2\u09cb\u09ae\u09c7\u09b2\u09cb\u0964\n\
\n\
\u0986\u09aa\u09a8\u09bf \u09aa\u09cd\u09b0\u09a7\u09be\u09a8 \u099f\u09c1\u09b2\u09ac\u09be\u09b0\u09c7\u09b0 \u09ac\u09cb\u09a4\u09be\u09ae \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09b8\u0995\u09b2 \u099f\u09cd\u09af\u09be\u09ac \u0995\u09c7 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8 \u0985\u09a5\u09ac\u09be \u09b2\u09c1\u0995\u09be\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964\n\
\n\
\u0986\u09aa\u09a8\u09bf \u0986\u09aa\u09a8\u09be\u09b0 \u09aa\u099b\u09a8\u09cd\u09a6\u09c7\u09b0 \u0995\u09cb\u09a8 \u098f\u0995\u099f\u09bf \u099f\u09cd\u09af\u09be\u09ac pin \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u0995\u09be\u099c\u09c7\u0987 \u098f\u099f\u09bf \u09aa\u09c1\u09a8\u09b0\u09be\u09df \u099a\u09be\u09b2\u09c1 \u0995\u09b0\u09be\u09b0 \u09aa\u09b0\u09c7\u0993 \u09a6\u09c3\u09b6\u09cd\u09af\u09ae\u09be\u09a8 \u09a5\u09be\u0995\u09ac\u09c7\u0964 
tips.tip.gen.017 = \u0986\u09aa\u09a8\u09bf \u099f\u09c7\u09ac\u09bf\u09b2 \u09b8\u09cd\u09a4\u09ae\u09cd\u09ad \u0997\u09c1\u09b2\u09be\u0995\u09c7 \u099f\u09c7\u09a8\u09c7 \u09a8\u09bf\u09df\u09c7 \u098f\u09b8\u09c7 \u099b\u09c7\u09dc\u09c7 \u09a6\u09bf\u09df\u09c7 \u09a4\u09be\u09a6\u09c7\u09b0\u0995\u09c7 \u09aa\u09c1\u09a8\u09b0\u09be\u09df \u09ac\u09bf\u09a8\u09cd\u09af\u09be\u09b8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964\n\
\n\
\u0986\u09aa\u09a8\u09bf \u098f\u099f\u09be\u0993 \u09a8\u09bf\u09b0\u09cd\u09ac\u09be\u099a\u09a8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09af\u09c7 \u0995\u09cb\u09a8 \u09b8\u09cd\u09a4\u09ae\u09cd\u09ad \u0997\u09c1\u09b2\u09be\u0995\u09c7 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8 \u0995\u09b0\u09be \u09b9\u09ac\u09c7, \u09aa\u09cd\u09b0\u09a4\u09cd\u09af\u09c7\u0995 \u099f\u09c7\u09ac\u09bf\u09b2 \u098f\u09b0 \u09a1\u09be\u09a8 \u09a6\u09bf\u0995\u09c7\u09b0 \u09b8\u09cd\u0995\u09cd\u09b0\u09b2 \u09ac\u09be\u09b0\u09c7\u09b0 \u09a0\u09bf\u0995 \u0989\u09aa\u09b0\u09c7\u09b0 \u0986\u0987\u0995\u09a8 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\u0964 
tips.tip.gen.018 = Manual browse indicator - Pages found by the spiders and forced browser are flagged in the Sites tree with the relevant icon. This icon disappears when you visit that page manually.
tips.tip.gen.019 = You can launch browsers that automatically proxy through ZAP and do not need to have the ZAP certificate added via the 'Manual Explore' button.
tips.tip.gen.020 = The Replacer options page allows you to quickly and easily replace text anywhere in an HTTP(S) message.

# HUD tips
tips.tip.hud.001 = The Heads Up Display brings all of the key ZAP functionality into your browser.
tips.tip.hud.002 = Complete the Heads Up Display tutorial - it covers all of the HUD's features.
tips.tip.hud.003 = The HUD is constantly being updated - share feedback, feature requests and raise issues via https\://github.com/zaproxy/zap-hud

# Automation tips
tips.tip.aut.001 = ZAP is great for automation, but its easier to test features in the desktop UI first and then convert them to a script.
tips.tip.aut.002 = ZAP has a powerful API that covers nearly all of the features available in the desktop UI.
tips.tip.aut.003 = By default you cannot connect to ZAP on another machine, you will need to change the configs to allow remote connections.

# Obscure features
tips.tip.obs.001 = POST requests have a 'right click' menu for generating an anti CSRF test form.
tips.tip.obs.002 = \u09aa\u09cd\u09b0\u09a7\u09be\u09a8 \u099f\u09c1\u09b2\u09ac\u09be\u09b0\u09c7 lightbulb \u09ac\u09cb\u09a4\u09be\u09ae \u098f\u09b0 'Show / enable' \u09ab\u09bf\u09b2\u09cd\u09a1 \u099f\u09bf \u09b2\u09c1\u0995\u09be\u09df\u09bf\u09a4 \u09ab\u09bf\u09b2\u09cd\u09a1 \u0995\u09c7 \u09a6\u09c3\u09b6\u09cd\u09af\u09ae\u09be\u09a8 \u0995\u09b0\u09c7 \u098f\u09ac\u0982 \u0986\u09aa\u09a8\u09be\u0995\u09c7 \u09a8\u09bf\u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09df \u09ab\u09bf\u09b2\u09cd\u09a1 \u09b8\u09ae\u09cd\u09aa\u09be\u09a6\u09a8\u09c7 \u0985\u09a8\u09c1\u09ae\u09a4\u09bf \u09a6\u09c7\u09df\u0964 
tips.tip.obs.003 = \u0986\u09aa\u09a8\u09be\u09b0 \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8 \u0995\u09bf \u0985\u09cd\u09af\u09be\u09a8\u09cd\u099f\u09bf CSRF \u099f\u09cb\u0995\u09c7\u09a8 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7? \n\
\n\
\u09a8\u09bf\u09b6\u09cd\u099a\u09bf\u09a4 \u09b9\u09df\u09c7 \u09a8\u09bf\u09a8 \u09af\u09c7 \u0986\u09aa\u09a8\u09bf ZAP \u0995\u09c7 'Options / Active Scan' \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09a8 \u098f\u09b0 \u09ae\u09be\u09a7\u09cd\u09af\u09ae\u09c7 \u09a4\u09be\u09a6\u09c7\u09b0 \u09aa\u09b0\u09bf\u099a\u09be\u09b2\u09a8\u09be \u0995\u09b0\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u09ac\u09bf\u09a8\u09cd\u09af\u09b8\u09cd\u09a4 \u0995\u09b0\u09c7\u099b\u09c7\u09a8\u0964 
tips.tip.obs.004 = \u0986\u09aa\u09a8\u09bf \u09e8 \u099f\u09bf \u0985\u09a8\u09c1\u09b0\u09cb\u09a7 \u0985\u09a5\u09ac\u09be \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09df\u09be\u09b0 \u09ae\u09a7\u09cd\u09af\u09c7 \u09a4\u09c1\u09b2\u09a8\u09be \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09a4\u09be\u09a6\u09c7\u09b0 \u0989\u09ad\u09df\u0995\u09c7\u0987 \u09a8\u09bf\u09b0\u09cd\u09ac\u09be\u099a\u09a8 \u0995\u09b0\u09c7, \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c7 \u098f\u09ac\u0982 \u09ae\u09c7\u09a8\u09c1 \u0986\u0987\u099f\u09c7\u09ae \u09a5\u09c7\u0995\u09c7 \u098f\u0995\u099f\u09bf 'Compare 2..' \u0985\u09aa\u09b6\u09a8 \u09a8\u09bf\u09b0\u09cd\u09ac\u09be\u099a\u09a8 \u0995\u09b0\u09c7\u0964 
tips.tip.obs.005 = \u0986\u09aa\u09a8\u09bf ZAP \u0995\u09c7 \u09ac\u09b2\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u098f\u0995\u099f\u09bf \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8 \u098f \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6 \u0995\u09b0\u09a4\u09c7\u0964 \n\
\n\
\u098f\u099f\u09bf \u0995\u09b0\u09a4\u09c7 \u0986\u09aa\u09a8\u09be\u09b0 \u09a6\u09b0\u0995\u09be\u09b0 \u09b9\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8 \u0995\u09a8\u09cd\u099f\u09c7\u0995\u09cd\u09b8\u099f \u098f \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09be \u098f\u09ac\u0982 \u09a4\u09be\u09b0\u09aa\u09b0 \u09b8\u09a4\u09cd\u09af\u09a4\u09be \u09af\u09be\u099a\u09be\u0987\u09df\u09c7\u09b0 \u09aa\u09a5 \u098f\u09ac\u0982 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0\u0995\u09be\u09b0\u09c0\u09b0 \u09a4\u09a5\u09cd\u09af \u09a8\u09bf\u09b0\u09cd\u09a7\u09be\u09b0\u09a8 \u0995\u09b0\u09c7 \u09a6\u09c7\u0993\u09df\u09be\u0964 
tips.tip.obs.006 = \u0985\u09a8\u09c1\u09b8\u09a8\u09cd\u09a7\u09be\u09b0\u09a8 \u099f\u09cd\u09af\u09be\u09ac \u0986\u09aa\u09a8\u09be\u0995\u09c7 Fuzz \u09ab\u09b2\u09be\u09ab\u09b2\u09c7 \u0995\u09cb\u09a8 \u09b8\u09cd\u099f\u09cd\u09b0\u09bf\u0982 \u0996\u09c1\u099c\u09c7 \u09aa\u09c7\u09a4\u09c7 \u09b8\u09ae\u09b0\u09cd\u09a5\u09a8 \u0995\u09b0\u09c7 - \u098f\u099f\u09bf regex \u0985\u09ad\u09bf\u09ac\u09cd\u09af\u0995\u09cd\u09a4\u09bf \u098f\u09ac\u0982 \u09ac\u09bf\u09aa\u09b0\u09c0\u09a4 \u09ae\u09bf\u09b2\u09a8 \u09b8\u09ae\u09b0\u09cd\u09a5\u09a8 \u0995\u09b0\u09c7\u0964 
tips.tip.obs.007 = \u0986\u09aa\u09a8\u09bf \u09af\u09c7\u0995\u09cb\u09a8\u09cb \u09b2\u09c7\u0996\u09be\u09b0 \u098f\u09b2\u09be\u0995\u09be\u09df \u09b2\u09c7\u0996\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u0996\u09cb\u0981\u099c \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8, \u09b8\u09be\u09a5\u09c7 \u09b8\u09be\u09a5\u09c7 \u0985\u09a8\u09c1\u09b0\u09cb\u09a7 \u098f\u09ac\u0982 \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09df\u09be \u099f\u09cd\u09af\u09be\u09ac\u0993 \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09ae\u09c7\u09a8\u09c1 \u09a5\u09c7\u0995\u09c7 'Find...' \u0985\u09aa\u09b6\u09a8\u09c7 \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u0995\u09b0\u09c7\u0964 
tips.tip.obs.008 = \u0986\u09aa\u09a8\u09bf \u0985\u09a8\u09c1\u09b0\u09cb\u09a7, \u09aa\u09cd\u09b0\u09a4\u09bf\u0995\u09cd\u09b0\u09bf\u09df\u09be \u098f\u09ac\u0982 \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0995\u09a8\u09b8\u09cb\u09b2 \u099f\u09cd\u09af\u09be\u09ac\u09c7\u09b0 \u09ac\u09be\u0995\u09cd\u09af \u0997\u09a0\u09a8 \u098f\u09b0 \u09b9\u09be\u0987\u09b2\u09be\u0987\u099f\u09bf\u0982 \u09aa\u09a6\u09cd\u09a7\u09a4\u09bf \u09aa\u09b0\u09bf\u09ac\u09b0\u09cd\u09a4\u09a8 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 'Syntax' \u09ae\u09c7\u09a8\u09c1\u09a4\u09c7 \u09a1\u09be\u09a8 \u0995\u09cd\u09b2\u09bf\u0995 \u09a6\u09cd\u09ac\u09be\u09b0\u09be\u0964 
tips.tip.obs.009 = \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0985\u09aa\u09b6\u09a8 \u09aa\u09be\u09a4\u09be\u09b0 \u09ae\u09be\u09a7\u09cd\u09af\u09ae\u09c7 \u0986\u09aa\u09a8\u09bf ZAP \u0995\u09c7 \u09b8\u0995\u09b2 \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u098f\u0995\u099f\u09bf \u09a1\u09bf\u09b0\u09c7\u0995\u09cd\u099f\u09b0\u09bf \u09a4\u09c7 \u09b8\u09c7\u099f \u09b9\u09bf\u09b8\u09c7\u09ac\u09c7 \u09b2\u09cb\u09a1 \u0995\u09b0\u09a4\u09c7 \u09ac\u09b2\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964 \n\
\n\
\u09a1\u09bf\u09b0\u09c7\u0995\u09cd\u099f\u09b0\u09bf \u098f\u09b0 \u0997\u09a0\u09a8 \u098f\u09b0 \u09ac\u09bf\u09b8\u09cd\u09a4\u09be\u09b0\u09bf\u09a4 \u09a4\u09a5\u09cd\u09af \u099c\u09be\u09a8\u09a4\u09c7 \u09b8\u09be\u09b9\u09be\u09af\u09cd\u09af \u09aa\u09be\u09a4\u09be \u09a6\u09c7\u0996\u09c1\u09a8\u0964 
tips.tip.obs.010 = \u0986\u09aa\u09a8\u09bf \u09b8\u09c7\u0987 \u09b8\u0995\u09b2 URL \u0997\u09c1\u09b2\u09be \u09b0\u09aa\u09cd\u09a4\u09be\u09a8\u09bf \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 \u09af\u09be ZAP \u09a6\u09cd\u09ac\u09be\u09b0\u09be \u09b0\u09c7\u0995\u09b0\u09cd\u09a1 \u0995\u09b0\u09be \u09b9\u09df\u09c7\u099b\u09c7, \u0989\u099a\u09cd\u099a \u09b8\u09cd\u09a4\u09b0\u09c7\u09b0 \u098f\u0987 \u09ae\u09c7\u09a8\u09c1 \u099f\u09bf \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7\: "Report / Export All URLs to a File..."
tips.tip.obs.011 = \u0986\u09aa\u09a8\u09bf \u09a4\u09c3\u09a4\u09c0\u09af\u09bc \u09aa\u09be\u09b0\u09cd\u099f\u09bf \u099f\u09c1\u09b2\u09b8 \u09af\u09c7\u09ae\u09a8 sqlmap \u098f\u09ac\u0982 nmap \u0995\u09c7 \u0986\u09b9\u09ac\u09be\u09a8 \u0995\u09b0\u09c7 ZAP \u098f\u09b0 \u09a5\u09c7\u0995\u09c7 \u098f\u0995\u099f\u09bf \u09ac\u09cd\u09af\u09be\u09aa\u0995 \u0986\u0995\u09be\u09b0\u09c7\u09b0 \u09aa\u09cd\u09b0\u09be\u09b8\u0999\u09cd\u0997\u09bf\u0995 \u09a4\u09a5\u09cd\u09af \u09ac\u09c7\u09b0 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8\u0964\n\
\n\
\u09b6\u09c1\u09a7\u09c1\u09ae\u09be\u09a4\u09cd\u09b0 "Options / Applications" \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09a8 \u09a5\u09c7\u0995\u09c7 \u09af\u09c7\u0987 \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8 \u0986\u09aa\u09a8\u09bf \u0986\u09b9\u09ac\u09be\u09a8 \u0995\u09b0\u09a4\u09c7 \u099a\u09be\u09a8 \u09a4\u09be \u09ac\u09bf\u09a8\u09cd\u09af\u09b8\u09cd\u09a4 \u0995\u09b0\u09c1\u09a8\u0964 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

# Optional add-ons
tips.tip.add.001 = \u09ac\u09c7\u099f\u09be \u09b8\u0995\u09cd\u09b0\u09bf\u09df \u098f\u09ac\u0982 \u09a8\u09bf\u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09df \u09b8\u09cd\u0995\u09cd\u09af\u09be\u09a8 \u09a8\u09c0\u09a4\u09bf \u0987\u09a8\u09cd\u09b8\u099f\u09be\u09b2 \u0995\u09b0\u09c7 \u09b0\u09be\u0996\u09c1\u09a8 \u0986\u09b0\u0993 \u09b8\u09ae\u09cd\u09ad\u09be\u09ac\u09cd\u09af \u09b8\u09ae\u09b8\u09cd\u09af\u09be \u0996\u09c1\u099c\u09c7 \u09aa\u09c7\u09a4\u09c7\u0964\n\
\n\
\u098f\u0996\u09be\u09a8\u09c7 \u098f\u09b0 \u09b8\u09be\u09a5\u09c7 \u0986\u09b2\u09ab\u09be \u09b8\u0995\u09cd\u09b0\u09bf\u09df \u098f\u09ac\u0982 \u09a8\u09bf\u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09df \u09b8\u09cd\u0995\u09cd\u09af\u09be\u09a8 \u09a8\u09bf\u09df\u09ae\u0993 \u0986\u099b\u09c7 \u0995\u09bf\u09a8\u09cd\u09a4\u09c1 \u09a4\u09be\u09b0\u09be \u0985\u09ac\u09b6\u09cd\u09af\u0987 \u0986\u09b0\u0993 \u0995\u09ae \u09b8\u09cd\u09a5\u09be\u09df\u09c0 \u09b9\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u0964 
tips.tip.add.002 = ZAP \u0995\u09c7 Java \u098f\u09ac\u0982 Zest \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u099b\u09be\u09dc\u09be \u0985\u09a8\u09cd\u09af \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f\u09bf\u0982 \u09ad\u09be\u09b7\u09be \u09a4\u09c7 \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0995\u09b0\u09a4\u09c7 \u099a\u09be\u09a8?\n\
\n\
ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8 \u099f\u09bf \u099a\u09c7\u0995 \u0995\u09b0\u09c1\u09a8 \u0985\u09a8\u09cd\u09af \u09ad\u09be\u09b7\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u09af\u09c7\u09ae\u09a8 python \u098f\u09ac\u0982 ruby.
tips.tip.add.003 = SAML \u0985\u09a8\u09c1\u09b0\u09cb\u09a7 \u0997\u09c1\u09b2\u09be\u0995\u09c7 \u09b8\u09a8\u09be\u0995\u09cd\u09a4, \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8, \u09b8\u09ae\u09cd\u09aa\u09be\u09a6\u09a8 \u098f\u09ac\u0982 fuzz \u0995\u09b0\u09a4\u09c7 ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8 \u09a5\u09c7\u0995\u09c7 SAML Add-on \u0987\u09a8\u09cd\u09b8\u099f\u09be\u09b2 \u0995\u09b0\u09c7 \u09a8\u09bf\u09a8\u0964 
tips.tip.add.004 = ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8\u09c7\u09b0 'Directory List *' \u098f \u09ac\u09bf\u09aa\u09c1\u09b2 \u09b8\u0982\u0996\u09cd\u09af\u0995 fuzzing \u09ab\u09be\u0987\u09b2 \u09aa\u09be\u0993\u09df\u09be \u09af\u09be\u09ac\u09c7, 'Fuzzdb files' \u098f\u09ac\u0982 'SVN Digger files' add-ons.
tips.tip.add.005 = ZAP \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0997\u09c1\u09b2\u09be\u09b0 \u099c\u09a8\u09cd\u09af \u098f\u0996\u09be\u09a8\u09c7 \u098f\u0995\u099f\u09bf \u09b0\u09bf\u09aa\u099c\u09bf\u099f\u09b0\u09bf \u0986\u099b\u09c7 https\://github.com/zaproxy/community-scripts\n\
\n\
\u0986\u09aa\u09a8\u09bf \u09af\u09a6\u09bf \u098f\u0995\u099f\u09bf \u09b8\u09cd\u09a5\u09be\u09a8\u09c0\u09df \u0995\u09aa\u09bf\u09b0 \u0985\u09a8\u09c1\u09b2\u09bf\u09aa\u09bf \u09a4\u09c8\u09b0\u09bf \u0995\u09b0\u09c7\u09a8 \u09a4\u09be\u09b9\u09b2\u09c7 \u0986\u09aa\u09a8\u09bf \u09b8\u09c7\u0997\u09c1\u09b2\u09be ZAP \u098f \u09af\u09c1\u0995\u09cd\u09a4 \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09ac\u09c7\u09a8 \u09b8\u09cd\u0995\u09cd\u09b0\u09bf\u09aa\u09cd\u099f \u0985\u09aa\u09b6\u09a8 pane \u09a6\u09cd\u09ac\u09be\u09b0\u09be\u0964
tips.tip.add.007 = ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8 \u09a5\u09c7\u0995\u09c7 sequence add-on \u0987\u09a8\u09cd\u09b8\u099f\u09be\u09b2 \u0995\u09b0\u09c1\u09a8 \u09ac\u09bf\u09ad\u09bf\u09a8\u09cd\u09a8 \u09aa\u09be\u09a4\u09be \u09b8\u09cd\u0995\u09cd\u09af\u09be\u09a8 \u0995\u09b0\u09a4\u09c7 \u09af\u09be \u0985\u09ac\u09b6\u09cd\u09af\u0987 \u09aa\u09cd\u09b0\u09a6\u09b0\u09cd\u09b6\u09a8 \u0995\u09b0\u09a4\u09c7 \u09b9\u09ac\u09c7 \u098f\u0995\u099f\u09bf \u09a8\u09bf\u09b0\u09cd\u09a6\u09bf\u09b7\u09cd\u099f \u0995\u09cd\u09b0\u09ae\u09c7 \u09aa\u09c1\u09b0\u09cb \u0995\u09be\u09b0\u09cd\u09af\u0995\u09cd\u09b7\u09ae\u09a4\u09be \u09a4\u09c7 \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6\u09af\u09cb\u0997\u09cd\u09af\u09a4\u09be \u09aa\u09be\u0993\u09df\u09be\u09b0 \u099c\u09a8\u09cd\u09af\u0964 
tips.tip.add.008 = ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8 \u09a5\u09c7\u0995\u09c7 accessControl add-on \u0987\u09a8\u09cd\u09b8\u099f\u09be\u09b2 \u0995\u09b0\u09c1\u09a8 \u0986\u09aa\u09a8\u09be\u09b0 \u098f\u09aa\u09cd\u09b2\u09bf\u0995\u09c7\u09b6\u09a8\u09c7\u09b0 \u09b8\u09cd\u09ac\u09df\u0982\u0995\u09cd\u09b0\u09bf\u09df \u09aa\u09b0\u09c0\u0995\u09cd\u09b7\u09be \u09a4\u09c7 \u09aa\u09cd\u09b0\u09ac\u09c7\u09b6 \u09a8\u09bf\u09df\u09a8\u09cd\u09a4\u09cd\u09b0\u09a3 \u0995\u09b0\u09a4\u09c7\u0964 
tips.tip.add.009 = \u0986\u09aa\u09a8\u09bf \u099f\u09c7\u0995\u09cd\u09b8\u099f \u09ab\u09be\u0987\u09b2\u09c7 \u09a5\u09be\u0995\u09be URL \u0997\u09c1\u09b2\u09be \u09b0\u09aa\u09cd\u09a4\u09be\u09a8\u09bf \u0995\u09b0\u09a4\u09c7 \u09aa\u09be\u09b0\u09c7\u09a8 importurls add-on \u09ac\u09cd\u09af\u09be\u09ac\u09b9\u09be\u09b0 \u0995\u09b0\u09c7 \u09af\u09be \u0986\u09aa\u09a8\u09bf ZAP \u09ae\u09be\u09b0\u09cd\u0995\u09c7\u099f\u09aa\u09cd\u09b2\u09c7\u09b8 \u098f \u09aa\u09be\u09ac\u09c7\u09a8\u0964 
