# Strings used by the add-on
tips.desc					= Consejos y trucos
tips.button.allTips			= Todos los consejos
tips.button.nextTip			= Pr\u00f3ximo Consejo
tips.dialog.title			= Consejos y trucos
tips.topmenu.help.tips		= Consejos y trucos

# The actual tips and tricks - anything with a key stating 'tips.tip.' will be treated as a tip
# General tips
tips.tip.gen.001 = Guarde su sesi\u00f3n ZAP al comienzo en lugar de al final - la sesi\u00f3n es almacenada en un db que ser\u00e1 actualizado todo el tiempo, con lo cual no tendr\u00e1 que guardarla otra vez.
tips.tip.gen.002 = Intente diferentes configuraciones de UI a trav\u00e9s de los botones en la barra principal de herramientas.
tips.tip.gen.003 = Cliquee el bot\u00f3n derecho en cualquier lugar. Sombree texto y cliquee el bot\u00f3n derecho. Gran parte de la funcionalidad de ZAP es sensible al contexto como tambi\u00e9n se accede mejor de esta manera.
tips.tip.gen.004 = Use los atajos del teclado para acelerar sus pruebas - puede definir sus propias combinaciones con 'Opciones/Teclado\u2019, que tambi\u00e9n le permite generar una versi\u00f3n imprimible del listado de atajos.
tips.tip.gen.005 = Si est\u00e1 recibiendo demasiados falsos positivos, trate cambiando el l\u00edmite para esa regla de escaneo a Alto. Pero adem\u00e1s, denos aviso del problema a trav\u00e9s del Grupo de usuarios de ZAP o Asuntos para que podamos investigarlo - ambos est\u00e1n enlazados al men\u00fa 'Online'
tips.tip.gen.007 = Agregue su aplicaci\u00f3n de objetivo un Contexto, usando el men\u00fa 'click derecho\u2019\: 'Inclu\u00edr en Contexto'. Esto le permite decirle a ZAP mucho m\u00e1s acerca del objetivo, como la autenticaci\u00f3n, los usuarios y la tecnolog\u00eda que usa.
tips.tip.gen.008 = ZAP puede mostrar, interceptar e incluso esconder mensajes secundarios de un cliente, incluyendo los PostMesagges - 'click derecho\u2019 en un sub\u00e1rbol en el \u00e1rbol Sitios y seleccione un submen\u00fa adecuado debajo de 'Clientes Monitor\u2019. Fuerce que vuelva a cargarse el navegador y sus p\u00e1ginas abiertas ser\u00e1n mostradas en la pesta\u00f1a 'Clientes\u2019 junto con todos los mensajes secundarios que ellos generan.
tips.tip.gen.009 = Las secuencias Zest son una excelente manera de automatizar tareas. Zest es lenguaje gr\u00e1fico macro de ZAP, pero ofrece caracter\u00edsticas de programaci\u00f3n como condicionales y loops. Use el bot\u00f3n \u201cGrabe una nueva secuencia Zest\u2026\u2019 en la barra de herramientas principal para grabar una secuencia Zest r\u00e1pidamente. Tambi\u00e9n puede hacer click derecho en los pedidos para agregarlos a una secuencia Zest.
tips.tip.gen.010 = ZAP puede revisar autom\u00e1ticamente las actualizaciones - para habilitarlo use la pantalla 'Opciones/Revisar Actualizaciones\u2019. Si no quiere que sea autom\u00e1tico, entonces aseg\u00farese de revisar las actualizaciones manualmente con frecuencia a trav\u00e9s del bot\u00f3n 'Administrat Adiciones\u2019 en la barra de herramientas principal ya que continuamente agregamos nuevas servicios y reparamos errores.
tips.tip.gen.011 = Haga click en el bot\u00f3n \u201cEquipo\u201d en la parte derecha de varias pesta\u00f1as para acceder r\u00e1pidamente la configuraci\u00f3n de esa secci\u00f3n. 
tips.tip.gen.012 = Hay muchos recursos enlazados al men\u00fa 'Online\u2019, incluyendo la p\u00e1gina principal de ZAP, grupos de Usuarios y Desarrolladores
tips.tip.gen.013 = Want to chat to someone about ZAP?\n\
\n\
Many of the ZAP core developers hang out on the Libera Chat \#zaproxy irc channel\: https\://web.libera.chat/\#zaproxy
tips.tip.gen.014 = ZAP tiene varias p\u00e1ginas de ayuda a las que se puede acceder a trav\u00e9s del men\u00fa 'Ayuda / OWASP Gu\u00eda Usuarios ZAP\u2019. La tecla F1 tambi\u00e9n le abrir\u00e1 las p\u00e1ginas de ayuda y lo llevar\u00e1 directamente a la secci\u00f3n de importancia para la pesta\u00f1a seleccionada.
tips.tip.gen.015 = New to ZAP?\n\
\n\
Read the 'Getting Started with ZAP' guide accessible via the 'Help' menu. 
tips.tip.gen.016 = La mayor\u00eda de las pesta\u00f1as de ZAP ahora por defecto est\u00e1n escondidas, para que la UI est\u00e9 menos congestionada. Puede mostrar o esconder todas las pesta\u00f1as con los botones en la barra de herramientas principal. Tambi\u00e9n puede 'fijar\u2019 cualquier pesta\u00f1as para que quede visible a\u00fan despu\u00e9s de un restart.
tips.tip.gen.017 = Puede reorganizar las columnas de una tabla arrastrando y soltando. Tambi\u00e9n puede seleccionar qu\u00e9 columnas son visibles usando el \u00edcono que est\u00e1 justo sobre la barra deslizable en el margen derecho de cada tabla.
tips.tip.gen.018 = Manual browse indicator - Pages found by the spiders and forced browser are flagged in the Sites tree with the relevant icon. This icon disappears when you visit that page manually.
tips.tip.gen.019 = You can launch browsers that automatically proxy through ZAP and do not need to have the ZAP certificate added via the 'Manual Explore' button.
tips.tip.gen.020 = The Replacer options page allows you to quickly and easily replace text anywhere in an HTTP(S) message.

# HUD tips
tips.tip.hud.001 = The Heads Up Display brings all of the key ZAP functionality into your browser.
tips.tip.hud.002 = Complete the Heads Up Display tutorial - it covers all of the HUD's features.
tips.tip.hud.003 = The HUD is constantly being updated - share feedback, feature requests and raise issues via https\://github.com/zaproxy/zap-hud

# Automation tips
tips.tip.aut.001 = ZAP is great for automation, but its easier to test features in the desktop UI first and then convert them to a script.
tips.tip.aut.002 = ZAP has a powerful API that covers nearly all of the features available in the desktop UI.
tips.tip.aut.003 = By default you cannot connect to ZAP on another machine, you will need to change the configs to allow remote connections.

# Obscure features
tips.tip.obs.001 = POST requests have a 'right click' menu for generating an anti CSRF test form.
tips.tip.obs.002 = El bot\u00f3n 'bombilla' de los campos 'Mostrar/Habilitar\u2019 de la barra de herramientas principal har\u00e1 visibles los campos escondidos y le permitir\u00e1 editar los campos deshabilitados.
tips.tip.obs.003 = \u00bfSu aplicaci\u00f3n usa identificadores anti CSRF? Aseg\u00farese de haber configurado ZAP para manejarlos a trav\u00e9s de la pantalla 'Opciones / Escaneo Activo\u2019.
tips.tip.obs.004 = Puede comparar dos pedidos o respuestas seleccionando ambos, 'click derecho\u2019 y seleccionando uno de los \u00edtems del men\u00fa 'Comparar 2...'.
tips.tip.obs.005 = Puede decirle a ZAP que acceda a una aplicaci\u00f3n usando un usuario espec\u00edfico. Para hacer eso, necesita agregar su aplicaci\u00f3n a un Contexto y luego definir los detalles de autenticaci\u00f3n y usuario.
tips.tip.obs.006 = La pesta\u00f1a B\u00fasqueda le permite encontrar cuerdas en resultados Fuzz - soporta expresiones regex y emparejamiento inverso.
tips.tip.obs.007 = Puede buscar texto en cualquier \u00e1rea de texto incluyendo las pesta\u00f1as Pedido y Respuesta, usando el men\u00fa de \u2018click derecho' \u2018Encontrar\u2026\u2019.  
tips.tip.obs.008 = Puede cambiar el sombreado de sintaxis usado para las pesta\u00f1as Pedido, Respuesta y Consola de Secuencia a trav\u00e9s de los men\u00faes \u2018Syntax\u2019 haciendo 'click derecho'.
tips.tip.obs.009 = Puede decirle a ZAP que cargue todas las secuencias en un conjunto de directorios a trav\u00e9s de la p\u00e1gina 'Opciones de Secuencia'. Recurra a la ayuda para detalles de la estructura del directorio.
tips.tip.obs.010 = Puede exportar todas las URLs grabadas por ZAP usando el men\u00fa de nivel superior\: \u201cReportar / Exportar todas las URLs a un Archivo\u2026\u201d
tips.tip.obs.011 = Puede convocar herramientas de una tercera parte como sqlmap y nmap desde ZAP, pasando a trav\u00e9s de un amplio rango de informaci\u00f3n contextual. Solamente configure las aplicaciones que quiere convocar en la pantalla \u201cOpciones / Aplicaciones\u201d. 
tips.tip.obs.012 = Docker Support - https\://www.zaproxy.org/docs/docker/

# Optional add-ons
tips.tip.add.001 = Instale las reglas de escaneo beta activas y pasivas para encontrar m\u00e1s inconvenientes potenciales. Tambi\u00e9n hay reglas de escaneo alfa activas y pasivas, pero obviamente pueden ser menos estables.
tips.tip.add.002 = Quiere armar secuencias ZAP en otro lenguaje que no sea JavaScript o Zest? En la tienda de ZAP podr\u00e1 encontrar otros lenguajes como Python y Ruby. Si su lenguaje preferido todav\u00eda no est\u00e1 disponible all\u00ed, entonces cont\u00e1ctese - es bastante f\u00e1cil agregar soporte para otros lenguajes.
tips.tip.add.003 = Instale el SAML Add-on desde la Tienda de ZAP para detectar, mostrar, editar y esconder pedidos SAML.
tips.tip.add.004 = Hay un gran n\u00famero de archivos \u201cfuzzy\u201d disponibles en la tienda de ZAP, en los apartados 'Lista de Directorio*\u2019, 'Archivos Fuzzdb\u2019 y 'Archivos SVN Digger'.
tips.tip.add.005 = Hay un repositorio bfr secuencias ZAP en https\://github.com/zaproxy/community-scripts Si clona una copia local entonces podr\u00e1 agregarlos a todos a ZAP a trav\u00e9s de la p\u00e1gina Opciones de Secuencia. Tambi\u00e9n puede cargar sus propias secuencias a trav\u00e9s de extraer pedidos - cuantos m\u00e1s mejor\! 
tips.tip.add.007 = Install the sequence add-on from the ZAP Marketplace to scan pages that must be visited in a specific order for the full functionality to be accessible.
tips.tip.add.008 = Install the accessControl add-on from the ZAP Marketplace to automate testing of your application's access control.
tips.tip.add.009 = You can import URLs contained in a text file using the importurls add-on available on the ZAP Marketplace
