#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=\u30a2\u30af\u30c6\u30a3\u30d6 \u30b9\u30ad\u30e3\u30f3 \u30eb\u30fc\u30eb

ascanrules.clientbrowsercache.desc=\u4fdd\u8b77\u3055\u308c\u305f\u30da\u30fc\u30b8\u306f\u30d6\u30e9\u30a6\u30b6\u30fc\u3067\u30ad\u30e3\u30c3\u30b7\u30e5\u3067\u304d\u307e\u3059\u3002HTTP\u30d8\u30c3\u30c0\u306b\u3082HTML\u306e\u30d8\u30c3\u30c0\u8981\u7d20\u306b\u3082\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u306f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u3001\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u30b9\u30c8\u30ec\u30fc\u30b8\u304b\u3089\u5fa9\u5143\u3067\u304d\u3066\u3057\u307e\u3044\u307e\u3059\u3002
ascanrules.clientbrowsercache.name=\u30bb\u30ad\u30e5\u30a2\u30da\u30fc\u30b8\u306e\u30d6\u30e9\u30a6\u30b6\u30fc\u30ad\u30e3\u30c3\u30b7\u30e5
ascanrules.clientbrowsercache.ref=Internet Explorer\u3067\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u7981\u6b62\u3059\u308b\u65b9\u6cd5 - http\://support.microsoft.com/default.aspx?kbid\=234067\n\nPragma\: No-cache \u30bf\u30b0\u306e\u307f\u3067\u306f\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u7981\u6b62\u3055\u308c\u306a\u3044\u5834\u5408\u304c\u3042\u308a\u307e\u3059 -  http\://support.microsoft.com/default.aspx?kbid\=222064
ascanrules.clientbrowsercache.solution=\u6700\u3082\u826f\u3044\u65b9\u6cd5\u306f HTTP \u30d8\u30c3\u30c0\u306b 'Pragma\: No-cache' \u3068 'Cache-control\: No-cache' \u3092\u30bb\u30c3\u30c8\u3059\u308b\u4e8b\u3067\u3059\u3002\n\n\u4e0a\u8a18\u306e\u4ee3\u308f\u308a\u306b\u3001\u3053\u308c\u3089\u306e\u5024\u3092\u4e0b\u8a18\u306e\u3088\u3046\u306bHTML \u30d8\u30c3\u30c0\u306b\u30bb\u30c3\u30c8\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\n\n<META HTTP-EQUIV\='Pragma' CONTENT\='no-cache'> \n<META HTTP-EQUIV\='Cache-Control' CONTENT\='no-cache'> \n\n\u305f\u3060\u3057\u3001\u30d6\u30e9\u30a6\u30b6\u306b\u3088\u3063\u3066\u306f\u3053\u306e\u624b\u6cd5\u3092\u53d6\u308b\u3053\u3068\u3067\u554f\u984c\u3092\u5f15\u304d\u8d77\u3053\u3059\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002

ascanrules.cmdinjection.name=\u30ea\u30e2\u30fc\u30c8 OS \u30b3\u30de\u30f3\u30c9 \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 \u30d7\u30e9\u30b0\u30a4\u30f3
ascanrules.cmdinjection.desc=\u4e0d\u6b63\u306aOS\u30b3\u30de\u30f3\u30c9\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u653b\u6483\u624b\u6cd5\u3067\u3059\u3002\u9069\u5207\u306b\u7121\u5bb3\u5316\u3092\u65bd\u3055\u308c\u3066\u3044\u306a\u3044\u5165\u529b\u3092\u4f7f\u3063\u3066\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304cOS\u30b3\u30de\u30f3\u30c9\u3092\u751f\u6210\u3059\u308b\u5834\u5408\u3084\u3001\u4e0d\u6b63\u306a\u5916\u90e8\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u547c\u3073\u51fa\u3059\u5834\u5408\u306b\u3053\u306e\u653b\u6483\u304c\u6210\u7acb\u3057\u307e\u3059\u3002

ascanrules.rxss.name=\u30af\u30ed\u30b9 \u30b5\u30a4\u30c8 \u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u53cd\u5c04\u578b)

ascanrules.pxss.attack.name=\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u6301\u7d9a\u578b)
ascanrules.pxss.otherinfo=\u30bd\u30fc\u30b9URL\: {0}
ascanrules.pxss.prime.name=\u30af\u30ed\u30b9\u3000\u30b5\u30a4\u30c8 \u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0(\u6301\u7d9a\u7684) - \u30d7\u30e9\u30a4\u30e0
ascanrules.pxss.spider.name=\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0(\u6301\u7d9a\u578b) - \u30b9\u30d1\u30a4\u30c0\u30fc

ascanrules.sqlinjection.name=SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3
ascanrules.sqlinjection.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027
ascanrules.sqlinjection.soln=\u4f8b\u3048\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u3067\u5165\u529b\u691c\u8a3c\u3092\u884c\u3063\u3066\u3044\u305f\u3068\u3057\u3066\u3082\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u5165\u529b\u3092\u4fe1\u983c\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\n\u4e00\u822c\u306b\u3001\u5168\u3066\u306e\u5165\u529b\u30c7\u30fc\u30bf\u306e\u691c\u8a3c\u306f\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c9\u3067\u884c\u3046\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304cJDBC \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u3001PreparedStatement \u307e\u305f\u306f CallableStatement  \u3067 '?' \u306b\u3088\u3063\u3066\u6e21\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u4f7f\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c ASP \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u3001 ADO Command Objects \u3067\u53b3\u5bc6\u306a\u578b\u30c1\u30a7\u30c3\u30af\u3068\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5316\u3055\u308c\u305f\u30af\u30a8\u30ea\u3092\u4f7f\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 \u306e \u30b9\u30c8\u30a2\u30c9 \u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u3092\u4f7f\u7528\u3067\u304d\u308b\u5834\u5408\u306f\u3001\u305d\u308c\u3089\u3092\u4f7f\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\n\n\u30b9\u30c8\u30a2\u30c9 \u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u3078\u306e\u6587\u5b57\u5217\u306e\u7d50\u5408\u3084\u3001'exec', 'exec immediate' \u306b\u985e\u3059\u308b\u6a5f\u80fd\u306f\u3001\u6c7a\u3057\u3066\u4f7f\u7528\u3057\u306a\u3044\u3067\u4e0b\u3055\u3044\u3002\u307e\u305f\u3001\u5358\u7d14\u306a\u6587\u5b57\u5217\u306e\u9023\u7d50\u3092\u4f7f\u7528\u3057\u3066\u52d5\u7684\u306b SQL \u30af\u30a8\u30ea\u3092\u4f5c\u6210\u3057\u306a\u3044\u3067\u4e0b\u3055\u3044\u3002\n\n\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u53d7\u4fe1\u3057\u305f\u5168\u3066\u306e\u30c7\u30fc\u30bf\u306f\u30a8\u30b9\u30b1\u30fc\u30d7\u3057\u3066\u4e0b\u3055\u3044\u3002\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u6587\u5b57\u306e\u30db\u30ef\u30a4\u30c8\u30ea\u30b9\u30c8\u3001\u307e\u305f\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u6587\u5b57\u306e\u30d6\u30e9\u30c3\u30af\u30ea\u30b9\u30c8\u3092\u3001\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u306b\u9069\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\n\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u306f\u3001\u6700\u4f4e\u9650\u306e\u6a29\u9650\u3092\u9069\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\u5177\u4f53\u7684\u306b\u306f\u3001'sa' \u307e\u305f\u306f ' db-owner' \u306e\u6a29\u9650\u3092\u6301\u3064\u30e6\u30fc\u30b6\u30fc\u3092\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u3053\u308c\u306f SQL \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u5bfe\u7b56\u3068\u306f\u306a\u308a\u307e\u305b\u3093\u304c\u3001\u305d\u306e\u5f71\u97ff\u3092\u6700\u5c0f\u9650\u306b\u6291\u3048\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306f\u5fc5\u8981\u6700\u5c0f\u9650\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
ascanrules.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.sqlinjection.alert.errorbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanrules.sqlinjection.alert.errorbased.differentiation.attack=\u5143\u306e\u5024\: [{0}]\u3002\u5909\u66f4\u5f8c\u306e\u5024\: [{1}]\u3002\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u5024\: [{2}]
ascanrules.sqlinjection.alert.booleanbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanrules.sqlinjection.alert.unionbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanrules.sqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] likely, given error message regular expression [{1}] matched by the HTML results.\nThe vulnerability was detected by manipulating the parameter to cause a database error message to be returned and recognised
ascanrules.sqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] likely, given UNION-specific error message regular expression [{1}] matched by the HTML results\nThe vulnerability was detected by manipulating the parameter with an SQL ''UNION'' clause to cause a database error message to be returned and recognised
ascanrules.sqlinjection.alert.expressionbased.extrainfo=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5f0f [{0}] \u3092\u4e0e\u3048\u3066\u3082\u3001\u5143\u306e\u30da\u30fc\u30b8\u3068\u540c\u4e00\u306e\u8868\u793a\u7d50\u679c\u304c\u5f97\u3089\u308c\u307e\u3057\u305f\u3002\n\u5909\u66f4\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f {1} \u3067\u3001\u6bd4\u8f03\u306e\u305f\u3081\u306b HTML \u51fa\u529b\u304b\u3089\u53d6\u308a\u9664\u304b\u308c\u307e\u3059\u3002
ascanrules.sqlinjection.alert.orderbybased.extrainfo=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b "ORDER BY" \u5f0f [{0}] \u3092\u4e0e\u3048\u3066\u3082\u3001\u5143\u306e\u30da\u30fc\u30b8\u3068\u540c\u4e00\u306e\u8868\u793a\u7d50\u679c\u304c\u5f97\u3089\u308c\u307e\u3057\u305f\u3002\n\u5909\u66f4\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f {1} \u3067\u3001\u6bd4\u8f03\u306e\u305f\u3081\u306b HTML \u51fa\u529b\u304b\u3089\u53d6\u308a\u9664\u304b\u308c\u307e\u3059\u3002
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Unmodified message gave HTTP status [{0}], modified message gave HTTP status [{1}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo=Unmodified message gave HTTP status [{0}], body of length [{1}], modified message gave HTTP status [{2}], body of length [{3}]. A third (non-SQL injection inducing value) gave HTTP status [{4}], body of length [{5}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo=\u30d6\u30fc\u30eb\u6761\u4ef6 [{0}] \u3068 [{1}] \u3092\u4f7f\u7528\u3057\u3001\u30da\u30fc\u30b8\u306e\u8868\u793a\u7d50\u679c\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u306b\u6210\u529f\u3057\u307e\u3057\u305f\u3002\n\u5909\u66f4\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f {2} \u3067\u3001\u6bd4\u8f03\u306e\u305f\u3081\u306b HTML \u51fa\u529b\u304b\u3089\u53d6\u308a\u9664\u304b\u308c\u307e\u3059\u3002
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists=\u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5bfe\u3057\u3066\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u3001\u5143\u3005\u8fd4\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u306b\u6210\u529f\u3057\u305f\u305f\u3081\u3001\u3053\u306e\u8106\u5f31\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists=\u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u30aa\u30ea\u30b8\u30ca\u30eb\u3088\u308a\u591a\u304f\u306e\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u305f\u306e\u3067\u3001\u3053\u306e\u8106\u5f31\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
ascanrules.sqlinjection.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds 
ascanrules.sqlinjection.authbypass.name=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - \u8a8d\u8a3c\u306e\u30d0\u30a4\u30d1\u30b9
ascanrules.sqlinjection.authbypass.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306f\u3001\u30ed\u30b0\u30a4\u30f3 \u30da\u30fc\u30b8\u3067\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8a8d\u8a3c\u6a5f\u69cb\u3092\u30d0\u30a4\u30d1\u30b9\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 

ascanrules.extredirect.reason.location.header=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8URL\u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Location \u30d8\u30c3\u30c0\u5185\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.location.meta=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8URL\u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Location \u3092\u6307\u5b9a\u3057\u305f meta http-equiv \u30bf\u30b0\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.refresh.header=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Refresh \u30d8\u30c3\u30c0\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.refresh.meta=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u6307\u5b9a\u3067\u304d\u308b\u300cRefresh\u300dmeta http-equiv \u30bf\u30b0\u3092\u7528\u3044\u305f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.javascript=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b JavaScript \u30b3\u30fc\u30c9\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.notfound=\u9069\u5207\u306a\u7406\u7531\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u2026

