#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=\u30a2\u30af\u30c6\u30a3\u30d6 \u30b9\u30ad\u30e3\u30f3 \u30eb\u30fc\u30eb

ascanrules.clientbrowsercache.desc=\u4fdd\u8b77\u3055\u308c\u305f\u30da\u30fc\u30b8\u306f\u30d6\u30e9\u30a6\u30b6\u30fc\u3067\u30ad\u30e3\u30c3\u30b7\u30e5\u3067\u304d\u307e\u3059\u3002HTTP\u30d8\u30c3\u30c0\u306b\u3082HTML\u306e\u30d8\u30c3\u30c0\u8981\u7d20\u306b\u3082\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u306f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u6a5f\u5bc6\u6027\u306e\u9ad8\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u3001\u30d6\u30e9\u30a6\u30b6\u30fc\u306e\u30b9\u30c8\u30ec\u30fc\u30b8\u304b\u3089\u5fa9\u5143\u3067\u304d\u3066\u3057\u307e\u3044\u307e\u3059\u3002
ascanrules.clientbrowsercache.name=\u30da\u30fc\u30b8\u306e\u30d6\u30e9\u30a6\u30b6\u30fc\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u4fdd\u8b77\u3057\u307e\u3059\u3002
ascanrules.clientbrowsercache.ref=How to prevent caching in Internet Explorer - http\://support.microsoft.com/default.aspx?kbid\=234067\n\nPragma\: No-cache Tag May Not Prevent Page from Being Cached - http\://support.microsoft.com/default.aspx?kbid\=222064
ascanrules.clientbrowsercache.solution=The best way is to set HTTP header with\: 'Pragma\: No-cache' and 'Cache-control\: No-cache'. \n\nAlternatively, this can be set in the HTML header by\: \n\n<META HTTP-EQUIV\='Pragma' CONTENT\='no-cache'> \n\n<META HTTP-EQUIV\='Cache-Control' CONTENT\='no-cache'> \n\nbut some browsers may have problem using this method.

ascanrules.cmdinjection.name=\u30ea\u30e2\u30fc\u30c8 OS \u30b3\u30de\u30f3\u30c9 \u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 \u30d7\u30e9\u30b0\u30a4\u30f3
ascanrules.cmdinjection.desc=Attack technique used for unauthorized execution of operating system commands. This attack is possible when an application accepts untrusted input to build operating system commands in an insecure manner involving improper data sanitization, and/or improper calling of external programs.

ascanrules.rxss.name=Cross Site Scripting (Reflected)

ascanrules.pxss.attack.name=\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0 (\u6301\u7d9a\u578b)
ascanrules.pxss.otherinfo=\u30bd\u30fc\u30b9URL\: {0}
ascanrules.pxss.prime.name=\u30af\u30ed\u30b9\u3000\u30b5\u30a4\u30c8 \u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0(\u6301\u7d9a\u7684) - \u30d7\u30e9\u30a4\u30e0
ascanrules.pxss.spider.name=\u30af\u30ed\u30b9\u30b5\u30a4\u30c8\u30b9\u30af\u30ea\u30d7\u30c6\u30a3\u30f3\u30b0(\u6301\u7d9a\u578b) - \u30b9\u30d1\u30a4\u30c0\u30fc

ascanrules.sqlinjection.name=SQL Injection
ascanrules.sqlinjection.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306e\u53ef\u80fd\u6027
ascanrules.sqlinjection.soln=Do not trust client side input, even if there is client side validation in place.  \nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality\!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply a 'whitelist' of allowed characters, or a 'blacklist' of disallowed characters in user input.\nApply the privilege of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.
ascanrules.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.sqlinjection.alert.errorbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack=Original Value\: [{0}]. Modified Value\: [{1}]. Control Value\: [{2}]
ascanrules.sqlinjection.alert.booleanbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanrules.sqlinjection.alert.unionbased.attack=[{0}] \u30d5\u30a3\u30fc\u30eb\u30c9\: [{1}]\u3000\u5024\uff1a[{2}] 
ascanrules.sqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] likely, given error message fragment [{1}] in HTML results.\nThe vulnerability was detected by manipulating the parameter to cause a database error message to be returned and recognised
ascanrules.sqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] likely, given UNION-specific error message fragment [{1}] in HTML results\nThe vulnerability was detected by manipulating the parameter with an SQL ''UNION'' clause to cause a database error message to be returned and recognised
ascanrules.sqlinjection.alert.expressionbased.extrainfo=The original page results were successfully replicated using the expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison
ascanrules.sqlinjection.alert.orderbybased.extrainfo=The original page results were successfully replicated using the "ORDER BY" expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Unmodified message gave HTTP status [{0}], modified message gave HTTP status [{1}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo=Unmodified message gave HTTP status [{0}], body of length [{1}], modified message gave HTTP status [{2}], body of length [{3}]. A third (non-SQL injection inducing value) gave HTTP status [{4}], body of length [{5}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo=The page results were successfully manipulated using the boolean conditions [{0}] and [{1}]\nThe parameter value being modified was {2}stripped from the HTML output for the purposes of the comparison
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists=Data was returned for the original parameter.\nThe vulnerability was detected by successfully restricting the data originally returned, by manipulating the parameter
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists=\u5143\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\n\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u3053\u3068\u3067\u30aa\u30ea\u30b8\u30ca\u30eb\u3088\u308a\u591a\u304f\u306e\u30c7\u30fc\u30bf\u304c\u8fd4\u3055\u308c\u305f\u306e\u3067\u3001\u3053\u306e\u8106\u5f31\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
ascanrules.sqlinjection.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds 
ascanrules.sqlinjection.authbypass.name=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3 - \u8a8d\u8a3c\u306e\u30d0\u30a4\u30d1\u30b9
ascanrules.sqlinjection.authbypass.desc=SQL\u30a4\u30f3\u30b8\u30a7\u30af\u30b7\u30e7\u30f3\u306f\u3001\u30ed\u30b0\u30a4\u30f3 \u30da\u30fc\u30b8\u3067\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8a8d\u8a3c\u6a5f\u69cb\u3092\u30d0\u30a4\u30d1\u30b9\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 

ascanrules.extredirect.reason.location.header=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8URL\u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Location \u30d8\u30c3\u30c0\u5185\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.location.meta=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8URL\u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Location \u3092\u6307\u5b9a\u3057\u305f meta http-equiv \u30bf\u30b0\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.refresh.header=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b Refresh \u30d8\u30c3\u30c0\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.refresh.meta=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u6307\u5b9a\u3067\u304d\u308b\u300cRefresh\u300dmeta http-equiv \u30bf\u30b0\u3092\u7528\u3044\u305f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.javascript=\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u3001\u5916\u90e8 URL \u3092\u30bb\u30c3\u30c8\u3067\u304d\u308b JavaScript \u30b3\u30fc\u30c9\u306b\u3088\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
ascanrules.extredirect.reason.notfound=\u9069\u5207\u306a\u7406\u7531\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u2026

