#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=R\u00e8gles d'analyse active

ascanrules.clientbrowsercache.desc=La page s\u00e9curis\u00e9e peut \u00eatre mise en cache dans le navigateur. Le contr\u00f4le de cache n'est d\u00e9fini ni dans l'en-t\u00eate HTTP, ni dans l'en-t\u00eate HTML. Le contenu sensible peut \u00eatre r\u00e9cup\u00e9r\u00e9 de la zone de stockage du navigateur.
ascanrules.clientbrowsercache.name=Cache du navigateur pour les pages s\u00e9curis\u00e9es
ascanrules.clientbrowsercache.ref=Comment emp\u00eacher la mise en cache dans Internet Explorer - http\://support.microsoft.com/default.aspx?kbid\=234067\n\nPragma\: la balise No-cache peut ne pas emp\u00eacher la mise en cache de la page - http\://support.microsoft.com/default.aspx?kbid\=222064
ascanrules.clientbrowsercache.solution=La meilleure fa\u00e7on est de d\u00e9finir l'en-t\u00eate HTTP avec\: 'Pragma\: No-cache' et ' Cache-control\: No-cache'.   \n\nUne alternative serait de d\u00e9finir l'en-t\u00eate HTML avec\:\n\n<META HTTP-EQUIV \= 'Pragma' CONTENT \='no-cache'>\n\n<META HTTP-EQUIV \= 'Cache-Control' CONTENT\='no-cache'>\n\nmais certains navigateurs pourraient poser probl\u00e8me avec cette m\u00e9thode.

ascanrules.cmdinjection.name=Plugin d'Injection de commande d'OS distante
ascanrules.cmdinjection.desc=Technique d'attaque utilis\u00e9e pour l'ex\u00e9cution non autoris\u00e9e de commandes du syst\u00e8me d'exploitation. Cette attaque est possible lorsqu'une application accepte des entr\u00e9es douteuses pour g\u00e9n\u00e9rer des commandes du syst\u00e8me d'exploitation de mani\u00e8re vuln\u00e9rable, sans assainissement correct des donn\u00e9es et/ou sans appel de programmes externes.

ascanrules.rxss.name=Cross Site Scripting (Traduit)

ascanrules.pxss.attack.name=Cross-Site Scripting (persistant)
ascanrules.pxss.otherinfo=URL de la source\: {0}
ascanrules.pxss.prime.name=Cross Site Scripting (persistant) - premier
ascanrules.pxss.spider.name=Cross-Site Scripting (persistant) - Robot d'indexation

ascanrules.sqlinjection.name=Injection SQL
ascanrules.sqlinjection.desc=Une injection SQL peut \u00eatre possible
ascanrules.sqlinjection.soln=Ne faites pas confiance aux entr\u00e9es du c\u00f4t\u00e9 client, m\u00eame si des m\u00e9canismes de validation sont en place c\u00f4t\u00e9 client. En g\u00e9n\u00e9ral, contr\u00f4lez du c\u00f4t\u00e9 serveur le type de chaque donn\u00e9e.\nSi l'application utilise JDBC, utilisez les m\u00e9thodes PreparedStatement ou CallableStatement, avec les param\u00e8tres pass\u00e9s par '?'\nSi l'application utilise ASP, utilisez les Command Objects ADO avec un typage fort et des requ\u00eates param\u00e9tr\u00e9es.\nSi l'utilisation de Proc\u00e9dure Stock\u00e9es est possible, utilisez-les. \nNe concat\u00e9nez *pas* les cha\u00eenes de caract\u00e8res dans les requ\u00eates \u00e0 l'int\u00e9rieur des proc\u00e9dures stock\u00e9es, ou utilisez des fonctions 'exec', 'exec immediate' ou d'autre fonctions \u00e9quivalentes\!\nNe cr\u00e9ez pas des requ\u00eates SQL dynamiques par simples concat\u00e9nation de cha\u00eenes de caract\u00e8res.\n\u00c9chappez toutes les donn\u00e9es re\u00e7ues du client.\nAppliquez une 'liste blanche' des caract\u00e8res autoris\u00e9s, ou une 'liste noir' des caract\u00e8res interdits dans les entr\u00e9es de l'utilisateur.\nAppliquez le principe de moindre privil\u00e8ge en utilisant les privil\u00e8ges utilisateur minimaux sur la base de donn\u00e9e.\nEn particulier, \u00e9vitez l'utilisation des utilisateurs 'sa' ou 'db-owner'. Ceci n'\u00e9limine pas les injections SQL, mais minimise leur impact.\nAccordez le minimum de droits d'acc\u00e8s aux bases de donn\u00e9es n\u00e9cessaires \u00e0 l'application.
ascanrules.sqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.sqlinjection.alert.errorbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.sqlinjection.alert.errorbased.differentiation.attack=Valeur d'Origine\: [{0}]. Valeur Modifi\u00e9e\: [{1}]. Valeur de Contr\u00f4le\: [{2}]
ascanrules.sqlinjection.alert.booleanbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.sqlinjection.alert.unionbased.attack=[{0}] champ\: [{1}], valeur [{2}]
ascanrules.sqlinjection.alert.errorbased.extrainfo=SGBDR [{0}] probable, compte tenu du fragment de message d'erreur [{1}] dans les r\u00e9sultats de l'HTML.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre pour provoquer le message d'erreur de base de donn\u00e9es retourn\u00e9
ascanrules.sqlinjection.alert.unionbased.extrainfo=SGBDR [{0}] probable, compte tenu du fragment de message d'erreur sp\u00e9cifique \u00e0 l'UNION [{1}] trouv\u00e9 dans la r\u00e9ponse HTML\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre avec une clause SQL ' UNION' pour provoquer le message d'erreur de base de donn\u00e9es retourn\u00e9
ascanrules.sqlinjection.alert.expressionbased.extrainfo=Les r\u00e9sultats de la page originale ont \u00e9t\u00e9 reproduits avec succ\u00e8s en utilisant l'expression [{0}] comme valeur du param\u00e8tre\nLa valeur du param\u00e8tre {1} en cours de modification est extraite de la sortie HTML aux fins de comparaison
ascanrules.sqlinjection.alert.orderbybased.extrainfo=Les r\u00e9sultats de la page originale ont \u00e9t\u00e9 reproduits avec succ\u00e8s en utilisant l'expression "ORDER BY" [{0}] comme valeur de param\u00e8tre\nLa valeur du param\u00e8tre {1} en cours de modification est extraite de la sortie HTML aux fins de comparaison
ascanrules.sqlinjection.alert.errorbased.httpstatuscode.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], le message modifi\u00e9 donne le statut HTTP [{1}]
ascanrules.sqlinjection.alert.errorbased.differentiation.extrainfo=Le message non modifi\u00e9 donne le statut HTTP [{0}], un corps d'une longueur [{1}], le message modifi\u00e9 donne le statut HTTP [{2}], un corps d'une longueur [{3}]. Un tiers (une injection non-SQL induisant une valeur) donne un statut HTTP [{4}], un corps d'une longueur [{5}]
ascanrules.sqlinjection.alert.booleanbased.extrainfo=Les r\u00e9sultats de la page ont \u00e9t\u00e9 manipul\u00e9s avec succ\u00e8s en utilisant les conditions bool\u00e9ennes [{0}] et [{1}]\nLa valeur du param\u00e8tre en cours de modification {2} est extraite de la sortie HTML aux fins de comparaison
ascanrules.sqlinjection.alert.booleanbased.extrainfo.dataexists=La donn\u00e9es a \u00e9t\u00e9 retourn\u00e9e pour le param\u00e8tre d'origine.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en restreignant avec succ\u00e8s les donn\u00e9es initialement retourn\u00e9es, en manipulant le param\u00e8tre
ascanrules.sqlinjection.alert.booleanbased.extrainfo.datanotexists=Les donn\u00e9es n'ont PAS \u00e9t\u00e9 retourn\u00e9es pour le param\u00e8tre d'origine.\nLa vuln\u00e9rabilit\u00e9 a \u00e9t\u00e9 d\u00e9tect\u00e9e en manipulant le param\u00e8tre pour r\u00e9cup\u00e9rer avec succ\u00e8s plus de donn\u00e9es qu'initialement retourn\u00e9es,
ascanrules.sqlinjection.alert.timebased.extrainfo=Le temps de la requ\u00eate est contr\u00f4lable \u00e0 l'aide de la valeur du param\u00e8tre [{0}], qui lui fait ainsi prendre [{1}] millisecondes, alors que la requ\u00eate d'origine, non modifi\u00e9e avec la valeur [{2}] prend, quant \u00e0 elle, [{3}] millisecondes 
ascanrules.sqlinjection.authbypass.name=Injection SQL - contournement de l'authentification
ascanrules.sqlinjection.authbypass.desc=L'injection SQL peut \u00eatre possible sur une page de connexion, ce qui peut permettre de contourner le m\u00e9canisme d'authentification de l'application 

ascanrules.extredirect.reason.location.header=La r\u00e9ponse contient une redirection dans le champ d'en-t\u00eate Location, ce qui permet de d\u00e9finir une Url externe.
ascanrules.extredirect.reason.location.meta=La r\u00e9ponse contient une redirection pour 'Location' dans sa balise meta http-equiv, ce qui permet de d\u00e9finir une Url externe.
ascanrules.extredirect.reason.refresh.header=La r\u00e9ponse contient une redirection dans le champ d'en-t\u00eate Refresh, ce qui permet de d\u00e9finir une Url externe.
ascanrules.extredirect.reason.refresh.meta=La r\u00e9ponse contient une redirection pour 'Refresh' dans sa balise meta http-equiv, ce qui permet de d\u00e9finir une Url externe.
ascanrules.extredirect.reason.javascript=La r\u00e9ponse contient une redirection dans son code JavaScript qui permet de d\u00e9finir une Url externe.
ascanrules.extredirect.reason.notfound=Aucune raison trouv\u00e9e pour ceci...

