#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

ascanrules.desc=Active Scan Rules

ascanrules.bufferoverflow.name=Puffer t\u00falcsordul\u00e1s
ascanrules.bufferoverflow.desc=Buffer overflow errors are characterized by the overwriting of memory spaces of the background web process, which should have never been modified intentionally or unintentionally. Overwriting values of the IP (Instruction Pointer), BP (Base Pointer) and other registers causes exceptions, segmentation faults, and other process errors to occur. Usually these errors end execution of the application in an unexpected way. 
ascanrules.bufferoverflow.soln=\u00c1t\u00edrni a h\u00e1tt\u00e9rben a program seg\u00edts\u00e9g\u00e9vel megfelel\u0151 vissza hossz ellen\u0151rz\u00e9se. Ehhez egy \u00fajraford\u00edtani a h\u00e1tt\u00e9rben futtathat\u00f3.
ascanrules.bufferoverflow.refs=https\://www.owasp.org/index.php/Buffer_overflow_attack
ascanrules.bufferoverflow.other=Lehets\u00e9ges Buffer Overflow. A forgat\u00f3k\u00f6nyvet z\u00e1rt a kapcsolatot, majd dobott egy 500 Internal Server Error


ascanrules.commandinjectionplugin.name=Remote OS Command Injection
ascanrules.commandinjectionplugin.desc=T\u00e1mad\u00e1s a technik\u00e1t haszn\u00e1lt a jogosulatlan v\u00e9grehajt\u00e1sa az oper\u00e1ci\u00f3s rendszer parancsok. Ez a t\u00e1mad\u00e1s lehets\u00e9ges, ha a k\u00e9relmet elfogadja, megb\u00edzhat\u00f3 bemeneti \u00e9p\u00edteni oper\u00e1ci\u00f3s rendszer parancsok egy bizonytalan m\u00f3don \u00e9rint\u0151, a helytelen adatok fert\u0151tlen\u00edt\u00e9s, \u00e9s/vagy nem megfelel\u0151 h\u00edv\u00f3 k\u00fcls\u0151 programok.
ascanrules.commandinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/78.html\nhttps\://www.owasp.org/index.php/Command_Injection

ascanrules.formatstring.name=Format String Error
ascanrules.formatstring.desc=A Format String error occurs when the submitted data of an input string is evaluated as a command by the application. 
ascanrules.formatstring.soln=\u00c1t\u00edrni a h\u00e1tt\u00e9rben a program a megfelel\u0151 t\u00f6rl\u00e9s a rossz karaktersor. Ehhez egy \u00fajraford\u00edtani a h\u00e1tt\u00e9rben futtathat\u00f3.
ascanrules.formatstring.refs=https\://www.owasp.org/index.php/Format_string_attack
ascanrules.formatstring.error1=Potential Format String Error.  The script closed the connection on a /%s
ascanrules.formatstring.error2=Potential Format String Error.  The script closed the connection on a /%s and /%x
ascanrules.formatstring.error3=Potential Format String Error.  The script closed the connection on a microsoft format string error


ascanrules.testscrosssitescriptv2.name=Cross Site Scripting (Reflected)
ascanrules.testscrosssitescriptv2.otherinfo.nothtml=Raised with LOW confidence as the Content-Type is not HTML

ascanrules.testpersistentxssattack.name=Cross Site Scripting (Persistent)
ascanrules.testpersistentxssattack.otherinfo=Source URL\: {0}

ascanrules.testpersistentxssprime.name=Cross Site Scripting (Persistent) - Prime
ascanrules.testpersistentxssprime.misc=N/A

ascanrules.testpersistentxssspider.name=Cross Site Scripting (Persistent) - Spider
ascanrules.testpersistentxssspider.misc=N/A

ascanrules.testsqlinjection.name=SQL Injection
ascanrules.testsqlinjection.desc=SQL injection may be possible.
ascanrules.testsqlinjection.soln=Nem b\u00edznak kliens oldali bemenet, m\u00e9g akkor is, ha van kliens oldali \u00e9rv\u00e9nyes\u00edt\u00e9s a hely.  \nAz \u00e1ltal\u00e1nos, t\u00edpus ellen\u0151rizze az adatokat a szerver oldalon. Ha az alkalmaz\u00e1s JDBC, haszn\u00e1lja a PreparedStatement vagy CallableStatement, param\u00e9terek \u00e1ltal elfogadott '?' Ha az alkalmaz\u00e1s ASP, haszn\u00e1lata N\u00c9LK\u00dcL a Parancs T\u00e1rgyak er\u0151s t\u00edpus\u00fa ellen\u0151rz\u00e9se, valamint k\u00f3dokat lek\u00e9rdez\u00e9sek. Ha adatb\u00e1zisban T\u00e1rolt Elj\u00e1r\u00e1sok lehet haszn\u00e1lni, haszn\u00e1lni \u0151ket. *Nem* \u00f6sszef\u0171zni h\u00farok a lek\u00e9rdez\u00e9sek a t\u00e1rolt elj\u00e1r\u00e1s, vagy haszn\u00e1ld a 'igazgat\u00f3', 'exec azonnali, vagy ezzel egyen\u00e9rt\u00e9k\u0171 funkci\u00f3t\! Ne hozzon l\u00e9tre a dinamikus SQL lek\u00e9rdez\u00e9sek seg\u00edts\u00e9g\u00e9vel egyszer\u0171 string \u00f6sszef\u0171z\u00e9s. Menek\u00fcl\u00e9s minden adatot kapott az \u00fcgyf\u00e9l. Alkalmazni egy whitelist' az enged\u00e9lyezett karakterek, vagy egy "feketelista" a nem enged\u00e9lyezett karakterek felhaszn\u00e1l\u00f3i bevitel. Alkalmazza a legkisebb jogosults\u00e1g elv\u00e9nek seg\u00edts\u00e9g\u00e9vel a legkevesebb joggal rendelkez\u0151 adatb\u00e1zis felhaszn\u00e1l\u00f3i lehets\u00e9ges. K\u00fcl\u00f6n\u00f6sen ker\u00fclje a 'sa", vagy a " db-tulajdonos adatb\u00e1zis a felhaszn\u00e1l\u00f3k. Ez nem sz\u00fcnteti meg az SQL injection, de minim\u00e1lisra cs\u00f6kkenti a hat\u00e1st. Grant a minim\u00e1lis adatb\u00e1zis hozz\u00e1f\u00e9r\u00e9s sz\u00fcks\u00e9ges, a k\u00e9relmet.
ascanrules.testsqlinjection.refs=https\://www.owasp.org/index.php/Top_10_2010-A1\nhttps\://www.owasp.org/index.php/SQL_Injection_Prevention_Cheat_Sheet
ascanrules.testsqlinjection.alert.errorbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.attack=Original Value\: [{0}]. Modified Value\: [{1}]. Control Value\: [{2}]
ascanrules.testsqlinjection.alert.booleanbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.unionbased.attack=[{0}] field\: [{1}], value [{2}]
ascanrules.testsqlinjection.alert.errorbased.extrainfo=RDBMS [{0}] likely, given error message regular expression [{1}] matched by the HTML results.\nThe vulnerability was detected by manipulating the parameter to cause a database error message to be returned and recognised
ascanrules.testsqlinjection.alert.unionbased.extrainfo=RDBMS [{0}] likely, given UNION-specific error message regular expression [{1}] matched by the HTML results\nThe vulnerability was detected by manipulating the parameter with an SQL ''UNION'' clause to cause a database error message to be returned and recognised
ascanrules.testsqlinjection.alert.expressionbased.extrainfo=The original page results were successfully replicated using the expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison
ascanrules.testsqlinjection.alert.orderbybased.extrainfo=The original page results were successfully replicated using the "ORDER BY" expression [{0}] as the parameter value\nThe parameter value being modified was {1}stripped from the HTML output for the purposes of the comparison
ascanrules.testsqlinjection.alert.errorbased.httpstatuscode.extrainfo=Unmodified message gave HTTP status [{0}], modified message gave HTTP status [{1}]
ascanrules.testsqlinjection.alert.errorbased.differentiation.extrainfo=Unmodified message gave HTTP status [{0}], body of length [{1}], modified message gave HTTP status [{2}], body of length [{3}]. A third (non-SQL injection inducing value) gave HTTP status [{4}], body of length [{5}]
ascanrules.testsqlinjection.alert.booleanbased.extrainfo=The page results were successfully manipulated using the boolean conditions [{0}] and [{1}]\nThe parameter value being modified was {2}stripped from the HTML output for the purposes of the comparison
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.dataexists=Data was returned for the original parameter.\nThe vulnerability was detected by successfully restricting the data originally returned, by manipulating the parameter
ascanrules.testsqlinjection.alert.booleanbased.extrainfo.datanotexists=Az adatok NEM t\u00e9rtek vissza az eredeti param\u00e9ter. A biztons\u00e1gi r\u00e9s \u00e1ltal \u00e9szlelt sikeresen let\u00f6lt\u00e9se t\u00f6bb adatot, mint eredetileg visszat\u00e9rt, manipul\u00e1l\u00e1s\u00e1val a param\u00e9ter
ascanrules.testsqlinjection.alert.timebased.extrainfo=The query time is controllable using parameter value [{0}], which caused the request to take [{1}] milliseconds, when the original unmodified query with value [{2}] took [{3}] milliseconds 
ascanrules.testsqlinjection.authbypass.name=SQL Injection - Authentication Bypass
ascanrules.testsqlinjection.authbypass.desc=SQL injection may be possible on a login page, potentially allowing the application's authentication mechanism to be bypassed 

ascanrules.testexternalredirect.name=External Redirect
ascanrules.testexternalredirect.reason.location.header=A v\u00e1lasz tartalmaz egy \u00e1tir\u00e1ny\u00edt\u00e1s a Hely\u00e9t fejl\u00e9c, amely lehet\u0151v\u00e9 teszi, hogy egy k\u00fcls\u0151 Url-t kell be\u00e1ll\u00edtani.
ascanrules.testexternalredirect.reason.location.meta=A v\u00e1lasz tartalmazza az \u00e1tir\u00e1ny\u00edt\u00e1s a meta http-equiv tag a 'Hely', amely lehet\u0151v\u00e9 teszi, hogy egy k\u00fcls\u0151 Url-t kell be\u00e1ll\u00edtani.
ascanrules.testexternalredirect.reason.refresh.header=A v\u00e1lasz tartalmazza az \u00e1tir\u00e1ny\u00edt\u00e1s a Friss\u00edt\u00e9s fejl\u00e9c, amely lehet\u0151v\u00e9 teszi, hogy egy k\u00fcls\u0151 Url-t kell be\u00e1ll\u00edtani.
ascanrules.testexternalredirect.reason.refresh.meta=A v\u00e1lasz tartalmazza az \u00e1tir\u00e1ny\u00edt\u00e1s a meta http-equiv tag a "Refresh", amely lehet\u0151v\u00e9 teszi, hogy egy k\u00fcls\u0151 Url-t kell be\u00e1ll\u00edtani.
ascanrules.testexternalredirect.reason.javascript=A v\u00e1lasz tartalmazza az \u00e1tir\u00e1ny\u00edt\u00e1s a JavaScript k\u00f3dot, amely lehet\u0151v\u00e9 teszi, hogy egy k\u00fcls\u0151 Url-t kell be\u00e1ll\u00edtani.
ascanrules.testexternalredirect.reason.notfound=No reason found for it...

ascanrules.codeinjectionplugin.name=Server Side Code Injection
ascanrules.codeinjectionplugin.name.asp=Server Side Code Injection - ASP Code Injection
ascanrules.codeinjectionplugin.name.php=Server Side Code Injection - PHP Code Injection
ascanrules.codeinjectionplugin.desc=A code injection may be possible including custom code that will be evaluated by the scripting engine
ascanrules.codeinjectionplugin.soln=Do not trust client side input, even if there is client side validation in place.\nIn general, type check all data on the server side and escape all data received from the client.\n Avoid the use of eval() functions combined with user input data.
ascanrules.codeinjectionplugin.refs=http\://cwe.mitre.org/data/definitions/94.html\nhttps\://www.owasp.org/index.php/Direct_Dynamic_Code_Evaluation_('Eval_Injection')

ascanrules.testdirectorybrowsing.name=Directory Browsing
ascanrules.testdirectorybrowsing.desc=It is possible to view the directory listing.  Directory listing may reveal hidden scripts, include files , backup source files etc which can be accessed to read sensitive information.
ascanrules.testdirectorybrowsing.soln=Disable directory browsing.  If this is required, make sure the listed files does not induce risks.
ascanrules.testdirectorybrowsing.refs=http\://httpd.apache.org/docs/mod/core.html\#options\nhttp\://alamo.satlug.org/pipermail/satlug/2002-February/000053.html\n

ascanrules.testinjectioncrlf.name=CRLF Injection
ascanrules.testinjectioncrlf.desc=Cookie can be set via CRLF injection.  It may also be possible to set arbitrary HTTP response headers. In addition, by carefully crafting the injected response using cross-site script, cache poisoning vulnerability may also exist.
ascanrules.testinjectioncrlf.soln=Type check the submitted parameter carefully.  Do not allow CRLF to be injected by filtering CRLF.
ascanrules.testinjectioncrlf.refs=http\://www.watchfire.com/resources/HTTPResponseSplitting.pdf\nhttp\://webappfirewall.com/lib/crlf-injection.txtnull\nhttp\://www.securityfocus.com/bid/9804

ascanrules.testparametertamper.name=Parameter Tampering
ascanrules.testparametertamper.desc=Parameter manipulation caused an error page or Java stack trace to be displayed.  This indicated lack of exception handling and potential areas for further exploit.
ascanrules.testparametertamper.soln=Identify the cause of the error and fix it.  Do not trust client side input and enforce a tight check in the server side.  Besides, catch the exception properly.  Use a generic 500 error page for internal server error.

ascanrules.testpathtraversal.name=Path Traversal

ascanrules.testremotefileinclude.name=Remote File Inclusion

ascanrules.testserversideinclude.name=Server Side Include
ascanrules.testserversideinclude.desc=Bizonyos param\u00e9terek okozhat Server Side Include parancsokat v\u00e9grehajtani. Ez lehet\u0151v\u00e9 teszi, hogy az adatb\u00e1zis-kapcsolat, vagy tetsz\u0151leges k\u00f3d v\u00e9gezni.
ascanrules.testserversideinclude.soln=Nem b\u00edznak kliens oldali bemeneti \u00e9rv\u00e9nyes\u00edthet\u0151 sz\u0171k ellen\u0151rizze a szerver oldalon. Tiltsa le server side includes.\n
Refer=to manual to disable Sever Side Include.\n\nUse least privilege to run your web server or application server.\n\nFor Apache, disable the following\:\n\nOptions Indexes FollowSymLinks Includes\n\nAddType application/x-httpd-cgi .cgi\n\nAddType text/x-server-parsed-html .html
ascanrules.testserversideinclude.refs=http\://www.carleton.ca/~dmcfet/html/ssi.html

