#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=\u9759\u7684\u30b9\u30ad\u30e3\u30f3\u30eb\u30fc\u30eb - Beta

pscanbeta.authenticationcredentialscaptured.name=Authentication Credentials Captured
pscanbeta.authenticationcredentialscaptured.desc=\u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u8a8d\u8a3c\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306e ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u3001\u540c\u4e00\u30cd\u30c3\u30c8\u30ef\u30fc\u30af \u4e0a\u306e\u653b\u6483\u8005\u304b\u3089\u508d\u53d7\u53ef\u80fd\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002\n\nBASIC\u8a8d\u8a3c\u306e\u5834\u5408\u3001\u653b\u6483\u8005\u306f\u5358\u306bBASIC\u8a8d\u8a3c\u8981\u6c42\u304c\u53d7\u4fe1\u3055\u308c\u308b\u307e\u3067\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30c8\u30e9\u30d5\u30a3\u30c3\u30af\u3092\u76e3\u8996\u3057\u3001\u53d7\u4fe1\u3055\u308c\u305f\u3089BASE64\u306b\u3088\u3063\u3066\u30e6\u30fc\u30b6\u30fcID\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5fa9\u53f7\u5316\u3057\u307e\u3059\u3002\n\n\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u8a8d\u8a3c\u306e\u5834\u5408\u3001\u653b\u6483\u8005\u304c\u30cf\u30c3\u30b7\u30e5\uff08\u30ca\u30f3\u30b9\u3092\u542b\u3080\uff09\u306e\u89e3\u8aad\u306b\u6210\u529f\u3057\u305f\u5834\u5408\u3001\u307e\u305f\u306f\u4e2d\u9593\u8005\u653b\u6483\u3092\u30de\u30a6\u30f3\u30c8\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3060\u3051\u3067\u306a\u304f\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u5bfe\u3057\u3066\u3082\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u3068\u306a\u308b\u3067\u3057\u3087\u3046\u3002
pscanbeta.authenticationcredentialscaptured.soln=HTTPS\u3092\u4f7f\u7528\u3057\u3001\u30e6\u30fc\u30b6ID\u3084\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5e73\u6587\u3067\u9001\u4fe1\u3057\u306a\u3044\u30bb\u30ad\u30e5\u30a2\u306a\u8a8d\u8a3c\u65b9\u5f0f\u3092\u4f7f\u7528\u3057\u3066\u4e0b\u3055\u3044\u3002\n\u7279\u306b\u3001\u7c21\u5358\u306b\u6697\u53f7\u3092\u89e3\u304b\u308c\u3066\u3057\u307e\u3046\u306e\u3067\u3001BASIC\u8a8d\u8a3c\u306e\u4f7f\u7528\u306f\u907f\u3051\u3066\u4e0b\u3055\u3044\u3002
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] \u306f\u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f [{2}] \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30e6\u30fc\u30b6\u30fc\u540d [{3}] \u3068\u30d1\u30b9\u30ef\u30fc\u30c9 [{4}] \u304c\u508d\u53d7\u53ef\u80fd\u3067\u3059\u3002
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] \u306f\u5b89\u5168\u3067\u306a\u3044\u8a8d\u8a3c\u65b9\u5f0f [{2}] \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30e6\u30fc\u30b6\u30fc\u540d [{3}] \u3068\u8ffd\u52a0\u60c5\u5831 [{4}] \u304c\u508d\u53d7\u53ef\u80fd\u3067\u3059\u3002
pscanbeta.authenticationcredentialscaptured.alert.attack=\u8a8d\u8a3c\u304c\u5b8c\u4e86\u3059\u308b\u307e\u3067\u306e\u9593\u3001\u653b\u6483\u8005\u306b\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3092\u76d7\u8074\u3055\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002

pscanbeta.charsetmismatch.name=\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u4e0d\u4e00\u81f4
pscanbeta.charsetmismatch.desc=\u3053\u306e\u691c\u67fb\u3067\u306f\u3001 HTML \u307e\u305f\u306f XML \u306e body \u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b charset \u3068\u3001HTTP \u306e Content-Type \u30d8\u30c3\u30c0\u30fc\u3067\u5ba3\u8a00\u3055\u308c\u3066\u3044\u308b charset \u304c\u4e00\u81f4\u3057\u3066\u3044\u308b\u304b\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\nHTTP \u30d8\u30c3\u30c0\u30fc\u3068\u30b3\u30f3\u30c6\u30f3\u30c4\u306e body \u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b charset \u304c\u4e00\u81f4\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u3001 Web\u30d6\u30e9\u30a6\u30b6\u306f\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u6b63\u3057\u3044 charset \u3092\u5224\u65ad\u3059\u308b\u305f\u3081\u3001\u672c\u6765\u610f\u56f3\u3057\u3066\u3044\u306a\u3044\u30b3\u30f3\u30c6\u30f3\u30c4\u30b9\u30cb\u30c3\u30d5\u30a3\u30f3\u30b0\u30e2\u30fc\u30c9\u3092\u5f37\u5236\u3055\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.charsetmismatch.soln=\u5168\u3066\u306e Text Content \u3068 HTTP \u30d8\u30c3\u30c0\u30fc\u3001 meta \u30bf\u30b0\u3001 XML\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306b\u304a\u3044\u3066\u3001 UTF-8 \u3092\u6307\u5b9a\u3057\u3066\u4e0b\u3055\u3044\u3002
pscanbeta.charsetmismatch.exploit=\u653b\u6483\u8005\u306f\u3001\u4efb\u610f\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3067\u30da\u30fc\u30b8\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u89e3\u91c8\u3055\u308c\u308b\u3088\u3046\u64cd\u4f5c\u3059\u308b\u4e8b\u304c\u3067\u304d\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u653b\u6483\u8005\u304c\u30da\u30fc\u30b8\u306e\u5148\u982d\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u5236\u5fa1\u3067\u304d\u308b\u5834\u5408\u3001UTF-7 \u3067\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u305f\u30c6\u30ad\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u3066\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u633f\u5165\u3057\u3001\u305d\u306e\u30c6\u30ad\u30b9\u30c8\u3092\u89e3\u91c8\u3059\u308b\u30d6\u30e9\u30a6\u30b6\u30fc\u3092\u64cd\u4f5c\u3059\u308b\u4e8b\u304c\u3067\u304d\u307e\u3059\u3002
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html=HTTP \u30d8\u30c3\u30c0\u30fc\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8 [{0}] \u3068 XML\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u6307\u5b9a [{1}] \u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
pscanbeta.charsetmismatch.extrainfo.xml=HTTP \u30d8\u30c3\u30c0\u30fc\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u6587\u5b57\u30bb\u30c3\u30c8 [{0}] \u3068 XML\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u5ba3\u8a00\u306e\u6587\u5b57\u30bb\u30c3\u30c8\u306e\u6307\u5b9a [{1}] \u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002

pscanbeta.cookielooselyscoped.name=\u30b9\u30b3\u30fc\u30d7\u304c\u5e83\u3044\u30af\u30c3\u30ad\u30fc
pscanbeta.cookielooselyscoped.desc=\u30af\u30c3\u30ad\u30fc\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u307e\u305f\u306f\u30d1\u30b9\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u3067\u30b9\u30b3\u30fc\u30d7\u3092\u9650\u5b9a\u3059\u308b\u4e8b\u304c\u3067\u304d\u307e\u3059\u3002\n\u3053\u306e\u691c\u67fb\u306f\u3001\u30b9\u30b3\u30fc\u30d7\u306b\u30c9\u30e1\u30a4\u30f3\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3092\u5bfe\u8c61\u3068\u3057\u3066\u3044\u307e\u3059\u3002\u30af\u30c3\u30ad\u30fc\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30c9\u30e1\u30a4\u30f3\u30b9\u30b3\u30fc\u30d7\u306f\u3001\u3069\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u30af\u30c3\u30ad\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u304b\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002\n\u30c9\u30e1\u30a4\u30f3\u30b9\u30b3\u30fc\u30d7\u306f\u3001\u4f8b\u3048\u3070\u3001 "www.nottrusted.com" \u306e\u3088\u3046\u306b\u3001\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u307e\u3067\u53b3\u5bc6\u306b\u6307\u5b9a\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u3001 "nottrusted.com" \u306e\u3088\u3046\u306b\u4e0a\u4f4d\u306e\u30c9\u30e1\u30a4\u30f3\u3092\u6307\u5b9a\u3057\u3066\u5e83\u3044\u30b9\u30b3\u30fc\u30d7\u3068\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u5f8c\u8005\u306e\u5834\u5408\u3001  "nottrusted.com" \u306e\u3044\u305a\u308c\u306e\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u306b\u304a\u3044\u3066\u3082\u3001\u30af\u30c3\u30ad\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n"google.com" \u3084 "live.com" \u306e\u3088\u3046\u306a\u5de8\u5927\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u304a\u3044\u3066\u306f\u3001\u5927\u62b5\u30af\u30c3\u30ad\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u306f\u5e83\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pscanbeta.cookielooselyscoped.soln=\u30af\u30c3\u30ad\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u306f\u5e38\u306b FQDN (\u5b8c\u5168\u4fee\u98fe\u30c9\u30e1\u30a4\u30f3\u540d) \u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
pscanbeta.cookielooselyscoped.exploit=app.foo.bar \u306e\u3088\u3046\u306b\u3001\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u30b9\u30b3\u30fc\u30d7\u304c\u6307\u5b9a\u3055\u308c\u305f\u30af\u30c3\u30ad\u30fc\u306f\u3001\u305d\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u306e\u307f\u30a2\u30af\u30bb\u30b9\u3059\u308b\u4e8b\u304c\u3067\u304d\u307e\u3059\u3002\n\u3057\u304b\u3057\u3001\u30af\u30c3\u30ad\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u306b\u4e0a\u4f4d\u30ec\u30d9\u30eb\u306e\u30c9\u30e1\u30a4\u30f3\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u305d\u306e\u4e0a\u4f4d\u30ec\u30d9\u30eb\u306b\u52a0\u3048\u3066\u4efb\u610f\u306e\u30b5\u30d6\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3068\u306a\u308a\u307e\u3059\u3002
pscanbeta.cookielooselyscoped.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=\u6bd4\u8f03\u306b\u4f7f\u7528\u3057\u305f\u5143\u306e\u30c9\u30e1\u30a4\u30f3\:\n{0}\n{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}

pscanbeta.insecureauthentication.name=\u8106\u5f31\u306a\u8a8d\u8a3c\u65b9\u6cd5
pscanbeta.insecureauthentication.desc=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4fdd\u8b77\u3055\u308c\u3066\u3044\u306a\u3044\u63a5\u7d9a\u3092\u4ecb\u3057\u3066 HTTP \u306eBASIC\u8a8d\u8a3c\u307e\u305f\u306f\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u8a8d\u8a3c\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3078\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306a\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u8a8d\u8a3c\u60c5\u5831\u304c\u508d\u53d7\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanbeta.insecureauthentication.soln=HTTPS \u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3092\u4fdd\u8b77\u3057\u305f\u308a\u3001\u5f37\u529b\u306a\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=\u5b89\u5168\u3067\u306a\u3044JSF ViewState
pscanbeta.insecurejsfviewstate.desc=\u6b21\u306e URL \u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u306f\u6697\u53f7\u5316\u4fdd\u8b77\u3092\u6301\u305f\u306a\u3044 ViewState \u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
pscanbeta.insecurejsfviewstate.soln=\u3042\u306a\u305f\u306e\u74b0\u5883\u56fa\u6709\u306e MAC \u30a2\u30c9\u30ec\u30b9\u3092\u4f7f\u3063\u3066\u30bb\u30ad\u30e5\u30a2\u306aVIEWSTATE\u306b\u3057\u3066\u4e0b\u3055\u3044\u3002
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] \u306f\u5b89\u5168\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

pscanbeta.noanticsrftokens.name=\u30a2\u30f3\u30c1-CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044
pscanbeta.noanticsrftokens.desc=HTML \u9001\u4fe1\u30d5\u30a9\u30fc\u30e0\u3067\u30a2\u30f3\u30c1CSRF\u30c8\u30fc\u30af\u30f3\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
pscanbeta.noanticsrftokens.alert.attack=\u5024\u306a\u3057\u3002\u8b66\u544a\u306e\u307f\u3002
pscanbeta.noanticsrftokens.alert.extrainfo=HTML \u30d5\u30a9\u30fc\u30e0 {1} \u306b\u65e2\u77e5\u306e\u30a2\u30f3\u30c1 CSRF \u30c8\u30fc\u30af\u30f3 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
