#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Pasif Tarama Kurallar\u0131 - beta

pscanbeta.authenticationcredentialscaptured.name=Do\u011frulama Kimlik Bilgileri Yakalanan
pscanbeta.authenticationcredentialscaptured.desc=G\u00fcvensiz do\u011frulama mekanizmas\u0131 kullan\u0131l\u0131yor. Bu kimli\u011fi do\u011frulanm\u0131\u015f kullan\u0131c\u0131 kimli\u011fi ve \u015fifre a\u011f eri\u015fimi bir sald\u0131rgan\u0131n izin verir. Temel kimlik do\u011frulamas\u0131 i\u00e7in, sald\u0131rgan\u0131n yaln\u0131zca kullan\u0131c\u0131 ad\u0131 ve \u015fifre de\u015fifre base64 ard\u0131ndan Temel kimlik do\u011frulamas\u0131 iste\u011fi al\u0131nana kadar a\u011f trafi\u011fini izlemek, ve olmal\u0131d\u0131r. \u00d6zet kimlik do\u011frulamas\u0131 i\u00e7in sald\u0131rgan (bir nonce dahil) karma ba\u015far\u0131yla k\u0131r\u0131k olabilir, e\u011fer, kullan\u0131c\u0131 eri\u015fimi ve muhtemelen de \u015fifre vard\u0131r, ya da bir Man-In-Orta sald\u0131r\u0131 monte edilir ise.     
pscanbeta.authenticationcredentialscaptured.soln=HTTPS kullan\u0131n ve un-\u015fifreli bi\u00e7imde kimli\u011fi veya \u015fifre iletmez g\u00fcvenli bir kimlik do\u011frulama mekanizmas\u0131 kullan\u0131n. Bu \u00f6nemsiz \u015fa\u015f\u0131rtmaca mekanizmas\u0131 kolayca bozuldu \u00e7\u00fcnk\u00fc \u00d6zellikle, Temel Kimlik Do\u011frulama mekanizmas\u0131n\u0131n kullan\u0131m\u0131n\u0131 \u00f6nlemek. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3 \nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[ {0} ] [ {1} ] g\u00fcvensiz kimlik do\u011frulama mekanizmas\u0131 kullan\u0131r [ {2} ], ad\u0131n\u0131 if\u015fa [ {3} ] ve \u015fifre [ {4} ].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[ {0} ] [ {1} ] g\u00fcvensiz kimlik do\u011frulama mekanizmas\u0131 kullan\u0131r [ {2} ], ad\u0131n\u0131 if\u015fa [ {3} ] ve ek bilgiler [ {4} ].
pscanbeta.authenticationcredentialscaptured.alert.attack=bir kimlik do\u011frulama tamamlanana kadar sald\u0131rgan a\u011f \u00fczerinde kulak misafiri.

pscanbeta.charsetmismatch.name=Karakter uyu\u015fmazl\u0131\u011f\u0131
pscanbeta.charsetmismatch.desc=Bu onay, HTTP Content-Type \u00fcstbilgisi HTML veya XML v\u00fccut taraf\u0131ndan tan\u0131mlanan charset farkl\u0131 bir karakter k\u00fcmesi beyan yan\u0131tlar\u0131 tan\u0131mlar. HTTP ba\u015fl\u0131k ve i\u00e7erik beden Web taray\u0131c\u0131lar\u0131 aras\u0131nda bir charset uyumsuzlu\u011fu oldu\u011funda i\u00e7eri\u011fin do\u011fru karakter setini belirlemek i\u00e7in istenmeyen bir i\u00e7erik koklama moduna zorlanamaz.
pscanbeta.charsetmismatch.soln=Kuvvet UTF-8 XML HTTP ba\u015fl\u0131k ve meta etiketleri hem veya kodlama beyanlar t\u00fcm metin i\u00e7erik i\u00e7in.
pscanbeta.charsetmismatch.exploit=Sayfadaki i\u00e7eri\u011fi manip\u00fcle olabilir Sald\u0131rgan, kendi se\u00e7tikleri bir kodlama yorumlan\u0131r. Bir sald\u0131rgan\u0131n sayfan\u0131n ba\u015f\u0131nda i\u00e7eri\u011fini kontrol edebilirsiniz \u00d6rne\u011fin, onlar UTF-7 kodlanm\u0131\u015f metin kullanarak komut dosyas\u0131 ekleyebilir ve bu metin yorumlama i\u00e7ine baz\u0131 taray\u0131c\u0131lar i\u015fleyebilirsiniz.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html=HTTP \u00dcstbilgi ve HTML kodlamas\u0131 bildirimi aras\u0131nda bir charset uyumsuzlu\u011fu vard\u0131\: [ {0} ] ve [ {1} ] uyu\u015fmuyor.
pscanbeta.charsetmismatch.extrainfo.xml=HTTP \u00dcstbilgi ve XML kodlama bildirimi aras\u0131nda bir charset uyumsuzlu\u011fu vard\u0131\: [ {0} ] ve [ {1} ] uyu\u015fmuyor.

pscanbeta.cookielooselyscoped.name=Gev\u015fek Scoped \u00c7erez
pscanbeta.cookielooselyscoped.desc=\u00c7erezler etki alan\u0131 veya yolu ile kapsaml\u0131 edilebilir. Bu onay, bir \u00e7erez uygulanan etki scope.The alan\u0131 kapsam\u0131 ile sadece endi\u015fe etki eri\u015febilir belirler. \u00d6rne\u011fin, bir \u00e7erez bir alt \u00f6rn www.nottrusted.com veya gev\u015fek bir \u00fcst etki, \u00f6rne\u011fin nottrusted.com i\u00e7in kapsaml\u0131 kesinlikle kapsaml\u0131 olabilir. Bu durumda, herhangi bir alt etki alan\u0131 nottrusted.com tan\u0131mlama eri\u015febilir. Gev\u015fek kapsaml\u0131 \u00e7erezler google.com ve live.com gibi mega-uygulamalar yayg\u0131nd\u0131r.
pscanbeta.cookielooselyscoped.soln=Bir FQDN (Tam Etki Alan\u0131 Ad\u0131) Her zaman kapsam tan\u0131mlama.
pscanbeta.cookielooselyscoped.exploit=App.foo.bar gibi bir alt k\u00fcmesi \u00c7erezler sadece taray\u0131c\u0131 taraf\u0131ndan bu etki iletilir. Ancak, \u00e7erezler ebeveyn veya veli herhangi bir alt alan iletilebilir bir ebeveyn d\u00fczey etki alan\u0131na kapsaml\u0131.
pscanbeta.cookielooselyscoped.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=Kar\u015f\u0131la\u015ft\u0131rma i\u00e7in kullan\u0131lan men\u015fe alan\u0131 oldu\: {0} {1} \n\n
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\n

pscanbeta.insecureauthentication.name=Zay\u0131f Kimlik Do\u011frulama Y\u00f6ntemi
pscanbeta.insecureauthentication.desc=HTTP Temel ya da \u00f6zet kimlik do\u011frulamas\u0131 g\u00fcvenli olmayan ba\u011flant\u0131 \u00fczerinden kullan\u0131l\u0131r olmu\u015ftur. kimlik okuyun ve sonra a\u011fa eri\u015fimi olan bir ki\u015fi taraf\u0131ndan yeniden kullan\u0131labilir.
pscanbeta.insecureauthentication.soln=HTTPS kullanarak ba\u011flant\u0131y\u0131 korumak veya daha g\u00fc\u00e7l\u00fc bir kimlik do\u011frulama mekanizmas\u0131 kullan\u0131n
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=G\u00fcvensiz JSF ViewState
pscanbeta.insecurejsfviewstate.desc=a\u015fa\u011f\u0131daki URL'den yan\u0131t\u0131 yok kriptografik koruma olan bir ViewState de\u011feri i\u00e7erir.
pscanbeta.insecurejsfviewstate.soln=Ortam\u0131n\u0131za bir MAC \u00f6zg\u00fc olan G\u00fcvenli viewstate
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [ {0} ] g\u00fcvensiz

pscanbeta.noanticsrftokens.name=Anti-CSRF belirte\u00e7leri olmamas\u0131
pscanbeta.noanticsrftokens.desc=Hay\u0131r Anti-CSRF belirte\u00e7leri HTML g\u00f6nderme formunda bulundu.
pscanbeta.noanticsrftokens.alert.attack=Hi\u00e7biri. Sadece Uyar\u0131.
pscanbeta.noanticsrftokens.alert.extrainfo=Bilinen Anti-CSRF belirte\u00e7leri {0} a\u015fa\u011f\u0131daki HTML formlar\u0131 bulundu\: {1} .  
