#X-Generator: crowdin.net
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Passive Scan Rules - beta

pscanbeta.authenticationcredentialscaptured.name=\u06af\u0648\u0627\u0647\u06cc\u0646\u0627\u0645\u0647 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u062f\u0631\u06cc\u0627\u0641\u062a \u0634\u062f
pscanbeta.authenticationcredentialscaptured.desc=\u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u062f\u0631 \u062d\u0627\u0644 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0633\u062a. \u0627\u06cc\u0646 \u0628\u0647 \u0645\u0647\u0627\u062c\u0645 \u062f\u0631 \u0634\u0628\u06a9\u0647 \u0627\u062c\u0627\u0632\u0647 \u062f\u0633\u062a\u0631\u0633\u06cc \u0628\u0647 \u0634\u0646\u0627\u0633\u0647 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u06a9\u0627\u0631\u0628\u0631 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0634\u062f\u0647 \u0631\u0627 \u0645\u06cc\u062f\u0647\u062f. \u0628\u0631\u0627\u06cc Basic Authentication\u060c \u0645\u0647\u0627\u062c\u0645 \u062a\u0646\u0647\u0627 \u0645\u06cc\u0628\u0627\u06cc\u0633\u062a \u062a\u0631\u0627\u0641\u06cc\u06a9 \u0634\u0628\u06a9\u0647 \u0631\u0627 \u062a\u0627 \u0632\u0645\u0627\u0646\u06cc\u06a9\u0647 \u06cc\u06a9 \u062f\u0631\u062e\u0648\u0627\u0633\u062a Basic Authentication \u062f\u0631\u06cc\u0627\u0641\u062a \u0634\u0648\u062f\u060c \u0646\u0638\u0627\u0631\u062a \u06a9\u0646\u062f\u060c \u0648 \u067e\u0633 \u0627\u0632 \u0622\u0646 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0631\u0627 \u0628\u0627 \u0631\u0648\u0634 base64 \u0631\u0645\u0632\u06af\u0634\u0627\u06cc\u06cc \u06a9\u0646\u062f. \u0628\u0631\u0627\u06cc Digest Authentication\u060c \u0645\u0647\u0627\u062c\u0645 \u0628\u0647 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u062f\u0633\u062a\u0631\u0633\u06cc \u062f\u0627\u0631\u062f \u0648 \u0627\u06af\u0631 \u062f\u0631\u0647\u0645 \u0633\u0627\u0632\u06cc (\u0634\u0627\u0645\u0644 \u06cc\u06a9 nonce) \u0628\u0647 \u0637\u0648\u0631 \u0645\u0648\u0641\u0642\u06cc\u062a \u0622\u0645\u06cc\u0632 \u0634\u06a9\u0633\u062a\u0647 \u0634\u0648\u062f\u060c \u06cc\u0627 \u06cc\u06a9 \u062d\u0645\u0644\u0647 Man-In-The-Middle \u0627\u062c\u0631\u0627 \u0634\u0648\u062f\u060c \u0627\u062d\u062a\u0645\u0627\u0644\u0627\u064b \u0628\u0647 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0647\u0645 \u062f\u0633\u062a\u0631\u0633\u06cc \u062e\u0648\u0627\u0647\u062f \u062f\u0627\u0634\u062a.     
pscanbeta.authenticationcredentialscaptured.soln=\u0627\u0632 HTTPS \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f \u0648 \u0627\u0632 \u06cc\u06a9 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f \u06a9\u0647 \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 \u0631\u0627 \u0628\u0635\u0648\u0631\u062a \u0631\u0645\u0632 \u06af\u0630\u0627\u0631\u06cc \u0646\u0634\u062f\u0647 \u0627\u0646\u062a\u0642\u0627\u0644 \u0646\u062f\u0647\u062f. \u0628\u0647 \u0637\u0648\u0631 \u0645\u0634\u062e\u0635\u060c \u0627\u0632 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 Basic Authentication \u062e\u0648\u062f\u062f\u0627\u0631\u06cc \u06a9\u0646\u06cc\u062f\u060c \u0686\u0631\u0627 \u06a9\u0647 \u0627\u06cc\u0646 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u062f\u0631\u0647\u0645 \u0633\u0627\u0632\u06cc \u0645\u0642\u062f\u0645\u0627\u062a\u06cc \u0628\u0647 \u0631\u0627\u062d\u062a\u06cc \u0634\u06a9\u0633\u062a\u0647 \u0645\u06cc\u0634\u0648\u062f. 
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}][{1}] \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc\u06a9\u0646\u062f [{2}]\u060c \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc [{3}] \u0648 \u0631\u0645\u0632 \u0639\u0628\u0648\u0631 [{4}] \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u0645\u06cc\u06a9\u0646\u062f.
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}][{1}] \u0627\u0632 \u0645\u06a9\u0627\u0646\u06cc\u0632\u0645 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u0646\u0627 \u0627\u0645\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc\u06a9\u0646\u062f [{2}]\u060c \u0646\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u06cc [{3}] \u0648 \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u0627\u0636\u0627\u0641\u06cc \u062f\u06cc\u06af\u0631 [{4}] \u0631\u0627 \u0622\u0634\u06a9\u0627\u0631 \u0645\u06cc\u06a9\u0646\u062f.
pscanbeta.authenticationcredentialscaptured.alert.attack=\u0645\u0647\u0627\u062c\u0645 \u0634\u0628\u06a9\u0647 \u0631\u0627 \u0627\u0633\u062a\u0631\u0627\u0642 \u0633\u0645\u0639 \u0645\u06cc\u06a9\u0646\u062f \u062a\u0627 \u0627\u06cc\u0646\u06a9\u0647 \u06cc\u06a9 \u0627\u062d\u0631\u0627\u0632 \u0647\u0648\u06cc\u062a \u06a9\u0627\u0645\u0644 \u0634\u0648\u062f.

pscanbeta.charsetmismatch.name=Charset Mismatch
pscanbeta.charsetmismatch.desc=This check identifies responses where the HTTP Content-Type header declares a charset different from the charset defined by the body of the HTML or XML. When there's a charset mismatch between the HTTP header and content body Web browsers can be forced into an undesirable content-sniffing mode to determine the content's correct character set.
pscanbeta.charsetmismatch.soln=Force UTF-8 for all text content in both the HTTP header and meta tags or encoding declarations in XML.
pscanbeta.charsetmismatch.exploit=An attacker could manipulate content on the page to be interpreted in an encoding of their choice. For example, if an attacker can control content at the beginning of the page, they could inject script using UTF-7 encoded text and manipulate some browsers into interpreting that text.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html=There was a charset mismatch between the HTTP Header and the HTML encoding declaration\: [{0}] and [{1}] do not match.
pscanbeta.charsetmismatch.extrainfo.xml=There was a charset mismatch between the HTTP Header and the XML encoding declaration\: [{0}] and [{1}] do not match.

pscanbeta.cookielooselyscoped.name=Loosely Scoped Cookie
pscanbeta.cookielooselyscoped.desc=Cookies can be scoped by domain or path. This check is only concerned with domain scope.The domain scope applied to a cookie determines which domains can access it. For example, a cookie can be scoped strictly to a subdomain e.g. www.nottrusted.com, or loosely scoped to a parent domain e.g. nottrusted.com. In the latter case, any subdomain of nottrusted.com can access the cookie. Loosely scoped cookies are common in mega-applications like google.com and live.com.
pscanbeta.cookielooselyscoped.soln=Always scope cookies to a FQDN (Fully Qualified Domain Name).
pscanbeta.cookielooselyscoped.exploit=Cookies set from a subdomain like app.foo.bar are transmitted only to that domain by the browser. However, cookies scoped to a parent-level domain may be transmitted to the parent, or any subdomain of the parent.
pscanbeta.cookielooselyscoped.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=The origin domain used for comparison was\: \r\n{0}\r\n{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\r\n

pscanbeta.insecureauthentication.name=Weak Authentication Method
pscanbeta.insecureauthentication.desc=HTTP basic or digest authentication has been used over an unsecured connection. The credentials can be read and then reused by someone with access to the network.
pscanbeta.insecureauthentication.soln=Protect the connection using HTTPS or use a stronger authentication mechanism
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=Insecure JSF ViewState
pscanbeta.insecurejsfviewstate.desc=The response at the following URL contains a ViewState value that has no cryptographic protections.
pscanbeta.insecurejsfviewstate.soln=Secure VIEWSTATE with a MAC specific to your environment
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] is insecure

pscanbeta.noanticsrftokens.name=Absence of Anti-CSRF Tokens
pscanbeta.noanticsrftokens.desc=No Anti-CSRF tokens were found in a HTML submission form.
pscanbeta.noanticsrftokens.alert.attack=None. Warning only.
pscanbeta.noanticsrftokens.alert.extrainfo=No known Anti-CSRF tokens {0} were found in the following HTML forms\: {1}.  
