#X-Generator: crowdin.net
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.authenticationcredentialscaptured.name=\u062a\u0645 \u0625\u0644\u062a\u0642\u0627\u0637 \u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629
pscanbeta.authenticationcredentialscaptured.desc=\u062a\u0645 \u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0622\u0644\u064a\u0629 \u063a\u064a\u0631 \u0622\u0645\u0646\u0629 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629. \u0642\u062f \u062a\u0633\u0645\u062d \u0647\u0630\u0627 \u0627\u0644\u0622\u0644\u064a\u0629 \u0644\u0644\u0645\u062e\u062a\u0631\u0642 \u0623\u0646 \u064a\u0642\u0648\u0645 \u0628\u0627\u0644\u0625\u0637\u0644\u0627\u0639 \u0639\u0644\u0649 \u0627\u0633\u0645 \u0648\u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0627\u0644\u0630\u064a \u062a\u0645 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0647\u0648\u064a\u062a\u0647. \u0641\u064a \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0627\u0644\u0628\u0633\u064a\u0637 (Basic Authentication)\u060c \u064a\u062c\u0628 \u0639\u0644\u0649 \u0627\u0644\u0645\u062e\u062a\u0631\u0642 \u0645\u0631\u0627\u0642\u0628\u0629 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u0639\u0644\u0649 \u0627\u0644\u0634\u0628\u0643\u0629 \u062d\u062a\u0649 \u064a\u062a\u0645 \u0627\u0633\u062a\u0644\u0627\u0645 \u0637\u0644\u0628 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0627\u0644\u0628\u0633\u064a\u0637\u060c \u0628\u0639\u062f\u0647\u0627 \u064a\u0642\u0648\u0645 \u0628\u0641\u0643 \u062a\u0631\u0645\u064a\u0632 (base64) \u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0648\u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631. \u0623\u0645\u0627 \u0641\u064a \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0627\u0644\u0645\u0648\u062c\u0632 (Digest Authentication)\u060c \u0641\u064a\u0645\u0643\u0646 \u0644\u0644\u0645\u062e\u062a\u0631\u0642 \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645\u060c \u0648\u0631\u0628\u0645\u0627 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631\u060c \u0625\u0630\u0627 \u0643\u0627\u0646 \u0645\u0646 \u0627\u0644\u0645\u0645\u0643\u0646 \u0643\u0633\u0631 \u0642\u064a\u0645 \u0627\u0644\u0625\u062e\u062a\u0632\u0627\u0644 \u0623\u0648 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0647\u062d\u0645\u0627\u062a (\u0627\u0644\u0631\u062c\u0644 \u0641\u064a \u0627\u0644\u0648\u0633\u0637).     
pscanbeta.authenticationcredentialscaptured.soln=\u0642\u0645 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 \u0627\u0644\u062a\u0634\u0641\u064a\u0631 (HTTPS)\u060c \u0628\u0627\u0644\u0625\u0636\u0627\u0641\u0629 \u0625\u0644\u0649 \u0622\u0644\u064a\u0629 \u0622\u0645\u0646\u0629 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0648\u0627\u0644\u062a\u064a \u0644\u0627\u062a\u0642\u0648\u0645 \u0628\u0625\u0631\u0633\u0627\u0644 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0648\u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0628\u0637\u0631\u064a\u0642\u0629 \u063a\u064a\u0631 \u0645\u0634\u0641\u0631\u0629. \u0648\u0628\u0627\u0644\u0623\u062e\u0635\u060c \u0644\u0627\u062a\u0642\u0645 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0622\u0644\u064a\u0629 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0627\u0644\u0628\u0633\u064a\u0637 (Basic Authentication)\u060c \u062d\u064a\u062b \u0623\u0646\u0647 \u0645\u0646 \u0627\u0644\u0633\u0647\u0644 \u0643\u0633\u0631 \u0647\u0630\u0627 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u0627\u0644\u0636\u0639\u064a\u0641 \u0645\u0646 \u0627\u0644\u062a\u0634\u0648\u064a\u0634.
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] \u062a\u0633\u062a\u062e\u062f\u0645 \u0622\u0644\u064a\u0629 \u063a\u064a\u0631 \u0622\u0645\u0646\u0629 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 [{2}]\u060c \u062a\u0643\u0634\u0641 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 [{3}] \u0648\u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] \u062a\u0633\u062a\u062e\u062f\u0645 \u0622\u0644\u064a\u0629 \u063a\u064a\u0631 \u0622\u0645\u0646\u0629 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 [{2}]\u060c \u062a\u0643\u0634\u0641 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 [{3}] \u0648\u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0623\u062e\u0631\u0649 [{4}].
pscanbeta.authenticationcredentialscaptured.alert.attack=\u064a\u0642\u0648\u0645 \u0627\u0644\u0645\u062e\u062a\u0631\u0642 \u0628\u0627\u0644\u062a\u0646\u0635\u062a \u0639\u0644\u0649 \u0627\u0644\u0634\u0628\u0643\u0629 \u062d\u062a\u0649 \u064a\u062a\u0645 \u0627\u0643\u062a\u0645\u0627\u0644 \u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629.

pscanbeta.insecureauthentication.name=\u0623\u0633\u0644\u0648\u0628 \u0636\u0639\u064a\u0641 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629
pscanbeta.insecureauthentication.desc=\u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629 \u0627\u0644\u0628\u0633\u064a\u0637\u0629 \u0648\u0627\u0644\u0645\u0648\u062c\u0632\u0629 \u0639\u0628\u0631 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 (HTTP) \u062a\u0645\u062a \u0639\u0628\u0631 \u0642\u0646\u0627\u0629 \u0627\u062a\u0635\u0627\u0644 \u063a\u064a\u0631 \u0622\u0645\u0646\u0629. \u064a\u0645\u0643\u0646 \u0642\u0631\u0627\u0621\u0629 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0648\u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0648\u0645\u0646 \u062b\u0645 \u0625\u0639\u0627\u062f\u0629 \u0625\u0633\u062a\u062e\u062f\u0627\u0645\u0647\u0627 \u0645\u0631\u0629 \u0623\u062e\u0631\u0649 \u0645\u0646 \u0642\u0650\u0628\u0644 \u0623\u064a \u0634\u062e\u0635 \u0644\u0647 \u0635\u0644\u0627\u062d\u064a\u0629 \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0627\u0644\u0634\u0628\u0643\u0629.
pscanbeta.insecureauthentication.soln=\u0642\u0645 \u0628\u062d\u0645\u0627\u064a\u0629 \u0627\u0644\u0627\u062a\u0635\u0627\u0644 \u0628\u0627\u0633\u062a\u062e\u062f\u0645 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 (HTTPS) \u0623\u0648 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0622\u0644\u064a\u0629 \u0642\u0648\u064a\u0629 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0647\u0648\u064a\u0629
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=(JSF ViewState) \u063a\u064a\u0631 \u0622\u0645\u0646\u0629
pscanbeta.insecurejsfviewstate.desc=\u0627\u0644\u0631\u062f \u0627\u0644\u0642\u0627\u062f\u0645 \u0645\u0646 \u0639\u0646\u0648\u0627\u0646 \u0627\u0644\u0635\u0641\u062d\u0629 \u0627\u0644\u062a\u0627\u0644\u064a\u0629 \u064a\u062d\u062a\u0648\u064a \u0639\u0644\u0649 \u0642\u064a\u0645\u0629 ViewState \u0644\u0627\u062a\u062d\u062a\u0648\u064a \u0639\u0644\u0649 \u062d\u0645\u0627\u064a\u0629 \u062a\u0634\u0641\u064a\u0631.
pscanbeta.insecurejsfviewstate.soln=\u0642\u0645 \u0628\u062d\u0645\u0627\u064a\u0629 (VIEWSTATE) \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 (MAC) \u0645\u062e\u0635\u0635\u0629 \u0644\u0628\u064a\u0626\u0629 \u0627\u0644\u0639\u0645\u0644 \u0627\u0644\u062e\u0627\u0635\u0629 \u0628\u0643
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] is insecure

pscanbeta.noanticsrftokens.name=\u0639\u062f\u0645 \u0648\u062c\u0648\u062f (Anti-CSRF Tokens)
pscanbeta.noanticsrftokens.desc=\u0644\u0645 \u064a\u062a\u0645 \u0625\u064a\u062c\u0627\u062f (Anti-CSRF tokens) \u0641\u064a \u0646\u0645\u0648\u0630\u062c \u0627\u0644\u062a\u0633\u0644\u064a\u0645.
pscanbeta.noanticsrftokens.alert.attack=\u0644\u0627\u0634\u064a\u0621. \u062a\u062d\u0630\u064a\u0631 \u0641\u0642\u0637.
pscanbeta.noanticsrftokens.alert.extrainfo=No known Anti-CSRF tokens {0} were found in the following HTML forms\: {1}.  
