#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanbeta.desc=Passive Scan Rules - beta

pscanbeta.authenticationcredentialscaptured.name=Autentifikacijski Kredencijali uhva\u0107eni
pscanbeta.authenticationcredentialscaptured.desc=U upotrebi je nesiguran autentikacijski mehanizam.  Ovo omogu\u0107ava napada\u010du mre\u017eni pristup do kosirni\u010dkog id-a i lozinke autenticiranog korisnika. Za Basic Authentication, napada\u010d mora samo pratiti mre\u017eni promet dok se ne dobije Basic Authentication zahtjev, i onda base64 dekodiranje korisni\u010dkog imena i lozinke.  Za Digest Authentication, napada\u010d ima pristup do korisni\u010dkog imena, i vjerovatno\u0107u dobijanja lozinke, ako se he\u0161 (uklju\u010duju\u0107i i sada) uspje\u0161no razbije, ili ako se koristi napad Man-In-The-Middle.\u00a0\u00a0\u00a0\u00a0\u00a0
pscanbeta.authenticationcredentialscaptured.soln=Koristi HTTPS, i koristi siguran autentikacijski mehanizam koji ne \u0161alje kostisni\u010dkiid ili lozinku u nekriptovanom obliku. Posebno, izbjegnike kori\u0161tenje Basic Authentication mehanizma, budu\u0107i da je ovaj trivijalni mehanizam lako razbiti.\u00a0
pscanbeta.authenticationcredentialscaptured.refs=https\://www.owasp.org/index.php/Top_10_2010-A3\nhttps\://www.owasp.org/index.php/Testing_for_Brute_Force_%28OWASP-AT-004%29\nhttps\://www.owasp.org/index.php/Category\:Authentication_Vulnerability\nhttp\://en.wikipedia.org/wiki/Digest_access_authentication
pscanbeta.authenticationcredentialscaptured.alert.basicauth.extrainfo=[{0}] [{1}] koristi nesigurni autentikacijski mehanizam [{2}], otkriva korisni\u010dko ime [{3}] i lozinku [{4}].
pscanbeta.authenticationcredentialscaptured.alert.digestauth.extrainfo=[{0}] [{1}] koristi nesigurni autentikacijski mehanizam [{2}], otkriva korisni\u010dko ime [{3}] i dodatne informacije [{4}].
pscanbeta.authenticationcredentialscaptured.alert.attack=Napada\u010d prislu\u0161kuje mre\u017eu dok autentikacija nije zavr\u0161ena.

pscanbeta.charsetmismatch.name=Charset Mismatch
pscanbeta.charsetmismatch.desc=This check identifies responses where the HTTP Content-Type header declares a charset different from the charset defined by the body of the HTML or XML. When there's a charset mismatch between the HTTP header and content body Web browsers can be forced into an undesirable content-sniffing mode to determine the content's correct character set.
pscanbeta.charsetmismatch.soln=Force UTF-8 for all text content in both the HTTP header and meta tags or encoding declarations in XML.
pscanbeta.charsetmismatch.exploit=An attacker could manipulate content on the page to be interpreted in an encoding of their choice. For example, if an attacker can control content at the beginning of the page, they could inject script using UTF-7 encoded text and manipulate some browsers into interpreting that text.
pscanbeta.charsetmismatch.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Character_set_handling_and_detection
pscanbeta.charsetmismatch.extrainfo.html=There was a charset mismatch between the HTTP Header and the HTML encoding declaration\: [{0}] and [{1}] do not match.
pscanbeta.charsetmismatch.extrainfo.xml=There was a charset mismatch between the HTTP Header and the XML encoding declaration\: [{0}] and [{1}] do not match.

pscanbeta.cookielooselyscoped.name=Loosely Scoped Cookie
pscanbeta.cookielooselyscoped.desc=Cookies can be scoped by domain or path. This check is only concerned with domain scope.The domain scope applied to a cookie determines which domains can access it. For example, a cookie can be scoped strictly to a subdomain e.g. www.nottrusted.com, or loosely scoped to a parent domain e.g. nottrusted.com. In the latter case, any subdomain of nottrusted.com can access the cookie. Loosely scoped cookies are common in mega-applications like google.com and live.com.
pscanbeta.cookielooselyscoped.soln=Always scope cookies to a FQDN (Fully Qualified Domain Name).
pscanbeta.cookielooselyscoped.exploit=Cookies set from a subdomain like app.foo.bar are transmitted only to that domain by the browser. However, cookies scoped to a parent-level domain may be transmitted to the parent, or any subdomain of the parent.
pscanbeta.cookielooselyscoped.refs=http\://code.google.com/p/browsersec/wiki/Part2\#Same-origin_policy_for_cookies
pscanbeta.cookielooselyscoped.extrainfo=The origin domain used for comparison was\: \r\n{0}\r\n{1}
pscanbeta.cookielooselyscoped.extrainfo.cookie={0}\r\n

pscanbeta.insecureauthentication.name=Slab Autentikacijski Metod
pscanbeta.insecureauthentication.desc=HTTP basic ili digest autentikacija se koristi preko nesigurne veze. Kredencijali se mogu pre\u010ditati i koristiti od nekog drugog za pristup mre\u017ei.
pscanbeta.insecureauthentication.soln=Za\u0161titite vezu koriste\u0107i HTTPS ili koristiti ja\u010di autentikacijski mehanizam
pscanbeta.insecureauthentication.refs=www.owasp.org/index.php/Category\:Authentication_Vulnerability

pscanbeta.insecurejsfviewstate.name=Nesiguran JSF ViewState
pscanbeta.insecurejsfviewstate.desc=Odgovor na sljede\u0107em URL-u sadr\u017ei ViewState vrijednost koja nema svoje kriptografske za\u0161tite.
pscanbeta.insecurejsfviewstate.soln=Sigurni VIEWSTATE s  MAC-om specifi\u010dnim za va\u0161e okru\u017eenje
pscanbeta.insecurejsfviewstate.refs=https\://www.trustwave.com/spiderlabs/advisories/TWSL2010-001.txt
pscanbeta.insecurejsfviewstate.extrainfo=JSF ViewState [{0}] nije siguran

pscanbeta.noanticsrftokens.name=Nedostaju Anti-CSRF Tokeni
pscanbeta.noanticsrftokens.desc=Anti-CSRF tokeni nisu nisu na\u0111eni u proslje\u0111enoj HTML form.
pscanbeta.noanticsrftokens.alert.attack=Nijedan. Samo upozorenja.
pscanbeta.noanticsrftokens.alert.extrainfo=Nepoznati Anti-CSRF tokeni {0} su na\u0111eni u sljede\u0107oj HTML formi\: {1}.\u00a0\u00a0
