#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

openapi.api.action.importFile=\u0418\u043c\u043f\u043e\u0440\u0442 \u043e\u0442\u043a\u0440\u044b\u0442\u043e\u0433\u043e \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f API \u0438\u0437 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0430.
openapi.api.action.importUrl=\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u0435 \u041e\u0442\u043a\u0440\u044b\u0442\u043e\u0433\u043e API URL-\u0430\u0434\u0440\u0435\u0441, hostOverride \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u0445\u043e\u0437\u044f\u0438\u043d\u0443 \u0431\u044b\u0442\u044c \u0437\u0430\u043c\u0435\u043d\u0435\u043d\u044b

openapi.cmdline.file.help=\u0418\u043c\u043f\u043e\u0440\u0442 \u043e\u0442\u043a\u0440\u044b\u0442\u043e\u0433\u043e \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f API \u0438\u0437 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u0438\u043c\u0435\u043d\u0438 \u0444\u0430\u0439\u043b\u0430
openapi.cmdline.url.help=\u0418\u043c\u043f\u043e\u0440\u0442 \u043e\u0442\u043a\u0440\u044b\u0442\u043e\u0433\u043e \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f API \u0438\u0437 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0433\u043e URL-\u0430\u0434\u0440\u0435\u0441\u0430

openapi.desc=Allows you to spider and import OpenAPI (Swagger) definitions 
openapi.topmenu.tools.importopenapi=\u0418\u043c\u043f\u043e\u0440\u0442 \u043e\u0442\u043a\u0440\u044b\u0442\u043e\u0433\u043e \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f API \u0438\u0437 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u043e\u0439 \u0444\u0430\u0439\u043b\u043e\u0432\u043e\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u044b
openapi.topmenu.tools.importopenapi.tooltip=\u0424\u0430\u0439\u043b \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u0444\u043e\u0440\u043c\u0430\u043b\u044c\u043d\u044b\u043c \u043e\u043f\u0438\u0441\u0430\u043d\u043d\u044b\u043c \u0444\u0430\u0439\u043b\u043e\u043c OpenApi.
openapi.topmenu.tools.importremoteopenapi=Import an Open API definition from a URL
openapi.topmenu.tools.importremoteopenapi.tooltip=\u0424\u0430\u0439\u043b \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u0444\u043e\u0440\u043c\u0430\u043b\u044c\u043d\u044b\u043c \u043e\u043f\u0438\u0441\u0430\u043d\u043d\u044b\u043c \u0444\u0430\u0439\u043b\u043e\u043c OpenApi.

openapi.importfromurldialog.pasteaction=Paste
openapi.importfromurldialog.labeloverride=Override Host\:
openapi.importfromurldialog.labelurl=URL Pointing to OpenAPI defn\:
openapi.importfromurldialog.importbutton=\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c
openapi.importfromurldialog.title=Import OpenAPI Definition from URL
openapi.importfromurldialog.badurl=Invalid URL
openapi.importfromurldialog.badoverride=Invalid Override Host\: this should be of the form "host" or "host\:port"\:\n{0}

openapi.io.error=Failed to access specified definition
openapi.parse.error=Failed to parse OpenAPI definition
openapi.parse.ok=Successfully parsed OpenAPI definition
openapi.parse.warn=Parsed OpenAPI definition with warnings - \nsee Output tab for details

openapi.import.error=Failed to access URL\: {0} \: {1} \: {2}
