#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages
cspscanner.addon.desc=Esc\u00e1ner de la Pol\u00edtica de Seguridad de Contenido

cspscanner.name=Esc\u00e1ner CSP
cspscanner.desc=Pol\u00edtica de la Seguridad de Contenido (CSP) por sus siglas en ingl\u00e9s, es una capa de seguridad a\u00f1adida que ayuda a detectar y mitigar ciertos tipos de ataque. Incluyendo (pero sin limitarse a) Cross Site Scripting (XSS), y a ataques de inyecci\u00f3n de datos. Estos ataques son usados para todo, desde robo de datos hasta defacement de sitios web o distribuci\u00f3n de malware. CSP proporciona un conjunto de cabeceras HTTP est\u00e1ndar que permiten a los propietarios de sitios web declarar recursos de contenido aprobados que los navegadores deber\u00edan tener permitido cargar en la p\u00e1gina \u2014 los tipos cubiertos son JavaScript, CSS, marcos HTML, fuentes, im\u00e1genes y objetos incrustables tales como Java applets, ActiveX y archivos de audio y v\u00eddeo.
cspscanner.refs=http\://www.w3.org/TR/CSP2/\nhttp\://www.w3.org/TR/CSP/\nhttp\://caniuse.com/\#search\=content+security+policy\nhttp\://content-security-policy.com/\nhttps\://github.com/shapesecurity/salvation
cspscanner.soln=Aseg\u00farese de que su servidor web, servidor de aplicaci\u00f3n, equilibrador de carga, etc. est\u00e1 configurado apropiadamente para establecer la cabecera de Pol\u00edtica de Seguridad de Contenido.

cspscanner.notices.name=Avisos
cspscanner.notices.errors=Errores\:
cspscanner.notices.warnings=Advertencias\:
cspscanner.notices.infoitems=\u00cdtemes de informaci\u00f3n\:

cspscanner.scriptsrc.unsafe.name=script-src unsafe-inline
cspscanner.scriptsrc.unsafe.desc=script-src includes unsafe-inline.
cspscanner.stylesrc.unsafe.name=style-src unsafe-inline
cspscanner.stylesrc.unsafe.desc=style-src includes unsafe-inline.

cspscanner.wildcard.name=Directiva Comod\u00edn
cspscanner.wildcard.desc=Las siguientes directivas permiten fuentes comod\u00edn (o antepasadas) que no est\u00e1n definidas, o que est\u00e1n demasiado ampliamente definidas\:\n {0}

cspscanner.xcsp.name=X-Content-Security-Policy
cspscanner.xcsp.desc=La cabecera X-Pol\u00edtica de Seguridad del Contenido fue encontrada en esta respuesta. Si bien es una buena se\u00f1al que CSP est\u00e9 implementada hasta cierto grado que la pol\u00edtica especificada en esta cabecera no ha sido analizada por ZAP. Para asegurar un soporte completo de los navegadores modernos aseg\u00farese de que la cabecera Pol\u00edtica de Seguridad del Contenido est\u00e1 definida y sujeta a respuestas.

cspscanner.xwkcsp.name=X-WebKit-CSP
cspscanner.xwkcsp.desc=La cabecera X-WebKit-CSP fue encontrada en esta respuesta. Si bien es una buena se\u00f1al que CSP est\u00e9 implementada a tal grado que la pol\u00edtica especificada en esta cabecera no ha sido analizada por ZAP. Para asegurar un soporte completo de los navegadores modernos aseg\u00farese de que la cabecera Pol\u00edtica de Seguridad del Contenido est\u00e1 definida y sujeta a respuestas.
