#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages
cspscanner.addon.desc=Taray\u0131c\u0131 \u0130\u00e7erik G\u00fcvenlik \u0130lkesi

cspscanner.name=CSP Taray\u0131c\u0131
cspscanner.desc=\u0130\u00e7erik G\u00fcvenli\u011fi Politikas\u0131 (CSP) belirli sald\u0131r\u0131 t\u00fcrlerini tespit etmeye ve hafifletmeye yard\u0131mc\u0131 olan ek bir g\u00fcvenlik katman\u0131d\u0131r. \u00c7apraz Site Komut Dosyas\u0131 Olu\u015fturma (XSS) ve veri enjeksiyon sald\u0131r\u0131lar\u0131 dahildir (fakat bunlarla s\u0131n\u0131rl\u0131 de\u011fildir). Bu sald\u0131r\u0131lar, veri h\u0131rs\u0131zl\u0131\u011f\u0131ndan sitenin bozulmas\u0131na veya k\u00f6t\u00fc ama\u00e7l\u0131 yaz\u0131l\u0131m da\u011f\u0131t\u0131m\u0131na kadar her \u015fey i\u00e7in kullan\u0131l\u0131r. CSP, web sitesi sahiplerinin, taray\u0131c\u0131lar\u0131n bu sayfaya y\u00fcklenmesine izin verilmesi gereken onaylanm\u0131\u015f i\u00e7erik kaynaklar\u0131n\u0131 beyan edebilmelerini sa\u011flayan standart HTTP \u00fcstbilgileri seti sa\u011flar; \u00f6rt\u00fcl\u00fc t\u00fcrler; JavaScript, CSS, HTML \u00e7er\u00e7eveleri, yaz\u0131 tipleri, g\u00f6r\u00fcnt\u00fcler ve Java uygulamalar\u0131 gibi kat\u0131\u015ft\u0131r\u0131labilir nesneler, ActiveX, ses ve video dosyalar\u0131.
cspscanner.refs=http\://www.w3.org/TR/CSP2/\nhttp\://www.w3.org/TR/CSP/\nhttp\://caniuse.com/\#search\=content+security+policy\nhttp\://content-security-policy.com/\nhttps\://github.com/shapesecurity/salvation
cspscanner.soln=Web sunucusu, uygulama sunucusu, y\u00fck dengeleyici \u00f6\u011fenizin \u0130\u00e7erik-G\u00fcvenlik-Politikas\u0131 ba\u015fl\u0131\u011f\u0131n\u0131 ayarlayacak \u015fekilde do\u011fru yap\u0131land\u0131r\u0131ld\u0131\u011f\u0131ndan emin olun.

cspscanner.notices.name=Bildirimler
cspscanner.notices.errors=Hatalar\:
cspscanner.notices.warnings=Uyar\u0131lar\:
cspscanner.notices.infoitems=\u00dcr\u00fcnlerin bilgisi\:

cspscanner.scriptsrc.unsafe.name=script-src unsafe-inline
cspscanner.scriptsrc.unsafe.desc=script-src unsafe-inline i\u00e7eriyor.
cspscanner.stylesrc.unsafe.name=style-src unsafe-inline
cspscanner.stylesrc.unsafe.desc=style-src unsafe-inline i\u00e7eriyor.

cspscanner.wildcard.name=Joker Y\u00f6nergesi
cspscanner.wildcard.desc=A\u015fa\u011f\u0131daki talimatlar ya izin verilen joker kaynaklar\u0131nda (veya atalar\u0131nda) tan\u0131ml\u0131 de\u011fil veya a\u015f\u0131r\u0131 geni\u015f tan\u0131mlanm\u0131\u015f\: \n{0}

cspscanner.xcsp.name=X-\u0130\u00e7erik-G\u00fcvenlik-Politikas\u0131
cspscanner.xcsp.desc=Bu yan\u0131tta X-\u0130\u00e7erik-G\u00fcvenlik-Politikas\u0131 ba\u015fl\u0131\u011f\u0131 bulundu. CSP'nin bir dereceye kadar uygulanmas\u0131 iyi bir i\u015faret olsa da bu ba\u015fl\u0131kta belirtilen politika ZAP taraf\u0131ndan analiz edilmemi\u015ftir. Modern taray\u0131c\u0131lar taraf\u0131ndan tam olarak desteklenmesi i\u00e7in \u0130\u00e7erik-G\u00fcvenlik-Politikas\u0131 ba\u015fl\u0131\u011f\u0131n\u0131n tan\u0131mland\u0131\u011f\u0131ndan ve sorumlulu\u011fa eklendi\u011finden emin olun.

cspscanner.xwkcsp.name=X-WebKit-CSP
cspscanner.xwkcsp.desc=Bu yan\u0131tta X-WebKit-CSP ba\u015fl\u0131\u011f\u0131 bulundu. CSP'nin bir dereceye kadar uygulanmas\u0131 iyi bir i\u015faret olsa da bu ba\u015fl\u0131kta belirtilen politika ZAP taraf\u0131ndan analiz edilmemi\u015ftir. Modern taray\u0131c\u0131lar taraf\u0131ndan tam olarak desteklenmesi i\u00e7in \u0130\u00e7erik-G\u00fcvenlik-Politikas\u0131 ba\u015fl\u0131\u011f\u0131n\u0131n tan\u0131mland\u0131\u011f\u0131ndan ve sorumlulu\u011fa eklendi\u011finden emin olun.
