#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanrules.desc=Passive Scan Rules

pscanrules.headerxssprotectionscanner.name=Web\u30d6\u30e9\u30a6\u30b6\u306eXSS\u9632\u6b62\u6a5f\u80fd\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.headerxssprotectionscanner.desc=Web \u30d6\u30e9\u30a6\u30b6\u306eXSS\u9632\u6b62\u6a5f\u80fd\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u306a\u3044\u3001\u307e\u305f\u306fWeb\u30b5\u30fc\u30d0\u304b\u3089\u306eHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0 'X-XSS-Protection' \u304c\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
pscanrules.headerxssprotectionscanner.refs=https\://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet\nhttps\://blog.veracode.com/2014/03/guidelines-for-setting-security-headers/
pscanrules.headerxssprotectionscanner.extrainfo=HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u306e 'X-XSS-Protection' \u306f\u3001Web\u30d6\u30e9\u30a6\u30b6\u306eXSS\u9632\u6b62\u6a5f\u80fd\u306e\u6709\u52b9/\u7121\u52b9\u3092Web\u30b5\u30fc\u30d0\u304b\u3089\u5236\u5fa1\u53ef\u80fd\u3068\u3057\u307e\u3059\u3002\n\u6709\u52b9\u5316\u3059\u308b\u306b\u306f\u4e0b\u8a18\u306e\u3088\u3046\u306b\u5024\u3092\u30bb\u30c3\u30c8\u3057\u307e\u3059\:\n X-XSS-Protection\: 1; mode\=block\n X-XSS-Protection\: 1; report\=http\://www.example.com/xss\n\u7121\u52b9\u5316\u3059\u308b\u306b\u306f\u4e0b\u8a18\u306e\u3088\u3046\u306b\u5024\u3092\u30bb\u30c3\u30c8\u3057\u307e\u3059\:\n X-XSS-Protection\: 0\n\n'X-XSS-Protection' HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u306f\u3001\u73fe\u5728 Internet Explorer, Chrome, Safari(WebKit) \u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\n\u3053\u306e\u30a2\u30e9\u30fc\u30c8\u306f\u3001\u30ec\u30b9\u30dd\u30f3\u30b9\u30dc\u30c7\u30a3\u306bXSS\u30da\u30a4\u30ed\u30fc\u30c9\u3092\u542b\u3080\u6050\u308c\u304c\u3042\u308b\u5834\u5408\n(content type\u304ctext\u30d9\u30fc\u30b9 \u304b\u3064\u9577\u3055\u304c0\u3067\u306a\u3044)\u306b\u306e\u307f\u6319\u3052\u3089\u308c\u307e\u3059\u3002
pscanrules.headerxssprotectionscanner.soln='X-XSS-Protection' HTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u306b '1' \u3092\u30bb\u30c3\u30c8\u3057\u3001Web\u30d6\u30e9\u30a6\u30b6\u306eXSS\u30d5\u30a3\u30eb\u30bf\u306e\u6709\u52b9\u5316\u3092\u78ba\u5b9f\u306a\u3082\u306e\u3068\u3057\u3066\u304f\u3060\u3055\u3044\u3002

pscanrules.xframeoptionsscanner.name=X-Frame-Options\u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u5982
pscanrules.xframeoptionsscanner.incInCsp=The Content-Security-Policy does include a 'frame-ancestors' element which takes precedence over the X-Frame-Options header, which is why this has been raised with a LOW risk.  
pscanrules.xframeoptionsscanner.missing.name=X-Frame-Options\u30d8\u30c3\u30c0\u30fc\u306e\u6b20\u5982
pscanrules.xframeoptionsscanner.missing.desc=\u300c\u30af\u30ea\u30c3\u30af\u30b8\u30e3\u30c3\u30ad\u30f3\u30b0\u300d\u653b\u6483\u3092\u9632\u6b62\u3059\u308b\u305f\u3081\u306eX-Frame-Options\u30d8\u30c3\u30c0\u30fc\u304cHTTP\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.xframeoptionsscanner.missing.refs=http\://blogs.msdn.com/b/ieinternals/archive/2010/03/30/combating-clickjacking-with-x-frame-options.aspx
pscanrules.xframeoptionsscanner.missing.soln=\u6700\u65b0\u306e Web \u30d6\u30e9\u30a6\u30b6\u30fc\u306f X-Frame-Options \u306e HTTP \u30d8\u30c3\u30c0\u30fc\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059\u3002\u30b5\u30a4\u30c8\u306e\u3059\u3079\u3066\u306e Web \u30da\u30fc\u30b8\u304c\u305d\u308c\u3092\u8fd4\u3059\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\uff08\u3082\u3057\u81ea\u5206\u306e\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30da\u30fc\u30b8\u304b\u3089\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3064\u3082\u308a\u304c\u3042\u308b\uff08\u4f8b\u3048\u3070\u305d\u308c\u304cFRAMESET\u306e\u4e00\u90e8\u3067\u3042\u308b\uff09\u5834\u5408\u306f SAMEORIGIN \u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3057\u3001\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3064\u3082\u308a\u304c\u306a\u3044\u5834\u5408\u306f DENY \u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002ALLOW-FROM \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b web \u30d6\u30e9\u30a6\u30b6\u30fc\u4e0a\u3067\u6307\u5b9a\u3057\u305f Web\u30b5\u30a4\u30c8\u304cWeb\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3053\u3068\u3092\u8a31\u53ef\u3057\u307e\u3059\uff09\u3002
pscanrules.xframeoptionsscanner.multiple.header.name=\u8907\u6570\u306eX-Frame-Options\u30d8\u30c3\u30c0\u30fc\u30a8\u30f3\u30c8\u30ea
pscanrules.xframeoptionsscanner.multiple.header.desc=X-Frame-Options (XFO) \u30d8\u30c3\u30c0\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u8907\u6570\u306e XFO \u30d8\u30c3\u30c0\u30a8\u30f3\u30c8\u30ea\u304c\u5fdc\u7b54\u306b\u542b\u307e\u308c\u3066\u304a\u308a\u3001\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306b\u3088\u3063\u3066\u60f3\u5b9a\u901a\u308a\u306b\u51e6\u7406\u3055\u308c\u308b\u3068\u306f\u9650\u308a\u307e\u305b\u3093\u3002
pscanrules.xframeoptionsscanner.multiple.header.refs=https\://tools.ietf.org/html/rfc7034
pscanrules.xframeoptionsscanner.multiple.header.soln=\u30ec\u30b9\u30dd\u30f3\u30b9\u306e\u4e2d\u306b X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u304c\u3072\u3068\u3064\u3060\u3051\u5b58\u5728\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.xframeoptionsscanner.compliance.meta.name=X-Frame-Options \u306e\u30e1\u30bf\u60c5\u5831\u5b9a\u7fa9\uff08\u975e\u6e96\u62e0\u4ed5\u69d8\uff09
pscanrules.xframeoptionsscanner.compliance.meta.desc=X-Frame-Options (XFO) \u30e1\u30bf\u30bf\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u30e1\u30bf\u30bf\u30b0\u3067XFO\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3001\u4ed5\u69d8(RFC 7034)\u3067\u660e\u793a\u7684\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pscanrules.xframeoptionsscanner.compliance.meta.refs=https\://tools.ietf.org/html/rfc7034\#section-4
pscanrules.xframeoptionsscanner.compliance.meta.soln=X-Frame-Options \u3092\u30ec\u30b9\u30dd\u30f3\u30b9\u30d8\u30c3\u30c0\u30fc\u9818\u57df\u306b\u30bb\u30c3\u30c8\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.xframeoptionsscanner.compliance.malformed.setting.name=\u4e0d\u6b63\u306a X-Frame-Options \u8a2d\u5b9a
pscanrules.xframeoptionsscanner.compliance.malformed.setting.desc=X-Frame-Options \u30d8\u30c3\u30c0\u30fc\u306f\u5fdc\u7b54\u306b\u5b58\u5728\u3057\u307e\u3059\u304c\u3001\u5024\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
pscanrules.xframeoptionsscanner.compliance.malformed.setting.refs=https\://tools.ietf.org/html/rfc7034\#section-2.1
pscanrules.xframeoptionsscanner.compliance.malformed.setting.soln=\u30b5\u30a4\u30c8\u306e\u3059\u3079\u3066\u306e Web \u30da\u30fc\u30b8\u304c\u6b63\u3057\u3044\u5024\u3092\u8fd4\u3059\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\uff08\u3082\u3057\u81ea\u5206\u306e\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30da\u30fc\u30b8\u304b\u3089\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3064\u3082\u308a\u304c\u3042\u308b\uff08\u4f8b\u3048\u3070\u305d\u308c\u304cFRAMESET\u306e\u4e00\u90e8\u3067\u3042\u308b\uff09\u5834\u5408\u306f SAMEORIGIN \u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3057\u3001\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3064\u3082\u308a\u304c\u306a\u3044\u5834\u5408\u306f DENY \u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002ALLOW-FROM \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b web \u30d6\u30e9\u30a6\u30b6\u30fc\u4e0a\u3067\u6307\u5b9a\u3057\u305f Web\u30b5\u30a4\u30c8\u304cWeb\u30da\u30fc\u30b8\u3092\u30d5\u30ec\u30fc\u30e0\u306b\u3059\u308b\u3053\u3068\u3092\u8a31\u53ef\u3057\u307e\u3059\uff09\u3002

pscanrules.xcontenttypeoptionsscanner.name=X-Content-Type-Options\u30d8\u30c3\u30c0\u306e\u8a2d\u5b9a\u30df\u30b9
pscanrules.xcontenttypeoptionsscanner.desc=The Anti-MIME-Sniffing header X-Content-Type-Options was not set to 'nosniff'. This allows older versions of Internet Explorer and Chrome to perform MIME-sniffing on the response body, potentially causing the response body to be interpreted and displayed as a content type other than the declared content type. Current (early 2014) and legacy versions of Firefox will use the declared content type (if one is set), rather than performing MIME-sniffing.
pscanrules.xcontenttypeoptionsscanner.otherinfo=This issue still applies to error type pages (401, 403, 500, etc) as those pages are often still affected by injection issues, in which case there is still concern for browsers sniffing pages away from their actual content type.\nAt "High" threshold this scanner will not alert on client or server error responses.
pscanrules.xcontenttypeoptionsscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers
pscanrules.xcontenttypeoptionsscanner.soln=Ensure that the application/web server sets the Content-Type header appropriately, and that it sets the X-Content-Type-Options header to 'nosniff' for all web pages.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that does not perform MIME-sniffing at all, or that can be directed by the web application/web server to not perform MIME-sniffing.

pscanrules.applicationerrorscanner.name=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30a8\u30e9\u30fc\u306e\u958b\u793a
pscanrules.applicationerrorscanner.desc=This page contains an error/warning message that may disclose sensitive information like the location of the file that produced the unhandled exception. This information can be used to launch further attacks against the web application. The alert could be a false positive if the error message is found inside a documentation page.
pscanrules.applicationerrorscanner.soln=Review the source code of this page. Implement custom error pages. Consider implementing a mechanism to provide a unique error reference/identifier to the client (browser) while logging the details on the server side and not exposing them to the user.

pscanrules.cachecontrolscanner.name=\u4e0d\u5b8c\u5168\u306a\u30ad\u30e3\u30c3\u30b7\u30e5\u5236\u5fa1\u3084Pragma HTTP \u30d8\u30c3\u30c0\u30fc\u8a2d\u5b9a
pscanrules.cachecontrolscanner.desc=The cache-control and pragma HTTP header have not been set properly or are missing allowing the browser and proxies to cache content.
pscanrules.cachecontrolscanner.soln=Whenever possible ensure the cache-control HTTP header is set with no-cache, no-store, must-revalidate; and that the pragma HTTP header is set with no-cache.
pscanrules.cachecontrolscanner.refs=https\://www.owasp.org/index.php/Session_Management_Cheat_Sheet\#Web_Content_Caching

pscanrules.contenttypemissingscanner.name=Content-Type\u30d8\u30c3\u30c0\u30fc\u304c\u306a\u3044
pscanrules.contenttypemissingscanner.name.empty=Content-Type\u30d8\u30c3\u30c0\u30fc\u304c\u7a7a
pscanrules.contenttypemissingscanner.desc=The Content-Type header was either missing or empty.
pscanrules.contenttypemissingscanner.soln=Ensure each page is setting the specific and appropriate content-type value for the content being delivered.
pscanrules.contenttypemissingscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx

pscanrules.cookiehttponlyscanner.name=Cookie\u306eHttpOnly\u5c5e\u6027\u304c\u672a\u8a2d\u5b9a
pscanrules.cookiehttponlyscanner.desc=cookie\u306bHttpOnly\u5c5e\u6027\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001JavaScript\u306b\u3088\u308bcookie\u3078\u306e\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u3067\u3059\u3002\n\u60aa\u610f\u306e\u3042\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u672c\u30da\u30fc\u30b8\u3067\u5b9f\u884c\u53ef\u80fd\u306a\u5834\u5408\u3001cookie\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u5225\u306e\u30b5\u30a4\u30c8\u3078cookie\u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u3082\u3057\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306acookie\u304c\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u7528\u3067\u3042\u308b\u5834\u5408\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u653b\u6483\u304c\u6210\u7acb\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.cookiehttponlyscanner.soln=\u3059\u3079\u3066\u306e cookie \u306b HttpOnly \u30d5\u30e9\u30b0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.cookiehttponlyscanner.refs=http\://www.owasp.org/index.php/HttpOnly

pscanrules.cookiesecureflagscanner.name=Cookie\u306e\u30bb\u30ad\u30e5\u30a2\u5c5e\u6027\u304c\u306a\u3044
pscanrules.cookiesecureflagscanner.desc=A cookie has been set without the secure flag, which means that the cookie can be accessed via unencrypted connections.
pscanrules.cookiesecureflagscanner.soln=Whenever a cookie contains sensitive information or is a session token, then it should always be passed using an encrypted channel. Ensure that the secure flag is set for cookies containing such sensitive information.
pscanrules.cookiesecureflagscanner.refs=http\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OWASP-SM-002)

pscanrules.crossdomainscriptinclusionscanner.name=Cross-Domain JavaScript Source File Inclusion
pscanrules.crossdomainscriptinclusionscanner.desc=The page includes one or more script files from a third-party domain.
pscanrules.crossdomainscriptinclusionscanner.soln=Ensure JavaScript source files are loaded from only trusted sources, and the sources can't be controlled by end users of the application.

pscanrules.mixedcontentscanner.name=Secure Pages Include Mixed Content
pscanrules.mixedcontentscanner.name.inclscripts=Secure Pages Include Mixed Content (Including Scripts)
pscanrules.mixedcontentscanner.desc=The page includes mixed content, that is content accessed via HTTP instead of HTTPS.
pscanrules.mixedcontentscanner.soln=A page that is available over SSL/TLS must be comprised completely of content which is transmitted over SSL/TLS.\nThe page must not contain any content that is transmitted over unencrypted HTTP.\n This includes content from third party sites.
pscanrules.mixedcontentscanner.refs=https\://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet

pscanrules.passwordautocompletescanner.name=\u30d6\u30e9\u30a6\u30b6\u306b\u3088\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u30aa\u30fc\u30c8\u30b3\u30f3\u30d7\u30ea\u30fc\u30c8
pscanrules.passwordautocompletescanner.desc=\u30d1\u30b9\u30ef\u30fc\u30c9\u578b\u5165\u529b\u3092\u542b\u3080 HTML \u30d5\u30a9\u30fc\u30e0\u5165\u529b\u8981\u7d20\u3067\u30aa\u30fc\u30c8\u30b3\u30f3\u30d7\u30ea\u30fc\u30c8\u5c5e\u6027\u304c\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u683c\u7d0d\u3055\u308c\u3001\u53d6\u5f97\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pscanrules.passwordautocompletescanner.soln=\u30d5\u30a9\u30fc\u30e0\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u5165\u529b\u3092\u542b\u3080\u500b\u5225\u306e\u5165\u529b\u8981\u7d20\u306b AUTOCOMPLETE\='OFF' \u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u30aa\u30fc\u30c8\u30b3\u30f3\u30d7\u30ea\u30fc\u30c8\u5c5e\u6027\u3092\u7121\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
pscanrules.passwordautocompletescanner.refs=http\://www.w3schools.com/tags/att_input_autocomplete.asp\nhttps\://msdn.microsoft.com/en-us/library/ms533486%28v\=vs.85%29.aspx

pscanrules.testinfoprivateaddressdisclosure.name=\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8IP\u306e\u958b\u793a
pscanrules.testinfoprivateaddressdisclosure.desc=A private IP (such as 10.x.x.x, 172.x.x.x, 192.168.x.x) or an Amazon EC2 private hostname (for example, ip-10-0-56-78) has been found in the HTTP response body. This information might be helpful for further attacks targeting internal systems.
pscanrules.testinfoprivateaddressdisclosure.soln=Remove the private IP address from the HTTP response body.  For comments, use JSP/ASP/PHP comment instead of HTML/JavaScript comment which can be seen by client browsers.
pscanrules.testinfoprivateaddressdisclosure.refs=https\://tools.ietf.org/html/rfc1918

pscanrules.testinfosessionidurl.name=Session ID in URL Rewrite
pscanrules.testinfosessionidurl.desc=URL rewrite is used to track user session ID. The session ID may be disclosed via cross-site referer header. In addition, the session ID might be stored in browser history or server logs.
pscanrules.testinfosessionidurl.soln=For secure content, put session ID in a cookie. To be even more secure consider using a combination of cookie and URL rewrite.
pscanrules.testinfosessionidurl.refs=http\://seclists.org/lists/webappsec/2002/Oct-Dec/0111.html
pscanrules.testinfosessionidurl.referrer.alert=Referer Exposes Session ID
pscanrules.testinfosessionidurl.referrer.desc=A hyperlink pointing to anther host name was found. As session ID URL rewrite is used, it may be disclosed in referer header to external hosts.
pscanrules.testinfosessionidurl.referrer.soln=This is a risk if the session ID is sensitive and the hyperlink refers to an external or third party host. For secure content, put session ID in secured session cookie.

