#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanrules.desc=Pasif Tarama Kurallar\u0131

pscanrules.headerxssprotectionscanner.name=Web Taray\u0131c\u0131 Korumas\u0131 XSS \u200b\u200bEtkin De\u011fil
pscanrules.headerxssprotectionscanner.desc=Web Taray\u0131c\u0131 Korumas\u0131 XSS \u200b\u200betkin de\u011fil, ya da web sunucusu \u00fczerinde 'X-XSS-Protection' HTTP cevap ba\u015fl\u0131\u011f\u0131n\u0131n yap\u0131land\u0131rmas\u0131 taraf\u0131ndan devre d\u0131\u015f\u0131
pscanrules.headerxssprotectionscanner.refs=https\://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet https\://blog.veracode.com/2014/03/guidelines-for-setting-security-headers/
pscanrules.headerxssprotectionscanner.extrainfo=X-XSS-Protection HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131 web sunucusu etkinle\u015ftirmek veya web taray\u0131c\u0131n\u0131z\u0131n XSS koruma mekanizmas\u0131 devre d\u0131\u015f\u0131 b\u0131rakman\u0131z\u0131 sa\u011flar. A\u015fa\u011f\u0131daki de\u011ferler etkinle\u015ftirmek giri\u015fiminde\:  \nX-XSS-Protection\: 1; mode \= blok X-XSS-Protection\: 1; \= http raporu\: A\u015fa\u011f\u0131daki de\u011ferler devre d\u0131\u015f\u0131 olur //www.example.com/xss\: X-XSS-Protection\: 0 X-XSS-Protection HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131 \u015fu anda Internet Explorer, Chrome ve Safari (WebKit) desteklenir. Yan\u0131t g\u00f6vde potansiyel bir XSS y\u00fck\u00fc i\u00e7erebilir, bu uyar\u0131 sadece (metin tabanl\u0131 i\u00e7erik t\u00fcr\u00fcyle s\u0131f\u0131r olmayan bir uzunlukta) y\u00fckseltilmi\u015f oldu\u011funu unutmay\u0131n.
pscanrules.headerxssprotectionscanner.soln=Web taray\u0131c\u0131n\u0131z\u0131n XSS filtresi '1' X-XSS-Protection HTTP yan\u0131t ba\u015fl\u0131\u011f\u0131n\u0131 ayarlayarak, etkin oldu\u011fundan emin olun.

pscanrules.xframeoptionsscanner.name=X-Frame-Options Header De\u011fil Seti
pscanrules.xframeoptionsscanner.desc=X-Frame-Options ba\u015fl\u0131\u011f\u0131 'Clickjacking' sald\u0131r\u0131lar\u0131na kar\u015f\u0131 savunma i\u00e7in ayarlanm\u0131\u015f de\u011fildi.
pscanrules.xframeoptionsscanner.missing.desc=X-Frame-Options ba\u015fl\u0131\u011f\u0131 'Clickjacking' sald\u0131r\u0131lar\u0131na kar\u015f\u0131 korumak i\u00e7in HTTP yan\u0131t\u0131 dahil de\u011fildir.
pscanrules.xframeoptionsscanner.otherinfo=Bu taray\u0131c\u0131, y\u00fcksek a\u015f\u0131m seviyesinde, istemci ya da sunucu hata d\u00f6n\u00fc\u015flerinde uyar\u0131 vermez.
pscanrules.xframeoptionsscanner.refs=http\://blogs.msdn.com/b/ieinternals/archive/2010/03/30/combating-clickjacking-with-x-frame-options.aspx
pscanrules.xframeoptionsscanner.soln=En modern Web taray\u0131c\u0131lar\u0131 X-Frame-Options HTTP ba\u015fl\u0131\u011f\u0131n\u0131 destekler. Sayfay\u0131 bekliyoruz asla aksi takdirde, sayfa yaln\u0131zca sunucu \u00fczerinde sayfalar (\u00f6rne\u011fin, bir FRAMESET par\u00e7as\u0131) sonra SAMEORIGIN kullanmak isteyeceksiniz taraf\u0131ndan \u00e7er\u00e7eveli bekliyoruz e\u011fer (sitenizin taraf\u0131ndan d\u00f6nd\u00fcr\u00fclen t\u00fcm web sayfalar\u0131nda ayarlan\u0131r emin olun \u00e7er\u00e7eveli olmas\u0131, size DENY kullanmal\u0131s\u0131n\u0131z. \u0130Z\u0130N-DAN \u00f6zg\u00fc web siteleri desteklenen web taray\u0131c\u0131lar\u0131nda web sayfas\u0131 \u00e7er\u00e7eve sa\u011flar).

pscanrules.xcontenttypeoptionsscanner.name=X-Content-Type-Se\u00e7enekler Header Eksik
pscanrules.xcontenttypeoptionsscanner.desc=Anti-MIME Koklama ba\u015fl\u0131k X-Content-Type-Se\u00e7enekler 'nosniff' ayarlanm\u0131\u015f de\u011fildi. Bu, Internet Explorer ve Chrome eski s\u00fcr\u00fcmleri potansiyel yan\u0131t g\u00f6vde yorumlan\u0131r ve ilan i\u00e7erik t\u00fcr\u00fc d\u0131\u015f\u0131ndaki bir i\u00e7erik t\u00fcr\u00fc olarak g\u00f6r\u00fcnt\u00fclenecek neden tepki v\u00fccut \u00fczerinde MIME alg\u0131lamas\u0131 ger\u00e7ekle\u015ftirmenizi sa\u011flar. (Bir set ise) Firefox'un Ak\u0131m (2014 erken) ve eski s\u00fcr\u00fcmleri yerine MIME koklama ger\u00e7ekle\u015ftirmek yerine, beyan i\u00e7erik t\u00fcr\u00fcn\u00fc kullan\u0131r.
pscanrules.xcontenttypeoptionsscanner.otherinfo=Bu sorun hala tip sayfalar\u0131 bu sayfalar\u0131n \u00e7o\u011fu hala hala taray\u0131c\u0131lar uzakta onlar\u0131n ger\u00e7ek i\u00e7erik t\u00fcr\u00fcnden sayfalar\u0131 koklama i\u00e7in endi\u015fe var bu durumda enjeksiyon sorunlar\u0131, etkilenen gibi (401, 403, 500, vb) hata i\u00e7in de ge\u00e7erlidir.
pscanrules.xcontenttypeoptionsscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941 % 28 v \= VS.85 % 29 .aspx https\://www.owasp.org/index.php/List_of_useful_HTTP_headers
pscanrules.xcontenttypeoptionsscanner.soln=Uygulama / web sunucusu uygun Content-Type ba\u015fl\u0131\u011f\u0131n\u0131 ayarlar emin olun ve t\u00fcm web sayfalar\u0131 i\u00e7in 'nosniff' X-Content-Type-Se\u00e7enekler ba\u015fl\u0131\u011f\u0131 ayarlar. E\u011fer m\u00fcmk\u00fcnse, son kullan\u0131c\u0131 t\u00fcm MIME koklama, ya da MIME koklama ger\u00e7ekle\u015ftirmek i\u00e7in web uygulamas\u0131 / web sunucusu taraf\u0131ndan y\u00f6nlendirilebilir yapmaz standartlara uyumlu ve modern bir web taray\u0131c\u0131s\u0131 kullan\u0131yor emin olun.

pscanrules.applicationerrorscanner.name=Uygulama Hatas\u0131 Bilgilendirme
pscanrules.applicationerrorscanner.desc=Bu sayfa i\u015flenmeyen \u00f6zel durum \u00fcretti dosyas\u0131n\u0131n konumu gibi hassas bilgileri if\u015fa edebilir bir hata / uyar\u0131 mesaj\u0131 i\u00e7eriyor. Bu bilgiler web uygulamas\u0131 kar\u015f\u0131 ba\u015fka sald\u0131r\u0131lar ba\u015flatmak i\u00e7in kullan\u0131labilir. hata iletisi dok\u00fcmantasyon sayfa i\u00e7inde bulunursa uyar\u0131 yanl\u0131\u015f pozitif olabilir.
pscanrules.applicationerrorscanner.soln=Bu sayfan\u0131n kaynak kodunu g\u00f6zden ge\u00e7irin. \u00d6zel hata sayfalar\u0131 uygulay\u0131n. Sunucu taraf\u0131nda ayr\u0131nt\u0131lar\u0131 oturum ve bunlar\u0131 kullan\u0131c\u0131ya te\u015fhir ederken istemci (taray\u0131c\u0131) i\u00e7in benzersiz bir hata referans / tan\u0131mlay\u0131c\u0131 sa\u011flamak i\u00e7in bir mekanizma uygulanmas\u0131 d\u00fc\u015f\u00fcn\u00fcn.

pscanrules.cachecontrolscanner.name=Eksik veya Hay\u0131r Cache-kontrol\u00fc ve Pragma HTTP Header Seti
pscanrules.cachecontrolscanner.desc=cache-control ve Pragma HTTP \u00fcstbilgisi d\u00fczg\u00fcn ayarlanm\u0131\u015f de\u011fil veya i\u00e7eri\u011fi \u00f6nbelle\u011fe taray\u0131c\u0131 ve proxy izin eksik.
pscanrules.cachecontrolscanner.soln=M\u00fcmk\u00fcn HTTP ba\u015fl\u0131\u011f\u0131 no-cache, no-store, \u00f6zel revalidate gerekir ayarlan\u0131r \u00f6nbellek kontrol\u00fcn\u00fc sa\u011flamak; ve Pragma HTTP ba\u015fl\u0131k no-cache ile ayarlanm\u0131\u015f oldu\u011fundan emin olun.
pscanrules.cachecontrolscanner.refs=https\://www.owasp.org/index.php/Session_Management_Cheat_Sheet\#Web_Content_Caching

pscanrules.contenttypemissingscanner.name=Content-Type \u00fcstbilgisi eksik
pscanrules.contenttypemissingscanner.name.empty=Content-Type Header Empty
pscanrules.contenttypemissingscanner.desc=The Content-Type header was either missing or empty.
pscanrules.contenttypemissingscanner.soln=Ensure each page is setting the specific and appropriate content-type value for the content being delivered.
pscanrules.contenttypemissingscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx

pscanrules.cookiehttponlyscanner.name=\u00c7erez Hay\u0131r HttpOnly Bayra\u011f\u0131
pscanrules.cookiehttponlyscanner.desc=A cookie has been set without the HttpOnly flag, which means that the cookie can be accessed by JavaScript. If a malicious script can be run on this page then the cookie will be accessible and can be transmitted to another site. If this is a session cookie then session hijacking may be possible.
pscanrules.cookiehttponlyscanner.soln=Ensure that the HttpOnly flag is set for all cookies.
pscanrules.cookiehttponlyscanner.refs=http\://www.owasp.org/index.php/HttpOnly

pscanrules.cookiesecureflagscanner.name=G\u00fcvenli Bayrak olmadan \u00c7erez
pscanrules.cookiesecureflagscanner.desc=A cookie has been set without the secure flag, which means that the cookie can be accessed via unencrypted connections.
pscanrules.cookiesecureflagscanner.soln=Whenever a cookie contains sensitive information or is a session token, then it should always be passed using an encrypted channel. Ensure that the secure flag is set for cookies containing such sensitive information.
pscanrules.cookiesecureflagscanner.refs=http\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OWASP-SM-002)

pscanrules.crossdomainscriptinclusionscanner.name=Etki Alanlar\u0131 Aras\u0131 JavaScript Kaynak Dosya Eklenmesi
pscanrules.crossdomainscriptinclusionscanner.desc=The page includes one or more script files from a third-party domain.
pscanrules.crossdomainscriptinclusionscanner.soln=Ensure JavaScript source files are loaded from only trusted sources, and the sources can't be controlled by end users of the application.

pscanrules.mixedcontentscanner.name=G\u00fcvenli Sayfalar Kar\u0131\u015f\u0131k \u0130\u00e7erik Dahil
pscanrules.mixedcontentscanner.name.inclscripts=Secure Pages Include Mixed Content (Including Scripts)
pscanrules.mixedcontentscanner.desc=The page includes mixed content, that is content accessed via HTTP instead of HTTPS.
pscanrules.mixedcontentscanner.soln=A page that is available over SSL/TLS must be comprised completely of content which is transmitted over SSL/TLS.\nThe page must not contain any content that is transmitted over unencrypted HTTP.\n This includes content from third party sites.
pscanrules.mixedcontentscanner.refs=https\://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet

pscanrules.passwordautocompletescanner.name=Taray\u0131c\u0131da Parola Otomatik Tamamlama
pscanrules.passwordautocompletescanner.desc=The AUTOCOMPLETE attribute is not disabled on an HTML FORM/INPUT element containing password type input.  Passwords may be stored in browsers and retrieved.
pscanrules.passwordautocompletescanner.soln=Turn off the AUTOCOMPLETE attribute in forms or individual input elements containing password inputs by using AUTOCOMPLETE\='OFF'.
pscanrules.passwordautocompletescanner.refs=http\://www.w3schools.com/tags/att_input_autocomplete.asp\nhttps\://msdn.microsoft.com/en-us/library/ms533486%28v\=vs.85%29.aspx

pscanrules.testinfoprivateaddressdisclosure.name=\u00d6zel IP Bilgilendirme
pscanrules.testinfoprivateaddressdisclosure.desc=Bir \u00f6zel IP gibi 10.xxx, 172.xxx, 192.168.xx HTTP yan\u0131t\u0131 g\u00f6vdesinde bulunmu\u015ftur. Bu bilgiler i\u00e7 sistemlerin hedef ileri sald\u0131r\u0131lar i\u00e7in yararl\u0131 olabilir.
pscanrules.testinfoprivateaddressdisclosure.soln=HTTP yan\u0131t v\u00fccuttan \u00f6zel IP adresini kald\u0131r\u0131n. G\u00f6r\u00fc\u015fleriniz i\u00e7in yerine istemci taray\u0131c\u0131lar taraf\u0131ndan g\u00f6r\u00fclebilir HTML / JavaScript yorumun JSP / ASP yorumunu kullan\u0131n.
pscanrules.testinfoprivateaddressdisclosure.refs=https\://tools.ietf.org/html/rfc1918

pscanrules.testinfosessionidurl.name=URL Rewrite Oturum Kimli\u011fi
pscanrules.testinfosessionidurl.desc=URL yeniden yazma kullan\u0131c\u0131 oturum kimli\u011fi izlemek i\u00e7in kullan\u0131l\u0131r. oturum kimli\u011fi \u00e7apraz site referer ba\u015fl\u0131\u011f\u0131nda yoluyla a\u00e7\u0131klanabilir. Buna ek olarak, oturum kimli\u011fi taray\u0131c\u0131 ge\u00e7mi\u015fi veya sunucu g\u00fcnl\u00fcklerinde depolanm\u0131\u015f olabilir.
pscanrules.testinfosessionidurl.soln=G\u00fcvenli i\u00e7erik i\u00e7in bir tan\u0131mlama oturum kimli\u011fi koydu. Daha g\u00fcvenli olmas\u0131 i\u00e7in \u00e7erez ve URL yeniden yazma bir arada kullanmay\u0131 d\u00fc\u015f\u00fcn\u00fcn.
pscanrules.testinfosessionidurl.refs=http\://seclists.org/lists/webappsec/2002/Oct-Dec/0111.html
pscanrules.testinfosessionidurl.referrer.alert=Referer Oturum kimli\u011fi Exposes
pscanrules.testinfosessionidurl.referrer.desc=Anter ana bilgisayar ad\u0131na i\u015faret eden k\u00f6pr\u00fc bulundu. Oturum kimli\u011fi URL yeniden yazma kullan\u0131ld\u0131\u011f\u0131 gibi, d\u0131\u015f ana bilgisayarlara referer ba\u015fl\u0131\u011f\u0131nda a\u00e7\u0131klanabilir.
pscanrules.testinfosessionidurl.referrer.soln=Oturum kimli\u011fi duyarl\u0131 ve k\u00f6pr\u00fc harici veya \u00fc\u00e7\u00fcnc\u00fc taraf ev sahibi ba\u015fvuruyorsa, bu bir risktir. G\u00fcvenli i\u00e7erik i\u00e7in, g\u00fcvenli oturum \u00e7erezi oturum kimli\u011fi koydu.

