#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanrules.desc=Reglas de la exploraci\u00f3n pasiva

pscanrules.headerxssprotectionscanner.name=Protecci\u00f3n de buscador de web XSS no disponible
pscanrules.headerxssprotectionscanner.desc=La protecci\u00f3n del buscador de web XSS no est\u00e1 disponible, o est\u00e1 deshabilitada por la configuraci\u00f3n de la cabecera de respuesta de HTTP 'X-XSS-Protection' en el servidor de web
pscanrules.headerxssprotectionscanner.refs=https\://www.OWASP.org/index.php/XSS _ (Cross_Site_Scripting) _Prevention_Cheat_Sheet https\://blog.veracode.com/2014/03/guidelines-for-setting-security-headers/
pscanrules.headerxssprotectionscanner.extrainfo=El encabezado de respuesta HTTP X-XSS-Protection le permite al servidor web habilitar o deshabilitar el mecanismo de protecci\u00f3n del navegador web XSS. Los siguientes valores intentan habilitarlo\:\nX-XSS-Protection\: 1; mode\=bloqueo\nX-XSS-Protection\:1; reporte\=http\://www.example.com/xss\nLos siguiente valores lo deshabilitar\u00edan\: \nX-XSS-Protection\: 0\nEl encabezado de respuesta HTTP X-XSS-Protection es actualmente compatible en Internet Explorer, Chrome y Safari (WebKit). Tenga en cuenta que esta alerta solo se produce si el cuerpo de respuesta podr\u00eda pontecialmente contener una carga \u00fatil XSS (con un tipo de contenido basado en texto, con una longitud distinta de cero).
pscanrules.headerxssprotectionscanner.soln=Aseg\u00farese que el filtro XSS del navegador web est\u00e1 habilitado, estableciendo el encabezado de respuesta HTTP X-XSS-Protection en '1'.

pscanrules.xframeoptionsscanner.name=Opciones del encabezado del esc\u00e1ner X-Frame
pscanrules.xframeoptionsscanner.incInCsp=La pol\u00edtica de seguridad de contenido incluye un elemento 'marco-antepasados' que tiene prioridad sobre la cabecera X-Frame-Options. raz\u00f3n por la cual este ha sido elevado con un bajo riesgo.  
pscanrules.xframeoptionsscanner.missing.name=Encabezado X-Frame-Options no establecido
pscanrules.xframeoptionsscanner.missing.desc=El encabezado X-Frame_options no est\u00e1 incluido en la respuesta HTTP para proteger ante ataques 'ClickJacking'.
pscanrules.xframeoptionsscanner.missing.refs=http\://blogs.msdn.com/b/ieinternals/archive/2010/03/30/combating-clickjacking-with-x-frame-options.aspx
pscanrules.xframeoptionsscanner.missing.soln=Los navegadores de web mas modernos apoyan la cabecera HTTP X-Frame-Options. Aseg\u00farese que est\u00e1 establecido en todas las p\u00e1ginas web devuelta por su sitio (si usted espera que la p\u00e1gina este enmarcada solo por p\u00e1ginas en su servidor (por ejemplo, es parte de un FRAMESET) entonces usted querr\u00e1 usar SAMEORIGIN, de otras forma si usted nunca espera que la p\u00e1gina est\u00e9 enmarcada, deber\u00eda usar DENY. ALLOW-FROM permite a sitios web espec\u00edficos enmarcar la p\u00e1gina web en navegadores web compatibles).
pscanrules.xframeoptionsscanner.multiple.header.name=M\u00faltiples entradas de encabezado X-Frame-Options
pscanrules.xframeoptionsscanner.multiple.header.desc=Encabezados X-Frame-Options (XFO) fueron encontrados, una respuesta con m\u00faltiples entradas de encabezados XFO podr\u00eda no ser tratada como se espera por todos los agentes de usuario.
pscanrules.xframeoptionsscanner.multiple.header.refs=https\://tools.ietf.org/html/rfc7034
pscanrules.xframeoptionsscanner.multiple.header.soln=Aseg\u00farese que solo un encabezado X-Frame-Options est\u00e1 presente en la respuesta.
pscanrules.xframeoptionsscanner.compliance.meta.name=X-Frame-Options definidas mediante META (no-obediente con especificaciones)
pscanrules.xframeoptionsscanner.compliance.meta.desc=Se encontr\u00f3 una etiqueta META X-Frame-Options (XFO), definiendo XFO mediante una etiqueta TAG es expl\u00edcitamente no compatible con la especificaci\u00f3n (RFC 7034).
pscanrules.xframeoptionsscanner.compliance.meta.refs=https\://tools.ietf.org/html/rfc7034\#section-4
pscanrules.xframeoptionsscanner.compliance.meta.soln=Aseg\u00fareque de que X-Frame-Options es configurado mediante un campo de encabezado de respuesta.
pscanrules.xframeoptionsscanner.compliance.malformed.setting.name=Ajuste incorrecto de X-Frame-Options
pscanrules.xframeoptionsscanner.compliance.malformed.setting.desc=Un encabezado X-Frame-Options estuvo presente en la respuesta pero el valor no se estableci\u00f3 correctamente.
pscanrules.xframeoptionsscanner.compliance.malformed.setting.refs=https\://tools.ietf.org/html/rfc7034\#section-2.1
pscanrules.xframeoptionsscanner.compliance.malformed.setting.soln=Aseg\u00farese que ajustes v\u00e1lidos son usados en todas las p\u00e1ginas web en su sitio (si usted espera que la p\u00e1gina sea enmarcada solo por p\u00e1ginas en su servidos (por ejemplo, es parte de un FRAMESET) entonces usted querr\u00e1 usar SAMEORIGIN, de otras forma si usted no espera nunca que la p\u00e1gina sea enmarcada, usted deber\u00eda usar DENY. ALLOW-FROM le permite a sitios web espec\u00edficos enmarcar la p\u00e1gina web en navegadores web compatibles).

pscanrules.xcontenttypeoptionsscanner.name=No se encuentra encabezado X-Content-Type-Options Header
pscanrules.xcontenttypeoptionsscanner.desc=El encabezado Anti-MIME-Sniffing X-Content-Type-Options no estaba configurado para 'nosniff'. Esto permite versiones antiguas de Internet Explores y Chrome ejecutar MIME-sniffing en el cuerpo de la respuesta, causando potencialmente que el cuerpo de respuesta sea interpretado y desarrollado como un tipo de contenido diferente que el tipo de contenido declarado. Estos (principios de 2014) y versiones antiguas de Firefox preferiblemente usar\u00e1n el tipo de contenido declarado (si hay uno establecido), antes que ejecutar el MIME-Sniffing.
pscanrules.xcontenttypeoptionsscanner.otherinfo=Este inconveniente a\u00fan aplica para p\u00e1ginas de error (401, 403, 500, etc) ya que esas p\u00e1ginas a menudo todav\u00eda est\u00e1n afectadas por problemas de inyecci\u00f3n, en cuyos casos a\u00fan hay preocupaci\u00f3n de buscadores rastreando p\u00e1ginas fuera de su tipo de contenido ver\u00eddico. En l\u00edmite 'alto' este esc\u00e1ner no alertar\u00e1 sobre las respuestas de error al cliente o servidor.
pscanrules.xcontenttypeoptionsscanner.refs=http\://msdn.Microsoft.com/en-us/library/Ie/gg622941%28v\=vs.85%29.aspx https\://www.owasp.org/index.php/List_of_useful_HTTP_headers
pscanrules.xcontenttypeoptionsscanner.soln=Aseg\u00farese que el servidor de la aplicaci\u00f3n/web establezca el encabezado Content-Type apropiadamente, y que est\u00e9 establecido el encabezado X-Content-Type-Options en 'nosniff' para todas las p\u00e1ginas web.\nSi es posible, aseg\u00farese que el \u00faltimo usuario usa un navegador web complatible con los est\u00e1ndares y moderno que no ejecute MIME-sniffing en absoluto, o que pueda ser dirigida por el servidor de la aplicaci\u00f3n/web para no ejecutar MIME-sniffing.

pscanrules.applicationerrorscanner.name=Divulgaci\u00f3n de error de aplicaci\u00f3n
pscanrules.applicationerrorscanner.desc=Esta p\u00e1gina contiene un mensaje de error/advertencia que podr\u00eda revelar informaci\u00f3n sensible como la ubicaci\u00f3n del archivo que produjo la excepci\u00f3n no controlada. Esta informaci\u00f3n puede ser usada para lanzas futuros ataques contra la aplicaci\u00f3n web. La alerta podr\u00eda ser una falso positivo si el mensaje de error es encontrado dentro de una p\u00e1gina de documentaci\u00f3n.
pscanrules.applicationerrorscanner.soln=Revisar el c\u00f3digo de fuente de esta p\u00e1gina. Implementaci\u00f3n de p\u00e1ginas de error personalizadas. Considerar implementar un mecanismos para proveer una \u00fanica referencia/identificaci\u00f3n de error para el cliente (navegador) mientras insertando los detalles en el sitio del navegador y no exponi\u00e9ndolos al usuario.

pscanrules.cachecontrolscanner.name=Incompleto o no Cache-control y sistema de encabezado HTTP Pragma
pscanrules.cachecontrolscanner.desc=El cache-control y encabezado HTTP Pragma no han sido establecidos apropiadamente o faltan, permitiendo al navegador y servidores proxy almacenar contenido.
pscanrules.cachecontrolscanner.soln=Siempre que sea posible asegurarse que el encabezado HTTP cache-control est\u00e1 establecido con no-cache, no-store, must-revalidate, y que el encabezado HTTP pragma est\u00e9 establecido con no-cache.
pscanrules.cachecontrolscanner.refs=https\://www.owasp.org/index.php/Session_Management_Cheat_Sheet\#Web_Content_Caching

pscanrules.contenttypemissingscanner.name=Falta de encabezado Content-Type
pscanrules.contenttypemissingscanner.name.empty=Vac\u00edo del encabezado Content-Type
pscanrules.contenttypemissingscanner.desc=El encabezado Content-Type se encuentra faltante o vac\u00edo.
pscanrules.contenttypemissingscanner.soln=Aseg\u00farese que cada p\u00e1gina establece el correcto y espec\u00edfico valor content-type para que el contenido sea impartido.
pscanrules.contenttypemissingscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx

pscanrules.cookiehttponlyscanner.name=Cookie No HttpOnly Flag
pscanrules.cookiehttponlyscanner.desc=Se ha establecido una cookie sin la bandera HttpOnly, lo que significa que la cookie puede ser accedida mediante JavaScript. Si un script malicioso puede ser ejecutado en esta p\u00e1gina entonces la cookie ser\u00e1 accesible y podr\u00e1 ser transmitida a otro sitio. Si esta es una cookie de sesi\u00f3n entonces el secuestro de sesi\u00f3n podr\u00eda ser posible.
pscanrules.cookiehttponlyscanner.soln=Aseg\u00farese que la bandera HttpOnly esta establecida para todas las cookies.
pscanrules.cookiehttponlyscanner.refs=http\://www.owasp.org/index.php/HttpOnly

pscanrules.cookiesecureflagscanner.name=Cookie sin bandera asegurada
pscanrules.cookiesecureflagscanner.desc=Una cookie ha sido enviada sin la bandera asegurada, lo que significa que la cookie puede ser accedida mediante conexiones sin cifrar.
pscanrules.cookiesecureflagscanner.soln=Cuando una cookie contiene informaci\u00f3n sensible o es un token de sesi\u00f3n, deber\u00eda ser siempre pasada usando un canal cifrado. Aseg\u00farese que la bandera asegurada est\u00e1 establecida para cookies conteniendo informaci\u00f3n sensible.
pscanrules.cookiesecureflagscanner.refs=http\://www.owasp.org/index.php/Testing_for_cookies_attributes_(OWASP-SM-002)

pscanrules.crossdomainscriptinclusionscanner.name=Inclusi\u00f3n de archivos de origen JavaScript Cross-Domain
pscanrules.crossdomainscriptinclusionscanner.desc=Las p\u00e1ginas incluyen uno o mas archivos encriptados de un dominio de terceros.
pscanrules.crossdomainscriptinclusionscanner.soln=Aseg\u00farese que los archivos de la fuente JavaScript est\u00e1n descargados solo de sus fuentes confiables, y las fuentes no pueden ser controladas por los usuarios finales de la aplicaci\u00f3n.

pscanrules.mixedcontentscanner.name=P\u00e1ginas seguras incluyen contenido mixto
pscanrules.mixedcontentscanner.name.inclscripts=P\u00e1ginas seguras incluyen contenido mixto (incluyendo scripts)
pscanrules.mixedcontentscanner.desc=La p\u00e1gina incluye contenido mixto, que es contenido accedido mediante HTTP en vez de HTTPS.
pscanrules.mixedcontentscanner.soln=Una p\u00e1gina que est\u00e1 disponible sobre SSL/TLS debe ser conformado completamente de contenido que es transmitido a trav\u00e9s de SSL/TLS. La p\u00e1gina no debe contener ning\u00fan contenido que es transmitido a trav\u00e9s de un HTTP encriptado. \n Esto incluye contenido de sitios de terceros.
pscanrules.mixedcontentscanner.refs=https\://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet

pscanrules.passwordautocompletescanner.name=Autocompletar contrase\u00f1as en el navegador
pscanrules.passwordautocompletescanner.desc=El atributo AUTOCOMPLETE no est\u00e1 deshabilitado en un elemento HTML FORM/INPUT conteniendo contrase\u00f1a de tipo input. Las contrase\u00f1as deben ser almacenadas en navegadores y recuperadas.
pscanrules.passwordautocompletescanner.soln=Turn off the AUTOCOMPLETE attribute in forms or individual input elements containing password inputs by using AUTOCOMPLETE\='OFF'.
pscanrules.passwordautocompletescanner.refs=http\://www.w3schools.com/tags/att_input_autocomplete.asp\nhttps\://msdn.microsoft.com/en-us/library/ms533486%28v\=vs.85%29.aspx

pscanrules.testinfoprivateaddressdisclosure.name=Private IP Disclosure
pscanrules.testinfoprivateaddressdisclosure.desc=A private IP (such as 10.x.x.x, 172.x.x.x, 192.168.x.x) or an Amazon EC2 private hostname (for example, ip-10-0-56-78) has been found in the HTTP response body. This information might be helpful for further attacks targeting internal systems.
pscanrules.testinfoprivateaddressdisclosure.soln=Remove the private IP address from the HTTP response body.  For comments, use JSP/ASP/PHP comment instead of HTML/JavaScript comment which can be seen by client browsers.
pscanrules.testinfoprivateaddressdisclosure.refs=https\://tools.ietf.org/html/rfc1918

pscanrules.testinfosessionidurl.name=Session ID in URL Rewrite
pscanrules.testinfosessionidurl.desc=URL rewrite is used to track user session ID. The session ID may be disclosed via cross-site referer header. In addition, the session ID might be stored in browser history or server logs.
pscanrules.testinfosessionidurl.soln=For secure content, put session ID in a cookie. To be even more secure consider using a combination of cookie and URL rewrite.
pscanrules.testinfosessionidurl.refs=http\://seclists.org/lists/webappsec/2002/Oct-Dec/0111.html
pscanrules.testinfosessionidurl.referrer.alert=Referer Exposes Session ID
pscanrules.testinfosessionidurl.referrer.desc=A hyperlink pointing to anther host name was found. As session ID URL rewrite is used, it may be disclosed in referer header to external hosts.
pscanrules.testinfosessionidurl.referrer.soln=This is a risk if the session ID is sensitive and the hyperlink refers to an external or third party host. For secure content, put session ID in secured session cookie.

