#X-Generator: crowdin.com
# This file defines the default (English) variants of all of the internationalised messages

pscanrules.desc=R\u00e8gles d'analyse passive

pscanrules.xss-protection.name=Protection XSS du navigateur Internet non activ\u00e9e
pscanrules.xss-protection.desc=La protection XSS du navigateur Internet n'est pas activ\u00e9e, ou est d\u00e9sactiv\u00e9e par la configuration de l'en-t\u00eate de r\u00e9ponse HTTP 'X-XSS-Protection' sur le serveur web
pscanrules.xss-protection.refs=https\://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet\nhttps\://blog.veracode.com/2014/03/guidelines-for-setting-security-headers/
pscanrules.xss-protection.extrainfo=L'en-t\u00eate de r\u00e9ponse HTTP X-XSS-Protection autorise le serveur internet \u00e0 activer ou d\u00e9sactiver le m\u00e9canisme de protection XSS du navigateur internet. Les valeurs suivantes tenteraient d'activer la protection\:\nX-XSS-Protection\: 1 ; mode \= block\nX-XSS-Protection\: 1 ; report \= http\://www.example.com/xss\nLes valeurs suivantes d\u00e9sactiveraient cette protection\:\nX-XSS-Protection\: 0\nL'en-t\u00eate de r\u00e9ponse HTTP de X-XSS-Protection est actuellement support\u00e9e par Internet Explorer, Chrome et Safari (WebKit). \nNotez que cette alerte n'est d\u00e9clench\u00e9e que si le corps de r\u00e9ponse pourraient contenir une charge utile XSS (avec un type de contenu texte, d'une longueur diff\u00e9rente de z\u00e9ro).
pscanrules.xss-protection.soln=Assurez-vous que le filtre XSS du navigateur internet est activ\u00e9, en renseignant l'en-t\u00eate de r\u00e9ponse HTTP X-XSS-Protection \u00e0 '1'.

pscanrules.xframeoptionsscanner.name=En-t\u00eate X-Frame-Options pas renseign\u00e9
pscanrules.xframeoptionsscanner.desc=L'en-t\u00eate X-Frame-Options n'a pas \u00e9t\u00e9 renseign\u00e9e pour d\u00e9fendre contre les attaques de 'ClickJacking'.
pscanrules.xframeoptionsscanner.missing.desc=L'en-t\u00eate X-Frame-Options n'est pas incluse dans la r\u00e9ponse HTTP pour prot\u00e9ger contre les attaques de 'ClickJacking'.
pscanrules.xframeoptionsscanner.refs=http\://blogs.msdn.com/b/ieinternals/archive/2010/03/30/combating-clickjacking-with-x-frame-options.aspx
pscanrules.xframeoptionsscanner.soln=La plupart des navigateurs internet modernes supportent l'en-t\u00eate HTTP X-Frame-Options. Assurez-vous que celle-ci est renseign\u00e9e sur toutes les pages internet retourn\u00e9es par votre site (si cette page ne doit \u00eatre encadr\u00e9e que par des pages de votre serveur (p.ex. fait partie d'un FRAMESET), alors utilisez la valeur SAMEORIGIN, sinon choisissez la valeur DENY quand la page n'est jamais encadr\u00e9e. ALLOW-FROM permet \u00e0 des sites sp\u00e9cifiques d'encadrer la page, pour autant que le navigateur le supporte).

pscanrules.xcontenttypeoptionsscanner.name=En-t\u00eate X-Content-Type-Options manquant
pscanrules.xcontenttypeoptionsscanner.desc=L'en-t\u00eate X-Content-Type-Options contre le sniffing MIME n'est pas renseign\u00e9 \u00e0 'nosniff'. Ceci permet \u00e0 de vielles versions d'Internet Explorer et de Chrome de pratiquer le sniffing MIME sur le corps de r\u00e9ponse, conduisant potentiellement \u00e0 l'interpr\u00e9tation et l'affichage du contenu dans un autre type que celui d\u00e9clar\u00e9. A l'heure actuelle (d\u00e9but 2014), les anciennes versions de Firefox utiliseront le type de contenu d\u00e9clar\u00e9 (au cas o\u00f9 un type est d\u00e9termin\u00e9), plut\u00f4t qu'analyser le MIME.
pscanrules.xcontenttypeoptionsscanner.otherinfo=Ce probl\u00e8me s'applique toujours aux pages de type erreur (401, 403, 500, etc.), car ces pages sont encore souvent touch\u00e9es par des probl\u00e8mes d'injection, auquel cas il est encore possible que les navigateurs interpr\u00e9tent des pages autrement que selon leur type de contenu r\u00e9el.
pscanrules.xcontenttypeoptionsscanner.refs=http\://msdn.microsoft.com/en-us/library/ie/gg622941%28v\=vs.85%29.aspx\nhttps\://www.owasp.org/index.php/List_of_useful_HTTP_headers
pscanrules.xcontenttypeoptionsscanner.soln=Assurez-vous que l'application ou le serveur internet renseigne l'en-t\u00eate Content-Type correctement, et que l'en-t\u00eate X-Content-Type-Options prenne la valeur 'nosniff' pour toutes les pages internet.\nSi possible, assurez-vous que l'utilisateur utilise un navigateur moderne et conforme aux standards, qui ne pratique pas du tout le sniffing MIME, ou qui puisse \u00eatre command\u00e9 par l'application ou le serveur internet de mani\u00e8re \u00e0 ne pas pratiquer le sniffing MIME.
